{"summary":"Episode 35 of The Scoop was recorded with Frank Chaparro, Ryan Todd, Steven Zheng and Kristin Smith, Executive Director of the Blockchain Association.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51135\/kristin-smith-executive-director-at-the-blockchain-association-breaks-down-2019s-biggest-crypto-stories-on-capitol-hill","publishDate":"2019-12-19T15:15:47","id":6653,"type":null,"title":"Kristin Smith, Blockchain Association executive director, breaks down 2019&#x27;s biggest crypto stories on Capitol Hill","category":["THE BLOCK"],"content":["<em data-v-f87c67ca=\"\">Episode 35 of The Scoop was recorded with Frank Chaparro, Ryan Todd, Steven Zheng and Kristin Smith, Executive Director of the Blockchain Association. <\/em>","<em data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>,&nbsp;<a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>,&nbsp;<a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>,&nbsp;<a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback and revision requests to&nbsp;<a href=\"\/cdn-cgi\/l\/email-protection#64140b000705171024100c0106080b070f07161d14100b4a070b09\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"bfcfd0dbdcdecccbffcbd7daddd3d0dcd4dccdc6cfcbd091dcd0d2\">[email&nbsp;protected]<\/span><\/a>.<\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK5182145056\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-mce-fragment=\"1\" data-v-f87c67ca=\"\"><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><\/iframe>","Kristin Smith is executive director of the Blockchain Association. In this episode, Kristin sits down for her second time with Frank, Ryan, and Steven to discuss:&nbsp;","<em data-v-f87c67ca=\"\">The transcript is provided for your convenience, please excuse any errors or typos resulting from the transcription process:<\/em>","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Ladies and gentlemen, thank you so much for tuning in to what is a very special episode of The Scoop. We have Kristin Smith and this is the second time. Yes, the second time she's joining us. No, this is quite the accomplishment. We have a prize for her, as a result.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>I love prizes.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>We have a case of White Claw waiting in the fridge for you from our event from Wednesday leftover. And that's the best we can do. We're a startup. We're a venture-backed startup, so that is literally the best we can do. We're gonna be diving into so many interesting things. You're plugged into Washington. Whenever, you know, we're picking up on something, we reach out to you to get your opinion because you represent so many companies at the Blockchain Association where you are pushing for thoughtful, innovative crypto regulations and policies. And those are some of the things we'll be talking about. Moving into 2020, what we can expect, what we might not expect. 2019 defined, obviously, by Libra, by Facebook and now most recently, Kelly Loeffler being appointed to the Senate. Some of these things, I imagine, are going to spill over into 2020. What are you most excited about?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>I'm excited that Washington in general, but specifically Congress, is getting much better on this stuff. There is a deeper understanding of the technology. There's a belief that it's inevitable and that it's important and that the U.S. wants to be competitive. And that's not universal throughout every single individual lawmaker, but the conversations have gotten way more sophisticated than they were a year ago at that time. So I think that we'll see some thoughtful efforts coming out of the Senate. We'll see some targeted legislation at Libra in the House. But, yeah, we're able to have a deeper conversation. And I don't think we'll get any broad legislation necessarily passed this year, but the debate's happening and that's an important phase of the process to be entering into.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>When you joined us last time, you talked about the dichotomy of crypto regulations changing either through law, through the courts, rather through courts or through regulation brought down by Congress and lawmakers. Do you see the space moving towards that direction of Congress, moving forward and pushing for standards and regulations versus things being determined by courts?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>I think we'll see some efforts in Congress. I don't think we'll see anything actually enacted into law. It is a presidential year coming up, and so policymaking in D.C.--even at the agency level, not that there's anything live going on at the agency level right now--but it almost entirely shuts down, especially as we get sort of past the first quarter, second quarter of the year. All people care about on Capitol Hill is getting reelected. We've got a presidential race going on that's in the backdrop. So, you know, sort of federal agencies now most the agencies we deal with are, you know, sort of independent agencies, so they'll continue to do their enforcement actions, but nobody is going to take on any major political type of an effort in a presidential year. So what does that mean for us? It doesn't mean we, you know, go home and not engage with lawmakers. There is gonna be a lot of activity and there's still much more education that needs to be done, and so we can use this time to lay the groundwork. Whether there is a change in power in Congress or a new administration or not, we'll have new leaders in place in the start of 2021, so we really need to use this time to be ready for some action.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>Is there a dead period next year where there's just not going to be much progress on that front? Like, people just focused on the election?","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I forgot to introduce Ryan, Ryan Todd, our great researcher, standing beside me.&nbsp;","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yeah, D.C. shuts down around June, typically. You know, things happen. If there's a crisis--you know, a major financial crisis or a terrorist attack or something like that, you know--the town will kick up again and start running and moving policy.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Well it seemed like things were in full swing right after Libra. Where are we at in terms of the sentiment in Washington when it comes to cryptocurrencies? Seems like a lot of those bills that were proposed not passed are dead in the water and not really going to go anywhere.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Oh, no, that's quite, quite the contrary.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>So let's focus in on the anti-big tech in finance bill. I don't think that's the name of it, but it's something to that effect.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>So there's a couple of bills that were circulated. So the timeline is as follows. We had the Libra hearings in the House and the Senate back in July, and then in October, Mark Zuckerberg came and testified before the House of Representatives. And when he came back for that hearing, there was a series of bills that were proposed at that time. One is to keep big tech out of finance acts that if you have more than twenty-five billion dollars of revenue in tech, you can't also be in finance. There was another one called the Managed Stable Coins are Securities Act. And that one is--that's a live exercise right now. That is--actually up until this morning, right, we're recording this on a Friday, I don't know when this will go live, but up until this morning, we were on track for that bill to be voted on at the committee level on Tuesday next week on the 10th and 11th.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Now, what would that bill propose?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>So this bill is, it's really an effort to go after Libra. What it does is It defines something called a managed stable coin, and it declares that that managed stable coin is a security and that if you want to trade them--","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>And that's a direct attack on Facebook in terms of it's structure, there's no other--","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yes.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>But it also spills over to other stable coin projects too, right? So it's like how would that impact Coinbase?","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Well, it's not necessarily managed like the way that Libra is, because it's a basket of these currencies and securities versus just a peg.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yes. And so what's interesting here--and this happens a lot with early-stage legislative proposals, right? So you have to remember that these proposals are drafted by sometimes by committee staff, but sometimes just personal office staff, sometimes they're lawyers, sometimes are not. There is a legislative council that helps with this process, but it's very often in the early stage--and in some ways, this is the beauty of the legislative process--you throw ideas out there and then you work to improve them. And so Representative Sylvia Garcia is on the Financial Services Committee and wanted to take a stab at doing this. And so put out this idea that, hey, this looks to me like an ETF. I think it's probably, you know, she's thinking it's probably already a security, but wants to drive that point home, and so crafted this in an effort to go after Libra. The problem is the way it was crafted at this early stage is that it captured probably everything. But the good news is the intent of this was not \"All cryptocurrencies are Securities Act\" or \"All stable coins are Securities Act,\" it was the Managed Stable Coins are Securities Act. So if you think about it, that's actually--the intent is to be fairly narrow on what is a managed stable coin.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>But that's not exactly what it looked like when it was introduced.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>And the definition they provide, it's just pretty vague.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yeah, it's just broad and probably captures in other things. So, you know, what do we do as the Blockchain Association and other stakeholders involved? You go and talk to the offices, we talked to Sylvia Garcia's office. We talked with Goodan's office, who's the Republican co-sponsor. We talked to the committee staff for Chair Waters and McHenry and, you know, express our concerns that this might be overly broad. And in most cases, they agreed with us that they didn't mean to go that broad. There's sort of an M.O. that especially Democratic offices on the House Financial Services Committee do is they want to get the conversation going, so they just throw something out there and then they improve it as they go. And so we had--you know, we were optimistic that they weren't trying to go after, you know, dollar-backed stable coins like USDC or TrueUSD or Paxos or Gemini Dollar. And they agreed with us. And so we were hopeful that if it had moved forward, that there would be some clarifying language that those types of things weren't included. Now they're also looking at some of the algorithmic stable coins and trying to figure out does that count as a managed stable coin or not. That's kind of an ongoing discussion with these offices, but as of last night, we thought that that was something that was going to be voted on next week, and we were prepared and ready to work through the weekend to try to change the language.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Why did they make it so vague? Why don't they just come and say, \"Based off of our review, this would be a managed stable coin. This would be as well,\" Versus put out this vague definition?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>So Congress is not allowed to write legislation that specifically calls out a company's name. I don't know where that is in the rules, but there's this idea that you can't pass a bill that says Facebook can't do this. What you have to do is pass a bill that says companies of a certain size or type can't do this certain type of thing. And so, you know, it doesn't do any good to just call out from a legislative perspective. You know, they're trying to set the policy, so you can't just call it a single company because then, you know, some other company could go to do the same thing. So they're trying to find the principles around which, you know, tokens should be securities and not. And if you think about it, that's actually what the industry's been asking for for a while. This is just because Libra is here, the focus is more around Libra as opposed to broader cryptocurrency, which isn't a terrible place to be, but, as written, the bill as introduced was not acceptable. But we're very optimistic, or cautiously optimistic I could say, that we can improve it and definitely narrow it so it doesn't inadvertently wipe out a large part of the industry.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>Were you surprised at the response? I remember talking to a couple of the analysts that work in the sell-side. But as Washington in coverage and all of them were surprised at how quick these hearings were getting pushed through to discuss Libra and everything else.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yeah, I think I was surprised by how strong it was. I knew that Facebook wasn't particularly popular amongst a certain set of lawmakers. But you know, even I on the ground there didn't think the reaction would be as strong as it was. And, you know, I think Facebook can fight through it if they have the appetite to do so. You know, they've got a lot of resources. They have a lot of lawyers. They have a lot of lobbyists. They have a very talented professional team behind them. So if they want to keep pushing through, they can do that. But yeah, they're just not popular.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I mean, when I was down there for the David Marcus hearings, the Senate one and then the congressional one, at first, I couldn't put my finger on whether or not the animosity was strictly bipartisan, meaning everyone just does not like Facebook as a company, or if maybe Republicans were a little more open to the innovation. I got that sense from the congressional hearing a little bit more. Looking back, you know, months out from when all this went down, is there a partisan divide on this issue or not necessarily?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>I think there's a growing partisan divide. I think in the beginning, everybody kind of hated Facebook, and it was popular. I think we're starting to see--you know, when things like the Keep Big Tech out of Finance Act comes in, you know, that that impacts a lot of large companies that are out there that might, you know--there seems to be a natural merging of tech and finance. You see several banks that are partnering with big tech companies on different projects, and I think the Republicans don't like to see those sorts of things.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>It also doesn't make a lot of sense because what are large financial companies? At the end of the day, they are technology companies.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>It's all just coming together. I'm looking at it now. It's a daily one million dollar fine if you're in financial services and a tech company with 25 billion in revenue.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>What defines a tech company? PayPal is just as much a tech company as Amazon.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>What you'll see with Republicans is Republicans don't like to deal with these overly broad definitions. It's a different legislating style, so even though you may have a few Republicans that are kind of sympathetic to that idea, a lot of it is they want to oppose things because it's being done by the other party and done in a way that's overly broad, and they're acting as sort of the backstop that is going to try to negotiate to narrow that down. So it's an important sort of role. But that being said, amongst Republicans, Facebook isn't particularly popular. But I do think what's happened is in the very beginning, the knee jerk reaction was to not like Libra because people don't like Facebook, but as it sort of moved on, I think there have been concerns that have sort of developed about, well, how is the U.S. dollar going to continue to remain strong if there are other currencies out there that are easier to use than the dollar? And it's, there's sort of a fork of this conversation that's starting around what is the role of the Fed? Should we have a Fed-backed digital U.S. dollar? And that's kind of a side conversation that's starting to happen as a result of Libra coming into this space.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I think the concerns are easing. I think they're warming up a little bit, right? Didn't Treasury secretary Mnuchin can say it could happen so long as they're conforming to the proper AML procedures?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yeah, and I did not watch word for word yesterday what he said, but the readout that I saw is Mnuchin was talking about the fact that the Fed didn't need to create its own in the next, you know, for at least five years, that this was something they wanted to look at and watch. And I do think what's interesting is you don't need the Fed to have the benefits of a digital U.S. dollar. We have that today, right? There are dollar back stable coins that are out there that you can have instant access to, that you can program, that you can move quickly at any hour of the day. So that's a--you know, you don't need the Fed to do that necessarily. There's a private marketplace that come in and do that.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>I've always been of that belief. Like, the Fed doesn't--exactly to your point, doesn't need--they should just outsource that to the private market.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>It already exists, yeah.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Let's all give our predictions. I think three things are important to think about when it comes to Facebook. I think they're going to relocate the association to the U.S., I think that they're going to move to a single currency that will back the coin, and I think that it will go through and it'll be successful because they'll be able to leverage the merchants that they have on their platform. There are tens of thousands of merchants that are on Facebook. If they offer, you know, some sort of incentive for them to accept and use Libra, I think that could be a tailwind.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>Those are some bold predictions.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>What do you think?","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>I don't know. I mean, what's the sense you get with the whole Geneva organization?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Well, that was a problem for U.S. lawmakers at the hearings. That was a really strong theme that came out because these were a lot of big U.S. companies behind it. And so I think it would be a good political move on their part to say, hey, we're going to bring that back here. But, you know, it seems to be fairly established over there now. And they, you know--it would be quite an undertaking to do that, but I think they could do it. But I don't know what that would do to the way their charter is set up and whether or not that's tied to that.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>But a lot of this stuff isn't set in stone, right? I mean, many of the companies haven't even made the 10 million dollar payment yet, right?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>That's my understanding. I think if they wanted to make a move to please U.S. policy policymakers, bringing it back home, I think would go a long way. But I think a dollar-backed or, you know, a single currency-backed token is a lot easier to do. There's this much less questions about its status in securities law, and that would I think be easier. But then also, you know, I think the reason they did that to begin with is they wanted to reach an international audience and that--","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>But how can they if they're going to be blocked off from India and China?","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>Well, there's other countries, besides India and China. It's a large use-case market I agree--","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I mean, if we're talking about banking the unbanked, that seems like two of the places you would start, especially in China.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>You could go after Jack Dorsey in Africa.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>That's true. He's moving there, isn't he?","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>I want to go back to you mentioned comments about just concerns over the dollar and what this could mean for that in the long term. One of the questions--I did some, like, analysis around the Senate and congressional hearings, mapping out like almost every question that was asked. I thought was interesting. The one thing, it was pretty down the middle, like the themes. Both sides of the aisle were asking pretty similar questions, but the two that jumped out on the Republican side were concerns over China and the rumors of them, which have now been confirmed, of being close to rolling out a digital currency of their own. And also concerns over pro-innovation and just stifling that, I guess. But I'm wondering if you hear that theme around China, especially now that the DCEP is looking more realistic as a 2020 launch?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yeah, we're hearing more and more about China from Congress. I mean, China's the boogie man in Congress. It's a talking point that when they go home and they're talking to their constituents, you know--both because I think the size of China, but also just sort of the cultural value differences--that there is a lot of concern, and it makes for an easy talking point. So we're seeing that quite a bit more on the Hill. And, you know, quite frankly, from our perspective, it's a useful argument to say, \"Hey, that's why we need to have good policies here, so the crypto-economy can develop here in the United States,\" whether that be, you know, just in terms of how do we improve our money, but also to all the other things that we think crypto can do.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Is that resonating with lawmakers, going to them and saying, \"Hey, if you're really concerned about China and concerned about them leapfrogging over us, you should pay a little bit more attention to cryptocurrency and blockchain?\"","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>I think so. I think so. You know, we had a couple of congressmen, French Hill and Bill Foster, who sent a letter to the Fed, asking--","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>It was a good letter, the responses were great.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yeah, I think it's prompting dialog and that's a big part of it. And yeah, we see it in meetings with staff and lawmaker comments. The China narrative is a very strong one.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>That's interesting. So what do some of those conversations look like? What are the questions that they're asking you as it pertains to China and blockchain?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Well, they're very simple. They just want the U.S. to continue to be the leader and, you know, trying to figure out how to do it in a way that embraces the technology, but doesn't have the technology undermine the U.S. dollar. And so it's I think it's a healthy conversation. It's a good conversation to be having, and it's one that, you know, is reaching the highest levels of treasury, it's reaching the key committees in Congress. But I think as we were saying before, I think the answer there is we don't need the Fed to do anything, like we can, you know, upgrade the technology with which we trade money, just like going from checkbooks to credit cards to wallet apps. You know that this is a technology layer that we can wrap around the dollar. So, you know, I think that's obviously a very small subset of crypto, but I think what has emerged from Libra is that people are trying to figure out this piece of the puzzle that we weren't talking about this a year ago at all. Nobody was talking about stable coins. Nobody was talking about how to move the dollar around in a more efficient way. So I think that's a step, a step forward.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>To what degree did Facebook drive that conversation? I don't know if we can quantify that in any sophisticated way, but it has--are you more busy? Like is the association as a result taking more meetings? How do you handle that influx of inquiries?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yeah. Well, a lot of it is we're the ones that are reaching out and it's a lot easier to get our meetings when we request them. And also just you know, due to the fact that we've been around for a while and we're sort of a known entity in the halls of Congress, people want to sit down and people want to talk to us and they want to learn more. I think, you know, the association's grown. We've got more staff now, more lobbyists now. We more members now. So we're able to manage that as best we can. But we do get people, you know, I get random inquiries from congressional staffers on the Web site or people from Treasury on a regular basis. So we do have people--","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>What do those look like? What are they asking?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Oh, they want to meet. They have a question about something. They want to, you know, understand the technology better. So, yeah, we're able to respond to all of that.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I think I want to draw in Steven Zheng, our other researcher.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>I was just gonna pitch that, honestly. We should be pushing Steven on the Congress.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>He's coming. Steven Zheng goes to Washington. Hop on an Amtrak down there.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>We can have a staff briefing on the Hill.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>So for the folks listening at home--or by train, plane, automobile, wherever you are in the world--The Blockchain Association approached The Block a few months ago about a research project that we've undertaken to examine the concerns many different companies have about the regulatory environment and a few other things. I'm not entirely sure about the full scope of the project because it's above my pay grade, but we have Steven here, he's been working tirelessly, taking calls at all hours of night, talking to CEOs from China and other places for this project. But I guess first, before we get Steven's take on what he's hearing, what was the thinking behind doing this? I actually have no insight, so this will be the first time I've heard about it.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>So, with regulators as well as lawmakers on Capitol Hill, we often tell the story about how, you know, the regulatory environment in the U.S. is problematic for the U.S. being competitive and that companies consider moving overseas--or perhaps they have moved overseas--and that, you know, the U.S. is losing out on opportunities because of our poor regulatory environment. But we didn't have any--these are all anecdotes. And what we've been trying to do is find some way to present this, what we believe to be true, that there's a problem, right? And specifically, we've had a couple of our champions in Congress who have asked us to try to quantify in any way and also really just sort of formalise that case. And so, you know, that's why we thought we'd reach out to you guys and see if we could capture the sentiment of the industry.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Yeah, and it doesn't only capture the sentiment of the industry, but also the scope and breadth of a lot of the companies. For the first time, we'll know exactly what the workforce of the crypto world--","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yes, where they're at, and, you know, it's our hope, you know, a year from now we'll be able to know if that's gotten bigger or it's gotten smaller. People want to know where the jobs are. They want to know how many they are, what they are. There's a real interest and desire to better understand sort of the industry and the workforce, and lawmakers in particular who are, you know, going home and talking with their constituents, they want to work on things that help drive jobs and help drive the economy so any information--","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Yeah, and I was shocked by some of the headcounts of these firms. But anyway, Steven, tell us if the thesis that Blockchain Association has had in their conversations with lawmakers is lining up with what you found from conversations and calls.","<strong data-v-f87c67ca=\"\">Steven Zheng <\/strong>Yeah so conversation-wise, a lot of firms agree with that thesis. Actually, interestingly, a lot of firms said that most of them didn't initially launch in the U.S. because they were such a small startup and they didn't have the resources to go through the normal compliance process that the U.S. expects of firms in this industry, so they end up having to delay their efforts to expand in the U.S. because they had to grow big enough to have enough resources that they can expand into the U.S..","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>So that's like a lot of the Asian exchanges, like a BitFlyer or a Binance just moved in.","<strong data-v-f87c67ca=\"\">Steven Zheng <\/strong>Yeah. We've heard of a few exchanges that said the U.S. was part of their initial plan, but they couldn't afford to spend resources just to be compliant with the U.S.'s harsh standards. And so they had to wait until they had enough resources. And also in our research, so from the data we've gotten, of the top 50 employers in this industry, 60, like two-thirds of them are based outside of the U.S.. So, yeah. So the U.S. only has like a third of the largest employers in the industry. That includes Bitmain, Huobi, I mean, Coinbase is based in the U.S., but a majority of firms that are hiring employees are based outside the US.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>That's an interesting--I didn't realize that number was that high, that's awesome. I mean, not awesome. That's actually terrible. But it's awesome from needing numbers to go and make arguments to get Congress to clean up this environment.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Its so crazy. If you Juxtapose that with--I mean, I have no idea what percentage of tech jobs or fintech jobs are here in the U.S., but I would imagine it might even be flipped, right? I mean, you would know better than I, Ryan.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>I would guess that, but I don't know, China's pretty big.","<strong data-v-f87c67ca=\"\">Steven Zheng <\/strong>Job count-wise, it's very hard to get this data, so we try to target like the firms that we know that are easier to get their data from. So we reached out to the largest firms in the space and they are more available to answer our questions. We've also dived into job listings sites specifically for crypto. So we've gotten data from over like 2000 job listings from 2018 to 2019. On that end, it's very interesting. There is actually an increase in job listings in the U.S. from 2018 to 2019. We don't have enough data stretching back to 2016, so we can't really see that growth, but from 2018 to 2019, we've seen a slight increase in job growth or at least job listings in the U.S. versus like remote and global.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Was there anything that was surprising?","<strong data-v-f87c67ca=\"\">Steven Zheng <\/strong>So stuff from the interviews. There appear to be like a few common themes. A lot of firms that have spoken to us said that they want regulators to engage with them. They're like they feel left out. They feel like regulators are looking at this--","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>They can join the blockchain association.","<strong data-v-f87c67ca=\"\">Steven Zheng <\/strong>Yeah, they feel like the regulators and U.S. Congress members are just looking at this from like, I guess like an ivory tower of like, they're not really engaging with firms in this industry. One actually pitched a crypto czar similar to how apparently Bill Clinton had an Internet czar during his presidency. Someone was like they should appoint a crypto czar so the crypto czar can talk to us and speak with us and find out what issues we have. So these firms want engagement with Congress members and regulators in the U.S., they feel like they are not getting that one to one engagement.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>Good stuff, Steven has been working hard on this","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yeah, I'm excited. I mean, the challenge that we have is we have a lot of good stories, but it's hard, I think, for individual companies sometimes to come out and tell that story, so if we can get some things in the aggregate that we can--data in the aggregate that we can use to convey the importance and give, you know, these strong data points to lawmakers. I think that'll really, you know, give them some fuel for their arguments, you know, to do things that support policies that'll help the technology and help the industry. So, yeah, we're excited to see the results of it.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Well, thank you, Steven. Get back to work. You've got more calls. Truly burning the midnight oil. He hasn't been home in weeks. We have a cot set out for him with the space heater next to it. Well, let's talk about some of the potential headwinds going into 2020. There was news out, I think it was this morning about Senator or Congressman Sherman.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yeah, on Wednesday, the House Financial Services Committee Democrats convene to elect the new chair of the of the subcommittee of the Financial Services Committee that has jurisdiction over securities laws and the S.E.C.. And I was told it was a 17 to 3 vote that Brad Sherman, the congressman from California, is going to replace Carolyn Maloney on this committee. Carolyn Maloney, right here, Congresswoman from, represents, I think, exactly where we're at here in New York City, a big, you know, sort of crypto community. She now is the chair of the Full Oversight Committee after Elijah Cummings passed away a couple of weeks ago, so there's been a vacancy there, and Brad Sherman is a very senior member of the committee and seniority matters in the House. It doesn't always matter, but especially with the Democrats in the House, they tend to honor the seniority system.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>We had Congresswoman Maloney, who, to your point, was a little bit more plugged in with the cryptocurrency world, just given her district. And now we have Brad Sherman, who likened Facebook to Libra to 9\/11.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Yes. He is the sworn enemy of the cryptocurrency industry.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>He's coming after you Steven, you better be ready.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I think we should try to play a clip of him popping off if we can figure that out on the tech side. I think that'd be worthwhile. You said, before we turned the mics on, I don't know to what degree you want to pop off yourself about what this means, but this is bad.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>It's not good. It's not good. So, you know, if you look in terms of, OK, you know, we've talked before, you can get policy change through the courts. You can get it directly through the rulemaking process with regulators, or there is this, you know, Congress can pass a law. So to pass a law, you have to get language through both chambers, both the House and the Senate, in identical form. And the President has to sign it into law. To get something of this nature through the House--the full House, all 435 members would have to vote on it--before that, you need to get it through the House Financial Services Committee, and the committees are divided into subcommittees. And so any type of bill of this nature would go through that subcommittee, and Brad Sherman, Chairman Sherman--","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>He is now chairing the subcommittee?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>He is chairing the subcommittee. You know, he has a fairly significant say in the agenda of that subcommittee.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>He can make sure that the agenda excludes any positive crypto bill, squat them down?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yes. If there is any hope, it is that that the full committee chair, so Chair Maxine Waters, she ultimately controls the agenda and has a lot of say into what the subcommittees do and do not do. And so he doesn't have a total blank slate to do whatever he wants, but he definitely has a lot of sway and a lot of influence, and, you know, we're excited because we have a great dialog with the full committee offices and they have very thoughtful counsels in this space that are thinking about these issues. So we're happy that we have that dialog there. But yeah, having him in this position is a little bit discomforting heading into the new year.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>On the flip side, Georgia Governor Brian Kemp just announced the appointment of a new junior senator from the state of Georgia, someone who is well known in the cryptocurrency industry. Kelly Loeffler.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yes.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>'O' is silent.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>First time he's ever said her last name correctly.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>It's true. No one's ever corrected me. That's unfortunate. So that's got to be positive, she didn't mention--I'm a little upset. She said she was pro-Trump, pro-wall and pro-second amendment but where was the pro-crypto or bitcoin. But that&nbsp; could be good..","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>It certainly doesn't hurt. And no, it's wonderful news.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Are your members--I mean, we care because we're newspeople: whenever anything in the mainstream media just peripherally touches, tangentially touches crypto, we get excited. People in DC, are they like, \"Oh, is that a crypto person?\"","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>There were a couple. You know, the D.C.--you know, as you well know, crypto news is sort of its own little world. The D.C. policy news is its own little world. And I was pleased that the D.C. kind of policy political press did pick up on the fact that she is a cryptocurrency former cryptocurrency executive now. So that's, you know--I think that's good for us. It's certainly, you know, every industry group out there has their champions. You know, the realtors know all the former realtors in Congress. The broadcasters have, you know, there are former broadcasters who are now members of Congress. And I think it's pretty dang cool that we have a former cryptocurrency executive as a United States senator. And, you know, that's gonna be a wonderful asset to have because, you know, members of Congress, whether they be in the House or the Senate, they talk to each other a lot, they learn from each other. And to have somebody with that kind of a background who can speak to other members and just through natural conversation, help educate them. I think it's a huge boon for us. And so, yeah, we're super excited to have her in that spot. And, you know, we haven't pounded down on her door yet, but we will be doing that and definitely in the new year.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>You gonna get the new Token Taxonomy Act her desk soon, to look at?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Well, you know, we have some potential--I don't want to say names because nothing's final yet--but there are quite a few Republican senators in the Senate that are interested in introducing legislation that would be helpful to the industry. The challenge is always finding, you know, a Democrat to pair with somebody. And we have some Democrats that are interested and also joining that effort, but they're not quite as far along. So I sort of wish she were a Democrat, but I guess it doesn't work that way. Excited to have her regardless.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>What is that initiative?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>It's similar to the Token Taxonomy Act.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>How much can you talk about it?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>About as much as I'm talking about it right now. You know, you get the benefit of over time, you know, looking at legislation and figuring out how to improve it. And we think we've found a couple ways to tighten up the definition that makes it a little bit cleaner. And so, you know, we would love to see something like that introduced, and, you know, that's sort of a work in progress to get everybody up to speed.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>When will we start to see more information around that come out?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>I mean, hopefully in the new year. It won't be before the end of the year, but hopefully in Q1.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>Do you see some of that--so, Warren Davidson jumps out as someone that's been pretty vocal in these hearings--do you see that spilling over to some of maybe people that aren't even in the Financial House Service Committee, but just broader Congress?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yeah, well, you know, we've had offices reach out, especially kind of from California, Silicon Valley that want ideas for things that they can do to be helpful, and they want to lead the charge. And we've had a couple offices that are off committee that start to do that, and I think that's more because it's more of a constituent interest, but, yeah, we're seeing a much broader group. But also on the Financial Services Committee, we're seeing more members that are getting involved. So it's a very positive development.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>Token Taxonomy Act, you mentioned that. Anything new there?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>We haven't had as much time to focus on that with all that's going on with Libra. But prior to the Libra announcement, we were in sort of offense mode and we've had to be in a little bit of defense mod--which is also probably equally as important as to not let anything bad happen--but no, we still love the bill. There have been a few more co-sponsors that have been added to the bill, but we haven't been able to devote the time it takes to get a bunch more on board. But I am confident, you know, as we get into the new year, we will hopefully have a little bit more bandwidth to get back to some of our offensive stuff, too, once we get through this Managed Stable Coins are Securities Act.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>Does that--does the tax implication still impact a Libra, especially if it's classified as security?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yeah. I mean, right now, I think Libra would likely--well, if it's a security, it would be taxed as sort of a security. But yeah, I think the virtual currency definition--well, let me back up. If Libra is classified as a security, it doesn't work, right? It has to be not classified as a security. And if it's more of a dollar--","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>If it's taxed like bitcoin, then it's still also cumbersome.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Well, if it's taxed like bitcoin, then it's taxed as property, so there would be capital gains tax implications. Now, if their goal is to have a stable coin--and this is a little bit beyond my expertise, but I've seen analyses that these sort of dollar-backed stable coins are not, you know, they're more like a gift card, right? Like they're they're not taxed--so I think it ultimately depends on how Libra is structured to figure out how it would be taxed. But, you know, the tax, I mean, that's something that's worth talking about. Is this need for a de minimis exemption--and we think we'll have a couple members of the House Ways and Means Committee, which is the committee that has jurisdiction over tax policy, should be introducing something, you know, either before the end of the year or early next year--and the IRS is--.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>Issuing just guidance on the de minimis?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Well, that--the thinking is that the IRS doesn't have the authority to just unilaterally do that. You need an act of Congress to get a de minimis exemption. So we should see that legislation get introduced, you know, maybe even this month, but definitely early Q1 at the latest. And then Treasury is looking at figuring out tax reporting guidance. And we had not done a lot of work with Treasury, but they reached out to us and are interested in figuring out, you know, for centralized exchanges, is there some sort of 1099B-type reporting that they can provide to the IRS and to their customers to help with tax compliance? Because as we've seen, there were a bunch of letters that went out over the summer, and, you know, the compliance with crypto taxes are low. And a lot of that is because it's not super easy if you're, you know, your everyday to consumer to track all of that. You have to get sophisticated software. And it's not like, you know, I get my Bank of America Merrill Lynch statement at the end of the year, and I put in some numbers on my form and I'm good to go. So that's something that I know the IRS is making more of a priority. They stated so in their--they have come out with a document every few months that states their priorities, and this is now one of their priorities. So I think we're going to see some promising work hopefully on the tax side, but they're very, very interested in having a dialogue.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>But if you don't get rid of it--if you don't have the de minumus exemption, what else can you do to make it easier?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Well, you would still--without the de minimis exemption for every transaction of virtual currency you would owe potentially on capital gains. You have to calculate it and then, you know. And so what you can do to make it easier for compliance is provide information that's pre-digested that people can plug into their tax forms in an easy way, because right now and you don't always get that at the end of the year. You have to figure it out, and it's complicated, and people don't know how to calculate it.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I thought Coinbase in Gemini did send out forms that you can plug into your--","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>My understanding is they do for--yes, there are some that are out there, but none of this is blessed by the IRS in terms of what they're doing. And there are different, you know, they do right now a 1099K, which is sort of the aggregated number, but there are some people that would like to see more of 1099B that sort of disaggregates it. It's a little bit complicated because right now exchanges can only see within, you know, the customers in their own exchange, you can't see across exchanges. So it's difficult for them to determine if something's actually a taxable event. Because if I'm moving it from, you know, one of my Coinbase accounts to another one of my Coinbase accounts, that's not a taxable event. But if I'm giving it to you, then that is. So, it's just difficult when they're looking across exchanges and what's coming in and out to figure out--","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>So basically what you're saying is the IRS needs to come out and provide a framework for a 1099B that exchanges could then use to offer that to their clients.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Yes. And they would be comforted that if they follow the guidance, that they're doing it correctly and consumers would be comforted that the information is somewhat correct. But I mean, the solution is not an easy one. The solution has to be built. There's no like off the shelf way to do this because you have--it's a little bit like what's going on with FINCEN and AML and the travel rule; you have to kind of have insight into what other actors are doing and you almost need like a third party that can administer that type of thing. So I think that's something we're going to see more work on. And that's again, not maybe, you know, major policy change, but it's getting that type of guidance that'll help the industry mature and make it easier for more consumers to hop on and give crypto a try.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>That's interesting. But you'd still need the exchanges, too. I mean, the guidance only would go so far.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Right.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Yeah. That's interesting. And you don't expect that to happen next year?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>No. We expect to see some proposals happening on that. Yeah. I don't think it will ultimately be enacted by the end of next year, but I think there's going to be a lot of back and forth. I mean, we've already been--we've met with Treasury on a couple of different occasions and are having these dialogs with them.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>Want to end on--what's your bold prediction for crypto policy in 2020?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>That is an interesting question, a bold prediction?","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>A bold prediction, or just one you have high conviction in.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>And I mean, I have high conviction that Facebook's woes are not over and that Congress in the first half of the year--not necessarily in the Senate, but in the House--are going to make a big push to try to stop Libra.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>Got it.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I'm trying to see if Neeraj will send a question for Kirsten from D.C.,.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>You know, he's in my WeWork.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>He is literally--he responds so quickly to all text messages. It's insane. What kind of question? Any kind of policy question as we sign off. Let's see what he says, I'm sure it's a good one. I'm sure our listeners are familiar with the Neeraj.","<strong data-v-f87c67ca=\"\">Ryan Todd <\/strong>How would they ramp up and stop Facebook? What would be the method of doing that?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>Well it could be this Managed Stable Coins are Securities Act. Yeah, it would have to be some legislative--no, I don't think they stop it, but they're gonna make a run at it.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>It's so funny to me when I look at something like that, I'm like \"No way people are gonna care enough about crypto,\" and maybe that's just because I'm self-deprecating and I project that onto the entire space but--that that's gonna go through all the different committees and then through Congress, then through the Senate. Do people care that much?","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>People do not like Facebook. Lawmakers do not like Facebook. So I think getting anything through the Senate is a challenge. The Senate a couple of weeks ago held their first committee markup. This is when they consider and vote to move legislation for the first time in I think it was 18 months. So, they don't do a whole lot over there in the Senate. You know, it's really the House that will move things through and then and then it sort of dies in the Senate. But, you know, regardless, it sends a message and sets precedent and sends signals to regulators of what the concerns are. So it's not meaningless that they're taking action. And there's certainly a lot of, you know, sort of headline risk for the companies involved when these types of things move. So that's why it's important to get these efforts as narrowly tailored as possible so that they don't, you know, take out everybody else in its path.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>What is your--this is Neeraj's question. Outside of keeping the ship afloat (he misspelled ship), what is your big aspirational policy goal for 2020? Ours would be something like a de minimis exemption, for example.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>So Coin Center--we love Coin Center, I love the whole team at Coin Center. I love them so much that I moved into their same WeWork so I could be close to them, and I sometimes just stop by to say hello to the whole team there. So they're great. Yeah, we--I think one of our top would be the de minimis exemption. I was on the Hill this week with Coin Ceneter doing meetings to get that bill introduced hopefully soon. But no, I think the number one issue for the members of the Blockchain Association is getting clarity on securities laws. You know, that, as we mentioned before, is probably unlikely to go through Brad Sherman's committee, but I think that we can see some ideas that are put out there in the Senate that can help send a signal to the SEC and whatever, you know, maybe future chairman of the SEC we might have in a year from now if Clayton, when he's done with his term, you know, that lays an important sort of precedent and groundwork for that. So that would be our number one. But I think the de minimis exemption is a close number two.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Well, I think that's a great place to end. Thanks so much for coming down and joining us for the second time.","<strong data-v-f87c67ca=\"\">Kristin Smith <\/strong>I know, this is the greatest achievement of my life to be asked to come back a second time on a podcast.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I doubt that is the truth. Thanks so much.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Goodan","content":"PERSON"},{"type":"Amazon","content":"LOCATION"},{"type":"Ryan Todd <\/strong>He","content":"PERSON"},{"type":"Clayton","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Steven Zheng","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"Gemini Dollar","content":"ORGANIZATION"},{"type":"Libra","content":"LOCATION"},{"type":"Frank Chaparro <\/strong>Well","content":"PERSON"},{"type":"Chaparro","content":"PERSON"},{"type":"Ryan Todd <\/strong>You","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"the Financial Services Committee","content":"ORGANIZATION"},{"type":"Kristin Smith <\/strong>Yeah","content":"PERSON"},{"type":"Brad Sherman","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Georgia","content":"LOCATION"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"IRS","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Financial House Service Committee","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Africa","content":"LOCATION"},{"type":"summer","content":"DATE"},{"type":"D.C.","content":"LOCATION"},{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"Kristin","content":"PERSON"},{"type":"2016","content":"DATE"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Kristin Smith <\/strong>Well","content":"PERSON"},{"type":"Bill Clinton","content":"PERSON"},{"type":"Frank","content":"ORGANIZATION"},{"type":"Financial Services Committee","content":"ORGANIZATION"},{"type":"Steven Zheng <\/strong>Yeah","content":"PERSON"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Executive Director of the Blockchain Association","content":"ORGANIZATION"},{"type":"Ryan Todd <\/strong>How","content":"PERSON"},{"type":"Capitol Hill","content":"LOCATION"},{"type":"Brian Kemp","content":"PERSON"},{"type":"Ryan Todd <\/strong>Want","content":"PERSON"},{"type":"David Marcus","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Warren Davidson","content":"PERSON"},{"type":"Amtrak","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"S.E.C.","content":"ORGANIZATION"},{"type":"House Ways and Means Committee","content":"ORGANIZATION"},{"type":"Ryan","content":"PERSON"},{"type":"2000","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Ryan Todd <\/strong>First","content":"PERSON"},{"type":"Ryan Todd <\/strong>Those","content":"PERSON"},{"type":"DCEP","content":"ORGANIZATION"},{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"Sherman","content":"PERSON"},{"type":"DC","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Chaparro <\/strong>Well","content":"PERSON"},{"type":"New York City","content":"LOCATION"},{"type":"Carolyn Maloney","content":"PERSON"},{"type":"Elijah Cummings","content":"PERSON"},{"type":"Sylvia Garcia","content":"PERSON"},{"type":"Kristin Smith","content":"PERSON"},{"type":"Bill Foster","content":"PERSON"},{"type":"Frank Chaparro <\/strong>Yeah","content":"PERSON"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"midnight","content":"TIME"},{"type":"Bank of America Merrill Lynch","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"Ryan Todd <\/strong>Well","content":"PERSON"},{"type":"Congresswoman Maloney","content":"PERSON"},{"type":"AML","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"second quarter","content":"DATE"},{"type":"McHenry","content":"ORGANIZATION"},{"type":"Ryan Todd","content":"PERSON"},{"type":"last night","content":"TIME"},{"type":"Big Tech","content":"ORGANIZATION"},{"type":"Gemini","content":"LOCATION"},{"type":"Steven","content":"PERSON"},{"type":"night","content":"TIME"},{"type":"House","content":"ORGANIZATION"},{"type":"first quarter","content":"DATE"},{"type":"Ryan Todd <\/strong>Got","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Ryan Todd <\/strong>Good","content":"PERSON"},{"type":"Huobi","content":"LOCATION"},{"type":"Senate","content":"ORGANIZATION"},{"type":"Ryan Todd <\/strong>But","content":"PERSON"},{"type":"this morning","content":"TIME"},{"type":"U.S.","content":"LOCATION"},{"type":"Mnuchin","content":"PERSON"},{"type":"weekend","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Kelly Loeffler","content":"PERSON"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"Ryan Todd <\/strong>Were","content":"PERSON"},{"type":"Neeraj","content":"PERSON"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Full Oversight Committee","content":"ORGANIZATION"},{"type":"Chaparro <\/strong>Yeah","content":"PERSON"},{"type":"Steven Zheng <\/strong>Job count-wise","content":"PERSON"},{"type":"Libra","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Washington","content":"LOCATION"},{"type":"Ryan Todd <\/strong>If","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Geneva","content":"LOCATION"},{"type":"The Blockchain Association","content":"ORGANIZATION"},{"type":"Kirsten","content":"PERSON"},{"type":"Tuesday next week","content":"DATE"},{"type":"five billion dollars","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Ryan Todd <\/strong>Does","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"FINCEN","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}