{"summary":"Prime Trust temporarily halted deposits and withdrawals of both fiat and crypto after receiving an order from the Nevada Financial Institution Division, according to fiat onramp service Stably.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236042\/prime-trust-halted-deposits-withdrawals-after-order-from-nevada-regulator","publishDate":"2023-06-22T13:57:10","id":6655,"type":null,"title":"Prime Trust halted deposits, withdrawals after order from Nevada regulator","category":["COMPANIES"],"content":["Crypto custodian Prime Trust <a href=\"https:\/\/twitter.com\/Stably_Official\/status\/1671903305365327872\" data-v-f87c67ca=\"\">halted<\/a> deposits and withdrawals of both fiat and crypto after receiving an order from the Nevada Financial Institution Division, fiat onramp service Stably said in a <a href=\"https:\/\/support.stably.io\/en\/articles\/8039846-prime-trust-halting-deposit-withdrawal?_ga=2.224471130.1963557396.1687454592-813931187.1687454592&amp;_gl=1*1iirsmx*_ga*ODEzOTMxMTg3LjE2ODc0NTQ1OTI.*_ga_R2T8PD7439*MTY4NzQ1NDU5Mi4xLjEuMTY4NzQ1NDcxMS41My4wLjA.\" data-v-f87c67ca=\"\">notice<\/a> posted on its website.&nbsp;","Stably, which said it relies on Prime Trust as its regulated custodian, cited a letter to clients it said it received from the company. A copy of the letter was also obtained separately by The Block.&nbsp;","\"During this period, we will suspend certain business expansion activities such as signing new customer contracts,\" Prime Trust said in the letter to Stably. \"Prime Trust is actively engaging the NV FID to determine next steps to remediate any concerns and return to business as usual as soon as possible.\"","Stably, meanwhile, said it was forced to pause some services and operations as a result.&nbsp;","\"As Prime Trust continues working to restore normal operations as quickly as possible, we are diligently working on integrating new custodian partners as well (more details to be announced soon),\" Stably <a href=\"https:\/\/twitter.com\/Stably_Official\/status\/1671903305365327872\" data-v-f87c67ca=\"\">said<\/a>.&nbsp;","The Nevada Financial Institution Division was not immediately able to respond when contacted by The Block. Prime Trust&nbsp;did not immediately respond to a request for comment.&nbsp;","BitGo said earlier Thursday that it's <a href=\"https:\/\/www.theblock.co\/post\/236014\/bitgo-says-its-terminating-acquisition-of-prime-trust\" data-v-f87c67ca=\"\">terminating<\/a> the planned <a href=\"https:\/\/www.theblock.co\/post\/233878\/bitgo-reaches-deal-to-buy-crypto-custodian-prime-trust-coindesk\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">acquisition<\/a> of Prime Trust, just two weeks after it announced plans for the deal.","Coinmetro said in a <a href=\"https:\/\/twitter.com\/CoinMetro\/status\/1671859408031055875\" data-v-f87c67ca=\"\">post<\/a> on Twitter that it was currently unable to process new USD transactions as a result.&nbsp;","TrueUSD, meanwhile, said the TUSD stablecoin was not affected.","\"We have no exposure to Prime Trust and maintain multiple USD rails for minting and redemption,\" it <a href=\"https:\/\/twitter.com\/tusdio\/status\/1671898163039596544?s=20\" data-v-f87c67ca=\"\">said<\/a> on Twitter.&nbsp;","Cryptocurrency platform HAYVN also said it was not affected, writing in a statement that it has \"zero exposure to Prime Trust and multiple USD rails available.\"","(<em data-v-f87c67ca=\"\">Updates with comments from additional companies.<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"\" Prime Trust","content":"ORGANIZATION"},{"type":"earlier Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nevada Financial Institution Division","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Prime Trust","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","Sarah Wynn","The Block"]}