{"summary":"Robinhood Crypto has received criticism for marketing its product as free when there are non-monetary and monetary costs to consumers. However, it very well may be a force for good in the industry.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/522\/robinhood-crypto-a-positive-force-for-crypto-adoption","publishDate":"2018-09-17T13:57:00","id":6657,"type":null,"title":"Robinhood Crypto: A positive force for crypto adoption?","category":["STARTUPS"],"content":["Media outlets, including The Block, have called into question the marketing claims of Robinhood Crypto as a \"free\" product over the past few weeks. Arguments that there is a real cost to trading and speculating via Robinhood Crypto have been introduced by <a href=\"https:\/\/www.theblockcrypto.com\/2018\/09\/10\/robinhood-crypto-the-fine-print-behind-free-crypto-trading\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">The Block<\/a>, <a href=\"https:\/\/seekingalpha.com\/article\/4205379-robinhood-making-millions-selling-millennial-customers-high-frequency-traders?page=2\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Seeking Alpha<\/a>, <a href=\"https:\/\/www.zerohedge.com\/news\/2018-09-15\/robinhood-investing-app-makes-millions-selling-users-data-high-frequencstealing\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">ZeroHedge<\/a>, and others. Given Robinhood's aggressive marketing of their product as free, it opens the company up to criticism of both the monetary and non-monetary costs that customers of their cryptocurrency products bear. That being said, the concerns and true costs around Robinhood's \"payment for order flow\" may be overstated. Seeking Alpha ran a piece titled: \"<a href=\"https:\/\/seekingalpha.com\/article\/4205761-robinhood-villain-made\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Robinhood Is Not The Villian It's Made Out To Be<\/a>.\" And Arjun Balaji pointed out that order-flow payment is \"<a href=\"https:\/\/twitter.com\/arjunblj\/status\/1041511370934677504\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">reasonable<\/a>\" and actually industry standard in the equity asset class. Ari Paul highlighted this is a situation of \"<a href=\"https:\/\/twitter.com\/AriDavidPaul\/status\/1041519509906104321\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">tradeoffs<\/a>\" that need to be balanced.","Relative to other options such as Coinbase or Gemini, there are clearly significant tradeoffs that customers make when choosing to trade cryptocurrency via Robinhood Crypto, however. As we highlighted in The Block: \"<em data-v-f87c67ca=\"\">[Robinhood Crypto]&nbsp;violates many of the core principles of cryptocurrency ownership: basic financial sovereignty through holding private and public keys, the ability to move funds at will, transparent pricing, and the absence of legalese unrelated to the cryptocurrency itself.\"&nbsp;<\/em>That being said, consumers have many options on how to purchase cryptocurrencies -- and this is a free market in which&nbsp;many value Robinhood's positives versus the tradeoffs. As Balaji said on <a href=\"https:\/\/twitter.com\/arjunblj\/status\/1041677289577168898\" data-v-f87c67ca=\"\">Twitter<\/a>:","","","Following on Arjun's point, there are many compelling arguments that Robinhood's approach is beneficial to the cryptocurrency ecosystem. Robinhood Crypto meets the needs of a set of customers who don't value the features mentioned in the more critical pieces above. Many of these customers are brand new to cryptocurrencies and are relatively \"low-information\" buyers. They may not be ready to manage their public and private keys, they may not care about a small amount of price slippage on their trades given the near frictionless process of purchasing cryptocurrencies on Robinhood Crypto, and they may prefer the \"security\" of a trusted third party holding their cryptocurrency. For this segment of cryptocurrency market participants, what many purists would view as a \"bug\" is actually a \"feature.\"","Many people believe that 95% or more of the interest in cryptocurrencies today is tied to price -- trading and speculation. From this perspective, Robinhood Crypto provides an easy on-ramp to cryptocurrencies that will allow millennials and others to speculate, test, and dabble in a friendly environment their friends also might be using. They can mingle their cryptocurrency trading with their equity trading such that crypto becomes just another part of their holistic portfolio.&nbsp;The optimistic view is that once they are hooked on the magic of cryptocurrencies, they will follow their price and speculative interest into a deeper study of the technology, the applications, the companies, and the products in the cryptocurrency and blockchain ecosystem.","There is no question that Robinhood has expanded the number of cryptocurrency owners in the US. That's especially true among its core user segment, which may not have felt comfortable with the complexity of direct exchange-based trading. It will be important to observe whether Robinhood itself introduces a fuller set of features such as self-custody and\/or moving cryptocurrency in and out of a Robinhood account. In any case, there is a strong argument to be made that by welcoming new cryptocurrency owners, Robinhood Crypto has done a good service to many, even if the product isn't 100% \"free.\"","&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arjun","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Arjun Balaji","content":"PERSON"},{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Gemini","content":"LOCATION"},{"type":"Robinhood Crypto]","content":"ORGANIZATION"},{"type":"Balaji","content":"PERSON"},{"type":"Ari Paul","content":"PERSON"},{"type":"95%","content":"PERCENT"}],"hashtag":["ROBINHOOD"],"authors":["Mike Dudas","The Block"]}