{"summary":"Believed to be responsible for the TerraUSD stablecoin disaster, Do Kwon&#x27;s detention in Montenegro has been extended until mid-February.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267237\/do-kwon-detention-extended-in-montenegro-after-report-of-likely-extradition-bloomberg","publishDate":"2023-12-12T11:12:15","id":6659,"type":null,"title":"Do Kwon detention extended in Montenegro after report of likely extradition: Bloomberg","category":["PEOPLE"],"content":["The detention of Terraform Labs co-founder Do Kwon in Montenegro has been extended at the request of the U.S. and South Korea, according to Bloomberg.","Do Kwon's detention in the small European nation will last until Feb. 15, the report said. The detention period had been scheduled to end this coming Friday, <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-12-12\/montenegro-extends-do-kwon-detention-on-us-south-korea-requests?utm_source=telegram&amp;utm_content=crypto&amp;utm_medium=social&amp;sref=QkiN9npb\" data-v-f87c67ca=\"\">the report<\/a> also said. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe court's decision comes in response to a request made from the U.S. and South Korea, both of which aim to prosecute the crypto entrepreneur on charges related to the collapse of the TerraUSD stablecoin, a court spokeswoman told Bloomberg.","Last week, The Wall Street Journal <a href=\"https:\/\/www.theblock.co\/post\/266585\/do-kwon-will-be-extradited-to-us-by-montenegro-justice-minister-wsj\" data-v-f87c67ca=\"\">reported<\/a> that Montenegro planned to extradited Kwon to the U.S. The report cited anonymous sources familiar with discussions had by Justice Minister Andrej Milovic.","Montenegro's high court has ruled that Kwon could be extradited to either the U.S. or South Korea, according to Bloomberg. Kwon is currently appealing that decision.","Kwon became the target of a global manhunt in 2022 after Interpol reportedly <a href=\"https:\/\/www.theblock.co\/post\/172739\/south-korea-says-interpol-has-issued-a-red-notice-for-do-kwon-bloomberg-says\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">issued<\/a> a so-called red notice for him due to the implosion of the two tokens he created, TerraUSD and Luna. The tokens' collapse wiped out about $40 billion.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Andrej Milovic","content":"PERSON"},{"type":"South Korea","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Kwon","content":"PERSON"},{"type":"Luna","content":"LOCATION"},{"type":"Feb. 15","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Interpol","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Montenegro","content":"LOCATION"},{"type":"Justice","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"U.S","content":"LOCATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}