{"summary":"Stablecoin issuer Circle has added support for Polygon USDC on its payment service for clients like exchanges and institutional trading desks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150488\/circle-launches-support-for-polygon-usdc-stablecoin-on-its-payments-platform","publishDate":"2022-06-07T10:30:57","id":6660,"type":null,"title":"Circle launches support for Polygon USDC stablecoin on its payments platform","category":["STABLECOINS"],"content":["Circle’s payments and treasury platform now supports Polygon USD Coin (USDC) thus enabling seamless transactions for customers using the stablecoin.","According to a Tuesday announcement, Polygon USDC is the first “bridged” version of the stablecoin to be supported on its platform. Bridging in crypto involves transferring coins native to a blockchain to another chain or Layer 2 network via a bridge.","The announcement means that Circle clients can transact using USDC without having to bear the additional cost of bridging the stablecoin from Ethereum to Polygon.","Bridging USDC from Ethereum to Polygon is already possible via the latter’s existing bridge service.","This process, however, can take up to 10 minutes for the funds to arrive in the user’s Polygon wallet.","With Polygon USDC enabled on the Circle Account, business clients will be able to convert fiat deposits to the stablecoin within seconds, the announcement added.","Polygon is the largest Layer 2 network for Ethereum according to market capitalization.","USDC, a stablecoin issued by Circle, is the second-largest stable currency in the crypto space with a market capitalization of about $53.7 billion according to CoinGecko.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tuesday","content":"DATE"},{"type":"Polygon USDC","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Polygon USD Coin (USDC","content":"ORGANIZATION"},{"type":"$53.7 billion","content":"MONEY"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["POLYGON","USDC"],"authors":["Osato Avan-Nomayo","The Block"]}