{"summary":"FTX CEO Sam Bankman-Fried said the new version of the crypto exchange platform will come with a faster order-matching engine.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175868\/ftx-rolling-out-v2-of-the-exchange-with-new-matching-engine-in-november","publishDate":"2022-10-10T06:48:18","id":6662,"type":null,"title":"FTX rolling out V2 of the exchange with new matching engine in November","category":["EXCHANGES"],"content":["A new version of the FTX crypto exchange will go live on Nov. 21, <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1579383258584059905\" data-v-f87c67ca=\"\">featuring<\/a> an improved matching engine aimed at addressing complaints from users about the performance of the current one.","“We’ll be rolling out a whole new order matcher, lower latency API pathways, a whole slew of other features,\" FTX CEO Sam Bankman-Fried <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1579383261599793153\" data-v-f87c67ca=\"\">tweeted<\/a> today.","Crypto exchanges, like other asset trading desks, use matching engines to match buy and sell orders. This process is what facilitates the buying and selling of crypto tokens on exchanges.","FTX’s matching engine has long been the subject of complaints from users. These complaints have been about the high latency and low throughput of the platform’s matching engine. Latency in the context refers to how fast the matching engine can match the buy and sell orders of users. Higher latency means slower trade execution which can be detrimental for users as profitable trading positions can be lost due to high latency.","According to Bankman-Fried, these improvements will double FTX’s order throughput while reducing the latency by 50%. He stated that these upgrades have been in the works for most of the year and are almost ready for release on the platform.","FTX <a href=\"https:\/\/www.theblock.co\/post\/169726\/sbf-apologizes-for-ftx-glitches-amid-high-volatility\" data-v-f87c67ca=\"\">suffered a downtime<\/a> last month due to what Bankman-Fried described as web interface-related issues. The glitch prevented users from accessing the crypto exchange’s website in the immediate aftermath of the September U.S. consumer price index report going live.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Nov. 21","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX","SAM BANKMAN-FRIED"],"authors":["Osato Avan-Nomayo","The Block"]}