{"summary":"The UK&#x27;s central bank called for regulatory clarity on crypto and reiterated its expectations for stablecoins in its latest financial stability report.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155802\/bank-of-england-calls-for-enhanced-crypto-regulatory-framework","publishDate":"2022-07-05T07:42:56","id":6663,"type":null,"title":"Bank of England calls for &#x27;enhanced&#x27; crypto regulatory framework","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">The Bank of England <\/span><a href=\"https:\/\/www.bankofengland.co.uk\/financial-stability-report\/2022\/july-2022\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> activity in the crypto market must be addressed as the industry continues to grow.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The bank’s Financial Policy Committee (FPC) briefly addressed cryptocurrencies in its financial stability report on Tuesday. The report noted that while crypto poses a less immediate risk it is nonetheless important to monitor.<\/span>","<span data-v-f87c67ca=\"\">In particular, the report pointed to the sharp drop-off in the market's value — which fell below $1 trillion in June from a high of $3 trillion in November. The FPC said that several vulnerabilities, with similarities to previous episodes in traditional finance, were exposed during this decline.<\/span>","<span data-v-f87c67ca=\"\">These vulnerabilities included \"liquidity mismatches leading to run dynamics and fire sales, and leveraged positions being unwound and amplifying price falls. Investor confidence in the ability of certain so-called 'stablecoins' to maintain their pegs was weakened significantly, particularly those with no or riskier backing assets and lower transparency.\"<\/span>","<span data-v-f87c67ca=\"\">While the report went on to say that these risks did not pose a threat to the stability of the broader financial markets, it did call for greater regulatory clarity as the industry develops.<\/span>","<span data-v-f87c67ca=\"\">“This underscores the need for enhanced regulatory and law enforcement frameworks to address developments in these markets and activities,” the report said.<\/span>","<span data-v-f87c67ca=\"\">Stablecoins were then singled out as requiring additional regulation, as \"some stablecoins held to be used for payments may not offer similar protections to central bank or commercial bank money.\"<\/span>","Such stablecoins <a href=\"https:\/\/www.theblock.co\/linked\/145974\/ust-stablecoin-regains-some-ground-as-crypto-sentiment-improves\" data-v-f87c67ca=\"\">hit the headlines<\/a> in May as TerraUSD – the third-largest — lost its peg to the US dollar, destroying more than $40 billion in value.&nbsp;","<span data-v-f87c67ca=\"\">The FPC previously set out its expectations for stablecoins which are&nbsp; used as “money-like instruments.” The committee expects these cryptocurrencies to meet “equivalent standards to commercial bank money in relation to stability of value, robustness of legal claim and the ability to redeem at par in fiat.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The US-UK Financial Innovation Partnership held its third <\/span><a href=\"https:\/\/www.theblock.co\/post\/155463\/uk-us-eye-central-bank-digital-currencies-and-stablecoins-in-london-meeting\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">meeting in London last week<\/span><\/a><span data-v-f87c67ca=\"\"> to discuss crypto and digital asset regulation, ahead of a financial working group meeting between the two nations later this month. The meeting also addressed stablecoins and central bank digital currencies.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fiat","content":"ORGANIZATION"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"FPC","content":"ORGANIZATION"},{"type":"’s Financial Policy Committee (FPC","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$3 trillion","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"last week","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"$1 trillion","content":"MONEY"},{"type":"UK Financial Innovation Partnership","content":"ORGANIZATION"}],"hashtag":[],"authors":["Adam Morgan McCarthy","The Block"]}