{"summary":"The Merlin rug pull occurred just days after CertiK conducted a code audit, prompting Crypto Twitter to blame the security auditor for the incident.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228485\/merlin-scam-certik-refund","publishDate":"2023-04-27T06:46:56","id":6668,"type":null,"title":"Crypto security firm vows refunds for Merlin DEX scam after auditing code","category":["CRYPTO ECOSYSTEMS"],"content":["The crypto security firm that audited the Merlin decentralized exchange's code announced plans to compensate victims after the team behind the project absconded with nearly $2 million days after the audit was completed.","CertiK, a well-known security and smart-contract audit firm, \"is exploring a community compensation plan\" after&nbsp;members of the Merlin team swiped the funds from the project's smart contract this week, CertiK <a href=\"https:\/\/twitter.com\/CertiK\/status\/1651276441949028373\" data-v-f87c67ca=\"\">said<\/a> in a tweet. More details about the plan will be released in future, it added.","Initially believed to be a <a href=\"https:\/\/www.theblock.co\/post\/228302\/zksync-dex-merlin-hack\" data-v-f87c67ca=\"\">hack<\/a>, security analysts, including CertiK, eventually concluded that it was a <a href=\"https:\/\/www.theblock.co\/linked\/143193\/state-lawmakers-want-to-make-fraudulent-rug-pulls-a-crime-in-new-york\" data-v-f87c67ca=\"\">rug pull<\/a> — an exit scam frequently encountered in the DeFi space where one or more members of a crypto project seize control and steal funds locked within the protocol. The incident occurred just a few days after CertiK conducted a code audit for Merlin, causing commentators on Crypto Twitter to <a href=\"https:\/\/twitter.com\/Flowslikeosmo\/status\/1651224710024253441\" data-v-f87c67ca=\"\">blame<\/a> the security auditor for the incident.","\"As CertiK works tirelessly to resolve the situation, the company will continue to provide updates and ensure transparency throughout the process,\" CertiK told The Block. \"We are committed to protecting the community and maintaining the highest level of security standards in the blockchain ecosystem.\"","CertiK, which <a href=\"https:\/\/www.theblock.co\/post\/141019\/certik-raises-88-million-valuation-2-billion-goldman-sachs-others\" data-v-f87c67ca=\"\">raised $88 million<\/a> in funding at a $2 billion valuation last year, audits smart contracts of DeFi projects. Due to the immutable nature of blockchain technology, projects often pay audit firms like CertiK to demonstrate their commitment to security measures before deploying a smart contract. The developers of Merlin, a decentralized exchange that&nbsp;operated on the zkSync Layer 2 blockchain, also contacted CertiK for an audit of their smart contract.","CertiK said it planned to cooperate with law enforcement to track down the rogue developers responsible for the scam and has offered a 20% bounty (worth about $400,000) for the return of the stolen funds.","\"Initial investigations indicate that the rogue developers are based in Europe, and CertiK will collaborate with law enforcement authorities to track them down if direct negotiation is unsuccessful,\" CertiK <a href=\"https:\/\/twitter.com\/CertiK\/status\/1651276441949028373\" data-v-f87c67ca=\"\">elaborated<\/a>.","Merlin allowed crypto users to provide liquidity by allocating their tokens to its smart contract in exchange for rewards. However, the developers who forked the smart contract from another decentralized exchange called Camelot, granted themselves admin privileges. This enabled them to seize user funds at any time with the help of the admin key.","CertiK's <a href=\"https:\/\/twitter.com\/CertiK\/status\/1651098565979037697\/photo\/2\" data-v-f87c67ca=\"\">audit<\/a> of Merlin did warn of risks, including the developers' privileged access to funds deposited in the smart contract. Yet users who trusted the project still deposited funds into its liquidity pools.","CertiK acknowledged the difficulty in detecting malicious developer intentions, stating, \"While audits can identify potential risks and vulnerabilities, they cannot prevent malicious activities on the part of rogue developers such as rug pulls.\"","The firm told The Block it was the first time it had decided to pay compensation after one of their clients cheated its investors.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$88 million","content":"MONEY"},{"type":"Merlin","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$400,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"$2 billion","content":"MONEY"},{"type":"Europe","content":"LOCATION"}],"hashtag":["DEXS","EXPLOITS","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}