{"summary":"A vulnerability on the popular Javascript library event-stream, used for streaming data in Node.js applications, affected BitPay&#x27;s Copay wallet","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/4030\/bitpay-wallet-vulnerability-caused-by-use-of-popular-javascript-library","publishDate":"2018-11-26T19:19:08","id":6673,"type":null,"title":"BitPay wallet vulnerability caused by use of popular JavaScript library","category":["HACKS"],"content":["A vulnerability on the popular Javascript library <code data-v-f87c67ca=\"\">event-stream<\/code>, used for streaming data in <a href=\"https:\/\/nodejs.org\/en\/\" data-v-f87c67ca=\"\">Node.js<\/a> applications, affected BitPay's Copay wallet application, which depended on the library downstream. The vulnerability enabled malevolent actors to steal bitcoin and bitcoin cash from accounts using BitPay's Copay wallet application. Popular applications are built on many layers of open-source tooling. With too many changes to track manually, developers often take for granted the stability of large open-source libraries.","In this case, the malicious addition to the library was a very well-executed social attack where the attacker, an anonymous developer with the handle <a href=\"https:\/\/github.com\/right9ctrl\" target=\"_blank\" rel=\"noopener noreferrer nofollow\" data-v-f87c67ca=\"\">right9ctrl<\/a>, was given control of the code repository from maintainer Dominic Tarr three months ago, after offering to help maintain the code.","The malicious code was flagged in the original repository <a href=\"https:\/\/github.com\/dominictarr\/event-stream\/issues\/116\" target=\"_blank\" rel=\"noopener noreferrer nofollow\" data-v-f87c67ca=\"\">six days ago<\/a> but only understood more recently as it specifically targeted the app <a href=\"https:\/\/copay.io\/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\" data-v-f87c67ca=\"\">Copay<\/a>, a cryptocurrency wallet developed by the bitcoin payment processor <a href=\"https:\/\/bitpay.com\/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\" data-v-f87c67ca=\"\">BitPay<\/a>. The <a href=\"https:\/\/github.com\/bitpay\/copay\/issues\/9346\" target=\"_blank\" rel=\"noopener noreferrer nofollow\" data-v-f87c67ca=\"\">issue was flagged<\/a> on BitPay's repository earlier today.","The added code was <a href=\"https:\/\/en.wikipedia.org\/wiki\/Obfuscation_(software)\" data-v-f87c67ca=\"\">obfuscated<\/a>, making it difficult to read at a glance. When expanded, the code revealed the vulnerability:","The issue was quickly resolved in a <a href=\"https:\/\/github.com\/bitpay\/copay\/pull\/9348\" data-v-f87c67ca=\"\">new release<\/a> but other wallets&nbsp;such as the <a href=\"https:\/\/github.com\/bitprim\/keoken\" data-v-f87c67ca=\"\">Keoken bitcoin\/bitcoin cash wallet<\/a>, which copied BitPay's codebase via a fork, are similarly affected. They are&nbsp;<a href=\"https:\/\/github.com\/bitprim\/keoken\/pull\/15\" data-v-f87c67ca=\"\">currently patching the vulnerability<\/a>.","While the library is used in hundreds of thousands of different unaffected applications, the vulnerability has sparked an <a href=\"https:\/\/news.ycombinator.com\/item?id=18534392\" data-v-f87c67ca=\"\">interesting conversation<\/a> on many developer forums about potential future changes to developer workflows or open-source release architecture to avoid similar issues.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Dominic Tarr","content":"PERSON"},{"type":"three months ago","content":"DATE"}],"hashtag":[],"authors":["The Block","The Block"]}