{"summary":"Blockchain development firm Recursive has introduced the Omni Network, a cross-rollup protocol built on Ethereum&#x27;s restaking Eigen Layer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228112\/recursive-looks-to-connect-rollups-with-eigen-layer-based-omni-network","publishDate":"2023-04-25T12:26:37","id":6675,"type":null,"title":"Recursive looks to connect rollups with Eigen Layer-based Omni Network","category":["CRYPTO ECOSYSTEMS"],"content":["Blockchain development firm Recursive is bringing a new addition to the crowded Ethereum Layer 2 ecosystem that aims to help connect roll-ups like Optimism, Arbitrum, zkSync, and Starkware, among others.","By transmitting messages from one scaling solution to another, Recursive's new Omni Network is looking to facilitate communication between disparate rollups and make it easier for users to navigate and interact between the different options.&nbsp;&nbsp;","\"Omni transmits messages from one rollup to another,\" explained Recursive co-founder Austin King. \"Users make a transaction on a protocol that has integrated Omni, which is then observed by Omni validators responsible for relaying the message to the recipient rollup.\"","The project ultimately wants to enable use cases like cross-rollup stablecoins and other DeFi primitives that can aggregate liquidity from different Layer 2 rollups. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Omni allows developers to think globally, not locally, \" King, who previously ran Strata Labs, said. \"This has significant impacts for them in terms of reaching a wider market of users and providing fundamental economic advantages like liquidity aggregation across rollups.\"","Recursive has announced its plans to launch a public testnet in the third quarter of 2023 and aims to have a mainnet launch in 2024. The Omni Network will collaborate with major rollup partners like Arbitrum, Polygon's zkEVM, Scroll, ConsenSys's Linea, and Starkware to launch the first version of the platform in the coming year.","The Omni platform is being designed to build on top of the <a href=\"https:\/\/www.theblock.co\/post\/208015\/eigenlayer-series-a-round\" data-v-f87c67ca=\"\">EigenLayer<\/a>, another blockchain protocol. Omni will leverage EigenLayer for its security needs.","Recursive (previously called Rift) raised $18 million from investors like Pantera and Two Sigma in 2022. Prior to that Recursive co-founder Austin King had co-founded Strata Labs, a crypto payments project that was later acquired by Xpring, the investment arm of Ripple, in 2019.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Austin King","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Recursive","content":"ORGANIZATION"},{"type":"third quarter of 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"\" King","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"$18 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Arbitrum","content":"LOCATION"},{"type":"Two Sigma","content":"LOCATION"},{"type":"Strata Labs","content":"ORGANIZATION"},{"type":"Pantera","content":"ORGANIZATION"},{"type":"Omni","content":"ORGANIZATION"},{"type":"Omni Network","content":"ORGANIZATION"},{"type":"Scroll","content":"LOCATION"}],"hashtag":["POLYGON","SCROLL","STARKNET","ZKEVM","ZKSYNC"],"authors":["Vishal Chawla","The Block"]}