{"summary":"Rapper T.I. found himself the defendant in a securities lawsuit arising out of the FLiK token sale, which he was involved in. T.I. argued his tokens weren’t securities, but after the court applied the Howey Test, it found they were in fact securities, in spite of claimed utility.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/24608\/court-says-rapper-t-i-s-flik-token-was-a-security-but-its-case-dismissed-for-now","publishDate":"2019-05-24T12:00:11","id":6677,"type":null,"title":"Court says rapper T.I.&#x27;s FLiK token was a security: Case dismissed for now","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","“But it’s a utility token!!!!” was a magic mantra many proclaimed in the furious flash-bang of the ICO craze in 2017. The litigation tail that skeptics expected has started to thwack back fiercely, and this case is yet another to add to what is likely to begin a lengthy string cite for the point that calling a fig a duck won’t make fruit quack and that “utility token” won’t magically transmute a security into something else.","This lawsuit is one of several that ensnared a celebrity, too. Here, it’s the rapper T.I. At issue in this securities action (not a class action, by the way, just a pile of individual plaintiffs) is a token sale for something called FLik. The Court explains the basic facts underlying the suit thus:","<em data-v-f87c67ca=\"\">“The defendants were the controlling shareholdings of FLiK, a company initiated to create an online distribution platform for entertainment projects. To raise money to launch the company and its online platform, the defendants conducted an initial coin offering (“ICO”) from August 20, 2017 to September 20, 2017. In an ICO, a company offers purchasers a unique digital asset, often called a “coin” or “token,” in exchange for consideration. FLiK’s ICO involved the sale of a limited number of FLiK tokens, which were then available for sale on the secondary market.”<\/em>","There was the usual whitepaper, claims that the token would moon and everyone would make beaucoup bucks, and “several announcements promoting the tokens, including social media posts describing high-value purchases, celebrity endorsements, and investments and upcoming projects that the company would take on.” The tokens went up in value, then they went down, nothing got launched and (per the court’s opinion) “the tokens are now essentially worthless.” Plaintiffs say they lost about $2 million and that this was really just a classic pump and dump scheme and was an unregistered securities offering. So they filed suit under the federal Securities Act and under Georgia’s state securities law.","T.I. filed a motion to dismiss. He argued that the tokens were not securities and even if they are that the claims weren’t adequately pleaded. The Court applied the Howey Test.","First, there was an investment of money to pay for the FLiK tokens, and for purposes of prong 1 of the Howey Test payment in digital assets suffices. Defendant’s argument to the contrary was “not persuasive.”","Second, Felton challenged the third Howey element — “expectation of profits derived solely from the [managerial] efforts of others.” The Court rejected this argument too. The fact that they offered some functionality didn’t matter for pleading purposes: “Although the tokens had additional functionality — such as access to in- person FLiK events for token owners — the complaint details several ways in which Felton led the plaintiffs to believe that they could expect a profit from buying the tokens.” In addition, the use of funds “was already determined by the defendants” per the FLiK token whitepaper. In short, purchase of FLiK tokens was a speculative investment in a largely non-existent technology, with the expectation of investment returns that depended entirely on the defendants' efforts.","Even though the Court agrees that these tokens were in fact sufficiently alleged to be securities, the Court granted the motion to dismiss the federal securities claims (with leave to refile) for timing reasons. Claims for unregistered sale of securities have to be brought within a year after the violation on which they are based, under federal law. Because this isn’t pleaded, these claims were dismissed with leave to refile. Plaintiffs have since filed an amended complaint that seeks to fix this problem.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Felton","content":"PERSON"},{"type":"Court","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"T.I","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"$2 million","content":"MONEY"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Georgia","content":"LOCATION"},{"type":"September 20, 2017","content":"DATE"},{"type":"ICO","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Howey","content":"PERSON"},{"type":"Palley","content":"PERSON"},{"type":"August 20, 2017","content":"DATE"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"}],"hashtag":[],"authors":["Stephen D. Palley","The Block"]}