{"summary":"FTX founder and ex-CEO Sam Bankman-Fried said on Twitter that he’s “really sorry, again,” after the exchange and related companies filed for bankruptcy.\n“I was shocked to see things unravel the way they did earlier this week,” he said.","author":["Nathan Crooks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185964\/bankman-frieds-really-really-sorry-again-following-bankruptcy-filing","publishDate":"2022-11-11T10:54:16","id":668,"type":null,"title":"Bankman-Fried&#x27;s really, really sorry &#x27;again&#x27; following bankruptcy filing","category":["Exchanges"],"content":["Sam Bankman-Fried, the founder and former CEO of the FTX crypto exchange that filed for Chapter 11 bankruptcy protection today, said he was \"really sorry, again, that we ended up here.\"","\"I'm piecing together all of the details, but I was shocked to see things unravel the way they did earlier this week,\" he wrote in a <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1591089317300293636\" data-v-f87c67ca=\"\">thread<\/a> on Twitter. \"I will, soon, write up a more complete post on the play by play, but I want to make sure that I get it right when I do.\"","The fresh apology came just one day after Bankman-Fried said he had \"<a href=\"https:\/\/www.theblock.co\/post\/185332\/bankman-fried-apologizes-says-ftx-has-more-assets-than-client-deposits\" data-v-f87c67ca=\"\">'f*cked up<\/a>\" and would do everything possible in an attempt to raise liquidity and save the struggling company.","While he said on Tuesday that the exchange's U.S. operations had not been impacted by the liquidity crunch, FTX US was included in the slew of bankruptcy filings.&nbsp;","Collectively, <a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">the firms have claimed<\/a> more than 100,000 creditors and between $10 billion and $50 billion in both assets and liabilities.&nbsp;","\"I'm going to work on giving clarity on where things are in terms of user recovery ASAP,\" Bankman-Fried said.&nbsp;"],"hashtag":["FTX","SAM BANKMAN-FRIED"]}