{"summary":"Terra&#x27;s core developers got approval to burn 1.3 billion UST from its community pool following a governance vote.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/148999\/terra-governance-system-passes-plan-to-burn-1-3-billion-ust-tokens","publishDate":"2022-05-26T16:00:07","id":668,"type":null,"title":"Terra governance system passes plan to burn 1.3 billion UST tokens","category":["GOVERNANCE"],"content":["The Terra governance system has voted to approve a <a href=\"https:\/\/station.terra.money\/proposal\/1747\" data-v-f87c67ca=\"\">proposal<\/a> to burn all TerraUSD (UST) tokens held in the project’s community pool and UST deployed for past liquidity incentives on Ethereum.","This amounts to more than 1.3 billion UST, or roughly 11% of the existing 11.2 billion UST supply, <a href=\"https:\/\/www.coingecko.com\/en\/coins\/terraclassicusd\" data-v-f87c67ca=\"\">according<\/a> to CoinGecko. The proposal received 99.3% of the total cast votes in favor of it. <span data-v-f87c67ca=\"\">Following the vote, Terraform Labs, Terra's core development firm, will proceed to execute the burn. <\/span>","<span data-v-f87c67ca=\"\">This process will take place over two phases. First, it will send about 1 billion UST from Terra's <a href=\"https:\/\/lcd.terra.dev\/distribution\/community_pool?height=7589632\" data-v-f87c67ca=\"\">community pool<\/a> to a burn module where it will be permanently removed from the supply. Then, the team will manually bridge back 370 million UST to Terra from the Ethereum blockchain and destroy them, as <a href=\"https:\/\/agora.terra.money\/t\/burn-the-remaining-ust-in-the-community-pool-cross-chain-liquidity-incentive-ust\/6837\" data-v-f87c67ca=\"\">detailed<\/a> in an explainer post on the Terra governance forum.<\/span>","<span data-v-f87c67ca=\"\">Earlier this month, the dollar-pegged algorithmic stablecoin UST plummeted from $1 to $0.04 cents before slightly recovering to $0.07 where it trades now. This represents a 93% drop from its value prior to the fall from dollar parity.&nbsp;<\/span>","The approval of the UST burn comes a day after Terra's governance system also <a href=\"https:\/\/www.theblockcrypto.com\/post\/148629\/do-kwons-plan-to-rebirth-the-terra-blockchain-gets-approved\" data-v-f87c67ca=\"\">approved<\/a> Terraform’s revival plan to re-launch the Terra blockchain and create LUNA 2.0 tokens.","The relaunched chain will go live Saturday and subsequently airdrop the new LUNA 2.0 tokens to holders of Terra-based assets. However, the new Terra blockchain will exist without the UST tokens, and their use will be restricted to the original blockchain.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$0.04 cents","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Terraform Labs","content":"ORGANIZATION"},{"type":"11%","content":"PERCENT"},{"type":"$1","content":"MONEY"},{"type":"93%","content":"PERCENT"},{"type":"Terra","content":"LOCATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"99.3%","content":"PERCENT"},{"type":"UST","content":"ORGANIZATION"},{"type":"$0.07","content":"MONEY"},{"type":"Saturday","content":"DATE"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}