{"summary":"Brazil&#x27;s federal tax authority, which compiles data from foreign and local exchanges on cryptocurrency usage, said that the value of all transactions for tether jumped 58% last year compared to a year earlier.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211247\/tether-dominates-brazil-as-bitcoin-ether-fall-out-of-favor","publishDate":"2023-02-13T18:06:31","id":6684,"type":null,"title":"Tether dominates Brazil as bitcoin, ether fall out of favor","category":["MARKETS"],"content":["In a country where economic instability is as common as coconuts, Brazilians appear to favor the stablecoin tether as their cryptocurrency of choice.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe federal tax authority, which compiles data from foreign and local exchanges on cryptocurrency usage, said that the value of all transactions for tether jumped 58% last year compared to a year earlier. Bitcoin and ether, also widely used, saw decreases of more than 60% from 2021.&nbsp;","Last year, Brazil approved a law regulating cryptocurrencies, a major step forward as the country embraces digital assets.&nbsp;","The main use case for Brazilians is as a speculative investment, <a href=\"https:\/\/blog.chainalysis.com\/reports\/latin-america-cryptocurrency-geography-report-2022-preview\/\" data-v-f87c67ca=\"\">Chainalysis<\/a> reported Thomaz Fortes, the crypto lead at Brazil's Nubank, as saying.","“Customers want a way to expand their earnings,” he said in October. “The retail growth in the number of users in crypto has been much faster than in the equities market.\"","Nubank <a href=\"https:\/\/www.theblock.co\/post\/172893\/nubank-logs-nearly-1-8-million-crypto-users-in-brazil\" data-v-f87c67ca=\"\">reached<\/a> 1.8 million crypto customers about four months after launching the service.&nbsp; &nbsp;","Cryptocurrency-related revenue in the country is expected to show an annual growth rate of 15.25% between 2023 and 2027, Statista <a href=\"https:\/\/www.statista.com\/outlook\/dmo\/fintech\/digital-assets\/cryptocurrencies\/brazil\" data-v-f87c67ca=\"\">reported<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2027","content":"DATE"},{"type":"58%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Thomaz Fortes","content":"PERSON"},{"type":"Brazil","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"15.25%","content":"PERCENT"},{"type":"Statista","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"Nubank","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}