{"summary":"Aave Companies has proposed to Aave&#x27;s governance forum that a new stablecoin called GHO should be created.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156348\/defi-protocol-aave-proposes-creation-of-stablecoin-called-gho","publishDate":"2022-07-07T11:16:03","id":6691,"type":null,"title":"DeFi protocol Aave proposes creation of stablecoin called GHO","category":["DEFI"],"content":["Aave Companies, the entity behind DeFi protocol Aave, has proposed to Aave's governance forum that a new stablecoin called GHO should be created.","Currently the <a href=\"https:\/\/governance.aave.com\/t\/introducing-gho\/8730\" data-v-f87c67ca=\"\">proposal<\/a> is up for discussion and it would need to pass a governance vote to be implemented.","The stablecoin would be overcollateralized and similar to dai, the most popular decentralized stablecoin in the Ethereum ecosystem.","Aave users would be able to mint the stablecoin by using assets that they have supplied to Aave as collateral. These assets would continue to generate yield while also being used as collateral.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">While GHO would be secured by the assets on the Ethereum market, the main vision for GHO is to pursue organic adoption via L2s [layer 2s] to solve real life payment opportunities across the internet and on-ground,\" <a href=\"https:\/\/twitter.com\/StaniKulechov\/status\/1545058246821433348?t=kad7Ojj2KA7J1a1szyaMmw&amp;s=19\" data-v-f87c67ca=\"\">said<\/a> Aave founder Stani Kulechov on Twitter.<\/span>","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Kulechov<\/span> added that the Aave DAO would benefit by receiving the interest payments from anyone who borrows the stablecoin. He noted that the stablecoin's development has been completed and has an audit scheduled for July 11.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"July 11","content":"DATE"},{"type":"Aave DAO","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Aave","content":"ORGANIZATION"},{"type":"GHO","content":"ORGANIZATION"},{"type":"Stani Kulechov","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["AAVE","DAI"],"authors":["Tim Copeland","The Block"]}