{"summary":"Singapore’s new payments law has come into force today and it requires all crypto businesses operating in the country to be registered and licensed. The Payment Services Act was first passed in January 2019 and is now enacted, the Monetary Authority of Singapore (MAS) announced Tuesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54159\/new-singapore-law-requires-crypto-firms-to-be-licensed-in-the-country","publishDate":"2020-01-28T02:16:13","id":6692,"type":null,"title":"New Singapore law requires crypto firms to be licensed in the country","category":["REGULATION"],"content":["Singapore’s new payments law has come into force today and it requires all crypto businesses operating in the country to be registered and licensed.","The <a href=\"https:\/\/sso.agc.gov.sg\/Acts-Supp\/2-2019\/Published\/20190220?DocDate=20190220\" data-v-f87c67ca=\"\">Payment Services Act<\/a> was first passed in January 2019 and is now enacted, the Monetary Authority of Singapore (MAS) <a href=\"https:\/\/www.mas.gov.sg\/news\/media-releases\/2020\/payment-services-act-comes-into-force\" data-v-f87c67ca=\"\">announced<\/a> Tuesday. It gives the regulator formal supervisory authority over payments firms, including crypto.","The <a href=\"https:\/\/www.mas.gov.sg\/news\/speeches\/2019\/payment-services-bill\" data-v-f87c67ca=\"\">act covers<\/a> \"digital payment token services\" - effectively all crypto firms and exchanges in the country. It means they will have to comply with anti-money laundering (AML) and counter financing of terrorism (CFT) requirements.","MAS believes cryptocurrencies carry “significant” money laundering risks due to their anonymous and borderless nature of transactions. Therefore, all crypto businesses will have to be licensed to operate in the country.","<strong data-v-f87c67ca=\"\">Three classes of licenses<\/strong>","The act, however, does not impose uniform licensing requirements. It adopts an activity-based licensing framework for different kinds of activities firms undertake and risks they pose.","There are three classes of licenses – a money-changing license, a standard payment institution, and a major payment institution, per the act. “Each service provider needs to hold only one of the three licenses.”","“The activity-based and risk-focused regulatory structure allows rules to be applied proportionately and to be robust to changing business models. The PS Act will facilitate growth and innovation while mitigating risk and fostering confidence in our payments landscape,\" said Loo Siew Yee, assistant managing director at MAS.","<strong data-v-f87c67ca=\"\">Applicants in line&nbsp;<\/strong>","Singapore-headquartered crypto exchange Zipmex is one of the firms planning to apply for the licenses. Regulation brings “legitimacy and credibility” to digital assets, Marcus Lim, CEO of Zipmex, told The Block.","Japan-based crypto exchange Liquid and U.K.-based bitcoin wallet provider Luno, which already operate in Singapore, are also reportedly <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-01-27\/singapore-launches-new-regime-for-cryptocurrency-payments-firms?utm_campaign=socialflow-organic&amp;utm_source=twitter&amp;utm_content=business&amp;cmpid=socialflow-twitter-business&amp;utm_medium=social\" data-v-f87c67ca=\"\">planning<\/a> to apply for the licenses.","Singapore has now become one of the few regions to have regulatory clarity for crypto businesses. Japan has been regulating the crypto sector since 2017 via its Payment Services Act. Earlier this month, the EU region also brought its Fifth Anti-Money Laundering Directive (<a href=\"https:\/\/www.theblockcrypto.com\/daily\/51782\/amld5-fills-regulatory-void-for-crypto-firms-but-state-by-state-rules-pose-challenges\" data-v-f87c67ca=\"\">AMLD5<\/a>) into force. However, the directive has led some crypto <a href=\"https:\/\/www.theblockcrypto.com\/post\/50613\/two-more-crypto-firms-shutting-down-over-impending-eu-money-laundering-rules\" data-v-f87c67ca=\"\">business closures<\/a> and some have <a href=\"https:\/\/www.theblockcrypto.com\/post\/53352\/another-crypto-firm-moving-out-of-the-eu-in-response-to-5amld-this-time-non-custodial-exchange-kyberswap\" data-v-f87c67ca=\"\">moved their operations<\/a> out of the EU.","As for Singapore, MAS believes its new law will strengthen consumer protection and promote confidence in the use of electronic payments.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"Marcus Lim","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"January 2019","content":"DATE"},{"type":"Japan","content":"LOCATION"},{"type":"Loo Siew Yee","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"AML","content":"ORGANIZATION"},{"type":"Monetary Authority of Singapore (MAS)","content":"ORGANIZATION"},{"type":"MAS","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}