{"summary":"U.S. Presidential candidate Donald Trump told CNBC he has &quot;fun&quot; with crypto. Trump also said bitcoin is an “additional form of currency.”","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281660\/donald-trump-fun-crypto-bitcoin","publishDate":"2024-03-11T08:52:35","id":6699,"type":null,"title":"Donald Trump says he has &#x27;fun&#x27; with crypto, bitcoin is an &#x27;additional form of currency&#x27;","category":["PEOPLE"],"content":["Former United States President Donald Trump and the leading Republican candidate for November’s election said he has \"fun\" with crypto but doesn’t trade it.","“Well, it's taken [on] its own life,” Trump said in an <a href=\"https:\/\/x.com\/gaborgurbacs\/status\/1767157734808392060?s=20\" data-v-f87c67ca=\"\">interview<\/a> on CNBC this morning when asked about his thoughts on crypto. “You know, I do little things sometimes for fun and, you know, make money with it and have fun with it, too.”","Trump went on to say he sometimes lets people pay him in bitcoin, adding that it’s “an additional form of currency.”&nbsp;&nbsp;","The presidential candidate appears to be softening his <a href=\"https:\/\/www.theblock.co\/linked\/107439\/trump-bitcoin-seems-like-a-scam\" data-v-f87c67ca=\"\">stance<\/a> on bitcoin and the broader crypto market, having previously declared that \"it just seems like a scam\" in 2021. His latest remarks also echoed comments at a <a href=\"https:\/\/www.theblock.co\/post\/278786\/donald-trump-bitcoin-embracing\" data-v-f87c67ca=\"\">town hall<\/a> event on Fox News in February, where Trump said that while some regulation was likely required, many people were embracing bitcoin, and he could “live with it one way or the other.”","Trump has consistently highlighted on the importance of the U.S. dollar, but cryptocurrencies and the related market seem to be increasingly capturing his attention. “I used to say, I want one currency. I want the dollar. I don't want people leaving the dollar and all that. I feel that way. But I will tell you, it has taken on a life,” Trump said.","“I did a thing that people smile at, but it was wild,” he added, referring to his sneakers collection. “We did 1000 sneakers, a limited edition sneaker, and you could go through our crazy new currencies because that's what I call them.”","“The last pair sold for $450,000. So it just took off — and I noticed that so many of them were paid for with the new currency,” Trump said. “It's a new cryptocurrency, and I couldn't believe the amount.”","\"There has been a lot of use of that and I'm not sure that I would want to take it away at this point,” he added.","As President in 2019, Trump also blasted bitcoin and cryptocurrencies. \"I'm not a fan of bitcoin and other cryptocurrencies, which are not money, and whose value is highly volatile and based on thin air,\" Trump said.","However, Trump has since gone on to promote his own nonfungible tokens, including a <a href=\"https:\/\/www.theblock.co\/post\/195431\/only-99-former-us-president-donald-trump-unveils-nft-trading-card-collection\" data-v-f87c67ca=\"\">trading card<\/a> collection in December 2022 and a “<a href=\"https:\/\/www.theblock.co\/post\/267294\/trump-hawks-new-nfts-for-a-chance-to-win-a-piece-of-his-mugshot-suit\" data-v-f87c67ca=\"\">Mugshot Edition<\/a>” of the collection in December last year. Blockchain analytics platform Arkham Intelligence said that a crypto portfolio it believes to be owned by Trump sold 1,075 ETH, worth about $2.4 million at the time, in the same month.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2.4 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Trump","content":"ORGANIZATION"},{"type":"1000","content":"DATE"},{"type":"December last year","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$450,000","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"Donald Trump","content":"PERSON"},{"type":"Trump","content":"PERSON"},{"type":"CNBC this morning","content":"TIME"},{"type":"December 2022","content":"DATE"},{"type":"Fox News","content":"ORGANIZATION"}],"hashtag":[],"authors":["James Hunt","The Block"]}