{"summary":"The Delta upgrade was deployed on various Optimism-based chains, including OP Mainnet, Base and Zora, targeting reduced Layer 1 fees.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280044\/delta-hardfork-results-in-fee-reduction-on-optimism-ecosystem-chains","publishDate":"2024-03-01T02:14:05","id":670,"type":null,"title":"Delta upgrade results in fee reduction on Optimism ecosystem chains","category":["CRYPTO ECOSYSTEMS"],"content":["The Delta hardfork was deployed last week across various Optimism-based chains, including OP Mainnet, Base and Zora.","This update — aimed at reducing fixed overhead costs for Layer 1 fees — showed major fee reductions aligned with initial projections. Delta helped optimize blockchain operations, reducing costs for chain operators, according to OP Labs.","OP Labs — the core developer behind Optimism — demonstrated the effectiveness of the Delta hardfork in reducing fixed overhead costs with Zora-sepolia’s data, which shows a 90% decrease in such costs. This resulted in increased revenue collection by Zora.","“We expect this upgrade will make it much easier to adopt the OP Stack by alleviating fee burdens for all chain operators,” OP Labs <a href=\"https:\/\/blog.oplabs.co\/span-batches\/\" data-v-f87c67ca=\"\">said<\/a>.","The introduction of <a href=\"https:\/\/www.theblock.co\/post\/278689\/optimism-introduces-span-batches-cuts-op-stack-chains-overhead-by-90\" data-v-f87c67ca=\"\">Span Batches<\/a> — a key feature of the Delta upgrade — enabled the consolidation of consecutive Layer 2 blocks into a single batch, reducing the amount of data that needs to be posted to Ethereum.","The feature projected a reduction of L1 fees by 6% to 11% for more active chains and over 90% for less active ones before Delta was implemented. These projections held true after the implementation, the firm noted.","<a href=\"https:\/\/www.theblock.co\/post\/278251\/optimism-distributes-over-10-million-op-worth-nearly-41-million-in-fourth-airdrop\" data-v-f87c67ca=\"\">Optimism<\/a> comprises an ecosystem of Layer 2 chains (collectively called the Superchain) that utilize optimistic rollups to reduce transaction costs for dapps. This ecosystem is governed by a DAO, known as the Optimism Collective.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"6%","content":"PERCENT"},{"type":"Delta","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"11%","content":"PERCENT"},{"type":"OP Labs","content":"ORGANIZATION"}],"hashtag":["OPTIMISM"],"authors":["Vishal Chawla","The Block"]}