{"summary":"Crypto services firm BitGo is shifting its focus to address a long-standing grievance of both the banking and the digital assets world: clearing and","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/23318\/bitgo-branches-beyond-custody-business-launching-new-business-line-to-become-the-goldman-sachs-of-bitcoin","publishDate":"2019-05-14T10:00:31","id":6703,"type":null,"title":"BitGo ventures beyond custody with service that makes it look like the DTCC of bitcoin","category":["STARTUPS"],"content":["Crypto services firm BitGo is shifting its focus to address a long-standing grievance of both the banking and the digital assets world: clearing and settlement.","The Palo Alto firm announced it will offer new settlement and clearing services at an industry conference in New York, in a move that shows BitGo <a href=\"https:\/\/www.theblockcrypto.com\/2019\/04\/23\/behind-the-scoop-dtcc-and-the-opportunities-for-dlt-within-post-trade-settlement\/\" data-v-f87c67ca=\"\">working to become<\/a> the back-office to the entire crypto trading world.","BitGo has traditionally focused on its flagship custody business, reportedly storing $2 billion in clients’ assets across 100 different coins and tokens. But competition is heating up in the custody world, <a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/09\/bitgo-brings-on-trading-executive-to-solve-industry-pain-points-as-it-eyes-new-opportunities-to-lure-institutions-into-cryptocurrency\/\" data-v-f87c67ca=\"\">forcing BitGo<\/a> expand into new frontiers, having recently been eyeing the launch of prime-broker services.","But today's news reflects BitGo's ambitions to serve as the crypto world's version of the Depository Trust &amp; Clearing Corporation (DTCC) — which sits behind every trade in Wall Street. By providing a specialised clearing and settlement system, BitGo could be at the forefront of addressing one of the most underdeveloped and risky facets of crypto trading.","Currently, settling a crypto trade takes place by moving users’ assets into hot storage. By doing so, their crypto is exposed to risks of a hack or counter-party defaulting. Because the settlement is done on-chain, ownership of the crypto is renounced before users’ secure their payment (or vice versa), meaning the original owner absorbs any potential losses. Many believe this has been keeping institutions at an arm’s distance.&nbsp;As such, the likes of Bakkt and <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/over-20-crypto-heavyweights-put-heads-together-to-plan-institutional-uptake-clearinghouse-initiative-set-for-july\/\" data-v-f87c67ca=\"\">Liquidity Offset Network<\/a> are working to address this gap, but it seems BitGo may now beat them to the punch.","By adding an Off-Chain Clearing and Settlement (C&amp;S) service to its custody product, BitGo says users’ digital assets should remain safe throughout a transaction, as they will never leave custody before ownership is settled. In other words, BitGo acts as a trusted third party, locking up both parties’ funds during settlement. The crypto is only moved on-chain during the withdrawal, by which point it is the new owner’s responsibility.","“Until now, in a digital asset trade, one party needed to assume all of the risk and act on the counter-party’s good faith, and this doesn’t really work for institutional investors,” said BitGo CEO Mike Belshe. “We are bringing to market a riskless, efficient, and compliant digital asset clearing and settlement.”","Notably, the C&amp;S service will only be available to clients of its existing custodian business, adding a competitive edge. They are hoping to offer their services to a client base made up of OTC desks, single dealer platforms, exchanges, asset managers, and broker-dealers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Palo Alto","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"Mike Belshe","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Depository Trust &amp; Clearing Corporation (DTCC","content":"ORGANIZATION"},{"type":"Liquidity Offset Network","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"}],"hashtag":[],"authors":["Isabel Woodford","The Block"]}