{"summary":"The Kin Foundation has closed a vote to burn 4.96 trillion of its reserves in an effort to fully decentralize the Kin protocol. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241582\/proposal-to-burn-large-part-of-kin-supply-closes-with-full-support","publishDate":"2023-07-27T16:00:03","id":6706,"type":null,"title":"Proposal to burn large part of Kin supply closes with full support","category":["CRYPTO ECOSYSTEMS"],"content":["<a href=\"https:\/\/www.theblock.co\/post\/207056\/kin-foundation-debuts-solana-based-on-ramp-tool-for-app-developers\" data-v-f87c67ca=\"\">Kin Foundation<\/a>, the organization behind the protocol Kin, has concluded a vote that will see a vast percentage of total KIN supply burned.&nbsp;","The vote concluded on July 27 at 10 a.m. ET after a three week voting period. Ted Livingston, founder of the messaging platform Kik, <a href=\"https:\/\/www.reddit.com\/r\/kin\/comments\/14s5g5u\/21_days_to_vote_proposal_to_burn_496t_kin\/\" data-v-f87c67ca=\"\">proposed<\/a> to fully decentralize the Kin protocol on July 6.&nbsp;","Two parties hold vast swathes of the cryptocurrency that has a total <a href=\"https:\/\/coinmarketcap.com\/currencies\/kin\/\" data-v-f87c67ca=\"\">supply<\/a> of 10 trillion. After the vote, Kin Foundation will burn 4.96 trillion of its KIN reserves, and Kik will burn another 2.1 trillion afterward.","The total 7.06 trillion tokens to burned makes up almost 71% of the total supply.","\"This would make Kin the only meaningful cryptocurrency on Solana that is fully decentralized, with no inflation, no foundation, and no website. This could be a new and exciting era for Kin,\" Livingston wrote in the proposal.&nbsp;","The KIN token traded at $0.00001829 at 10 a.m. ET Thursday. In the three weeks leading up to the burn vote deadline, the coin saw a notable increase with the peak price of $0.000029 on July 23.&nbsp;","<span data-v-f87c67ca=\"\">$KIN price activity in the month leading up to the burn deadline on July 27 at 10 a.m. ET. Photo: CoinMarketCap<\/span>","Kin has a fully diluted market capitalization of $175.5 million, according to the crypto price tracker CoinMarketCap.","Ted Livingston saw the burn of trillions of KIN tokens as necessary for the future of the protocol, explaining his reasoning in the July 6 proposal.&nbsp;","\"My proposal is for Kin to go all in on decentralization by burning the Kin Reserves, putting the Kin Foundation on a path to being shut down,\" Livingstone wrote. \"This would not only make Kin one of the fastest cryptocurrencies for developers to build with, but also one of the safest from a regulatory perspective.\"&nbsp;","The Kin Foundation enacted a test burn of <a href=\"https:\/\/www.reddit.com\/r\/kin\/comments\/13qi5k0\/7_days_to_vote_proposal_to_allocate_1b_kin_to_a\/?utm_source=share&amp;utm_medium=web2x&amp;context=3\" data-v-f87c67ca=\"\">1 billion<\/a> KIN in May.&nbsp;","\"The community voting to approve such a significant burn of the supply is a huge milestone for the Kin cryptocurrency and significantly improves its attributes,\" a Kin community member who goes by KinShips told The Block.","\"The burn eliminates all inflation of the supply,\" they said. \"There will never be more Kin that enters circulation. It also further decentralizes the cryptocurrency by removing the supply which was allocated to the Kin Foundation during the initial distribution. Now that the burn has been approved, the Kin Foundation can be closed and Kin will become truly decentralized — with no centralized entity (given an initial allocation) driving the value of the currency.\"","(<em data-v-f87c67ca=\"\">Updates with comment from Kin community member.<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kin","content":"PERSON"},{"type":"KinShips","content":"ORGANIZATION"},{"type":"July 6","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"July 23","content":"DATE"},{"type":"1 billion","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10 a.m.","content":"TIME"},{"type":"Livingstone","content":"PERSON"},{"type":"Kik","content":"ORGANIZATION"},{"type":"71%","content":"PERCENT"},{"type":"10 a.m. ET","content":"TIME"},{"type":"Kin Foundation","content":"ORGANIZATION"},{"type":"$0.00001829","content":"MONEY"},{"type":"$0.000029","content":"MONEY"},{"type":"$KIN","content":"MONEY"},{"type":"$175.5 million","content":"MONEY"},{"type":"July 27","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Ted Livingston","content":"PERSON"},{"type":"Livingston","content":"PERSON"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}