{"summary":"Ousted Bitmain co-founder Micree Zhan has reportedly taken over the company’s factory in Shenzhen and demanded the latter to stop shipping miners to customers. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/68011\/bitmain-shenzhen-shipments-suspended","publishDate":"2020-06-11T12:49:07","id":671,"type":null,"title":"Ousted Bitmain co-founder reportedly takes control of company factory in Shenzhen, suspends shipments","category":["MINING"],"content":["<span data-v-f87c67ca=\"\">Ousted Bitmain co-founder Micree Zhan has taken over the company's factory in Shenzhen and demanded manufacturers to stop shipping miners to customers, according to reports.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to <a href=\"https:\/\/mp.weixin.qq.com\/s\/XIdkgVoivwfcdnqX5_QXxw\" data-v-f87c67ca=\"\">Wushuo Blockchain<\/a>, a local media outlet founded by a former Bitmain employee, Bitmain's supplier team in Shenzhen has joined Zhan's side of the battle as Zhan continues to fight for control over the company with Bitmain's other cofounder Jihan Wu. <a href=\"https:\/\/www.theblockbeats.com\/news\/16977\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">BlockBeats<\/a>, another Chinese outlet, also reported the news.<\/span>","<span data-v-f87c67ca=\"\">Zhan has reportedly intercepted the mining equipment that Bitmain customers have already paid for and is selling it to miners close to him. Meanwhile, the report claims, Zhan is unable to access Bitmain's IT and finance departments in Beijing and is asking customers to send money before equipment can be shipped.<\/span>","The developments represent the latest twist in a long-running power struggle between the co-founders of the bitcoin mining hardware giant.","<span data-v-f87c67ca=\"\">In October 2019, Wu abruptly took over Zhan's position as Bitmain's CEO and legal representative. Zhan has been working to reclaim influence ever since. In April, a local justice bureau in Beijing <a href=\"https:\/\/www.theblockcrypto.com\/post\/63443\/local-government-sides-with-bitmain-co-founder-micree-zhan-in-a-dispute-over-his-former-position\" data-v-f87c67ca=\"\">sided<\/a> with Zhan and reversed a previous decision that approved Bitmain's move to dismiss him.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As Wushuo Blockchain reported, Zhan recently sent out a letter to Bitmain's employees and shareholders, saying that he had regained control over Bitmain's office in China. On Wednesday, his new human resources team reportedly removed a number of employees including Bitmain's CFO, director of mining farm, and director of sales. In the meantime, Wu has issued a letter stating that Zhan has no legal rights to dismiss or hire any Bitmain personnel.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitmain","content":"ORGANIZATION"},{"type":"Beijing","content":"LOCATION"},{"type":"Micree Zhan","content":"PERSON"},{"type":"October 2019","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Shenzhen","content":"LOCATION"},{"type":"Bitmain","content":"LOCATION"},{"type":"Bitmain","content":"PERSON"},{"type":"Wushuo Blockchain","content":"PERSON"},{"type":"Jihan Wu","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"April","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}