{"summary":"Several creditors say they were told the promissory note was listed as a current asset in documents provided to them by Genesis and seen by The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203913\/genesis-creditors-back-winklevoss-promissory-note-claim-as-possible-bankruptcy-looms","publishDate":"2023-01-19T19:02:45","id":6710,"type":null,"title":"Genesis creditors back Winklevoss promissory note claim as possible bankruptcy looms","category":["COMPANIES"],"content":["Genesis Global Capital labeled a $1.1 billion promissory note from parent Digital Currency Group as a current asset in conversations with creditors, bolstering the appearance of a stronger balance sheet, five sources told The Block.<br data-v-f87c67ca=\"\">\n<b data-stringify-type=\"bold\" data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/b>That's&nbsp;according to several sources and creditors who spoke to The Block and provided documents to back up their claims. The creditors and documents confirm a claim made last week by Gemini's Cameron Winklevoss in his most recent salvo against DCG and its&nbsp;founder and CEO Barry Silbert. Winklevoss and the other creditors all insist they were misled about the financial health of Genesis.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nGenesis did not respond to requests for comment.","Promissory notes are generally considered liabilities on balance sheets. Listing the note under assets, as is claimed by the creditors, provides the appearance of a stronger balance sheet.&nbsp;","The creditors' comments come as Genesis is currently in talks with an ad hoc creditors committee for a prepackaged bankruptcy filing, The Block <a href=\"https:\/\/www.theblock.co\/post\/203310\/genesis-creditors-negotiating-prepackaged-bankruptcy-sources\" data-v-f87c67ca=\"\">previously reported<\/a>.","Documents seen by The Block from October and November show that Genesis's accounts listed over $1.7 billion under the Current Assets column in \"other assets.\" This figure is slightly below the $2 billion from July, <a href=\"https:\/\/assets.ctfassets.net\/jg6lo9a2ukvr\/6todobZudOq64PJ07nWKHq\/ab23fc3ed8750bc14ac656a9e16a2d2e\/2023-01-10_-_Gemini_-_Answer.pdf\" data-v-f87c67ca=\"\">seen<\/a> in Gemini's recent filing, but in line with the firm's claims.","Winklevoss <a href=\"https:\/\/www.theblock.co\/post\/200442\/gemini-ceo-winklevoss-escalates-dcg-spat-demands-removal-of-silbert\" data-v-f87c67ca=\"\">demanded<\/a> the removal of DCG CEO Barry Silbert on Jan. 10, alleging accounting fraud had taken place, saying a document titled \"Gemini Risk Metric Request\" contained two \"critical misrepresentations.\"","The representations noted the DCG promissory note was characterized as a \"current asset.\" Winklevoss' assertion is that under Generally Accepted Accounting Principals (GAAP), current assets refer to cash, cash equivalents, or other assets that can be exchanged into cash within one year.&nbsp;","The letter also argued that no market would value an unsecured long-dated promissory note at face value. \"The net present value of this note would be heavily discounted (approximately 70%) to reflect its value as of today (perhaps $300 million),\" it noted.","Silbert responded with a letter stating that \"The $1.1B promissory note, which matures in 2032, represents DCG’s assumption of liabilities owing to Genesis from Three Arrows Capital in connection with their default in June 2022 ... DCG did not receive any cash, cryptocurrency, or other form of payment for the promissory note ... Importantly, the $1.1B promissory note is not callable and does not contain any other similar features of a callable bond. Additionally, Genesis assigned to DCG its claims against Three Arrows Capital and as part of the transaction agreed that any recovery received by DCG in respect of the Three Arrows Capital liquidation will go directly to paying down the $1.1B promissory note.\"","He did not directly address the consideration of the note as an asset or a liability to Genesis.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2022","content":"DATE"},{"type":"DCG","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"2032","content":"DATE"},{"type":"$1.1","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"Jan. 10","content":"DATE"},{"type":"Silbert","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Barry Silbert","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Three Arrows Capital","content":"ORGANIZATION"},{"type":"Cameron Winklevoss","content":"PERSON"},{"type":"$300 million","content":"MONEY"},{"type":"$1.1 billion","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"$1.7 billion","content":"MONEY"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["CAMERON &AMP; TYLER WINKELVOSS","CRYPTO BANKS AND LENDERS"],"authors":["Adam Morgan McCarthy","RT Watson","Frank Chaparro","The Block"]}