{"summary":"Aztec Network is planning to discontinue its existing network version called Connect and focusing on building its next version privacy blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219253\/aztec-to-sunset-private-zk-rollup-connect-and-focus-on-next-gen-layer-2-chain","publishDate":"2023-03-13T09:08:51","id":6712,"type":null,"title":"Aztec to sunset private ZK-Rollup Connect and focus on next-gen Layer 2 chain","category":["CRYPTO ECOSYSTEMS"],"content":["Layer 2 privacy project Aztec Network will sunset its existing version of its ZK-Rollup network called Connect to focus on a third iteration of its core technology.","Aztec's first attempt to build a privacy network was called Aztec 1 and its second attempt was <a href=\"https:\/\/www.theblock.co\/post\/151085\/aztec-updates-its-layer-2-network-to-introduce-privacy-focused-defi-on-ethereum\" data-v-f87c67ca=\"\">Connect<\/a>. Now that Connect is being depreciated, Aztec will focus on building a general-purpose smart contract blockchain for privacy apps with its own programming language called Noir, the team said in a <a href=\"https:\/\/medium.com\/aztec-protocol\/sunsetting-aztec-connect-a786edce5cae\" data-v-f87c67ca=\"\">blog post<\/a>.","\"Our mid- and long-term focus will be solely directed towards the development of two major products, which are mutually compatible and interlinked: Noir, the universal language of zero knowledge, and our next-generation encrypted blockchain,\" the team said.","Aztec also noted that Connect remains open-sourced and encouraged the community to fork it and deploy it independently if they wish. As part of the discontinuation of Connect, Aztec said deposits into the Aztec Connect bridge contract will be disabled from March 21, 2023. However, users will still be able to withdraw their assets for up to a year.","Withdrawals will be available until Connect's sequencer stops publishing Rollup blocks from March 21, 2024. A sequencer is a component on Aztec that helps to order and bundle transactions before they are submitted to the Ethereum blockchain.","\"While withdrawals will always be possible, they will become significantly more burdensome after March 21, 2024,\" Aztec stated. The company expects to completely stop maintaining the Connect contract and sequencer after one year.","Aztec is a zero-knowledge proof project that focuses on achieving application privacy. This is different from other solutions in the Layer 2 and zero-knowledge areas that are focused on scaling instead.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aztec Network","content":"ORGANIZATION"},{"type":"Aztec","content":"ORGANIZATION"},{"type":"March 21, 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"March 21, 2024","content":"DATE"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}