{"summary":"Two of the largest staking companies won’t be supporting the new blockchain due to the way it was pushed through.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/149094\/two-big-staking-companies-wont-support-terras-new-blockchain","publishDate":"2022-05-27T06:35:12","id":6714,"type":null,"title":"Two big staking companies won’t support Terra’s new blockchain","category":["GOVERNANCE"],"content":["Two of the largest staking companies will not be supporting the new Terra blockchain, citing concerns over the way the decision-making process was handled.","The two are Figment, which had <a href=\"https:\/\/www.theblockcrypto.com\/news+\/135010\/crypto-staking-firms-are-racing-to-get-liquid-staking-to-institutions\" data-v-f87c67ca=\"\">$6 billion<\/a> in assets under management in February —&nbsp;likely much lower now — and Chorus One, which currently looks after <a href=\"https:\/\/chorus.one\/\" data-v-f87c67ca=\"\">$1 billion<\/a> in assets.","Chorus One said it will not be supporting the new Terra blockchain because it did “not follow a legitimate governance process.” The first reason it offered was that staking was frozen on the network at the time of the vote and voting powers had shifted. The second reason was that the main proposal to relaunch the blockchain had been amended during the vote.","As a result, Chorus One abstained from voting, has wound down its existing infrastructure and said that it will not be supporting the new Terra blockchain, according to a <a href=\"https:\/\/twitter.com\/ChorusOne\/status\/1528782897028771842\" data-v-f87c67ca=\"\">post<\/a> on Twitter.","Similarly, Figment said that it also will not be supporting the new blockchain. “We do not plan to support Terra 2.0 at launch and will make a decision to support Terra 2.0 at a later date, should we evaluate it as a new opportunity,” it <a href=\"https:\/\/twitter.com\/Figment_io\/status\/1529566363605356544\" data-v-f87c67ca=\"\">said<\/a> on Twitter.","Figment voted \"no with veto\" on the main proposal to relaunch the Terra blockchain. In a <a href=\"https:\/\/www.figment.io\/resources\/shutting-down-our-terra-validator-operations?utm_source=twitter&amp;utm_medium=share&amp;utm_term=&amp;utm_content=&amp;utm_campaign=protocol-content\" data-v-f87c67ca=\"\">blog post<\/a>, it said, “The proposal has been unilaterally modified multiple times while the voting period was active, leading to a lack of confidence in the integrity of the vote itself.”","Figment said it did not see launching a new chain this quickly as a solution. It added that Terraform Labs may still end up having influence over the new blockchain and that the company may face a range of lawsuits in the near future.&nbsp;","“These lawsuits could also pose unforeseen risk to infrastructure providers (such as Figment) in the future,” it said.","Terra’s new blockchain is being launched as a result of the collapse of the current chain. Its stablecoin TerraUSD (UST) lost its peg to the US dollar, leading to a death spiral for the blockchain’s native token Luna (LUNA).","Following its collapse, Terra’s governance saw a speedy turnaround as Terraform Labs CEO Do Kwon proposed a new blockchain and put it to a vote. As The Block reported, the <a href=\"https:\/\/www.theblockcrypto.com\/post\/147976\/do-kwon-amends-terra-2-0-proposal-during-the-vote-on-it\" data-v-f87c67ca=\"\">proposal was modified<\/a> during the course of the vote, leading to the concerns about its integrity.","Despite this —&nbsp;and a variety of <a href=\"https:\/\/www.theblockcrypto.com\/post\/147289\/terra-community-seems-dead-set-against-do-kwons-fork-proposal\" data-v-f87c67ca=\"\">community<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/post\/147803\/terra-validator-hits-out-at-do-kwons-dictatorship-model-on-key-fork-vote\" data-v-f87c67ca=\"\">validator<\/a> concerns —&nbsp;the proposal passed and the new blockchain is set to go live on May 28, having been pushed back a day.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$6 billion","content":"MONEY"},{"type":"May 28","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"Figment","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Terra","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Terraform Labs","content":"ORGANIZATION"},{"type":"Terra blockchain","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"}],"hashtag":["DO KWON","STAKING"],"authors":["Tim Copeland","The Block"]}