{"summary":"The move away from proof-of-work towards proof-of-stake sees miners compete on other chains, driving block difficulty and reducing profits.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170614\/gpu-miners-left-searching-for-profit-post-merge","publishDate":"2022-09-15T19:55:32","id":6715,"type":null,"title":"GPU miners left searching for profit post Merge","category":["MINING"],"content":["<span data-v-f87c67ca=\"\">It is estimated as many as 20% to 30% of miners have shut down operations altogether.<\/span>","Miners searching for new blockchains in the wake of Ethereum’s Merge are struggling as intense competition for blocks reduces profitability.","With Ethereum’s move away from proof-of-work based GPU mining to a proof-of-stake based consensus mechanism, many of the miner operators who formerly supported the world’s second-largest blockchain network are moving to other PoW networks like ETC and RVN.","But with the eager embrace of new miners to these networks comes a rise in block difficulty that, at current market conditions and energy costs, is making it difficult for GPU miners to turn a profit, according to Ben Gagnon, chief mining officer at bitcoin miner Bitfarms (BITF).","“GPU #mining is dead less than 24 hours after the #merge,” Gagnon <a href=\"https:\/\/twitter.com\/hashoveride\/status\/1570421233786945536\" data-v-f87c67ca=\"\">tweeted<\/a>, adding that three of the largest chains that utilize the mining method offer negligible profits and that “the only coins showing profit have no marketcap or liquidity.”","As the hash difficulty of networks like ETC and RVN continues to rise, profit among competing miners has driven down potential rewards. On ETC block rewards fell from a 24 hour average of around 58 cents to just over 1 cent, while rewards for blocks on RVN fell from a 24 hour average of $1.77 to just over 4 cents in more recent hours according to <a href=\"https:\/\/minerstat.com\/coin\/ETC\" data-v-f87c67ca=\"\">Minerstat<\/a> data.","“Even running new generation hardware at sub 3 cent power is not profitable on ETC now,” <a href=\"https:\/\/twitter.com\/ethan_vera\/status\/1570405590450552832\" data-v-f87c67ca=\"\">tweeted<\/a> Ethan Vera, COO of Luxor, which runs an Ethereum mining pool.","Without a profitable network to mine, as many as 20% to 30% of miners have simply shut down operations according to Vera.","Vera had previously <a href=\"https:\/\/www.theblock.co\/post\/168380\/whats-left-for-ethereum-gpu-miners-after-the-merge\" data-v-f87c67ca=\"\">estimated<\/a> that only miners contributing around 100 terahash per second to the Ethereum network would find a home on other blockchains, citing a need for state-of-the-art hardware and low electricity prices to remain competitive.","Now, it would appear that even the latest hardware rigs and cut-rate energy costs may not be enough to turn a profit on networks like ETC, where as much as a 280% <a href=\"https:\/\/www.theblock.co\/post\/170293\/ethereum-classics-hash-rate-soars-280-in-a-single-day\" data-v-f87c67ca=\"\">rise<\/a> in hash rates occurred over the last 24 hours.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"RVN","content":"ORGANIZATION"},{"type":"Ben Gagnon","content":"PERSON"},{"type":"4 cents","content":"MONEY"},{"type":"Ethan Vera","content":"PERSON"},{"type":"Gagnon","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"1 cent","content":"MONEY"},{"type":"bitcoin miner Bitfarms (BITF","content":"ORGANIZATION"},{"type":"GPU","content":"ORGANIZATION"},{"type":"3 cent","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"58 cents","content":"MONEY"},{"type":"ETC","content":"ORGANIZATION"},{"type":"280%","content":"PERCENT"},{"type":"$1.77","content":"MONEY"},{"type":"Luxor","content":"LOCATION"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}