{"summary":"The lawsuit alleges that Musk&#x27;s consistent messaging that he was a fan of the cryptocurrency led directly to its price spike, and when market conditions changed, investors lost out.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152951\/musk-tweets-that-he-will-keep-supporting-dogecoin-in-spite-of-lawsuit","publishDate":"2022-06-19T06:02:28","id":6716,"type":null,"title":"Musk tweets that he will keep supporting Dogecoin, in spite of lawsuit","category":["PEOPLE"],"content":["Elon Musk tweeted his support today for Dogecoin, in spite of a <a href=\"https:\/\/www.theblock.co\/post\/152538\/tesla-ceo-elon-musk-accused-of-dogecoin-ponzi-scheme-in-new-class-action-lawsuit\" data-v-f87c67ca=\"\">class action lawsuit<\/a> filed against him on Thursday claiming his actions involving the meme-themed cryptocurrency constituted a Ponzi scheme.","<a href=\"https:\/\/twitter.com\/elonmusk\/status\/1538406040374595585\" data-v-f87c67ca=\"\">Musk tweeted<\/a>: “I will keep supporting Dogecoin” early today in an exchange with another user, who urged him to keep buying it. “I am,” Musk tweeted in reply.","Keith Johnson, a US citizen, lodged the suit against Musk and his businesses Tesla and SpaceX in the Southern District of New York on behalf of himself and those similarly situated, claiming Musk and his business's activities around Doge defrauded him and other investors.","The complaint alleged that Musk's consistent messaging that he was a fan of the cryptocurrency led directly to its price spike, and when market conditions changed, investors lost out.","<span data-v-75116db2=\"\" data-v-f87c67ca=\"\">Musk has a long history <a href=\"https:\/\/www.theblockcrypto.com\/linked\/93723\/elon-musk-removes-bitcoin-twitter-bio-dogecoin\" data-v-f87c67ca=\"\">promoting<\/a> Dogecoin and the complaint highlights the greatest hits of Musk's Doge tweets since a satirical article piqued his interest about the meme coin in 2019. The complaint points out that Dogecoin grew in value after Musk's tweets about it in 2019.<br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"SpaceX","content":"ORGANIZATION"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"Musk","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Keith Johnson","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Dogecoin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Tesla","content":"PERSON"},{"type":"2019","content":"DATE"}],"hashtag":["ELON MUSK"],"authors":["Mike Millard","The Block"]}