{"summary":"Research papers from the Federal Reserve focused on decentralized finance and financial stability.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167673\/fed-research-papers-warn-about-future-risks-from-crypto-cefi-and-defi","publishDate":"2022-09-03T18:38:56","id":6717,"type":null,"title":"Fed research papers warn about future risks from crypto CeFi and DeFi","category":["DEFI"],"content":["The US Federal Reserve's research arm published a pair of papers last week exploring decentralized finance and the ramifications of digital assets for financial stability.","The Fed and its leadership have <a href=\"https:\/\/www.theblock.co\/post\/156567\/federal-reserves-brainard-urges-crypto-regulation-before-industry-becomes-more-entangled-with-the-financial-system\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">pushed for more oversight<\/a> of the crypto industry, particularly in the context of its links to the broader financial sector. Its paper on financial stability touched on regulation, with the authors suggesting stricter oversight for firms handling client funds.","\"Oversight, comprehensive disclosures, and capital and liquidity requirements, where appropriate, could improve the resilience of entities within the digital asset ecosystem,\" the paper said. \"For example, centralized cryptoentities that act as counterparties to retail users in the digital asset ecosystem are generally not subject to capital, liquidity, or comprehensive disclosure requirements.\"","The stability paper concluded that the crypto ecosystem is \"prone to the buildup of financial vulnerabilities,\" but later added that \"financial stability risks are not extensive because the digital asset ecosystem does not provide significant financial services and its interconnections with the traditional financial system are limited.\"","Still, such risks could grow in the future, the authors noted.","\"Should the digital financial system become more interconnected with the traditional system or expand its provision of financial services, financial stability risks could quickly become material,\" they wrote.","The paper \"Decentralized Finance (DeFi): Transformative Potential &amp; Associated Risks\" provides a broad overview of the DeFi ecosystem. It makes note of the crypto sector's significant growth while highlighting its potential for long-term stability risks.&nbsp;","\"The provision of financial services on public, permissionless blockchains has come a long way since the creation of bitcoin, but DeFi has not yet reached the point of becoming systemically important,\" the authors wrote. \"Nevertheless, the rapid growth in the role of such blockchains suggests that policymakers should start giving serious consideration to a full range of financial stability issues that could arise should such activities become systemically important.\"","The authors conclude:","\"As policymakers decide on which assets (for example, dollars and registered securities) to allow on public permissionless blockchains, evidence indicates that DeFi will rapidly exploit any and all profitable opportunities regardless of supervisory concerns. In addition, under the scenario in which public blockchains evolve to provide a full range of services denominated in cryptocurrencies, supervisory authorities (including the Federal Reserve) may lack the necessary tools to ensure compliance with laws and regulations. Policies considered well in advance and thoughtfully may reduce the scope of the inevitable financial stability disruptions stemming from DeFi.\"","The publication of <a href=\"https:\/\/www.federalreserve.gov\/econres\/feds\/the-financial-stability-implications-of-digital-assets.htm\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">both<\/a> <a href=\"https:\/\/www.federalreserve.gov\/econres\/feds\/decentralized-finance-defi-transformative-potential-and-associated-risks.htm\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">papers<\/a> builds on the body of research that the Fed's research team has made public to date. Past topics include the potential risks and rewards of wider <a href=\"https:\/\/www.theblock.co\/post\/132542\/fed-releases-new-research-on-risk-and-promise-of-stablecoins\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">stablecoin<\/a> usage and <a href=\"https:\/\/www.theblock.co\/linked\/148288\/fed-report-shows-crypto-is-favored-as-an-investment-tool\" data-v-f87c67ca=\"\">US residents'<\/a> cryptocurrency habits.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"US Federal Reserve","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Decentralized Finance","content":"ORGANIZATION"},{"type":"Transformative Potential &amp; Associated Risks\"","content":"ORGANIZATION"}],"hashtag":["FEDERAL RESERVE"],"authors":["Michael McSweeney","The Block"]}