{"summary":"The Nil Foundation is developing a ZK-Rollup, an Ethereum Layer 2 with sharding technology to scale dapps.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261957\/nil-foundation-introduces-ethereum-zk-rollup-with-sharding-support","publishDate":"2023-11-07T10:00:03","id":6719,"type":null,"title":"Nil Foundation introduces Ethereum ZK-Rollup with sharding support","category":["CRYPTO ECOSYSTEMS"],"content":["Blockchain cryptography firm <a href=\"https:\/\/www.theblock.co\/post\/251178\/nil-foundation-taceo-ethereum\" data-v-f87c67ca=\"\">Nil Foundation<\/a> is planning to introduce a ZK-Rollup, a type of Layer 2 network on Ethereum featuring sharding technology. The Layer 2 solution will function as a zkEVM — a type of ZK-Rollup that can run existing Ethereum decentralized applications.","The Nil Foundation states that its objective with the ZK-Rollup is to provide an alternative approach to scaling by integrating multiple shards into a unified Layer 2 execution environment. This approach combines modular and monolithic architectures to support data-intensive decentralized applications (dapps). The network is in an early development phase, and the Nil is working on a public testnet, which it expects to be available in the next 3-6 months.","“We’re excited to finally announce zkSharding for Ethereum availability for the wider community of developers on top of Ethereum, making it suitable for running high-load and data-intensive applications like decentralized sequencers, programmable data availability solutions, exchanges, autonomous worlds, and so on,” said Misha Komarov, CEO and co-founder of Nil Foundation.","Sharding has been an integral part of Ethereum’s <a href=\"https:\/\/www.theblock.co\/post\/170072\/beyond-the-merge-a-look-at-ethereums-plans-for-scaling-in-the-future\" data-v-f87c67ca=\"\">roadmap<\/a> strategy for enabling parallel transaction processing and validation, which aims to reduce costs and increase transaction speed.","According to the Nil Foundation, the deployment of zkSharding merges various architectural principles. The architecture consists of a main shard, where zero-knowledge proofs authenticate transactions as part of the Layer 2 design, and sub-shards that serve to increase transaction capacity.","While Nil is typically recognized for its proof marketplace, which facilitates the exchange of cryptographic proofs, its introduction of its own ZK-Rollup indicates its entry into a competitive space that features projects like <a href=\"https:\/\/www.theblock.co\/post\/222950\/polygon-labs-unveils-zkevm-layer-2-scaling-solution\" data-v-f87c67ca=\"\">Polygon zkEVM<\/a>, zkSync, and Scroll. In January 2023, Nil Foundation <a href=\"https:\/\/www.theblock.co\/post\/203411\/zk-tech-developer-nil-foundation-raises-22-million-at-a-220-million-valuation\" data-v-f87c67ca=\"\">raised $22 million<\/a> in a funding round led by Polychain Capital.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$22 million","content":"MONEY"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nil Foundation","content":"ORGANIZATION"},{"type":"January 2023","content":"DATE"},{"type":"Ethereum","content":"LOCATION"},{"type":"Misha Komarov","content":"PERSON"}],"hashtag":["DEVELOPER TOOLS","ZKEVM"],"authors":["Vishal Chawla","The Block"]}