{"summary":"Initiatives include “Governance Passports,” allowing citizens to actively participate in law-making and policy decisions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266710\/the-other-party-uk-blockchain-powered-democracy","publishDate":"2023-12-08T06:48:21","id":6721,"type":null,"title":"The Other Party is hoping to bring blockchain-powered democracy to the UK","category":["INTERNATIONAL POLICYMAKING"],"content":["The Other Party launched in the UK today, promising to decentralized power and return it to the public through blockchain technology.","Powered by blockchain technology, The Other Party wants to disrupt traditional centralized political structures, paving the way for a more direct and transparent democratic process, according to a statement.","“Our mission is to remove the centralized power of politicians and return it to the hands of the people,” The Other Party founder Dom Ryder said. “By leveraging blockchain technology, we are ensuring every voice is heard, every vote counts and every decision is transparent and incorruptible.”","It’s unclear what traction, if any, The Other Party will have in the UK’s political landscape, but it is notable that blockchain technology is becoming an increasingly important part of the political conversation.","Among The Other Party’s initiatives are “governance passports,” issued to UK voters as an NFT. The passports act as a digital identity on blockchain to ensure votes are “immutable, traceable and protected from tampering or undue influence,” it said.","The idea is that eligibility can be verified while maintaining voters' anonymity in participating in political decision-making, empowering every passport holder to propose, vote on and directly implement policies.","Straying from conventional left-right politics, The Other Party said it positions itself as a neutral facilitator of the people's will, adding any elected representatives of the party would be legally obligated to follow decisions made by their constituents rather than a party line.","“This isn't just about politics; it's about empowering every individual to actively shape our society. The Other Party is a movement for those who believe in a future where democracy is truly by the people, for the people,” Ryder added.","The Other Party has also introduced a POD (Proof Of Donation) memorabilia token, which is supposed to act as a “digital sticker,” <a href=\"https:\/\/www.otherparty.co.uk\/pod-token-the-other-party\" data-v-f87c67ca=\"\">according<\/a> to its website. The tokens are <a href=\"https:\/\/etherscan.io\/address\/0xE90CE7764d8401d19ed3733a211bd3b06c631Bc0\" data-v-f87c67ca=\"\">issued<\/a> on the Ethereum blockchain and are available via the decentralized exchange Uniswap.","POD has a fixed supply of around 3.5 trillion, purportedly mirroring the total amount of pound sterling in <a href=\"https:\/\/tradingeconomics.com\/united-kingdom\/money-supply-m3\" data-v-f87c67ca=\"\">circulation<\/a>. The token does not have any utility or value, according to The Other Party. However, “just like stickers, leaflets, letters or other political memorabilia, we don’t want to hinder our donors from attempting to transact in their proof of donation token if there is a secondary market and they do become collectible or desirable as memorabilia,” its website reads.","The Other Party’s website also provides a <a href=\"https:\/\/www.electoralcommission.org.uk\/who-we-are-and-what-we-do\/political-party-registration\/party-registration-decisions\" data-v-f87c67ca=\"\">link<\/a> to view its party registration on the UK electoral regulator The Electoral Commission’s website. However, its registration details are not yet visible on the site at the time of publication and its initial application appears to have been rejected on Nov. 28. Current applications were last updated on Dec. 7. The Other Party did not respond to a request for comment from The Block on the current status of its registration.","The Other Party is not alone in being keen on leveraging blockchain technology in the country. In June, UK Prime Minister Rishi Sunak expressed a desire to provide regulatory clarity regarding how crypto businesses should register and operate in the UK, <a href=\"https:\/\/www.theblock.co\/post\/234095\/a16z-uk-expansion\" data-v-f87c67ca=\"\">announcing<\/a> plans to turn the country into a web3 hub.","Last month, UK Finance Minister Jeremy Hunt also <a href=\"https:\/\/www.theblock.co\/post\/264389\/uk-finance-minister-announces-legislation-to-boost-the-nations-digital-asset-sector\" data-v-f87c67ca=\"\">outlined<\/a> legislation to expand the country’s digital assets sector via its Digital Securities Sandbox initiative — which aims to facilitate the adoption of digital assets across financial markets — expected to begin in Q1, 2024.","The UK’s stance contrasts somewhat with the crypto environment in the U.S., with Coinbase CEO Brian Armstrong stating in June that the U.S. regulatory environment was “hurting America’s economic competitiveness,” responding to the Security and Exchange Commission’s <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">lawsuit<\/a> against the crypto exchange for alleged securities violations.","This week, JPMorgan CEO Jamie Dimon told Sen. Elizabeth Warren that the government should <a href=\"https:\/\/www.theblock.co\/post\/266392\/jpmorgan-ceo-jamie-dimon-tells-sen-elizabeth-warren-that-government-should-shut-down-crypto\" data-v-f87c67ca=\"\">shut down crypto<\/a>, noting that it can bypass government controls.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nov. 28","content":"DATE"},{"type":"Jeremy Hunt","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Security and Exchange Commission","content":"ORGANIZATION"},{"type":"America","content":"LOCATION"},{"type":"Jamie Dimon","content":"PERSON"},{"type":"Other Party","content":"ORGANIZATION"},{"type":"Dom Ryder","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Dec. 7","content":"DATE"},{"type":"June","content":"DATE"},{"type":"UK Finance","content":"ORGANIZATION"},{"type":"Digital Securities Sandbox","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Rishi Sunak","content":"PERSON"},{"type":"The Electoral Commission","content":"ORGANIZATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"The Other Party","content":"ORGANIZATION"}],"hashtag":["UK PARLIAMENT"],"authors":["James Hunt","The Block"]}