{"summary":"After months of negotiation, the company that owns Blockbuster decided not to sell it to an organization that sought to create BlockbusterDAO.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154964\/dao-that-hopes-to-buy-blockbuster-meets-resistance-from-current-owners","publishDate":"2022-06-29T21:27:47","id":6725,"type":null,"title":"DAO that hopes to buy Blockbuster meets resistance from current owners","category":["THE BLOCK"],"content":["Hopes that former movie rental company Blockbuster would reemerge in the web3 space under the control of a decentralized autonomous organization (DAO) seem to have been extinguished — at least for now.","The organization behind the project, R3WIND, <a href=\"https:\/\/rewind.mirror.xyz\/pMqYQL1le9h8U-lvPDtMRgPc1yBvVI72db4HnDT1K8I\" data-v-f87c67ca=\"\">wrote in a post titled \"Blockbust\"<\/a> on Wednesday that the company that currently owns the now-defunct business, Dish Network, refused to sell it.","R3WIND said that it held thirteen meetings with Dish executives between January and May 2022, before the deal fell through.","Back in December of last year, R3WIND said that it<a href=\"https:\/\/www.theblock.co\/linked\/128564\/a-dao-wants-to-buy-blockbuster-and-turn-it-into-a-decentralized-film-streaming-service\" data-v-f87c67ca=\"\"> intended to raise $5 million to buy Blockbuster<\/a> via the sale of BlockbusterDAO NFTs. According to the post on Wednesday, Dish had bought the Blockbuster brand in 2011 for $320 million.","\"They believed it was still worth more than any community like ours would be able to raise,\" it read. \"Our position, to the contrary, was that its value had depreciated considerably since its bankruptcy.\"","R3WIND said that the project had received \"swift and enthusiastic\" support from the community but that it had decided to make sure they could \"deliver on the promise to buy Blockbuster\" before dropping an NFT collection.","According to the post, Dish did not want Blockbuster to be controlled by a DAO. R3WIND then came up with a proposal that would give the DAO 65% ownership of Blockbuster initially. The idea was to create a limited-liability corporation that would progressively become decentralized. R3WIND made a product presentation on May 10, but ultimately the company opted out weeks later.","\"In their exact words, they wanted to be 'in the driver's seat' and 'did not want to license the brand to a DAO,'\" the post read.","R3WIND said it still wants to see the project through, stating that its ambition is \"greater than ever.\" The organization's vision is to have a \"content ecosystem that gives creators more control over their art and their businesses.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$320 million","content":"MONEY"},{"type":"May 2022","content":"DATE"},{"type":"December of last year","content":"DATE"},{"type":"2011","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Dish Network","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"May 10","content":"DATE"},{"type":"$5 million","content":"MONEY"}],"hashtag":["DAOS"],"authors":["Catarina Moura","The Block"]}