{"summary":"The Michigan Consumer Sentiment Index (MSCI), a monthly telephone survey that looks to capture the overall sentiment of the U.S. consumer, registered the","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/60227\/u-s-consumer-sentiment-in-march-saw-the-4th-largest-monthly-drop-in-nearly-a-half-century","publishDate":"2020-03-29T18:26:45","id":6727,"type":null,"title":"U.S. consumer sentiment in March saw the 4th largest monthly drop in nearly a half century","category":["MACRO"],"content":["The Michigan Consumer Sentiment Index (MSCI), a monthly telephone survey that looks to capture the overall sentiment of the U.S. consumer, registered the 4th largest monthly decline in nearly 50 years. The index is often used by investors as a measure of near-term consumer spending expectations. According to the <a href=\"https:\/\/apps.bea.gov\/iTable\/iTable.cfm?reqid=19&amp;step=2#reqid=19&amp;step=2&amp;isuri=1&amp;1921=survey\" data-v-f87c67ca=\"\">Bureau of Economic Analysis<\/a>, consumer spending made up ~70% of U.S. GDP in 2019.","","","&nbsp;","The consumer sentiment index <a href=\"http:\/\/www.sca.isr.umich.edu\" data-v-f87c67ca=\"\">fell more 11.9 points<\/a> in March, only bested by a 12.7 decline in response to the Great Recession in October 2008, and a pair of 12.2 point declines surrounding Hurricane Katrina and in response to a 1980 recession that saw close to 11% unemployment at its height.","While the index currently sits at 89.1, still above 50-year and post-Great Recession averages, the index is expected to see further declines in the coming months.","In the University of Michigan Surveys of Consumers <a href=\"http:\/\/www.sca.isr.umich.edu\" data-v-f87c67ca=\"\">March report<\/a>, chief economist, Richard Curtin, noted that if the sentiment index were to \"stabilize at its most recent seven-day average, it would imply an additional decline of nearly 18.2 index points in April.\" Indeed, if the sentiment index were to decline that much, it would clock a new record decline in a two-month span.","","","\"Stabilizing confidence at its month's end level will be difficult given surging unemployment and falling household incomes. The extent of additional declines in April will depend on the success in curtailing the spread of the virus and how quickly households receive funds to relieve their financial hardships.\"","Curtin, in an <a href=\"https:\/\/data.sca.isr.umich.edu\/fetchdoc.php?docid=64893\" data-v-f87c67ca=\"\">update last week,<\/a> wrote, \"An economic recession has already begun, and it is likely to reduce consumer spending for a period that is two to three times as long as the virus crisis.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"October 2008","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Michigan","content":"LOCATION"},{"type":"1980","content":"DATE"},{"type":"Richard Curtin","content":"PERSON"},{"type":"11%","content":"PERCENT"},{"type":"University of Michigan Surveys of Consumers <a href=\"http:\/\/www.sca.isr.umich.edu\" data-v-f87c67ca=\"\">March","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Curtin","content":"PERSON"},{"type":"Bureau of Economic Analysis","content":"ORGANIZATION"},{"type":"Great Recession","content":"ORGANIZATION"},{"type":"April","content":"DATE"}],"hashtag":[],"authors":["Ryan Todd","The Block"]}