{"summary":"The Dencun upgrade led to reduced transaction fees, likely setting the stage for increased activity on the Base network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283056\/base-dencun-transactions-users-surge","publishDate":"2024-03-18T07:08:58","id":6731,"type":null,"title":"Base sees big surge in transactions and users after Dencun upgrade","category":["LAYER 2S AND SCALING"],"content":["The daily transactions on Base, the Ethereum Layer 2 network incubated by Coinbase, has experienced significant growth over the last week — likely driven by low transaction fees following the <a href=\"https:\/\/www.theblock.co\/post\/281258\/base-to-support-eip-4844-from-day-1-following-dencun-upgrade?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">Dencun upgrade<\/a>.","This Layer 2 network witnessed a sudden spike in daily users and transactions, reaching record highs shortly after the Dencun upgrade. This led to a <a href=\"https:\/\/www.theblock.co\/post\/282417\/ethereum-layer-2s-show-dramatic-drop-in-transaction-fees-after-dencun\" data-v-f87c67ca=\"\">dramatic drop<\/a> in transaction fees on most Layer 2s, including Base.","The number of daily transactions on the Base network was about 440,000 just before Dencun. The transaction count, based on a seven-day moving average, reached a new peak of over 1.05 million transactions on March 17 — just days after the Dencun upgrade, according to The Block’s <a href=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\" data-v-f87c67ca=\"\">data dashboard<\/a>.","This surpassed the transaction volumes of other leading optimistic rollups. Arbitrum had 960,000 transactions and Optimism had 519,000 transactions on March 17.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\/transaction-count-daily-7dma\/embed\" title=\"Transaction Count on Optimistic Rollups (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","A similar trend was observed in the influx of new users on Base. The number of weekly new users on Base spiked to <a href=\"https:\/\/dune.com\/watermeloncrypto\/base\" data-v-f87c67ca=\"\">800,000<\/a> last week, marking a 600% increase from the previous week before the Dencun upgrade was implemented and a record high for the network.","The upgrade introduced a new transaction type for Layer 2s called blobs. These blobs provide a new location point for chains when posting information on Ethereum, moving away from the traditional “calldata” method, thereby offering a direct route to reducing fees.","The median gas fees on Base dropped from around $0.5 on March 13, just before Dencun was activated, to about $0.003 now — one of the lowest among various Layer 2 networks. Meanwhile, the average fee on Base is currently $0.09.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$0.5","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"1.05 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"600%","content":"PERCENT"},{"type":"March 17","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March 13","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$0.09","content":"MONEY"},{"type":"$0.003","content":"MONEY"},{"type":"Dencun","content":"PERSON"}],"hashtag":["BASE","OPTIMISM","ROLLUPS"],"authors":["Vishal Chawla","The Block"]}