{"summary":"Crypto mining machine manufacturer Bitmain is venturing into the Filecoin mining field for the first time, with each unit priced at $38,888.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240768\/bitmain-filecoin-mining-38888-price-tag","publishDate":"2023-07-20T10:10:55","id":6734,"type":null,"title":"Bitmain launches Filecoin mining machines with a $38,888 price tag","category":["COMPANIES"],"content":["Crypto mining machine manufacturer Bitmain is venturing into the Filecoin mining field for the first time, offering a new model that's priced at $38,888 per unit.","The machines come with a hash rate of 4,300T, and users can host them at the Bitmain-associated Antpool mining pool platform to begin earning rewards right after purchase, according to an <a href=\"https:\/\/twitter.com\/BITMAINtech\/status\/1682009419465527297\" data-v-f87c67ca=\"\">announcement<\/a>.","Filecoin offers a unique combination of both mining and staking to support its decentralized storage network. Storage providers contribute their computing resources for data storage and retrieval, earning mining rewards based on their storage capacity. Meanwhile, token holders can stake FIL tokens to support the network's consensus and governance, earning staking rewards.&nbsp;","In addition to the mining machines, Bitmain is introducing a delegated staking service for Filecoin at a 0.5% monthly fee, allowing users to delegate their tokens to a third party, such as Antpool.","Sales of Bitmain's Filecoin mining machines begin on July 21.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitmain","content":"ORGANIZATION"},{"type":"July 21","content":"DATE"},{"type":"$38,888","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Bitmain","content":"LOCATION"},{"type":"0.5%","content":"PERCENT"},{"type":"Bitmain","content":"PERSON"}],"hashtag":["MINING COMPANIES","STAKING FIRMS"],"authors":["James Hunt","The Block"]}