{"summary":"The plan could see Frax buying up coins in proportion to the supply of its stablecoin on their respective blockchains.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141099\/frax-finance-may-buy-large-amounts-of-major-cryptos-to-back-its-stablecoin","publishDate":"2022-04-07T11:39:51","id":6738,"type":null,"title":"Frax Finance may buy large amounts of major cryptos to back its stablecoin","category":["STABLECOINS"],"content":["Frax, an algorithmic stablecoin protocol, is mulling the idea of buying billions of dollars' worth of native tokens of major blockchains to use as reserve collateral for its stablecoin.&nbsp;","The stablecoin, called FRAX, maintains its dollar value by being partially collateralized by USDC, along with an algorithm that buys and sells FRAX with another token called Frax Shares (FXS). When the stablecoin was launched, it was collateralized fully by USDC, but as it expanded, it used the algorithmic elements to maintain its peg to the dollar.","It was always an idea that the project would consider other coins as collateral. The project’s documentation states that non-stable cryptocurrencies like ether and bitcoin could be added as collateral once the system becomes more robust. Yet only recent has this plan to establish another “stability fund” made of various crypto assets been discussed as an imminent possibility.","Frax Finance founder Sam Kazemian told The Block that such a multi-chain approach for acquiring collateral backing will incentivize the flow of FRAX-denominated transactions on these blockchains. According to Kazemian, the system will contribute to a significant corresponding demand for the native tokens of these Layer 1 chains.","“Keep in mind, this strategy means every L1 chain (including BTC\/lightning) will have an incentive to have FRAX stablecoins flowing through their economy as that creates a central bank-size market demand for their L1 token,” said Kazemian.","Frax intends to acquire the native assets of all blockchains where the stablecoin has been issued.&nbsp;While FRAX's largest presence is on Ethereum, it also trades on 12 other blockchains including Avalanche, BNB Chain, Fantom, Harmony, Polygon, and Solana, along with Ethereum scaling solution Arbitrum.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-crypto-backed-and-algorithmic-stablecoin-supply\/embed\" title=\"Total Crypto-backed and Algorithmic Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","According to Kazemian, this chain-agnostic collateral acquisition will be proportional to the demand for the FRAX stablecoin across these networks. Thus, FRAX’s balance sheet will reflect the proportion of the stablecoin’s supply in each network.","The stablecoin may set aside a portion of the seigniorage — the protocol’s revenue generated from issuing FRAX — to accumulate the assets. The details have, however, yet to be finalized and may go through a governance vote first.","Besides going multi-chain, Frax Finance will take a route different from Terra’s manual Bitcoin purchases.","Terra has been buying bitcoin either by exchanging USDT or burning excess LUNA supply in exchange for BTC. Frax will, instead, utilize its Flaxswap platform to execute these large purchase orders on-chain. Fraxswap is a decentralized exchange designed to allow the execution of large-size orders at minimal slippage. This design feature is especially useful for Frax if it goes ahead to acquire a large volume of major cryptocurrencies over a long time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fantom","content":"PERSON"},{"type":"Sam Kazemian","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Frax Finance","content":"ORGANIZATION"},{"type":"Kazemian","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","Vishal Chawla","The Block"]}