{"summary":"U.S. authorities have arrested Avraham Eisenberg, who came forward as the Mango Markets exploiter in October. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/198172\/mango-markets-exploiter-arrested-in-puerto-rico-for-alleged-market-manipulation","publishDate":"2022-12-27T18:31:48","id":6742,"type":null,"title":"Mango Markets exploiter arrested in Puerto Rico for alleged market manipulation","category":["POLICY"],"content":["Authorities are not buying that code was law in the $114 million exploit of a decentralized exchange.&nbsp;","Federal authorities have arrested Avraham Eisenberg in Puerto Rico for his exploit of decentralized exchange Mango Markets, unsealing charges against him in the U.S. District Court for the Southern District of New York.&nbsp;","Eisenberg was charged with commodities fraud and commodities manipulation, the complaint shows.","Eisenberg led a team to exploit Mango Markets in October for $114 million by, according to an <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.591629\/gov.uscourts.nysd.591629.1.0.pdf\" data-v-f87c67ca=\"\">affidavit<\/a> against him, manipulating the price of the exchange's native token, MNGO. Eisenberg bought a massive position in MNGO, inflating the price of that token by 1,300%, which allowed him to borrow other tokens with larger market caps and more stable value via the same platform with no intention of paying them back.","When MNGO's price fell again, Eisenberg's position no longer had enough value to cover the debts he had taken in those other tokens. At the time, he <a href=\"https:\/\/www.theblock.co\/post\/177424\/mango-markets-exploiter-comes-clean-claims-all-actions-were-legal\" data-v-f87c67ca=\"\">came forward<\/a> as the user behind the massive price move in MNGO, saying he was \"using the protocol as designed, even if the development team did not fully anticipate all the consequences of setting parameters the way they are.\" Subsequently, Mango users voted to let him keep <a href=\"https:\/\/www.theblock.co\/post\/177736\/mango-markets-proposes-plan-to-pay-back-victims-after-114-million-hack\" data-v-f87c67ca=\"\">$47 million of his bounty<\/a>, while he returned the other $67 million.&nbsp;","Despite that decentralized settlement, authorities are charging Eisenberg with criminal market manipulation, conflicting with the DeFi notion that code can be its own law. No word on potential criminal charges for the rest of his team.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1,300%","content":"PERCENT"},{"type":"Avraham Eisenberg","content":"PERSON"},{"type":"Puerto Rico","content":"LOCATION"},{"type":"Eisenberg","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$114 million","content":"MONEY"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"MNGO","content":"ORGANIZATION"},{"type":"$47 million","content":"MONEY"},{"type":"$67 million","content":"MONEY"}],"hashtag":["CRIME"],"authors":["Kollen Post","The Block"]}