{"summary":"California repealed a ban that was put in place in 2018 due to concerns that crypto could be used to skirt campaign finance rules.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159162\/california-ends-ban-on-crypto-campaign-donations","publishDate":"2022-07-22T10:35:25","id":6748,"type":null,"title":"California ends ban on crypto campaign donations","category":["POLICY"],"content":["California’s campaign regulator ended a years-long ban on crypto donations this week.","Campaigns will soon be able to accept crypto through a payment processor, according to a regulation approved by the state’s Fair Political Practices Commission.","California campaigns can soon accept donations in cryptocurrency after the state’s campaign regulator ended a four-year ban on crypto contributions on Thursday.","The California Fair Political Practices Commission voted unanimously to repeal the state’s ban on cryptocurrency donations and adopt new rules for how to accept the funds. The <a href=\"https:\/\/www.fppc.ca.gov\/content\/dam\/fppc\/NS-Documents\/AgendaDocuments\/General%20Items\/2022\/july\/14.2-18421.2.pdf\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">new regulation<\/span><\/a> will take effect within the next 60 days.","“This is a new and ever-changing area,” said legal division general counsel David Bainbridge said during the <a href=\"https:\/\/youtu.be\/0RrKHvIh0W8?t=8241\" data-v-f87c67ca=\"\">commission’s July meeting<\/a>.","“We may need to adjust this as the industry develops, this is a fairly new industry,\" Bainbridge added. \"But I feel pretty confident this regulation at this point does a good job of allowing contributions to be made in crypto but then ensuring it’s not going to become an easy avenue to violate the law.”","Donations are required to be facilitated by a third-party payment processor that is based in the United States and registered with the Treasury's Financial Crimes Enforcement Network, and must not exceed contribution limits. Additionally, the contributor’s identity should be verified and the donation should be immediately converted into US dollars and transferred to the campaign’s bank account.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The commission prohibited crypto donations in 2018, citing concerns that crypto could be used to circumvent contribution limits and rules against accepting cash from foreign donors, according to a <a href=\"https:\/\/www.fppc.ca.gov\/content\/dam\/fppc\/NS-Documents\/AgendaDocuments\/General%20Items\/2022\/july\/14.0-Adoption-Memo.pdf\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">commission memo<\/span><\/a>. California was one of nine states that banned crypto donations, while a dozen states expressly allow some form of crypto donations.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"California","content":"LOCATION"},{"type":"Treasury's Financial Crimes Enforcement Network","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"California Fair Political Practices Commission","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"David Bainbridge","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"’s Fair Political Practices Commission","content":"ORGANIZATION"}],"hashtag":["CRYPTO"],"authors":["Stephanie Murray","The Block"]}