{"summary":"Mt. Gox creditors will also have an extra two months to provide crypto exchange and banking details for repayments.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199743\/mt-gox-first-repayments-pushed-back-to-september","publishDate":"2023-01-06T06:10:02","id":6749,"type":null,"title":"Mt. Gox repayments timeline pushed back by two months","category":["EXCHANGES"],"content":["<em data-v-f87c67ca=\"\">Correction: Mt. Gox payments will start from March and will continue up until the September 30 deadline.<\/em>","The timeline for Mt. Gox financial details registrations and repayments has been pushed back by two months.","The deadline for the first tranche of repayments from Mt. Gox has been moved to Sept. 30 from July 31, according to a creditor <a href=\"https:\/\/www.mtgox.com\/img\/pdf\/20230106_announcement_en.pdf\" data-v-f87c67ca=\"\">announcement<\/a>. Payments will begin from March 10 onward, a date that has also been moved back by two months.","The deadline for providing crypto exchange and banking information has also been changed to March 10 from Jan. 10. Former CEO Mark Karpeles said in a Telegram chat message that the deadline had been moved because a significant number of people had yet to file their information.&nbsp;","All creditors are set to receive a base payment. They will also receive an early lump sum payment or choose to accept what could be a different amount later. Payments will be provided in either cryptocurrency, fiat currency or both. This will be sent to the recipient's bank account or crypto exchange.","Among Mt. Gox creditors, there has been speculation that the timeline shift could be related to the crypto exchange Kraken's exit from the Japanese market. Creditors had to select from a few exchanges to receive their crypto payments, with Kraken being one of them. But the exchange said it intended to leave the Japanese market in January after global layoffs.","Some creditors said that they have been facing challenges getting their crypto exchange details verified in time for the previous deadline — potentially due to Kraken's upcoming exit — and that the new deadline will help them do so.","One creditor in the Mt. Gox creditors Telegram <a href=\"https:\/\/t.me\/mtgoxcreditors\" data-v-f87c67ca=\"\">channel<\/a> said they lived in Japan and registered Kraken as their exchange. After hearing of Kraken's plan to leave the country, they registered for two other exchanges so they could provide alternative payment details. \"I'm still waiting for both exchanges to complete my KYC, I will most likely miss the Jan 10th deadline,\" they said, adding: \"For me the extension was needed, I do sympathize with everyone who isn't in my predicament.\"","Kraken's exit from Japan may not affect most creditors or repayments, but it could cause problems for Japanese users that wish to swap their crypto to fiat currency and withdraw to their local bank account.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"Sept. 30 from July 31","content":"DATE"},{"type":"March 10 onward","content":"DATE"},{"type":"Mt. Gox","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Mark Karpeles","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Japan","content":"LOCATION"},{"type":"September 30","content":"DATE"},{"type":"March 10 from Jan. 10","content":"DATE"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}