{"summary":"Crypto projects leveraging artificial intelligence have potential but are overhyped, say Vanessa Grellet and Meltem Demirors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211849\/ai-crypto-investors","publishDate":"2023-02-15T05:00:17","id":6755,"type":null,"title":"AI crypto projects have potential but are &#x27;overhyped,&#x27; say veteran crypto investors","category":["VENTURE CAPITAL"],"content":["When OpenAI's ChatGPT launched in November last year, the AI-powered chatbot quickly whipped up a frenzy among investors. At the same time, the price of crypto tokens linked to artificial intelligence <a href=\"https:\/\/www.theblock.co\/post\/202637\/chatgpt-says-it-has-bills-to-pay-as-crypto-ai-tokens-rise-in-wake-of-potential-microsoft-deal\" data-v-f87c67ca=\"\">rallied<\/a> off the hype.&nbsp;","\"There are about 70 companies that have tokens that are related to AI and they all were caught up in the hype of the ChatGPT launch,\" said Aglaé Ventures' managing partner Vanessa Grellet in a recent appearance on The Scoop podcast with Frank Chaparro. \"We have the web2 AI area that's getting a lot of attention and then that's just bleeding into blockchain.\"&nbsp;","But that doesn't mean the world of AI-adjacent crypto projects is suddenly a sure-fire bet for crypto venture capitalists. Grellet said that many of the price rallies came from investors looking for the next big thing in a market where crypto prices are down across the board.","Grellet's comments come at a time when big tech giants Google and Microsoft are locked in an AI search war. Last week, Microsoft unveiled a revamped version of its Bing search engine powered by technology from ChatGPT creator OpenAI. That came off the back of Google trumpeting its ChatGPT challenger Bard earlier this month. These efforts also&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/209715\/microsoft-google-chatbot-frenzy-prompts-rally-in-ai-big-data-tokens\" data-v-f87c67ca=\"\">prompted<\/a> traders to pile into AI-focused tokens such as SingularityDAO (SDAO) and SingularityNET (AGIX), which saw their prices climb up to 200%.&nbsp;","A large number of projects offer blockchain-based data analytics and a distributed infrastructure to support decentralized AI and data science models. SingularityNET provides an incentive for individuals to contribute data that improves proprietary AI models, for example. Users are then compensated with tokens.","Yet CoinShares chief strategy officer and angel investor Meltem Demirors, who appeared on The Scoop with Grellet, called many of the valuations of such early-stage projects \"way overhyped.\"&nbsp;","Still, there may well be potential for crypto to serve as an enabler for AI applications, said Demirors. She cited stablecoin payments with immediate settlement guarantees, zero-knowledge proofs and even NFTs as examples of web3 technologies that could be combined with artificial intelligence.&nbsp;","\"On the gaming side and art side, we're seeing some really cool things with generative art where people are applying Gan algorithms (a machine learning model) and other learning algorithms,\" she said. \"Refik Anadol is a famous artist who's really embraced NFTs and has been doing this for years, but there's a lot of new art being generated — people are looking at ways to leverage AI to allow people to generate in-game assets and then issue them on-chain. So again, the AI and crypto component are mashed together, but one doesn't necessitate the use of the other.\"&nbsp;","Like Grellet, however, Demirors is approaching the intersection of AI and crypto with caution and believes it's a few cycles away from producing anything of commercial value.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Vanessa Grellet","content":"PERSON"},{"type":"earlier this month","content":"DATE"},{"type":"Bard","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Aglaé Ventures","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"SDAO","content":"LOCATION"},{"type":"November last year","content":"DATE"},{"type":"200%","content":"PERCENT"},{"type":"Meltem Demirors","content":"PERSON"},{"type":"Grellet","content":"PERSON"},{"type":"Gan","content":"ORGANIZATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Refik Anadol","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}