{"summary":"Ethereum founder Vitalik Buterin pledged fresh funding to advance COVID-19 research and other pandemic preparedness globally.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233857\/vitalik-buterin-pledges-millions-for-covid-19-future-pandemic-research","publishDate":"2023-06-08T16:18:55","id":6761,"type":null,"title":"Vitalik Buterin pledges millions for COVID-19, future pandemic research","category":["DEFI"],"content":["Ethereum founder Vitalik Buterin and Polygon founder Sandeep Nailwal have pledged fresh support for pandemic relief research.&nbsp;","\"Last year @CryptoRelief_ led by @sandeepnailwal allocated $100m to Covid research projects I wanted to fund Sandeep and I discussed and jointly concluded these and other projects are high-impact and need follow through grants,\" Buterin wrote on <a href=\"https:\/\/twitter.com\/VitalikButerin\/status\/1666860069273710606\" data-v-f87c67ca=\"\">Twitter<\/a>. \"Hence we decided to put $100m more to these projects.\"","\"Covid and future pandemics are a global problem that requires a global solution combining frontier scientific innovation and on-the-ground implementation all over the world,\" Buterin continued. \"We need to find public health solutions that respect people's rights and freedoms, are widely accessible, and ensure that we not only stay alive and healthy but have enjoyable lives that are worth living.\"","Buterin said $10 million of the new funds would come from him personally.&nbsp;","Nailwal founded the emergency relief fund Covid Relief in April of 2021. Aided by Buterin, it has disbursed over $58 million in pandemic relief grants and holds over $20 million in its bank account, according to the organization's <a href=\"https:\/\/cryptorelief.in\/transparency\" data-v-f87c67ca=\"\">website<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Buterin","content":"PERSON"},{"type":"$58 million","content":"MONEY"},{"type":"$100m","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$20 million","content":"MONEY"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Sandeep","content":"PERSON"},{"type":"Covid Relief","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"April of 2021","content":"DATE"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}