{"summary":"The average gas price in GWEI may still be low compared to the ‘bull market’ congestion of 2020-22. However, when history repeats itself and average gas price spikes for months at a time, how prepared is your Dapp?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265160\/as-bull-market-congestion-looms-is-your-infrastructure-ready-to-carry-the-extra-load","publishDate":"2023-11-30T09:01:05","id":6762,"type":null,"title":"As bull market congestion looms, is your infrastructure ready to carry the extra load?","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">The average gas price in GWEI may still be low compared to the ‘bull market’ congestion of 2020-22. However, when history repeats itself and average gas price spikes for months at a time, how prepared is your Dapp?<\/span>","<span data-v-f87c67ca=\"\">Oracles are integral infrastructure, and their usage is intrinsically linked to the cost of gas, particularly on the Ethereum mainnet. Oracle providers, which foot the bill for this cost, learned the hard way during this high GWEI period that ‘free-to-read’ Oracles are unsustainable. For example, at the height of congestion, the daily gas cost for an Oracle spiked to over $41,000 for one specific 24-hour period.<\/span>","&nbsp;","The average gas price in Gwei is creeping back up. Source: Etherscan.io","<span data-v-f87c67ca=\"\">New challengers have appeared, experimenting with different business models. Whereas longer-standing providers have diverted resources to newly created permissioned, revenue-generating product lines. As a result, the Oracle user market remains underserviced. Existing providers aren’t successfully alleviating customer pain points around high cost and low transparency; and new challengers don’t have the track record to provide the necessary confidence many DeFi protocols require.<\/span>","<span data-v-f87c67ca=\"\">This was a large part of the reason that <\/span><a href=\"https:\/\/chroniclelabs.org\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Chronicle Protocol<\/span><\/a><span data-v-f87c67ca=\"\"> was spun out of MakerDAO in September. Securing billions of dollars for the largest collateralized lending protocol in the space since 2017 has demanded the creation of a very tailored type of infrastructure that prioritizes gas efficiency and transparency, and can scale with network congestion.<\/span>","<span data-v-f87c67ca=\"\">The ‘Oracle dilemma’ dictates that there must be a trade-off between security (or decentralization) and cost. The more secure or decentralized you make an Oracle protocol (by increasing the validator set), the more it costs (in gas) to publish an Oracle outcome on-chain. The opposite is also true. The smaller the validator set and, therefore less secure you make the protocol, the less it costs to run an Oracle.<\/span>","<span data-v-f87c67ca=\"\">As on-chain TVL grows, the incentive for Oracle validator collusion to manipulate an Oracle also grows. This is one of many reasons why for Oracles to advance as tools of true and decentralized security, this trade-off cannot continue.<\/span>","<span data-v-f87c67ca=\"\">New and old Oracle providers have attempted to solve this dilemma by rearranging the moving parts of an Oracle and dressing it up with marketing. Meanwhile, DeFi and other areas of the industry that rely heavily on Oracles suffer high-cost and high-latency Oracles, and the ‘bull market’ congestion is, again, fast approaching.<\/span>","","","<span data-v-f87c67ca=\"\">The ‘Pull Oracle’ model is often presented as a solution. However, without gas optimization, this solution also falls foul when Mainnet becomes congested. The Pull model can and is often set up in a way where the Oracle provider or Dapp doesn’t pay the gas fee to update the Oracle. Instead, it is bundled into the transaction of the end user of the Dapp. Naturally, during high network congestion, this will lead to Dapps cannibalizing their user base as the cost of making an in-dapp transaction becomes unusably high due to spikes in gas prices for the Oracle.<\/span>","","","<span data-v-f87c67ca=\"\">The ‘Pull Oracle’ also doesn’t make publishing data on-chain any cheaper; it simply slows the frequency down to an on-demand basis. Therefore the Oracle only costs less gas to run as long as updates are being ‘pulled’ less frequently than it would have ‘pushed’ them in the alternative model. For context, in the push model, data is pushed on-chain regularly based on customizable thresholds such as time or the value changing by 0.5%.<\/span>","A comparison with other Oracle providers utilizing on-chain metrics for gas usage. Source: Etherscan.io","<span data-v-f87c67ca=\"\">This is why, regardless of whether you use a Push or Pull model, gas optimization and security are king. Verify this Chronicle Oracle gas usage for yourself <\/span><a href=\"https:\/\/etherscan.io\/tx\/0xc49820c31aa52df9b4c97ec18fb68aa97c5ee130946c3e34ea7b9dc760676171\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">via Etherscan<\/span><\/a><span data-v-f87c67ca=\"\">. This gas usage figure is quoted for a single-use Oracle update. With economies of scale and multicall, this can be brought down even further.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In tackling the Oracle gas usage issue, Chronicle was also the first to solve the cost-to-security tradeoff. The answer was found through the implementation of Schnorr cryptography, a signature scheme battle-tested on the Bitcoin blockchain for a number of years. This effectively means that Chronicle can scale to any number of validators on mainnet, whilst maintaining a fixed gas usage. You can dive into that further <\/span><a href=\"https:\/\/messari.io\/report\/web3-oracles-on-chronicle-protocol\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">in this research report.<\/span><\/a>","<span data-v-f87c67ca=\"\">In short, what does this all mean? As on-chain usage continues to rise and gas prices with it, Chronicle ensures that Oracle users have a truly cost-efficient option that scales with their business whilst increasing the security of the Oracle protocol instead of lowering it.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">And if you like every element of the data your Oracle provides to be verifiable, <\/span><a href=\"https:\/\/chroniclelabs.org\/dashboard\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">you can have that too<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","<b data-v-f87c67ca=\"\">What is Chronicle Protocol?<\/b>","<span data-v-f87c67ca=\"\">Chronicle Protocol is a novel Oracle solution that has exclusively secured over $10B in assets for MakerDAO and its ecosystem since 2017. With a history of innovation, including the invention of the first Oracle on Ethereum, Chronicle Protocol continues to redefine Oracles. A blockchain-agnostic protocol, Chronicle overcomes the current limitations of transferring data on-chain by developing the first truly scalable, cost-efficient, decentralized, and verifiable Oracles, rewriting the rulebook on data transparency and accessibility.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by <\/i><em data-v-f87c67ca=\"\">Chronicle Labs <\/em><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$41,000","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"billions of dollars","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"Chronicle","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"0.5%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Chronicle Labs","content":"ORGANIZATION"},{"type":"22","content":"DATE"},{"type":"Chronicle Oracle","content":"ORGANIZATION"},{"type":"Schnorr cryptography","content":"ORGANIZATION"},{"type":"$10B","content":"MONEY"},{"type":"Oracle","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Gwei","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}