{"summary":"Wall Street veterans say the catastrophic collapse of crypto exchange FTX shows the need for stricter regulation is here.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185445\/wall-street-sees-tightening-of-regulatory-screws-after-ftx-crypto-catastrophe","publishDate":"2022-11-10T13:09:00","id":6763,"type":null,"title":"Wall Street sees tightening of regulatory screws after FTX crypto catastrophe","category":["REGULATION"],"content":["<span data-contrast=\"none\" data-v-f87c67ca=\"\">Wall Street may not have seen the FTX debacle coming, but veterans of traditional finance recognize that once the dust settles there will be a new crypto paradigm.&nbsp;<\/span><br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">“Wall Street is clearly spooked by this event,” said Avivah Litan, a senior analyst at Gartner Research. “What’s happened will become a teaching moment.”<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">FTX CEO Sam Bankman-Fried <a href=\"https:\/\/www.theblock.co\/post\/184423\/ftxs-bankman-fried-gets-binance-bailout-in-stunning-reversal-of-fortune\" data-v-f87c67ca=\"\">shocked the financial world<\/a> earlier this week when he first reported liquidity troubles at the exchange he founded that was once valued at $32 billion. While a rescue deal with global rival Binance fell through just one day after it was announced, the whirlwind drama suggests a significant power shift, while also potentially ushering in a level of regulatory scrutiny capable of forever changing how digital assets are traded and overseen. &nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“[Wall Street] bankers certainly could be influential at shaping the right regulatory framework,” said Litan, who before joining Gartner spent more than a decade overseeing financial systems at the World Bank.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">For some on Wall Street, the entire year — from Terra’s death spiral, to 3AC’s bankruptcy — have been a cautionary tale. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/post\/185415\/ftx-lent-alameda-billions-of-dollars-in-customer-assets-wsj\" data-v-f87c67ca=\"\">Alarming reports<\/a> that Bankman-Fried transferred billions of dollars in customer funds held by FTX to prop up the trading firm he also owns, surfaced Thursday, further spotlighting the possible need for increased scrutiny of companies operating in crypto.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“The events of 2022 have highlighted major conflicts of interest between market participants, a lack of corporate governance, poor risk management practices, and a need for the separation of roles, responsibilities, and client funds,” <\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">said Duncan Trenholme, co-head of digital assets at market infrastructure player TP ICAP, which works with<\/span> <span data-contrast=\"none\" data-v-f87c67ca=\"\">traditional financial institutions. “<\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">These market events will likely further incentivize regulators to set stricter standards for the industry.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\" data-v-f87c67ca=\"\">&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">A senior Wall Street executive with extensive experience working across crypto, who asked to speak confidentially, echoed Litan’s statements. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">“There’s the hope it could lead to more fulsome regulation in the United States around centralized exchanges,” the person said. “It’s an opportunity for regulated financial institutions to now help shape what crypto regulation could be in the U.S. and that’s actually genuinely a positive.”<\/span>&nbsp;","For years the Securities and Exchange Commission has said that a majority of the digital asset industry is not following U.S. financial laws, and the markets regulator has aggressively pursued enforcement actions. SEC Chair Gary Gensler <a href=\"https:\/\/t.co\/47XvtAjHBs\" data-v-f87c67ca=\"\">reiterated<\/a> that sentiment in a televised interview earlier today.&nbsp;","U.S. regulators and the Treasury Department want Congress to tighten rules around stablecoins and spot markets for digital assets that qualify as commodities rather than securities. Ironically Bankman-Fried was the most <a href=\"https:\/\/www.theblock.co\/post\/184436\/bankman-frieds-priority-crypto-bill-dead-after-ftx-sells-to-binance\" data-v-f87c67ca=\"\">prominent industry proponent<\/a> of legislation to give regulators more direct rulemaking and oversight authority over crypto exchanges and markets.","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Meanwhile, big institutions have been largely untouched by losses in crypto according to a note by ratings agency Moody’s, which credited banks’ “fairly cautious approach.” Despite that, Fadi Massih, Moody’s vice president of the financial institutions group warned that if debt builds up substantially it could “unsettle the banking system, even if banks continue distancing themselves from direct interaction with the crypto economy.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The agitation roiling the crypto universe may be music to the ears of those on Wall Street who failed to embrace the promise of the new financial system. “Many traditional finance firms were feeling a sense of frustration at the peak of the market,” said an executive who leads a digital assets division at a traditional financial institution. “Crypto firms had large ambitions and weren’t constrained by the same things.”<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">The executive said that perhaps crypto is now facing, for the first time, the hard lessons traditional finance has learned over decades, including the need for robust corporate governance and solid risk management practices.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Others in traditional finance also see this moment as an opportunity for businesses looking to move into digital assets. “Investors will now be seeking service providers who manage these risks as part of their normal course of business,” said Trenholme. “Many have been building products and services for crypto over recent years incorporating stricter standards and have been comparably slower to get to market as a result but will now benefit.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\" data-v-f87c67ca=\"\">&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">An executive at a Wall Street bank, who asked not to be named due to the sensitivity of their position, said they believe the FTX fallout will eventually benefit large firms like Fidelity and BlackRock, if they begin offering crypto trading services to retail investors. <\/span>&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">Regardless of how sympathetic Wall Street is to the trials and tribulations suffered by FTX, traditional financial institutions like Goldman Sachs and JPMorgan Chase, even in lieu of strong oversight, are investing heavily in blockchain ventures, said Litan, adding that recent events are unlikely to change their plans.<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">“In the short run this is a huge setback for crypto, but in the long run the tokenization of real-world assets is where the big bang for the buck is,” Litan said. “It’s important not to conflate the speculative aspects of crypto with the value of the technology.”<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n<span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"the World Bank","content":"ORGANIZATION"},{"type":"Litan","content":"PERSON"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"TP ICAP","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Avivah Litan","content":"PERSON"},{"type":"Gartner Research","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Moody’s","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Trenholme","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"Fadi Massih","content":"PERSON"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Gartner","content":"ORGANIZATION"},{"type":"Duncan Trenholme","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE","FTX"],"authors":["RT Watson","Lucy Harley-McKeown","The Block"]}