{"summary":"The firm behind the Cool Cats NFT project is working with video game developers to launch three different video games.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239152\/cool-cats-partners-with-two-animoca-brands-owned-video-game-developers","publishDate":"2023-07-12T10:10:59","id":6764,"type":null,"title":"Cool Cats partners with Animoca Brands-owned video game developers","category":["METAVERSE & NFT"],"content":["Cool Cats Group, the firm behind the blue-chip NFT project of the same name, is partnering with three video game development firms, two of which are owned by Animoca Brands.","A Cool Cats partnership with nWay will yield a competitive multiplayer arcade game, with iCandy helping to develop an endless running game. Sync Studios, meanwhile, will help Cool Cats release a \"match3\" game, or a puzzle-like matching game like Candy Crush.","Cool Cats and its video game development partners are currently working on the games, which are slated to launch by the end of 2024.","\"Gaming is an immersive content distribution platform that builds emotional connection with the characters and story through engaging game play,\" Cool Cats CEO Stephen Teglas said in a statement. \"Our new games are critical to our ongoing mission of developing Cool Cats into a globally known character brand, and a robust storytelling and content company.\"","\"With nWay, iCandy and Sync Studios, we are partnering with three innovative leaders to provide immersive gaming entertainment to engage our current fans and introduce our brand to the broader global audience,” he added.","<a href=\"https:\/\/www.theblock.co\/linked\/132879\/international-olympic-committee-partners-with-developer-to-launch-game-with-nft-prizes\" data-v-f87c67ca=\"\">nWay<\/a> and iCandy are owned by <a href=\"https:\/\/www.theblock.co\/post\/235510\/animoca-brands-snags-strategic-investment-from-japans-mitsu\" data-v-f87c67ca=\"\">Animoca Brands,<\/a> the same firm that led a strategic funding round for Cool Cats in <a href=\"https:\/\/www.animocabrands.com\/cool-cats-group-secures-strategic-investment-from-animoca-brands\" data-v-f87c67ca=\"\">October<\/a> of 2022.&nbsp;","Cool Cats brought in nearly $246,000 in trading volume during the first week of July. For 2023, the project netted high of $8.1 million in sales in mid-February, The Block data shows.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/art-collectibles\/ethereum-art-and-collectibles-nft-trade-volume\/embed\" title=\"Ethereum Art and Collectibles NFT Trade Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cats Group","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Stephen Teglas","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"October<\/a> of 2022","content":"DATE"},{"type":"$246,000","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"$8.1 million","content":"MONEY"},{"type":"mid-February","content":"DATE"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}