{"summary":"The UK&#x27;s central bank, the Bank of England, has unveiled the model for a digital pound and asked the public to respond during a four-month consultation process.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209304\/uks-bank-of-england-launches-digital-pound-project-as-new-form-of-money","publishDate":"2023-02-07T09:42:27","id":6766,"type":null,"title":"UK&#x27;s Bank of England launches digital pound project as &#x27;new form&#x27; of money","category":["POLICY"],"content":["The Bank of England, the UK's central bank, launched its long-awaited digital pound project, pitching the potential to create a new payment system and form of money.&nbsp;","The potential digital currency would be issued solely by the central bank, with households and businesses able to hold the currency in a digital wallet accessible via smartphones or cards, a consultation document <a href=\"https:\/\/www.bankofengland.co.uk\/-\/media\/boe\/files\/paper\/2023\/the-digital-pound-consultation-working-paper.pdf?la=en&amp;hash=5CC053D3820DCE2F40656E772D9105FA10C654EC\" data-v-f87c67ca=\"\">published<\/a> on Tuesday said.&nbsp;","''A UK central bank digital currency – a ‘digital pound’ – would be a new form of digital money for use by households and businesses for their everyday payments needs,\" Chancellor of the Exchequer Jeremy Hunt, and Bank of England Governor Andrew Bailey said in a statement.&nbsp;","The project's announcement comes a week after the UK government unveiled a new regulatory regime for licensing crypto service providers and builds on Prime Minister Rishi Sunak's <a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/www.theblock.co\/post\/140451\/uk-treasury-outlines-plan-to-regulate-stablecoins-and-issue-an-nft\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/140451\/uk-treasury-outlines-plan-to-regulate-stablecoins-and-issue-an-nft\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">ambition <\/a>to center the country as a crypto and fintech hub. Even so, the UK lags behind its Euro zone neighbors where work on a central bank digital currency is well advanced, despite the fact that the EU has not yet committed to a rollout. A final decision on whether to move forward with implementation of a digital euro is expected in October.","There will also be challenges to convince the finance sector of the need for a new payments option. Bailey himself voiced skepticism about the need for a household-focused digital currency when speaking last month at a hearing in front of UK lawmakers. \"We have to be very clear what problem we are trying to solve before we get carried away with the technology,\" he said.","Delivering prepared remarks to financial trade association UK Finance, Deputy BoE Governor Jon Cunliffe said a digital pound ''could complement and support new forms of private digital money and payment services'' and help drive down transaction costs charged by credit card and other payment merchants. He also flagged the high costs of sending money overseas, something new digital currencies could bring down.","The document is meant to solicit public comment and the report's authors stressed several times that any digital currency plans were still at an early stage and might not be needed depending upon how the payments landscape evolved. If there is political and public demand to move forward then a prototype technology would be designed and tested before moving to a pilot project, the document said.","\"The work over the next two to three years will inform that decision and will reduce the lead time to launch should the decision at the end of this stage be to implement the digital pound in the UK, which could then be introduced in the second half of the decade,\" Cuncliffe said on Tuesday.&nbsp;","According to the proposal, wallets would be anonymized on the central bank's ledger to address privacy concerns and the digital currency would non-programmable, meaning authorities can't control how people spend their money.","The BoE also proposes an initial limit on the amount any individual could hold of up to £20,000, in order to manage the risks of deposits flowing out of the banking system.","Even if it did progress, building the necessary infrastructure would take several years to complete, the report said.&nbsp;","The BoE also published a separate <a href=\"https:\/\/www.bankofengland.co.uk\/paper\/2023\/the-digital-pound-technology-working-paper\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">working paper<\/a>&nbsp;on technological design considerations such as privacy, security and resilience.","There is now a four-month consultation period for the public to submit responses.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Hunt","content":"PERSON"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"\" Cuncliffe","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Euro","content":"ORGANIZATION"},{"type":"Andrew Bailey","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Jon Cunliffe","content":"PERSON"},{"type":"UK Finance","content":"ORGANIZATION"},{"type":"next two to three years","content":"DATE"},{"type":"the second half of the decade","content":"DATE"},{"type":"Rishi Sunak","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"euro","content":"ORGANIZATION"}],"hashtag":["BOE","CBDCS","ECB","EUROPEAN COMMISSION","EUROPEAN PARLIAMENT","UK PARLIAMENT"],"authors":["Benjamin Robertson","Inbar Preiss","The Block"]}