{"summary":"Social finance platforms are finding their feet. But will they be able to capture the imagination of the masses?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256392\/social-finance-platforms-experiment-with-new-features-in-bid-to-dethrone-friendtech-or-even-x","publishDate":"2023-10-13T13:55:59","id":6768,"type":null,"title":"Social finance platforms experiment with new features in bid to dethrone FriendTech — or even X","category":["CRYPTO ECOSYSTEMS"],"content":["Social finance platforms, the latest trend in crypto, are starting to experiment with more features in a bid to find a successful product market fit. Only they might struggle to disassociate themselves from the financial speculation element that kickstarted their initial success.","Based on Coinbase's Base platform, FriendTech was the first platform that started this new wave of social finance. It provides a space where users can buy keys that give them access to influencers' closed group chats. The price of the keys are on a bonding curve, meaning the more that are bought, the more expensive they get. And the kicker? That there's a 10% fee on each transaction, split between the platform's creator and the influencer.&nbsp;","Unsurprisingly, this led to a wave of financial speculation. Top crypto influencers like Hsaka, Cobie and Dingaling rose to the top of the ranks, raking in <a href=\"https:\/\/dune.com\/tk-research\/friendtech\" data-v-f87c67ca=\"\">hundreds of thousands of dollars<\/a> in fees — with the platform's creator Racer netting $450,000 from those trading their keys. In total, influencers have earned <a href=\"https:\/\/www.theblock.co\/post\/252072\/friend-tech-users-have-earned-12-million-in-fees-but-is-it-sustainable\" data-v-f87c67ca=\"\">$20 million through fees<\/a> on the app, with Racer receiving an equivalent amount.","What stands out about FriendTech is that although it has been the most successful social finance app by far — largely due to it being the first mover with this specific recipe —&nbsp; it is still quite an underdeveloped application. The application lets you post in group chats and trade keys, but that's about it.&nbsp;","Yet FriendTech has added remarkably few features. Instead, other applications have popped up offering a greater array of social and financial functions.&nbsp;","For a start, Arbitrum-based PostTech was one such clone that introduced posting to a general feed, in a similar format to X (formerly Twitter). This is interesting because it's a fairly basic functionality that creates the potential for crypto Twitter to migrate to a social finance app — assuming that these platforms move beyond being just a fad.&nbsp;","Avalanche-based StarsArena, which was the second-biggest such platform <a href=\"https:\/\/www.theblock.co\/post\/255337\/stars-arena-drained-of-2-9-million-in-avax-tokens-funds-in-user-wallets-are-safe\" data-v-f87c67ca=\"\">before a costly bug took it down<\/a>, is in the process of restarting. One feature that it provides is a tipping functionality. This is a simple feature that allows users to get paid directly for their public messages on its own X-like feed.","While not strictly a new functionality, Arbitrum-based CipherRIP is experimenting with ways to encourage users to buy more keys (or cores as it calls them). New users have to buy at least five cores in order to send a message — called a cipher — on its public feed. This may encourage more trading, although it risks putting new users off from giving it a go.&nbsp;","Then there’s Bitcoin Layer 2 NOS-based New Bitcoin City, which isn't a FriendTech clone but is more of a social layer that has similar functionalities, while allowing keyholders from other social finance protocols to use the same keys on its app. It's even more radical in the functions that it offers.&nbsp;","On the social side of things, the application offers DMs between influencers and their keyholders, in addition to the group chat that the key gives access to. Plus, it lets influencers play games with their keyholders and give them \"red packets\" — essentially buying extra keys for them.","On the finance side, it lets influencers choose the fee they charge for purchases and sales of their keys (between 0-8%) and how many keys are needed for access to their group chat.&nbsp;","New Bitcoin City also embeds a commonly used tactic known as (3,3) — a name derived from the game theory element of the Olympus Protocol — where social finance app users buy each other's keys in a bid to boost both of their values, and potential earnings from fees. The app has a function where you can make a (3,3) request that locks in each other's key for 30 days.&nbsp;","\"Our goal is not to build another socialfi app or a [FriendTech] fork. Our goal is to build the social layer for crypto\/web3\/the new decentralized web,\" New Bitcoin City said via DM on its app. \"So that’s the reason we invest a lot into building 'circle utilities' so people can actually do things together rather than just speculating on key prices.\"","While this new wave of FriendTech-inspired applications are providing new features and an arguably better experience, this might not be enough to find success. If the social gambling feature of FriendTech is what really matters, other smaller casinos — as you could characterize them by — might find it challenging to take its business.","That said, some are already looking beyond even that lofty goal.&nbsp;","\"For example, at [New Bitcoin City], our goal is not to compete against [FriendTech] and its forks. Our goal is to take on X, Meta, Tiktok, etc. For the first time, we are using a crypto app that feels so close to a regular consumer app,\" they said. \"I think crypto is ready for the masses now.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New Bitcoin City","content":"LOCATION"},{"type":"Cobie","content":"PERSON"},{"type":"8%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"FriendTech]","content":"ORGANIZATION"},{"type":"$450,000","content":"MONEY"},{"type":"Tiktok","content":"LOCATION"},{"type":"FriendTech","content":"ORGANIZATION"},{"type":"Meta","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Arbitrum","content":"LOCATION"},{"type":"$20 million","content":"MONEY"},{"type":"Hsaka","content":"PERSON"}],"hashtag":["FRIENDTECH"],"authors":["Tim Copeland","The Block"]}