{"summary":"Facebook and Instagram owner Meta is instituting a hiring freeze amid a shift in corporate priorities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173839\/metas-zuckerberg-warns-of-hiring-freeze-restructuring-plans-bloomberg","publishDate":"2022-09-29T15:04:33","id":6777,"type":null,"title":"Meta’s Zuckerberg warns of hiring freeze, restructuring plans: Bloomberg","category":["COMPANIES"],"content":["Facebook owner Meta Platforms Inc. is freezing hiring and restructuring teams to cut costs, Bloomberg reported, citing Chief Executive Mark Zuckerberg.","Meta will trim budgets across the company as it shifts priorities, not fill open roles or replace outgoing employees, and may manage out underperformers, Zuckerberg said during a weekly Q&amp;A session with employees.","<span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">“I had hoped the economy would have more clearly stabilized by now, but from what we're seeing it <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">doesn't yet seem like it has, so we want to plan somewhat conservatively,” Zuckerberg said during the meeting, according to Bloomberg.&nbsp;<\/span>","The moves come after a July warning that Meta would “steadily reduce headcount growth” amid a downturn in advertising revenue growth and increased competition from competitors like TikTok. Meta has been aiming to cut its costs by at least 10%, the Wall Street Journal <a href=\"https:\/\/www.wsj.com\/articles\/meta-and-google-are-cutting-staff-just-dont-mention-layoffs-11663778729\" data-v-f87c67ca=\"\">reported<\/a> on Sept. 21, noting that staff reductions would be one part of the strategy.","Meta missed on both earnings and revenue in the second quarter, with its metaverse and virtual-reality division Reality Labs losing $2.8 billion in the three-month period.","There’s no indication as to what the newly announced moves mean for Zuckerberg’s big plans for the company’s metaverse projects. Nonetheless, the social media giant has unveiled crypto-related initiatives in recent months, including <a href=\"https:\/\/www.theblock.co\/post\/166281\/meta-now-lets-you-post-nfts-and-other-digital-collectibles-to-facebook\" data-v-f87c67ca=\"\">embracing<\/a> digital collectibles and NFTs on Facebook and letting users <a href=\"https:\/\/www.theblock.co\/post\/173695\/u-s-based-facebook-and-instagram-users-can-now-cross-post-digital-assets\" data-v-f87c67ca=\"\">cross-post<\/a> digital assets between Instagram and Facebook.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sept. 21","content":"DATE"},{"type":"Instagram","content":"ORGANIZATION"},{"type":"the second quarter","content":"DATE"},{"type":"Zuckerberg","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$2.8 billion","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"Meta Platforms Inc.","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Mark Zuckerberg","content":"PERSON"}],"hashtag":[],"authors":["Larry DiTore","Kristin Majcher","The Block"]}