{"summary":"Curve Finance deployed smart contracts for the decentralized stablecoin crvUSD, marking its release on the Ethereum mainnet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229436\/curve-finance-deploys-crvusd-stablecoin-on-ethereum-mainnet","publishDate":"2023-05-04T04:46:29","id":6779,"type":null,"title":"Curve Finance deploys crvUSD stablecoin on Ethereum mainnet","category":["DEFI"],"content":["The developers of decentralized exchange Curve Finance deployed smart contracts for the decentralized stablecoin crvUSD, marking its release on the Ethereum mainnet.","Curve confirmed the deployment and added that the launch is not yet finalized, as a user interface — a frontend to interact with the crvUSD smart contracts — is still under development.","\"As many have figured out, deployment of crvUSD smart contracts has occurred. This is not finalized yet because the UI also needs to be deployed. Stay tuned,\" Curve Finance <a href=\"https:\/\/twitter.com\/CurveFinance\/status\/1653872243556986880\" data-v-f87c67ca=\"\">tweeted<\/a> yesterday at 5:20 p.m. EST.&nbsp;","The team created a total of 20 million crvUSD on the mainnet, which can be <a href=\"https:\/\/etherscan.io\/token\/0x95ecdc6caaf7e4805fcef2679a92338351d24297\" data-v-f87c67ca=\"\">viewed<\/a> on the Etherscan blockchain explorer. An <a href=\"https:\/\/platform.arkhamintelligence.com\/explorer\/address\/0x7a16ff8270133f063aab6c9977183d9e72835428\" data-v-f87c67ca=\"\">address<\/a> labeled as Curve on Arkham Intelligence took a loan of <a href=\"https:\/\/etherscan.io\/token\/0x95ecdc6caaf7e4805fcef2679a92338351d24297\" data-v-f87c67ca=\"\">1 million crvUSD<\/a> ($1 million) with 957 Frax Ether ($1.8 million).&nbsp;","The crvUSD stablecoin, a decentralized currency pegged to the U.S. dollar, employs a token design akin to MakerDAO's DAI stablecoin, rather than relying on dollar reserves. It will be over-collateralized by supported crypto assets surpassing the value of issued crvUSD. Similar to DAI, crypto users on the Curve platform can mint crvUSD stablecoins through overcollateralized loans.","The stablecoin will rely on a new algorithm called Lending-Liquidating AMM (LLAMMA). This continuously liquidates and automatically deposits collateral to manage the risk associated with the stablecoin, while maintaining its peg to the U.S. dollar.","Designed by one of the largest decentralized finance platforms with a strong focus on stablecoin,&nbsp;crvUSD stands a chance at gaining adoption. Nevertheless, it faces stiff competition in a market currently dominated by centralized stablecoins such as USDT and USDC, which represent $82 billion and $30 billion respectively of the overall $130 billion stablecoin market.","Meanwhile, DAI has a market capitalization of $4.6 billion. Aave, the largest lending protocol, is also testing a stablecoin called GHO, which was <a href=\"https:\/\/www.theblock.co\/post\/210092\/aaves-gho-stablecoin-goes-live-on-ethereums-goerli-testnet\" data-v-f87c67ca=\"\">deployed<\/a> on Ethereum's Goerli testnet in February and remains in development.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"1 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$1.8 million","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"DAI","content":"ORGANIZATION"},{"type":"5:20 p.m. EST.","content":"TIME"},{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"$82 billion","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$4.6 billion","content":"MONEY"},{"type":"$130 billion","content":"MONEY"},{"type":"\" Curve Finance","content":"ORGANIZATION"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["ASSETS","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}