{"summary":"Counsel representing Bittrex and Poloniex in an ongoing class action are joining the call for Roche Freedman to be thrown off the case.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167615\/poloniex-and-bittrex-join-tether-in-asking-court-to-terminate-roche-freedman-from-class-action","publishDate":"2022-09-02T20:15:38","id":6781,"type":null,"title":"Poloniex and Bittrex join Tether in asking court to terminate Roche Freedman from class action","category":["LEGAL"],"content":["Counsel representing Bittrex and Poloniex in an ongoing<a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/www.theblock.co\/post\/119054\/judge-dismisses-some-claims-against-bitfinex-and-tether-but-class-action-lawsuit-continues\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/119054\/judge-dismisses-some-claims-against-bitfinex-and-tether-but-class-action-lawsuit-continues\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">&nbsp;class action<\/a>&nbsp;lawsuit are the latest to call for law firm Roche Freeman to be thrown off the case.","Bitfinex and Tether recently filed a letter requesting Roche Freedman be terminated from the case following a <a href=\"https:\/\/www.theblock.co\/post\/166415\/security\" data-v-f87c67ca=\"\">scandal<\/a> surrounding its founding partner, Kyle Roche. Now, counsel for Poloniex and Bittrex have piled on, submitting a letter supporting the termination of Roche Freedman.","\"Mr. Roche’s recent statements raise serious concerns about the intent behind such discovery and how it will be used,\" lawyers for Bittrex and Poloniex said in a filing with U.S. District Court for the Southern District of New York. \"While the Exchange Defendants appreciate that a protective order has been entered in this matter and that attorneys can be expected to comply with such orders, Mr. Roche’s statements make clear that he has already used confidential materials produced in litigation for improper purposes.\"","Roche Freedman brought a class action suit against several exchanges in 2020. The traders and trading firms they represented alleged the exchanges colluded with stablecoin issuer Tether to manipulate crypto markets. Bitfinex, Bittrex and Poloniex were among the defendants.","Last week, Kyle Roche submitted a motion to withdraw from the case following a series of leaked videos in which he discussed his relationship to Avalanche blockchain developer Ava Labs. The site that published the videos, Crypto Leaks, alleged Roche lodged various class actions on behalf of the firm. Both <a href=\"https:\/\/medium.com\/@kyleroche\/my-response-b691563c255b\" data-v-f87c67ca=\"\">Roche<\/a> and <a href=\"https:\/\/el33th4x0r.medium.com\/my-statement-about-the-crypto-leaks-lies-ef2005da752\" data-v-f87c67ca=\"\">Ava Labs<\/a> have vigorously denied the claims.","Still, Roche has <a href=\"https:\/\/www.theblock.co\/post\/166816\/attorney-files-to-withdraw-from-tether-bitfinex-tron-and-binance-suits\" data-v-f87c67ca=\"\">withdrawn<\/a> from several cases in recent days, saying he is no longer part of the class action group he built within the firm. The exchange defendants have said that's not enough. The firms' counsel have requested Roche Freedman be dismissed from the class action altogether on the count that Roche could still direct the case from afar or misuse information revealed in discovery.","Roche Freedman submitted a response today, reiterating that Roche's statements in the videos were \"demonstrably false\" and alleging the videos were recorded under dubious circumstances orchestrated by a defendant of a different class action suit. Still, to \"avoid unnecessary distraction from the merits of the case\" the firm said it has removed Roche from its class action practice, screened him from the firm's other class action suits and Roche himself has forfeited any financial interest in the Tether case.&nbsp;","\"It’s no surprise, however, that defendants are using it as a litigation tactic to disqualify the entire firm,\" Roche Freedman said in its response.","Roche Freedman also requested a conference to address these issues if the court intends to consider the request to terminate the firm. A judge has yet to respond to any of the filings.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Roche Freeman","content":"ORGANIZATION"},{"type":"Roche Freedman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Kyle Roche","content":"PERSON"},{"type":"Roche Freedman","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Crypto Leaks","content":"PERSON"},{"type":"Poloniex","content":"PERSON"},{"type":"Bittrex","content":"PERSON"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"\" Roche Freedman","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Roche","content":"PERSON"},{"type":"Roche","content":"ORGANIZATION"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}