{"summary":"On this episode of The Scoop, Ethereum 2.0 developer and Prysmatic Labs founder Preston Van Loon and Joe Sticco broke down Cryptex.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/96892\/cryptex-tcap-ethereum-2-scaling","publishDate":"2021-03-02T20:37:03","id":6785,"type":null,"title":"Ethereum 2.0, scaling, and a project that lets you buy the whole market","category":["LAYER 1S"],"content":["Episode 12 of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Cryptex’s Joe Sticco and Preston Van Loon.","Listen below, and subscribe to The Scoop on&nbsp;Apple,&nbsp;Spotify,&nbsp;Google Play,&nbsp;Stitcher&nbsp;or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"4b3b242f282a383f0b3f232e29272428202839323b3f2465282426\">[email&nbsp;protected]<\/a>.","This episode is brought to you by our sponsors <a href=\"https:\/\/bakkt.onelink.me\/FTbR\/c2043775\" data-v-f87c67ca=\"\">Bakkt<\/a> and Kraken","<a href=\"https:\/\/bakkt.onelink.me\/FTbR\/c2043775\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Bakkt®<\/em><\/a><em data-v-f87c67ca=\"\"> unlocks the $1.2+ trillion of digital assets that is currently held in cryptocurrencies, rewards and loyalty points, gaming assets and merchant stored value. We began in 2018 with the vision to bring trust and transparency to digital assets. Through the Bakkt Warehouse and Bakkt Bitcoin Futures and Options contracts, we serve institutional clients in an end-to-end regulated market with true price transparency. For consumers, Bakkt aggregates digital assets to enable instant liquidity and to empower users to trade, transfer and pay however they want. <a href=\"https:\/\/bakkt.onelink.me\/FTbR\/c2043775\" data-v-f87c67ca=\"\">Visit Bakkt.com<\/a> for more information<\/em>","<em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit&nbsp;Kraken.com&nbsp;to get started&nbsp;today.<\/em>","<iframe loading=\"lazy\" src=\"https:\/\/playlist.megaphone.fm?e=BLOCK6239402631\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","On this episode of The Scoop, Ethereum 2.0 developer and Prysmatic Labs founder Preston Van Loon and Joe Sticco joined Frank Chaparro to discuss their project Cryptex.","Already, the firm has lined up 500 users for its testnet, including a number of liquidity providers in the US. The team expects to launch a new token, called TCAP in the next few weeks. Van Loon and Sticco broke down how the project will offer investors a way to buy the entire crypto market, how DeFi can offer an alternative to indexes popular on Wall Street, and the scaling solutions being explored in Ethereum.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bakkt Warehouse","content":"ORGANIZATION"},{"type":"Prysmatic Labs","content":"ORGANIZATION"},{"type":"Joe Sticco","content":"PERSON"},{"type":"$1.2+ trillion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Preston Van Loon","content":"PERSON"},{"type":"Preston Van Loon","content":"LOCATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}