{"summary":"Osmosis, a leading decentralized exchange in the Cosmos ecosystem, has revealed a key update to its tokenomics model, OSMO 2.0, cutting its inflation rate by 50%.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235529\/cosmos-dex-osmosis-tokenomics","publishDate":"2023-06-19T12:59:55","id":6791,"type":null,"title":"Cosmos DEX Osmosis cuts token inflation by 50%, plans fee sharing","category":["CRYPTO ECOSYSTEMS"],"content":["Osmosis, the largest decentralized exchange in the Cosmos ecosystem, has unveiled a major update to its tokenomics model, OSMO 2.0, with a major drop in its inflation rate.","After a community governance vote, the platform cut its inflation rate by 50%, signaling a transition from its early token distribution phase and a commitment to ensuring long-term sustainability of the native OSMO tokens.","“This adjustment allows Osmosis to strike a balance between growth and stability, ensuring smoother distribution of tokens over time,” the team commented on the measure. The team said the inflation rate of OSMO will be about 11% after the reduction.","Osmosis is the main decentralized exchange of the Cosmos ecosystem, where trading is conducted of native tokens including ATOM and bridged tokens such as Axelar wrapped BTC, ETH, and USDC stablecoin. It holds over <a href=\"https:\/\/defillama.com\/chain\/Osmosis\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">$124 million<\/a>&nbsp;in crypto assets, according to DeFiLlama.","The team at Osmosis said it's exploring the introduction of a protocol revenue burn mechanism, which could further offset the remaining inflation, leading to a net deflationary model.","<span data-v-f87c67ca=\"\">In addition, Osmosis governance is now <\/span><a href=\"https:\/\/gov.osmosis.zone\/discussion\/11577-introduce-a-protocol-taker-fee-for-osmosis-swaps\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">discussing<\/span><\/a><span data-v-f87c67ca=\"\"> the implementation of a fee switch for liquidity pools. The feature empowers OSMO stakers by allowing them to directly share in the swap fees generated by activity in Osmosis liquidity pools, snd it <\/span>would let OSMO stakers directly take a share in the swap fees generated by activity in Osmosis liquidity pools.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"11%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"$124 million","content":"MONEY"},{"type":"OSMO","content":"ORGANIZATION"}],"hashtag":["DEXS"],"authors":["Vishal Chawla","The Block"]}