{"summary":"Reddit is releasing a series of limited-edition blockchain-based avatars made by independent artists — but is stopping short of calling them NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156297\/reddit-is-releasing-blockchain-based-avatars-just-dont-call-them-nfts","publishDate":"2022-07-07T09:27:00","id":6794,"type":null,"title":"Reddit is releasing blockchain-based avatars — just don&#x27;t call them NFTs","category":["NFTS"],"content":["Reddit is releasing a series of limited-edition blockchain-based avatars made by independent artists – but is stopping short of calling them non-fungible tokens (NFTs).","<a href=\"https:\/\/www.redditinc.com\/blog\/blockchain-backed-collectible-avatars-coming-to-reddit-via-new-storefront\" data-v-f87c67ca=\"\">Announced on Thursday<\/a>, Collectible Avatars will be released in the coming weeks on the Polygon blockchain, which the social network said was chosen for its low transaction costs and sustainability commitments.","In a blog post, Reddit emphasized multiple times that the collection would only be purchasable with government-issued fiat currencies, not cryptocurrencies. Additionally, they will not be put up for auction and will instead be sold for a fixed amount.","“In the future, we see blockchain as one way to bring more empowerment and independence to communities on Reddit. Reddit has always been a model for what decentralization could look like online; our communities are self-built and run, and as part of our mission to better empower our communities, we are exploring tools to help them be even more self-sustaining and self-governed. Blockchain-backed Collectible Avatars are one of the early steps we’re taking to test out the potential benefits of this concept on Reddit,” said the company.","Reddit's reluctance to brand the new product as an NFT is perhaps surprising. While it's common to see Chinese tech companies refer to blockchain-based collections as \"digital collectibles,\" Reddit had no such qualms when it <a href=\"https:\/\/www.theblock.co\/post\/109450\/reddit-nfts-cryptosnoos-ethereum-opensea\" data-v-f87c67ca=\"\">brought out<\/a> its CryptoSnoo NFT collection last year on OpenSea.","The move is the latest in a series of web3 rollouts and experiments for Reddit. It has also experimented with allowing users to have NFTs as avatars, and allowing tokenized Community Points for its communities.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Community Points","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Collectible Avatars","content":"ORGANIZATION"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}