{"summary":"The Tornado Cash community voted against a plan to sell 50,000 vested native tokens for at least $480,000 in ETH.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155799\/tornado-cash-governance-rejects-plan-to-diversify-treasury-holdings","publishDate":"2022-07-05T09:14:20","id":6796,"type":null,"title":"Tornado Cash governance rejects plan to diversify treasury holdings","category":["GOVERNANCE"],"content":["A vote for Tornado Cash (TORN) — a coin mixing protocol for obscuring blockchain transaction history — to diversify its treasury holdings into ether (ETH) has failed. This comes as a lot of governance platforms continue to wrestle with the fact that their treasuries are declining rapidly.","The <a href=\"https:\/\/tornadocash.eth.limo\/governance\/13\" data-v-f87c67ca=\"\">governance vote<\/a>, which concluded on July 4, was a proposal to sell 50,000 of its vested native tokens (TORN-v-1) for ETH via a two-week limit order crowdsale on the decentralized exchange aggregator 1inch. This crowdsale would have been at a minimum of 0.008 ETH per token. As such, the platform would have raised at least $480,000 from the process if the vote had passed.","Since the tokens were vested, they can't be sold but they can be used to vote on governance decisions. As such, their sale would have seen buyers participate in the governance process. These tokens would have been locked up in governance for one year before they could be withdrawn at a 1:1 rate for TORN coins. Buyers would also have earned yield from staking during the vesting period.","Details from the voting page show that 68% of the participants were against the vote. Voter participation in the process was almost seven times the number required to achieve a quorum on Tornado Cash DAO, showing that there was a considerable number of participants weighing in (or ones with deep pockets). The coin mixing platform also <a href=\"https:\/\/twitter.com\/WUTornado\/status\/1543947875062878208\" data-v-f87c67ca=\"\">stated<\/a> that voter participation in the proposal was over 200% more than the previous governance vote.","Tornado Cash is the latest DeFi protocol to have looked at treasury management in this current bear market. The decline in crypto prices has seen the value of their treasuries plummet significantly. This situation has led to governance proposals on several projects, aiming to diversify their treasuries.","Liquid staking giant Lido Finance is considering a proposal to <a href=\"https:\/\/www.theblock.co\/post\/150247\/lido-developer-dao-should-sell-17-million-of-eth-to-prepare-for-bear-market\" data-v-f87c67ca=\"\">sell $17 million worth of ETH<\/a> to help the project navigate the current market conditions. In its treasury, the project only holds its native token, which is down more than 90%.","Stablecoin issuer Fei Protocol has also <a href=\"https:\/\/snapshot.org\/#\/fei.eth\/proposal\/0xf789539597a01bae85be052405854751737562f0832aab78f8d450d8afcb7bc3\" data-v-f87c67ca=\"\">voted<\/a> to sell some of its treasury tokens including Curve, Convex, and Aave for the Dai stablecoin. The move was to increase the stablecoin share of the project's treasury.","Plus, MakerDAO is <a href=\"https:\/\/www.theblock.co\/post\/154515\/maker-governance-is-voting-to-invest-500-million-in-us-treasury-bills\" data-v-f87c67ca=\"\">moving forward<\/a> with plans to invest $500 million of its treasury into stocks, although this wasn't due to declining prices (since its treasury largely comprises stablecoins).","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"90%","content":"PERCENT"},{"type":"$500 million","content":"MONEY"},{"type":"$480,000","content":"MONEY"},{"type":"68%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"July 4","content":"DATE"},{"type":"Fei Protocol","content":"ORGANIZATION"},{"type":"$17 million","content":"MONEY"},{"type":"200%","content":"PERCENT"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}