{"summary":"In a new post-mortem report, Sky Mavis, the creator of Axie Infinity and its Ronin sidechain, said it was evaluating its security on all fronts.\nThe team revealed plans to become a “zero-trust organization” and add more than 100 validator nodes in future.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/143821\/sky-mavis-plans-to-become-a-zero-trust-organization-after-600-million-ronin-hack","publishDate":"2022-04-27T17:05:03","id":680,"type":null,"title":"Sky Mavis plans to become a &#x27;zero-trust organization&#x27; after $600 million Ronin hack","category":["Security"],"content":["<span data-v-f87c67ca=\"\">Sky Mavis, the company behind the play-to-earn game Axie Infinity, said it is looking<\/span><span data-v-f87c67ca=\"\"> to become a “zero-trust organization\" in the wake of last month's $600 million attack on the Ronin network.<\/span>","<span data-v-f87c67ca=\"\">This refers to a security stance in which the team will constantly scan for new threats that may be targeting the game’s creator Sky Mavis, the team said in a new post-mortem <\/span><a href=\"https:\/\/roninblockchain.substack.com\/p\/back-to-building-ronin-security-breach?s=w\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report<\/span><\/a><span data-v-f87c67ca=\"\"> published Wednesday.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Our goal is to become a fully antifragile, zero-trust organization. Zero-trust is a framework that assumes that Sky Mavis is always at risk to external and internal threats,” the report said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The attackers took control over four of the total nine validators. First, they stole four validator keys controlled by Sky Mavis. Yet another validator — belonging to Axie DAO — was compromised through a \"gas-free signature\". After this, the hacking group attained a majority control (5\/9 validators) and had the ability to make illegitimate fund transfers from Ronin’s bridge on Ethereum.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">As revealed in the Wednesday update, Sky Mavis is<\/span><span data-v-f87c67ca=\"\">&nbsp;planning to expand the total validator nodes to 21 in the next three months, and target having <\/span><span data-v-f87c67ca=\"\">more than 100 nodes in the long run to strengthen the sidechain security.<\/span>","<span data-v-f87c67ca=\"\">As far as Sky Mavis goes, it raised <a href=\"https:\/\/www.theblockcrypto.com\/post\/140800\/sky-mavis-raises-150-million-from-binance-to-reimburse-ronin-hack-victims\" data-v-f87c67ca=\"\">$150 million<\/a> from a group of investors, including crypto exchange Binance and VC firms a16z and Paradigm, as part of its efforts to reimburse affected users.<\/span>"],"hashtag":["HACKS"]}