{"summary":"Users who were early liquidity providers, 0xmon NFT holders, or xmon token holders are eligible for the airdrop.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206917\/nft-marketplace-sudoswaps-airdrop-is-now-live","publishDate":"2023-01-30T19:13:22","id":6800,"type":null,"title":"NFT marketplace Sudoswap&#x27;s airdrop is now live","category":["DEFI"],"content":["Sudoswap, an NFT marketplace that allows for the instant buying and selling of NFTs, has airdropped and launched its sudo token.&nbsp;","Eligible users are able to claim their <a href=\"https:\/\/twitter.com\/sudoswap\/status\/1620111345676075009?s=20&amp;t=AHUle0mgszwZCeP9fWAZhg\" data-v-f87c67ca=\"\">airdropped tokens<\/a>, while holders of xmon tokens – created along with the oxmon NFT collection by the founders of Sudoswap – are able to lock xmon and receive locked sudo. The lock period for xmon tokens was reduced to one month from three, meaning the sudo tokens they receive will be unlocked after that time.","Users who were early liquidity providers on Sudoswap and 0xmon NFT holders are also eligible for the drop.","Some of those receiving the airdrop could be getting over $100,000, <a href=\"https:\/\/twitter.com\/Dogetoshi\/status\/1620194020940021761\/photo\/1\" data-v-f87c67ca=\"\">according<\/a> to The Block Research Director Steven Zheng.","Sudoswap is taking a new approach compared to other NFT marketplaces like Opensea, aiming to address the inability of other marketplaces to instantly sell NFTs like a traditional, fungible token. Sudoswap's technology is an Automated Market Maker (AMM) based model, similar to traditional decentralized exchanges, but for NFTs.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Opensea","content":"PERSON"},{"type":"Steven Zheng","content":"PERSON"}],"hashtag":["AIRDROP"],"authors":["Mike Truppa","The Block"]}