{"summary":"As crypto&#x27;s public profile grows in Washington, so too does the intersection of decentralization and politics.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167303\/bridging-dc-and-defi-can-crypto-decentralize-politics","publishDate":"2022-09-04T16:00:22","id":6805,"type":null,"title":"Bridging DC and DeFi: Can crypto decentralize politics?","category":["POLICY"],"content":["Political funding and lobbying are sensitive issues in America at the best of times. As the crypto industry has ascended as a power player in Washington, DC, stakeholders’ political work has attracted more attention.","The eminence of centralized players representing the decentralized world has proved a particular sticking point, sparking criticism during recent public — and televised — interactions.","Rep. Brad Sherman, one of the most vocal critics of crypto in Congress, derided a <a href=\"https:\/\/financialservices.house.gov\/events\/eventsingle.aspx?EventID=408705#LiveWebcast%20https:\/\/www.politico.com\/news\/2021\/12\/08\/cryptocurrency-ceos-congress-regulation-523950\" data-v-f87c67ca=\"\">panel<\/a> of crypto CEOs in December.","“The advocates of crypto represent the powers in our society. The powers in our society — on Wall Street and in Washington have spent millions, and are trying to make billions or trillions in the crypto world,” said Sherman. “Today we hear from the CEOs, with their lobbyists, their PACs, and their power.”","Many of the panelists run firms that have taken the lead on cryptocurrency lobbying and <a href=\"https:\/\/www.theblock.co\/post\/160663\/heres-how-crypto-linked-pacs-are-spending-in-tuesdays-primaries\" data-v-f87c67ca=\"\">campaign donations<\/a>. FTX’s Sam Bankman-Fried was one of the biggest donors to Biden’s 2020 campaign, while Coinbase — who sent CFO Alesia Haas rather than CEO Brian Armstrong — maintains the industry’s largest lobbying program, <a href=\"https:\/\/www.theblock.co\/post\/159545\/led-by-exchanges-crypto-industry-lobbying-grew-17-in-q2-despite-bear-market\" data-v-f87c67ca=\"\">dropping $1 million per quarter<\/a>.","At once, that investment in DC has opened the door to a massive increase in the industry’s political viability. Yet with increasing entanglements, <a href=\"https:\/\/www.theblock.co\/post\/160714\/crypto-booster-michelle-bond-is-running-for-congress-with-help-from-her-ftx-exec-boyfriend\" data-v-f87c67ca=\"\">ethical issues crop up<\/a>.","Non-profit Coin Center, for example, has long touted its dedication to decentralized networks as a distinction from trade associations like the Blockchain Association or the Chamber for Digital Commerce, which have to account for member companies. At the same time, many of those members are DeFi operators.","Firms like Uniswap Labs, the Stellar Development Foundation and the Celo Foundation have onboarded new teams to handle government relations.","Uniswap Labs and the Celo Foundation began reporting their first lobbying spending in the most recent quarter. Uniswap Labs hired Salman Banaei as head of policy in May. Both Stellar and Celo have dedicated internal lobbyists as well as outside contracts. Decentralized VPN developers Orchid Global began reporting lobbying in Q3 2021.","Those firms tout their distinctness from the protocols they program — that separation being a critical feature of DeFi. Seth Hertlein, who was the first registered lobbyist for the Stellar Development Foundation and who now works for Ledger, noted the distinction:","“It’s an interesting dichotomy if you think about purely decentralized elements of the blockchain community versus centralized entities that are building things that are decentralized,” says Seth Hertlein “The purely decentralized elements still haven’t really figured out how to lobby, is my assessment.”","For example, Uniswap is by far the largest decentralized exchange, with volumes comparable to centralized exchange Coinbase.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/dex-non-custodial\/uniswap-vs-coinbase-and-binance-trade-volume-7dma\/embed\" title=\"Uniswap vs. Coinbase and Binance Trade Volume (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","It is, however, a protocol operating independent of the firm, Uniswap Labs — an argument Uniswap Labs’ policy team has had to make before policymakers to ensure that the firm is not regulated as itself an exchange.","As one key piece of the puzzle, Uniswap Labs does not make money off of the platform’s transaction fees. It is, however, funded by reserving 21% of the supply of native UNI tokens. The total market cap for UNI today is about $2.9 billion, according to CoinGecko data.&nbsp;","Still, just like a traditional tech company would, Uniswap needs someone familiar with the ways of Washington. As one barrier, the Federal Elections Commission tallies campaign donations. The Secretary of the Senate tracks lobbying disclosures. Hertlein continued:","“To be effective, especially with campaign finance and political giving, you really need a certain amount of centralization. You need someone running it who knows how Washington works. Then you need someone, some entity, some group that has a coherent vision of what they hope to accomplish.”","In dollar terms, the biggest player in lobbying that sets the pace for DeFi-native is an offshoot of Uniswap. The DeFi Education Fund launched as a result of an on-chain Uniswap governance vote in July 2021, which allocated $20 million in UNI to the new political project.","The proposal established a new committee of seven members, including Uniswap’s chief legal officer Marvin Ammori and legal reps of several other DeFi projects.","“This entity will not replicate the great work of existing organizations such as Coin Center, Fight for the Future, the Blockchain Association, the Crypto Council for Innovation, the Defi Alliance, Blockchain for Europe, or others,” the governance proposal <a href=\"https:\/\/gov.uniswap.org\/t\/governance-proposal-005-defi-education-fund\/12963\" data-v-f87c67ca=\"\">read<\/a>.","The DEF quickly onboarded Miller Whitehouse-Levine, formerly of the Blockchain Association, as its policy director. In Q4 of 2021, the DEF reported its first lobbying expenses, quickly becoming one of the largest spenders in crypto. The fund reported $230,000 in the most recent quarter.","“DeFi’s on the radar of the most important international regulators in the world,” said Whitehouse-Levine. “There’s an increasing recognition that regulators and developers are not speaking the same language right now.”","“It is our hope that other DAOs will support policymaker education and advocacy efforts to help make the case for everyone to be able to develop and use DeFi protocols,” Whitehouse-Levine continued. The organization’s model has yet to attract imitators.","HODLPac is another project aiming to decentralize politics, particularly election donations. The political action committee’s tagline is “Grassroots politics for the decentralized economy.”","Whirty launched HODLPac while an analyst at Takoma Group in early 2020. The core objective is to evolve into, effectively, a DAO.","The PAC distributes its receipts according to an endorsement panel of known figures in crypto, many with DC connections. But the endorsement scheme only unlocks matching donations from the SuperPAC; donors can allocate their funds to whatever candidates they please.","“HODLPac’s section of the market is really being the hard-money PAC,” Tyler Whirty told The Block. It technically operates as a hybrid PAC and super PAC but has not actually used its super PAC wing this cycle.","For reference, PACs can donate $5,000 to a political candidate per election. Super PACs can spend unlimited funds in support of a campaign but are prohibited from coordinating with those campaigns.","In the cycle leading up to the 2022 midterms, the PAC had <a href=\"https:\/\/www.fec.gov\/data\/committee\/C00733691\/\" data-v-f87c67ca=\"\">reported<\/a> just under a quarter million dollars in total receipts. As of the end of June, it had given $46,191.47 to campaigns. Of total receipts, it actually returned a significant amount — over $130,000 — that had gone to its Super PAC.","For comparison, in its first year, HODLPac raised under $30,000 in total, only giving $7,500 to candidates. The current cycle represents a massive rise, and these numbers don’t represent peak midterm campaigning season. However, they are still nowhere near the scale of spending that centralized entities in crypto have been able to field.","After losing the 2020 Democratic presidential primaries and a 2022 run for mayor of New York, Andrew Yang turned, in 2022, to Lobby3.","“The most profound opportunity to fight poverty lies in Web3 technologies. Unfortunately, our leaders in DC don’t really get these technologies and are a little bit nervous about them,” he said in a February 17 <a href=\"https:\/\/twitter.com\/AndrewYang\/status\/1494295220023971845\" data-v-f87c67ca=\"\">video<\/a> announcing the project.","Lobby3 aimed to bring the virtues of Web3 to DC. At a July 22 <a href=\"https:\/\/twitter.com\/Lobby3_DAO\/status\/1550541443701227520\" data-v-f87c67ca=\"\">roundtable<\/a> conducted as a Twitter space, a representative described its ambition to become “an impact-advocacy DAO.”","Writing to The Block, community manager Renee Davis said of Lobby3’s 2,500 members: “This community is the first that is focused specifically on giving individual Web3 builders a real voice in the burgeoning policy conversation — so that it's not just major industry players whose voices are being heard.”","Yet from the public’s vantage point, Lobby3 has largely fallen quiet.","Trading on membership NFTs in secondary markets has practically frozen over. At the end of July, the firm hosted a members-only Twitter Space. Fifteen people tuned in. The operation has reported no lobbying spending, no political donations nor any other open public work. Yang himself has not tweeted or blogged about it since announcing its launch.","While decentralizing political influence has its appeal, it remains in beta testing. And as with the broader world of funding in politics, the field is fraught.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"February 17","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Chamber for Digital Commerce","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Celo Foundation","content":"ORGANIZATION"},{"type":"Blockchain","content":"PERSON"},{"type":"Tyler Whirty","content":"PERSON"},{"type":"$7,500","content":"MONEY"},{"type":"New York","content":"LOCATION"},{"type":"$130,000","content":"MONEY"},{"type":"Uniswap Labs","content":"ORGANIZATION"},{"type":"Defi Alliance","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"DC","content":"LOCATION"},{"type":"Levine","content":"PERSON"},{"type":"Brad Sherman","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Federal Elections Commission","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"$30,000","content":"MONEY"},{"type":"UNI","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"21%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"Alesia Haas","content":"PERSON"},{"type":"Stellar Development Foundation","content":"ORGANIZATION"},{"type":"Uniswap Labs’","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"Seth Hertlein","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"July 2021","content":"DATE"},{"type":"Senate","content":"ORGANIZATION"},{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"Salman Banaei","content":"PERSON"},{"type":"July 22","content":"DATE"},{"type":"DEF","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Crypto Council for Innovation","content":"ORGANIZATION"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"Takoma Group","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Whitehouse","content":"PERSON"},{"type":"$230,000","content":"MONEY"},{"type":"VPN","content":"ORGANIZATION"},{"type":"Renee Davis","content":"PERSON"},{"type":"Miller Whitehouse","content":"PERSON"},{"type":"Washington","content":"LOCATION"},{"type":"$5,000","content":"MONEY"},{"type":"Congress","content":"ORGANIZATION"},{"type":"$46,191.47","content":"MONEY"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"$2.9 billion","content":"MONEY"},{"type":"Marvin Ammori","content":"PERSON"},{"type":"America","content":"LOCATION"},{"type":"quarter million dollars","content":"MONEY"},{"type":"Andrew Yang","content":"PERSON"},{"type":"$20 million","content":"MONEY"},{"type":"PAC","content":"ORGANIZATION"},{"type":"Sherman","content":"PERSON"},{"type":"DC","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"}],"hashtag":["CONGRESS","UNISWAP"],"authors":["Kollen Post","The Block"]}