{"summary":"Impossible Cloud, a decentralized cloud platform, raised $7 million in a seed funding round led by HV Capital and 1kx. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216051\/impossible-cloud-raises-7-million-to-decentralize-storage","publishDate":"2023-03-01T09:30:10","id":6808,"type":null,"title":"Impossible Cloud raises $7 million to decentralize storage","category":["DEALS"],"content":["Impossible Cloud, a Germany-based decentralized cloud platform, raised $7 million in seed funding, led by HV Capital and 1kx.&nbsp;","The equity round, which closed last month, featured participation from Protocol Labs, TS Ventures and Very Early Ventures. The startup began fundraising toward the end of the third quarter of last year, according to a written interview with founders Kai Wawrzinek and Christian Kaul.&nbsp;","Wawrzinek is the founder of gaming studio Goodgame Studios while Kaul is a former Airbnb director, who later joined Goodgame initially as a head of talent acquisition before rising up to VP level. The pair are joined by co-founder and CTO Daniel Baker, formerly of open source platform D2iQ.&nbsp;","Impossible Cloud looks to provide decentralized cloud services for B2B customers looking to delve into web3 tech.","Currently, the startup says that centralized cloud platforms offered by big tech players such as Amazon, Meta and Microsoft suffer from complex pricing models, capacity limitations and a single point of failure, with one server vulnerability resulting in the possible loss of data.","It's also made intentionally difficult to change providers, meaning users are locked into using one particular service even if it could benefit from another one. That's not to mention that some states require data to fulfill certain standards, such as storage in a particular country which centralized providers with large but few data centers are unable to cater for.&nbsp;","\"We feel that web3 is inevitably the future of the most relevant cloud services, like cloud storage and computing, and is a highly positive development for business and government,\" said the founders. \"It’s a natural progression from web1 (read-only), web2 (read-write, highly centralized by now) to web3 (read-write-own, decentralized Cloud).\"&nbsp;","A cloud service powered by web3 technologies would benefit from an incentive system to speed up scaling, a distributed system to solve the issue of the geographical location of data storage and enable many participants to have a stake in the cloud systems that they use every day.&nbsp;","Sales for the services offered by Impossible Cloud will be done in fiat so users can benefit from the possible benefits that web3 technology could offer without having to change the fundamentals of their business models.","It will look to target online picture or video platforms and industries that rely on frequent backups of large datasets, such as surveillance video companies, said Wawrzinek and Kaul.&nbsp;","\"More generally, we’re targeting companies that already incur more than $10,000 in Cloud storage bills and want to save up to 70% of their monthly total cost of ownership,\" they added.&nbsp;","The company will primarily use the funding to finance its cloud storage solution, add further staff and incorporate in the U.S.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"HV Capital","content":"ORGANIZATION"},{"type":"Very Early Ventures","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Airbnb","content":"ORGANIZATION"},{"type":"Amazon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"TS Ventures","content":"ORGANIZATION"},{"type":"Kaul","content":"PERSON"},{"type":"$7 million","content":"MONEY"},{"type":"Wawrzinek","content":"PERSON"},{"type":"third quarter of last year","content":"DATE"},{"type":"Daniel Baker","content":"PERSON"},{"type":"$10,000","content":"MONEY"},{"type":"founders Kai Wawrzinek","content":"ORGANIZATION"},{"type":"Germany","content":"LOCATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Christian Kaul","content":"PERSON"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}