{"summary":"Swedish gaming startup GOALS has secured $15 million in seed funding in a round led by venture capital firm Northzone. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/140441\/blockchain-soccer-game-goals-scores-15-million-seed-funding","publishDate":"2022-04-05T04:00:56","id":6809,"type":null,"title":"Blockchain soccer game GOALS scores $15 million seed funding","category":["GAMING AND METAVERSE"],"content":["Swedish gaming startup GOALS today announced a $15 million seed funding round led by venture capital firm Northzone.&nbsp;","GOALS is developing an eponymous online multiplayer game that has a play-to-own mechanism for in-game assets such as players, clubs, and skins. Following in the footsteps of <a href=\"https:\/\/www.theblockcrypto.com\/post\/118094\/fantasy-soccer-nft-sorare-scores-680-million-raise-softbank\" data-v-f87c67ca=\"\">fantasy soccer platform Sorare,<\/a> these will be stored on a blockchain network as non-fungible tokens (NFTs) — a unique code that signifies ownership.&nbsp;","\"With FIFA you only own the skins for a limited period of time,\" explained founder Andreas Thorstensson, previously founder of e-sports organization SK Gaming and partner at EQT Ventures. \"You can't control them, you can't sell them and you don't have transparency — blockchain is the perfect solution to this.\"","Being free-to-play, the game will rely on taking a cut on every NFT marketplace sale alongside monetizing via add-ons that don't hinge on a user volunteering to sell their assets.&nbsp;","The company spent the last four months exploring which blockchain network to build on top of. Proof-of-stake networks like Polygon, Starkware, and Solana are currently at the top of the food chain.&nbsp;","Every user of GOALS owns fifteen players — each of which are minted as NFTs and stored. Depending on user count, this could amount to a large number of NFTs — and Thorstensson said that it's important that the supporting network is not only cost-efficient but also a low-emission network.&nbsp;","He said he isn't put off from exploring developing a sidechain of Ethereum such as Ronin, the blockchain underpinning Axie Infinity. Last week, Ronin was hit by a <a href=\"https:\/\/www.theblockcrypto.com\/post\/139761\/axie-infinitys-ethereum-sidechain-ronin-hit-by-600-million-exploit\" data-v-f87c67ca=\"\">$600 million exploit<\/a> that targeted the Ronin bridge, which connects Ethereum to the sidechain.&nbsp;","\"First of all, bridges are a security risk,\" he admits, noting that the hack will likely facilitate increased focus on securing bridges. \"From a security standpoint, we just need to make sure that the chain is very decentralized and that there are enough nodes and validators [to ensure majority control].\"&nbsp;","Thorstensson said he's aiming to capture a non-crypto native audience. That's why he passed on working with specialist crypto funds that he says \"make a better fit for companies that go deeper into tokens\" in favor of generalist equity-based funds with a strong web3 element.&nbsp;","With the new financing, the company will recruit another 30 game developers, coinciding with a form of public release by the end of 2022.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Northzone","content":"ORGANIZATION"},{"type":"EQT Ventures","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Andreas Thorstensson","content":"PERSON"},{"type":"Ronin","content":"ORGANIZATION"},{"type":"$600 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"Ronin","content":"LOCATION"},{"type":"FIFA","content":"ORGANIZATION"},{"type":"Thorstensson","content":"PERSON"},{"type":"Solana","content":"PERSON"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}