{"summary":"In an action plan for the next two years, Beijing envisions a greater role for the metaverse in its tourism and cultural outreach. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/165522\/beijing-lays-out-plan-for-metaverse-development-in-tech-development-zones","publishDate":"2022-08-24T14:08:21","id":6813,"type":null,"title":"Beijing lays out plan for metaverse development in tech development zones","category":["THE BLOCK"],"content":["Beijing released a new plan for developing \"metaverse\" technologies and NFTs.","The municipal government detailed its two-year \"Beijing Urban Sub-Center Metaverse Innovation and Development Action Plan\" in an Aug. 23 <a href=\"http:\/\/www.bjtzh.gov.cn\/bjtz\/xxfb\/202208\/1612371.shtml\" data-v-f87c67ca=\"\">release<\/a>.&nbsp;","The plan leans heavily on existing <a href=\"http:\/\/www.xinhuanet.com\/english\/2021-01\/20\/c_139684378.htm\" data-v-f87c67ca=\"\">development<\/a> of the Beijing International Science and Technology Innovation Center and \"the implementation plan for Beijing to build a global digital economy benchmark city in the city's sub-center.\"","It emphasizes a potential role for metaverse development in the city's innovation center as a source for tourism and cultural interchange. That includes a metaverse theme park and \"smart hotels.\"","No budgets for actual grants or subsidies for developments were provided as part of the release. The term \"metaverse\" has elicited different interpretations and Beijing's plan seems to lean heavily on a vision for a metaverse that largely just means virtual reality.","China famously <a href=\"https:\/\/www.theblock.co\/post\/147162\/new-data-suggest-many-china-based-bitcoin-miners-may-have-moved-underground-after-the-ban\" data-v-f87c67ca=\"\">banned cryptocurrency mining<\/a> in early 2021, but has remained keenly interested in blockchain technological development and digital economies since. Though it is not on a public ledger and so volumes are unclear, <a href=\"https:\/\/www.theblock.co\/linked\/129081\/chinas-digital-yuan-wallet-goes-live-on-app-stores-in-pilot-mode\" data-v-f87c67ca=\"\">China's digital yuan<\/a> is on beta testing whose scale likely makes it the largest operational central bank digital currency to date.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aug. 23","content":"DATE"},{"type":"Beijing","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Beijing Urban Sub-Center Metaverse Innovation and Development Action Plan\"","content":"ORGANIZATION"},{"type":"Beijing International Science and Technology Innovation Center","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Kollen Post","The Block"]}