{"summary":"Coinbase’s top lawyer said he’s ‘disappointed’ that the markets regulator took action against his company. ","author":["Colin Wilhelm","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233350\/we-will-continue-to-operate-our-business-as-usual-says-coinbase-legal-chief","publishDate":"2023-06-06T13:32:46","id":682,"type":null,"title":"&#x27;We will continue to operate our business as usual&#x27; says Coinbase legal chief","category":["Policy"],"content":["<span data-v-f87c67ca=\"\">Coinbase’s top lawyer chided the Securities and Exchange Commission in congressional testimony, as he testified before a House of Representatives committee currently drafting legislation to create a new framework for digital asset markets in the U.S.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“It’s disappointing, but not surprising, that the SEC has decided to bring legal action against Coinbase today, the day of our testimony before this committee’s critical hearing on creating a workable framework for digital asset regulation,” said Coinbase Chief Legal Officer Paul Grewal, hours after the SEC sued his company over alleged securities law violations. “The solution is legislation that allows fair rules for the road be developed transparently and applied equally, not litigation.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Added Grewal: “Despite today’s complaint we will continue to operate our business as usual.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The SEC has <\/span><a href=\"https:\/\/www.sec.gov\/litigation\/complaints\/2023\/comp-pr2023-102.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">accused Coinbase of willfully violating securities laws<\/span><\/a><span data-v-f87c67ca=\"\"> by listing unregistered securities and offering its staking program. <\/span>","<span data-v-f87c67ca=\"\">The civil complaint includes a reference to the SEC’s <\/span><a href=\"https:\/\/www.sec.gov\/litigation\/investreport\/34-81207.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report on the original Decentralized Autonomous Organization<\/span><\/a><span data-v-f87c67ca=\"\">, issued in 2017, which warned that crypto tokens and other digital assets could meet the definition of securities under U.S. law, and would likely require the same sort of registration and disclosures as stocks and bonds. <\/span>","<span data-v-f87c67ca=\"\">But the SEC also argues that Coinbase used to hold the same position the agency does, even before that report was issued.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The SEC also notes that Coinbase published its own document on securities law and cryptocurrencies in December 2016, indicating that for most tokens, parts of the Howey test, a legal precedent used in the U.S. to determine if an asset is a security investment, “are likely to be met.\"<\/span>"],"hashtag":["COINBASE","CONGRESS","LAWSUITS","SEC"]}