{"summary":"Crypto exchange Bitfinex has been gripped by New York Attorney General&#x27;s court order, but its partner exchange Ethfinex, which facilitates trading of","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/24228\/ethfinex-co-founder-says-other-exchanges-with-u-s-operations-will-face-regulator-scrutiny","publishDate":"2019-05-21T18:10:53","id":682,"type":null,"title":"Ethfinex co-founder says other exchanges with U.S. operations will face regulator scrutiny","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Crypto exchange Bitfinex has been gripped by New York Attorney General's court order, but its partner exchange Ethfinex, which facilitates trading of ERC-20 tokens, said Bitfinex won't be the only exchange caught in the regulatory cross-hairs.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">“At the end of the day, yes I do think although Bitfinex is in the headlines right now, there will be others and I think probably the level of scrutiny Bitfinex gets is the same as what other exchanges, at least in the U.S. or with any U.S. nexus, are getting,” said Ethfinex co-founder Will Harborne.<\/span>","<span data-v-f87c67ca=\"\">Harborne contended that regulators are making something of a statement by going after Bitfinex, and that other exchanges can expect similar treatment if their business activities are viewed as concerning by regulators acting without definitive guidance. To be clear, Harbone isn't suggesting that other exchanges will face scrutiny for the same reasons as Bitfinex inasmuch that other exchanges will be at the mercy of regulators' concerns as they hash out what is acceptable and what isn't — and who should have authority over the nascent market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Partly what is going on right now is the power play between various U.S. regulators over who has the real jurisdiction to go after [exchanges], particularly exchanges that don’t even operate in the U.S., and the New York AG would like to say that it was them,” said Harborne. “That’s what makes it a very public statement and go for Bitfinex. I think others (law enforcement agencies) are also making a similar move under the scenes. That’s understandable, but I don’t think it is just going to be Bitfinex.”&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bitfinex and Ethfinex, which operate under the same leadership, rolled out their IEO platform Tokinex today amidst an ongoing battle with the New York Attorney General's office. Bitfinex was sued by the NYAG less than a month ago for allegedly failing to disclose relevant documents and covering up a loss of $850 million.<br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"$850 million","content":"MONEY"},{"type":"Harborne","content":"PERSON"},{"type":"Ethfinex","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Bitfinex","content":"PERSON"},{"type":"New York AG","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"New York Attorney General","content":"ORGANIZATION"},{"type":"Will Harborne","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"Harbone","content":"PERSON"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}