{"summary":"A hacker has identified a security vulnerability in General Bytes&#x27; bitcoin ATMs that enabled them to read and decrypt API keys.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221032\/bitcoin-atm-maker-general-bytes-shuts-down-its-cloud-service-after-hacker-identifies-vulnerability-enabling-them-to-decrypt-api-keys","publishDate":"2023-03-19T06:04:54","id":6824,"type":null,"title":"Bitcoin ATM maker General Bytes shuts down its cloud service after hacker identifies vulnerability","category":["COMPANIES"],"content":["A hacker was able to upload their own Java application onto General Bytes' bitcoin ATMs, which enabled the attacker to read and decrypt API keys to access funds on exchanges and hot wallets.","The company <a href=\"https:\/\/generalbytes.atlassian.net\/wiki\/spaces\/ESD\/pages\/2885222430\/Security+Incident+March+17-18th+2023\" data-v-f87c67ca=\"\">posted<\/a> a high severity security incident warning on its Confluence page on March 18. The attacker was able to access the database, download user names and passwords as well as turn off two-factor authentication and scan terminal event logs for instances when customers scanned private keys in the ATM, the company said.","\"We urge all our customers to take immediate action to protect their funds and personal information and carefully read the security bulletin listed here,\" the company <a href=\"https:\/\/twitter.com\/generalbytes\/status\/1637192687160897537?s=20\" data-v-f87c67ca=\"\">said<\/a> on Twitter.","The hacker was able to mount the attack by uploading their own Java application and running it remotely, using the master service interface, which is used in bitcoin ATMs to upload videos to the server, the company said.","Both General Bytes' cloud service and standalone servers were compromised and as a result the company is closing down its cloud service.","\"It is theoretically (and practically) impossible to secure a system granting access to multiple operators at the same time where some of them are bad actors,\" said the company in the post, adding that it would provide support to customers to transition from the cloud service to running their own standalone servers.","The company published steps to implement the security fix. It also said that in multiple audits that had been completed since 2021 it had not identified this vulnerability.","The security post also listed the crypto addresses and APIs used by the attacker. On-chain analysis <a href=\"https:\/\/blockchair.com\/bitcoin\/address\/bc1qfa8pryacrjuzp9287zc2ufz5n0hdthff0av440\" data-v-f87c67ca=\"\">shows<\/a> a balance of 56 bitcoin ($1.5 million) in the bitcoin wallet linked to the attacker.&nbsp;","This isn't the first time General Bytes has experienced an attack. In August of last year, a hacker was <a href=\"https:\/\/www.theblock.co\/post\/164741\/hacker-stole-from-clients-making-deposits-on-bitcoin-atms\" data-v-f87c67ca=\"\">able<\/a> to steal funds from customers making deposits at its bitcoin ATMs. In that case, the hacker modified the crypto settings of two-way machines with their wallet settings and the invalid payment address setting.","General Bytes website <a href=\"https:\/\/www.generalbytes.com\/en\/\" data-v-f87c67ca=\"\">states<\/a> that it has sold more than 15,000 machines in over 140 countries.","The company didn't immediately respond to request for comment.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/exploits\/stolen-funds-by-blockchain\/embed\" title=\"Stolen Funds by Blockchain\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Java","content":"LOCATION"},{"type":"$1.5 million","content":"MONEY"},{"type":"August of last year","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"March 18","content":"DATE"},{"type":"ATM","content":"ORGANIZATION"}],"hashtag":["BITCOIN","EXPLOITS","HACKS","SECURITY FIRMS"],"authors":["Kari McMahon","The Block"]}