{"summary":"Aztec Network will use the funds to build out its encryption architecture and to double its team of 40 people.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195482\/a16z-leads-100-million-raise-for-web3-privacy-firm-aztec-network","publishDate":"2022-12-15T12:46:54","id":6829,"type":null,"title":"a16z leads $100 million raise for web3 privacy firm Aztec Network","category":["DEALS"],"content":["The privacy-focused web3 firm Aztec Network raised $100 million in Series B funding led by the web3 investment firm a16z.&nbsp;","Aztec aims to fully encrypt the Ethereum blockchain to add more privacy and reduce computational redundancy. The firm will use the fresh raise to develop encrypted architecture that lets individuals properly use blockchains without exposing identifying information. In addition, Aztec intends to double its current team of 40 people, the co-founders told TechCrunch.","\"What we’re building is a revolutionary piece of technology that transforms how we interact with each other online, in which the end user is the customer, rather than the product,\" Aztec Network CEO Zac Williamson said in a statement. \"End-to-end encrypted blockchains protect individuals, obviating the need for centralized financial systems.\"&nbsp;","Additional participants in the round include&nbsp;A Capital, King River, Variant, SV Angel, Hash Key, Fenbushi and AVG, according to a company <a href=\"https:\/\/medium.com\/@aztecnetwork\/aztec-raises-100-million-to-build-encrypted-ethereum-dd5062ba949c\" data-v-f87c67ca=\"\">blog<\/a> post.","Aztec Network was originally founded in 2017 by Zac Williamson and Joe Andrews.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aztec Network","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Joe Andrews","content":"PERSON"},{"type":"King River","content":"LOCATION"},{"type":"Fenbushi","content":"PERSON"},{"type":"Hash Key","content":"PERSON"},{"type":"Zac Williamson","content":"PERSON"}],"hashtag":["SERIES B"],"authors":["MK Manoylov","The Block"]}