{"summary":"The Hong Kong General Chamber of Commerce urges the government to embrace Chinese yuan-linked stablecoin issuance in the upcoming budget.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276367\/hong-kong-chamber-commerce-yuan-stablecoin-budget","publishDate":"2024-02-07T03:31:57","id":6832,"type":null,"title":"Hong Kong chamber of commerce calls for yuan stablecoin issuance in budget suggestions","category":["STABLECOINS"],"content":["<span data-v-f87c67ca=\"\">The Hong Kong General Chamber of Commerce has submitted proposals for the local government’s upcoming budget, suggesting policymakers allow the issuance of Chinese yuan-linked stablecoins.<\/span>","<span data-v-f87c67ca=\"\">The HKGCC said in a <\/span><a href=\"https:\/\/www.chamber.org.hk\/en\/media\/press-releases_detail.aspx?ID=3762\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\"> on Tuesday that the business organization urges the government to consider allowing the issuance of yuan-linked stablecoins or stablecoins backed by a basket of various fiat currencies, including the yuan, Hong Kong dollar, or U.S. dollar.<\/span>","<span data-v-f87c67ca=\"\">The organization also called on the government to explore the possibility of a “Virtual Asset Connect Scheme,” initially with a daily limit of around HK$20 billion ($2.5 billion). The HKGCC did not provide further details on the scheme in its proposal.<\/span>","<span data-v-f87c67ca=\"\">The suggestions from the HKGCC come as the Financial Secretary is scheduled to deliver the budget address later this month. “A key focus of the submission is dedicated to retaining and attracting talent and businesses,” the HKGCC said in the statement. “This is crucial to enhance Hong Kong’s overall operating environment and ease the acute manpower shortages.”<\/span>","<span data-v-f87c67ca=\"\">In December, the Hong Kong Monetary Authority said in a joint <\/span><a href=\"https:\/\/www.info.gov.hk\/gia\/general\/202312\/27\/P2023122700279.htm?fontSize=1\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">consultation paper<\/span><\/a><span data-v-f87c67ca=\"\"> with the Financial Services and the Treasury Bureau that a stablecoin issuer would be required to obtain a license from the authorities “if it issues a stablecoin that references the value of one or more fiat currencies in Hong Kong.” The two-month consultation is set to end at the end of this month.<\/span>","<span data-v-f87c67ca=\"\">Christopher Hui, Secretary for Financial Services and the Treasury, wrote in a blog <\/span><a href=\"https:\/\/www.fstb.gov.hk\/en\/blog\/blog020224.htm\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\"> last week that the HKMA plans to introduce a sandbox to explore stablecoin issuance with key industry players in the region.<\/span>","<span data-v-f87c67ca=\"\">Eddie Yue, chief executive of the HKMA, <\/span><a href=\"https:\/\/www.theblock.co\/post\/269301\/hkma-chief-stablecoins-could-become-interface-between-traditional-finance-and-crypto\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said in December<\/span><\/a><span data-v-f87c67ca=\"\"> that stablecoins could become the interface between traditional finance and the virtual asset market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“In a scenario where stablecoins become one of the preferred payment options by the general public, we should reasonably expect further integration between the digital payment ecosystem and the real economy, and whether the stablecoin is indeed ‘stable’ will then become ever more important,” Yue added.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"end of this month","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Secretary","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Eddie Yue","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$2.5 billion","content":"MONEY"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"HK$20 billion","content":"MONEY"},{"type":"Treasury Bureau","content":"ORGANIZATION"},{"type":"Secretary for Financial Services","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Hong Kong General Chamber of Commerce","content":"ORGANIZATION"},{"type":"Christopher Hui","content":"PERSON"},{"type":"HKMA","content":"ORGANIZATION"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}