{"summary":"Binance’s venture arm is betting another $5 million on Ultiverse, a metaverse gaming startup.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139246\/binance-doubles-down-on-ultiverse-with-another-5-million-investment","publishDate":"2022-03-25T02:29:20","id":6833,"type":null,"title":"Binance doubles down on Ultiverse with another $5 million investment","category":["GAMING AND METAVERSE"],"content":["One week after leading a $4.5 million seed investment in Ultiverse, Binance’s venture arm is betting another $5 million on the metaverse gaming startup. &nbsp;","Binance Labs, the crypto exchange’s venture capital and incubation unit, announced its initial investment in Ultiverse in <a href=\"https:\/\/www.binance.com\/en\/blog\/ecosystem\/binance-labs-leads-seed-round-for-ultiverse-to-expand-metaverse-offerings-in-bnb-chain-ecosystem-421499824684903590\" data-v-f87c67ca=\"\">a blog post<\/a> published on March 18. DeFiance Capital co-led the raise, with Three Arrows Capital and SkyVision Capital also investing. This initial $4.5 million raise took the form of a sale of Ultiverse’s governance token MXS.","But now Binance Labs has chosen to invest another $5 million in the equity of Ultiverse, according to both companies.&nbsp;Nicole Zhang, director at Binance Labs, told The Block that the additional investment was made to ensure the firms are “bonded in a way that we have some sort of a say in terms of the team’s future path.”","After the initial seed round was announced, Binance Labs stated that the proceeds would go towards building a social gaming metaverse with BNB Chain. BNB Chain is Binance’s blockchain — a network that, <a href=\"applewebdata:\/\/E913CAA4-BE60-40A1-A5CA-7762C5E60093\/BNB%20Chain%20will%20embrace%20large-scale%20applications,%20including%20GameFi,%20SocialFi%20and%20the%20Metaverse\" data-v-f87c67ca=\"\">after a rebrand in February<\/a>, has been built for the kind of large-scale applications offered by gaming and metaverse projects.&nbsp;Indeed, Zhang claimed BNB Chain is the only ecosystem capable of supporting gaming projects at scale.","“The moment you get really popular, you crash the entire blockchain,” she said of blockchain-based games. “We’re the only blockchain currently that has that kind of capacity.”","Zhang added that Binance has first-hand experience of these capacity issues. She pointed to BinaryX and Cryptoblades as examples of games that have gained significant traction and caused issues for Binance’s blockchain&nbsp;in the past, and said crypto giant has recently added extra capacity to deal with similar situations.&nbsp;","“Now we are super ready. We have the capacity,” Zhang said.","There are currently more than 100 people working on Ultiverse’s games under the stewardship of CEO Frank Ma, an entrepreneur. The startup’s first game Endless Loop will be a 3D massively multiplayer online role-playing game (MMORPG) with play-to-earn functionality. It is slated for a full launch in the first quarter of 2023.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the first quarter of 2023","content":"DATE"},{"type":"SkyVision Capital","content":"ORGANIZATION"},{"type":"Binance Labs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 18","content":"DATE"},{"type":"Nicole Zhang","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"$4.5 million","content":"MONEY"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Three Arrows Capital","content":"ORGANIZATION"},{"type":"Ultiverse","content":"LOCATION"},{"type":"Frank Ma","content":"PERSON"},{"type":"Zhang","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"$5 million","content":"MONEY"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}