{"summary":"China is still Binance&#x27;s biggest market despite the country&#x27;s crypto ban, with the exchange having over $90 billion in volume in May, the WSJ reported citing internal documents.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242693\/binance-china-biggest-market-90-billion-volume","publishDate":"2023-08-02T01:40:19","id":6838,"type":null,"title":"China still Binance&#x27;s biggest market with $90 billion in volume despite crypto ban: WSJ ","category":["COMPANIES"],"content":["Binance still gets most of its business from China despite crypto being illegal in the country.","The crypto exchange had over $90 billion worth of spot and futures trading volume from China in May, <a href=\"https:\/\/www.wsj.com\/articles\/crypto-is-illegal-in-china-binance-does-90-billion-of-business-there-anyway-2a0af975?mod=e2tw\" data-v-f87c67ca=\"\">the Wall Street Journal reported<\/a>, citing an internal platform at Binance named \"Mission Control.\" Most of that volume came from futures trading.","Binance's total combined spot and bitcoin futures trading volume was over $670 billion in May, according to <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>. After China, Binance's biggest markets are South Korea, Turkey and Vietnam, per the WSJ report.","Binance had 5.6 million China-based users as of May, of which 911,650 were active, according to Mission Control. Overall, the crypto exchange has a total of <a href=\"https:\/\/www.theblock.co\/post\/230140\/binance-capital-connect-vip\" data-v-f87c67ca=\"\">over&nbsp;128 million&nbsp;users<\/a>. As of January, the WSJ said about 100,000 Chinese users at Binance were classified as \"politically exposed persons\" (PEPs), citing internal company documents and a former employee. PEPs are individuals who hold influential positions in government offices or have close associations with such individuals. Traditional financial institutions often subject PEPs to enhanced scrutiny to prevent money laundering and illicit financial activities. Binance, however, has reportedly been lenient in verifying the identities of its users in China.","Binance was founded in Shanghai in July 2017. Soon after, in September 2017, China banned crypto&nbsp;initial coin offerings&nbsp;(ICOs) and blocked Binane's website. In 2021, China's central bank declared all crypto-related transactions illegal, resulting in a widespread ban. But Binance assisted Chinese users in bypassing restrictions by directing them to visit various websites with Chinese domain names before redirecting them to its main website, the WSJ reported, citing an internal document laying out the procedure. This internal document circulated within Binance before the 2021 ban, but after China blocked the exchange’s website in 2017.&nbsp;","Binance did not immediately respond to The Block's request for comment. A company spokesperson told the WSJ that the Binance.com website is blocked in China and is not accessible to China-based users, without commenting further.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Vietnam","content":"LOCATION"},{"type":"Turkey","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"WSJ","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Binance named \"Mission Control","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"$90 billion","content":"MONEY"},{"type":"Mission Control","content":"ORGANIZATION"},{"type":"Binane","content":"ORGANIZATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"July 2017","content":"DATE"},{"type":"$670 billion","content":"MONEY"},{"type":"Shanghai","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"September 2017","content":"DATE"}],"hashtag":["BINANCE"],"authors":["Yogita Khatri","The Block"]}