{"summary":"Hong Kong lawmaker Johnny Ng invited Vitalik Buterin to visit after the Ethereum co-founder raised concerns over its crypto-friendliness.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251167\/vitalik-buterin-hong-kong-crypto-friendliness-concerns","publishDate":"2023-09-15T05:53:59","id":6842,"type":null,"title":"Vitalik Buterin invited to visit Hong Kong after raising concerns over its crypto-friendliness","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">Hong Kong Legislative Council member Johnny Ng responded to comments from <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.93%\n    <\/span><\/a> <!----><\/span><\/span> co-founder Vitalik Buterin raising concerns about the stability of the crypto climate in Hong Kong, inviting him to visit the city.<\/span>","“I respect his right to speak, but at the same time, I think he does not understand the situation in Hong Kong.” Ng <a href=\"https:\/\/x.com\/Johnny_nkc\/status\/1702484459793395940?s=20\" data-v-f87c67ca=\"\">wrote<\/a> on X (formerly Twitter) today. “Hong Kong's policies and laws will not change overnight. All relevant strategies and regulations have gone through major social consensus and complete procedures. Therefore, I can tell Mr. Buterin that Hong Kong's policies are very stable.”","Ng added he was happy to coordinate with relevant institutions and enterprises to demonstrate Hong Kong’s crypto environment.","Speaking at the Web3 Transitions Summit in Singapore yesterday, Buterin said cryptocurrency projects looking to build operations in Hong Kong should <a href=\"https:\/\/www.theblock.co\/post\/251042\/vitalik-buterin-crypto-hong-kong\" data-v-f87c67ca=\"\">weigh up the stability of the government’s crypto-friendliness<\/a>.","“If any crypto project wants to make Hong Kong their home, they would want to have some confidence — not just that it’s friendly now but that it will continue to be friendly years from now when all kinds of unknown, regulatory and political and other kinds of events are going to happen,” Buterin said.","“Obviously, it's very friendly now. But the big question that I'm asking and that I think anyone is asking is: how stable is the level of friendliness?,” he added. “That's where I feel the challenge lies.”","Responding to Vitalik’s acknowledgment that he did not understand Hong Kong well and even less about the \"complicated interaction between Hong Kong and mainland China,\" Ng reiterated that Hong Kong is a special administrative region of China with its own procedure for formulating policies and laws.","“Under ‘one country, two systems’, Hong Kong has legislative power. Every policy or legislation in Hong Kong goes through a period of discussion, including government policy writing, public consultation, discussions in multiple committees of the Legislative Council and the General Assembly, etc,” Ng stated.","The lawmaker also pushed back on Vitalik’s comment that the interaction between Hong Kong and China was complicated. “The central government has always expressed support for the development of 'one country, two systems' in Hong Kong,” Ng said. “Hong Kong has room to formulate policies on virtual assets and welcomes global compliant companies to develop in Hong Kong.”","Buterin has yet to respond to the invitation publicly.","Hong Kong has diverged from the Chinese mainland's crackdown on cryptocurrency trading and mining, <a href=\"https:\/\/www.theblock.co\/post\/228743\/hong-kong-crypto-bank-accounts\" data-v-f87c67ca=\"\">welcoming crypto firms to the region and encouraging banks to collaborate<\/a> with them this year.","However, earlier this week, <a href=\"https:\/\/www.scmp.com\/tech\/tech-trends\/article\/3234523\/hong-kongs-crypto-adoption-ranking-drops-one-spot-chainalysis-report-city-tries-woo-virtual-asset\" data-v-f87c67ca=\"\">Hong Kong’s Chainalysis crypto adoption ranking fell<\/a> to 47th from 46th in 2022, with mainland China also dropping one spot to 11th.","In December, Hong Kong's Legislative Council <a href=\"https:\/\/www.theblock.co\/post\/193209\/hong-kong-amendment-vasp-licensing-regime\" data-v-f87c67ca=\"\">approved an amendment<\/a> to introduce a comprehensive licensing system for virtual asset service providers, which came into effect in June.","Commenting on the broader Asia region, having visited India, Japan, Taiwan, Palau and Singapore over the past few weeks, Buterin told The Block at yesterday's event, “the amount of activities I've seen in those spaces from every one of those countries that I mentioned has just really impressed me — just seeing the sheer number of people working on ZK and privacy solutions. It’s been impressive.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Kong Legislative Council","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Johnny Ng","content":"PERSON"},{"type":"Legislative Council","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"General Assembly","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Japan","content":"LOCATION"},{"type":"Taiwan","content":"LOCATION"},{"type":"Buterin","content":"PERSON"},{"type":"-0.93%","content":"PERCENT"},{"type":"Singapore","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Palau","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":["ASIAN PARLIAMENTS","ASIAN REGULATION","ETHEREUM","VITALIK BUTERIN"],"authors":["James Hunt","The Block"]}