{"summary":"In a recent high-profile panel discussion, experts from Barclays, the Bank of England, Goodwin Procter, Ripple, and Worldpay from FIS exchanged views on key aspects of the digital asset revolution, including the rise of CBDCs, the role of stablecoins and tokenized bank deposits. It was emphasized that while each approach holds unique potential benefits, such as improving financial inclusion or enhancing payment infrastructure, they also present distinct regulatory challenges. The panel highlighted the necessity of creating regulatory environments that accommodate these new forms of digital assets and ensure a level-playing field.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246519\/staying-ahead-of-the-curve-the-future-of-fintech-and-crypto-regulation","publishDate":"2023-08-21T07:53:00","id":6845,"type":null,"title":"Staying Ahead of the Curve: The Future of FinTech and Crypto Regulation","category":["SPONSORED"],"content":["<iframe loading=\"lazy\" title=\"Worldpay Event July\" width=\"500\" height=\"281\" src=\"https:\/\/www.youtube.com\/embed\/elaa4Sal8E0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"allowfullscreen\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">\"<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">From chokepoint to turning point: the digital assets and FinTech industries are at a crossroads.<\/span><\/i><span data-v-f87c67ca=\"\">\"<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Anatole Baboukhian, Head of Public Policy, Worldpay from FIS&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a recent high-profile panel discussion, experts from Barclays, the Bank of England, Goodwin Procter, Ripple, and Worldpay from FIS exchanged views on key aspects of the digital asset revolution, including the rise of CBDCs, the role of stablecoins and tokenized bank deposits. It was emphasized that while each approach holds unique potential benefits, such as improving financial inclusion or enhancing payment infrastructure, they also present distinct regulatory challenges. The panel highlighted the necessity of creating regulatory environments that accommodate these new forms of digital assets and ensure a level-playing field.<\/span>","<b data-v-f87c67ca=\"\">Central Bank Digital Currencies<\/b>","<span data-v-f87c67ca=\"\">\"<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">There is a real opportunity here to get rid of one of the biggest [...] inefficiencies in traditional finance, which is cross border payments. The public sector getting involved in this [via CBDCs] as well as the private sector is a very good thing.<\/span><\/i><span data-v-f87c67ca=\"\">\"<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Andrew Whitworth, Policy Director, Ripple<\/span>","<span data-v-f87c67ca=\"\">Central banks are increasingly exploring the potential of CBDCs. These are digital forms of national fiat currency that are issued by a country's central bank. CBDCs can support a resilient payments system by establishing a direct channel to make payments between individual citizens, enterprises, and other economic stakeholders. CBDCs can also be used as building blocks for more efficient cross-border payments, which, according to the panelists, is among the most promising use cases for this technology. <\/span>","CBDCs offer a range of potential benefits Source: Bank of England.","<span data-v-f87c67ca=\"\">The technical specifications and features for CBDCs may <\/span><a href=\"https:\/\/www.annualreviews.org\/doi\/abs\/10.1146\/annurev-economics-051420-020324?casa_token=0ssvdMwmWwsAAAAA:O18ZQTRw423EGU_Iczoux2KoK_yp87Tf7p8D6lmI25XBhc7W3Snr9-7Vu2tf7LrXphpB1OT1gz_9\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">vary greatly<\/span><\/a><span data-v-f87c67ca=\"\">, and therefore, overall CBDC characteristics and use cases depend on design decisions by the jurisdiction they are issued in.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Examples of design choices include<\/span>","<span data-v-f87c67ca=\"\">Panelists agreed that countries developing CBDCs must take key design considerations into account, depending on their economic landscape and policy objectives. <\/span><span data-v-f87c67ca=\"\">Closely related to CBDCs in terms of functionality as a means of payment are stablecoins and tokenized bank deposits.<\/span>","<b data-v-f87c67ca=\"\">Stablecoins and Tokenized Bank Deposits<\/b><b data-v-f87c67ca=\"\">&nbsp;<\/b>","<span data-v-f87c67ca=\"\">“<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">MiCA is very stablecoin-focused because regulators want to prevent the circulation of stablecoins from unregulated organizations.<\/span><\/i><span data-v-f87c67ca=\"\">” <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Nicole Sandler, Head of Digital Policy, Barclays<\/span>","<span data-v-f87c67ca=\"\">Stablecoins are cryptocurrencies that are pegged to a stable asset, typically a currency like the dollar or the euro. The peg can be maintained through different mechanisms, including reserves of real-world assets (e.g., USDC), algorithmic mechanisms (e.g., Terra’s failed UST), or crypto collateral (e.g., the ETH-backed LUSD). <\/span><span data-v-f87c67ca=\"\">One key use case of stablecoins is to shield market participants from the volatility of crypto assets, while allowing them to take advantage of the benefits of cryptocurrencies, including speed and lower transaction costs.<\/span>","Cryptoassets are (still) very volatile Source: S&amp;P Global","<span data-v-f87c67ca=\"\">The variety of stablecoin types and their increasing adoption rate has garnered the attention of regulators due to their potential for impacting traditional finance and the banking system. <\/span><span data-v-f87c67ca=\"\">T<\/span><span data-v-f87c67ca=\"\">his has made stablecoins and their issuers a target for increased regulatory oversight. For example, the EU's Markets in Crypto Assets (MiCA) regulation creates a regulatory framework for cryptoassets and stablecoins. Although there are concerns regarding unclarities in MiCA (such as, e.g., potentially different licensing requirements for virtual asset service providers across member jurisdictions), it is generally regarded as a net positive development for the industry. This applies especially in contrast to the \"<\/span><a href=\"https:\/\/www.reuters.com\/article\/bc-finreg-sec-regulation-by-enforcement-idUSKBN2HX1OR\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">regulation by enforcement<\/span><\/a><span data-v-f87c67ca=\"\">\" approach in the U.S., or complete bans on cryptocurrency in places like China.<\/span>","<span data-v-f87c67ca=\"\">“<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">I'm in favor of [licensing], because I think it brings legitimacy.<\/span><\/i><span data-v-f87c67ca=\"\">” <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Manoj Peiris, Legal Counsel, Regulation and Compliance, Worldpay from FIS<\/span>","<span data-v-f87c67ca=\"\">An interesting alternative to CBDCs and stablecoins are tokenized bank deposits (TBDs). TBDs are traditional bank deposits represented as digital tokens on a blockchain network. Bank deposits as a backing mechanism may reduce market volatility and inspire greater confidence in TBDs as they are backed by underlying assets of a bank that is typically covered by deposit insurance schemes. Furthermore, TBDs could address regulatory bottlenecks since they may be largely in scope of extant bank regulatory frameworks. TBDs may therefore be in a sweet spot to address a ‘stablecoin trilemma’, which forces regulators to choose between i) stifling innovation, ii) allowing stablecoin issuers to become the new banks, or iii) financial stability risks.<\/span>","The Stablecoin Trilemma Source: S&amp;P Global Ratings","<span data-v-f87c67ca=\"\">Panelists discussed how future payment methods, whether CBDCs, stablecoins or TBDs, must focus on building frictionless ‘payment journeys’, whilst ensuring safety and consumer protection such as privacy. They touched on the necessity to foster digital payments and the wider digital asset ecosystem within an internationally harmonized regulatory framework for digital assets.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Fostering Interoperability and Developing Harmonized Regulatory Frameworks<\/b>","<span data-v-f87c67ca=\"\">\"<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Regulation isn't designed to suppress innovation. Instead, it's intended to ensure that innovation occurs in a way that effectively fulfills its purpose, including safeguarding consumer protection and maintaining financial stability.<\/span><\/i><span data-v-f87c67ca=\"\">\" <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Amy Lee, Head of FinTech Hub, Bank of England.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Regulations provide markets with a stable framework, which aims to strike the right balance between stability, consumer protection, and innovation. Indeed, panelists exchanged views on the impact of critical failures such as FTX in the crypto space, and the potential regulatory gaps which may stifle innovation and represent a barrier to entry for legitimate market participants. Regulatory standards can also address fragmentation and lack of interoperability across various technology architectures, which may have a detrimental impact on adoption and scaling.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A major challenge to interoperability <\/span><b data-v-f87c67ca=\"\">within jurisdictions<\/b><span data-v-f87c67ca=\"\"> lies in interfacing DLT and existing payment infrastructures. Such integrations may require significant overhaul of the current payment infrastructure, which is often complex and rigid. To overcome this challenge, panelists discussed the need for central banks, FinTech and traditional financial institutions to collaborate and support legal and regulatory approaches that would enable the integration of DLT within existing payment systems and (upcoming) CBDCs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One promising example mentioned during the panelists’ discussion is how open banking, whose introduction in the United Kingdom benefited from regulatory standard setting, may address interoperability issues <\/span><b data-v-f87c67ca=\"\">within jurisdictions<\/b><span data-v-f87c67ca=\"\">. At the same time, it may also offer potential opportunities for addressing trust and digital identity issues when combined with DLT.<\/span>","<span data-v-f87c67ca=\"\">Furthermore, regulation may help overcome fragmentation in international payments and foster interoperability by promoting consistency and harmonization <\/span><b data-v-f87c67ca=\"\">between jurisdictions<\/b><span data-v-f87c67ca=\"\">. By aligning rules and standards, regulators can create a level playing field for all market participants. This, in turn, encourages collaboration between different systems, such as CBDCs, commercial bank money, and the wider digital asset ecosystem. Internationally harmonized regulations, balancing innovation with consumer protection and financial stability, are essential to deliver the best outcomes for payment users and fully harness the potential of digital assets.<\/span>","<span data-v-f87c67ca=\"\">Regulators may opt for the same regime as traditional financial players, arguing that the same activity should be subject to the same regulation. Alternatively, regulators may develop more tailored regulatory regimes to address specific facets that come with the new technologies, such as decentralization and pseudonymity. As DLT integrates into traditional finance, it is key for policymakers to align the level of regulatory oversight of crypto firms with that of traditional financial services providers.<\/span>","<span data-v-f87c67ca=\"\">\"<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">There is a clear thrust to bring digital assets into mainstream financial services regulation. However, new regulation needs to take into account that digital assets are technologically different from TradFi assets and desired policy outcomes may be accomplished without a one size fits all approach.<\/span><\/i><span data-v-f87c67ca=\"\">\" <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Arvin Abraham, Partner, Goodwin Procter.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In conclusion, panelists agreed that the promise of digital assets like CBDCs, stablecoins, and TBDs will be realized through a balance of innovation, regulation, and global cooperation. As emphasized by Anatole Baboukhian, this is a turning point where important choices will be taken for the future development of digital money and payments. Realizing the promise of a digitized financial future will require an orchestrated effort, sustained dialogue, and a shared vision that nurtures innovation while maintaining stability.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Head of Public Policy","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"FIS","content":"ORGANIZATION"},{"type":"FinTech Hub, Bank of England","content":"ORGANIZATION"},{"type":"Developing Harmonized Regulatory Frameworks","content":"ORGANIZATION"},{"type":"Amy Lee","content":"PERSON"},{"type":"Arvin Abraham","content":"PERSON"},{"type":"S&amp;P Global","content":"ORGANIZATION"},{"type":"Policy Director","content":"ORGANIZATION"},{"type":"Ripple","content":"LOCATION"},{"type":"Partner","content":"ORGANIZATION"},{"type":"euro","content":"ORGANIZATION"},{"type":"United Kingdom","content":"LOCATION"},{"type":"Goodwin Procter","content":"PERSON"},{"type":"FinTech","content":"ORGANIZATION"},{"type":"Central Bank Digital Currencies","content":"ORGANIZATION"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"Anatole Baboukhian","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Head of Digital Policy","content":"ORGANIZATION"},{"type":"DLT","content":"ORGANIZATION"},{"type":"S&amp;P Global Ratings","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Andrew Whitworth","content":"PERSON"},{"type":"Nicole Sandler","content":"PERSON"},{"type":"UST","content":"ORGANIZATION"},{"type":"Tokenized Bank Deposits","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Barclays","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}