{"summary":"“It’s easy to suggest, ‘Oh there’s no institution, there’s no individual, it’s just code, you can’t regulate that, it’s self-effectuating,’ but that really is the wrong set of questions,&quot; CFTC Chair Rostin Behnam said on a podcast.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231299\/cftc-chair-rostin-behnam-defi-crypto-regulated-just-code","publishDate":"2023-05-18T06:54:16","id":6849,"type":null,"title":"CFTC chair: DeFi crypto exchanges will be regulated even if &#x27;just code&#x27;","category":["POLICY"],"content":["Commodity Futures Trading Commission Chair Rostin Behnam said decentralized crypto exchanges will be regulated either by the CFTC or the Securities and Exchange Commission even if they are based on “self-effectuating” protocols that are “just code,”<a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-05-18\/cftc-chair-rostin-behnam-discusses-crypto-regulation-on-odd-lots\" data-v-f87c67ca=\"\"> in a conversation for Bloomberg’s Odd Lots podcast<\/a>.","Behnam was asked on the podcast — recorded at <a href=\"https:\/\/agm.isda.org\/agenda\/\" data-v-f87c67ca=\"\">the annual ISDA meeting in Chicago<\/a> a few days ago — whether regulation could apply to DeFi exchanges, which can operate autonomously or with very little human involvement. Many people in crypto believe that because some market platforms can exist in a completely decentralized way that they are therefore immune to regulation or impossible to regulate via law. That’s not so, Behnam said.","“It’s easy to suggest, ‘Oh there’s no institution, there’s no individual, it’s just code, you can’t regulate that, it’s self-effectuating,’ but that really is the wrong set of questions. It’s really about what are U.S. customers being offered and exposed to? And who is either the individual or group of individuals who set up that entity, that code, to offer those products?” he said.","“We’ll continue bringing bad actors to account here,” he added.","He did suggest there is one area where crypto will be lightly regulated by the CFTC: markets where tokens exist purely as a cash substitute and not as any other kind of asset, because the CFTC doesn’t regulate cash markets. “I don’t have legal authority to police cash crypto markets. We do have this very limited authority within the CFTC to police cash markets if there is fraud or manipulation,” he said.","<a href=\"https:\/\/www.theblock.co\/post\/223015\/cftc-sues-binance\" data-v-f87c67ca=\"\">The CFTC made headlines in March when it sued Binance<\/a>, a centralized exchange, for allegedly doing business in the U.S. without registering as a commodities exchange. It also accused Binance of turning a blind eye to financial crime and money laundering occurring on its platform. Binance denies the allegations.","Odd Lots host Tracy Alloway suggested listeners should read the <a href=\"https:\/\/www.theblock.co\/post\/223143\/binance-details-from-cftc-complaint\" data-v-f87c67ca=\"\">CFTC's complaint<\/a> for its entertainment value because of the number of internal messages it cites in which Binance executives appear to admit they are engaged in wrongdoing.","“It was not our intent to entertain,” Behnam said, while adding, “nothing surprises me anymore… we know there’s a lot of individuals out there who don’t want to comply with the law, choose to evade the law or don’t know about the law — and sometimes they will do things that are surprising, including writing stuff down.”","He went further to dispel the notion that crypto is in some way not currently covered by U.S. law.","“We have to drive our legal analysis from legal precedent,” he said, referring to the Howey Test which defines whether a contract involves a security. “And that, for better or for worse, is the driving force that sits as the foundation of our legal analysis to this day for digital assets when we think about that question of securities versus commodities.”","He did suggest that there was one undecided area of law around crypto: The question of whether a token can be launched as a security (if for instance the company launching it makes promises about its future utility or value) that might later devolve into a commodity when it becomes traded on decentralized exchanges purely as a cash substitute.","“There are many characteristics about the digital financial assets which are common to traditional financial assets but there are certainly many characteristics which are unique and, I think, demand a unique set of thoughts and policy ideas about how and whether we should regulate it,” he said.","A new token might initially involve the “pooling of capital to start a project,” which would make it look like a security, he said. But it’s an open question as to what happens when such a token “flips from being a security to being a commodity due to decentralization.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Commodity Futures Trading Commission Chair Rostin Behnam","content":"ORGANIZATION"},{"type":"Chicago","content":"LOCATION"},{"type":"Behnam","content":"PERSON"},{"type":"ISDA","content":"ORGANIZATION"},{"type":"Tracy Alloway","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["CFTC"],"authors":["Jim Edwards","The Block"]}