{"summary":"Ethereum core developers are planning to launch a new testnet called Holesky in September to improve smart contract testing experience.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246335\/ethereum-developers-to-debut-new-testnet-holesky-next-month","publishDate":"2023-08-18T13:49:40","id":6851,"type":null,"title":"Ethereum developers to debut new testnet &#x27;Holesky&#x27; next month","category":["CRYPTO ECOSYSTEMS"],"content":["In a bid to improve the testing environment and address supply challenges for ether on testnets, Ethereum core developers are planning to launch a new testnet called Holesky next month, as discussed in a <a href=\"https:\/\/www.youtube.com\/watch?v=DyAtbK2MQG4\" data-v-f87c67ca=\"\">meeting<\/a> yesterday.","The upcoming test network, initially referred to as <a href=\"https:\/\/www.theblock.co\/post\/214974\/ethereum-core-developers-plan-new-testnet-called-holli\" data-v-f87c67ca=\"\">Holli<\/a>, aims to offer enhanced testing support for developers working on the Ethereum network.","Test networks, or testnets, serve as clone blockchains that allow developers to deploy applications and identify bugs before launching them on the mainnet. Currently, Ethereum’s ecosystem has two primary testnets: Goerli and Sepolia. However, Goerli is reportedly going to be deprecated soon, paving the way for the introduction of Holesky.","Holesky may have a potential supply of over 1 billion testnet ETH. This substantial supply is designed to address challenges that developers face when acquiring testnet ETH on the primary test networks. The large amount of testnet ETH will enable easier access for testing Ethereum smart contracts.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Goerli","content":"PERSON"},{"type":"Sepolia","content":"LOCATION"},{"type":"1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Holli","content":"LOCATION"}],"hashtag":["ASSETS","DAOS","ETHEREUM","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}