{"summary":"Robinhood Crypto operates like a real-time casino with constant chatter, constant trading, and occasionally fierce moves in cryptocurrencies -- one of the single most volatile asset classes on earth even before the company came along. Finally, in the 19-page &quot;Robinhood Crypto User Agreement&quot;, we learn that &quot;commission free&quot; crypto trading isn&#x27;t actually free.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/316\/robinhood-crypto-the-fine-print-behind-free-crypto-trading","publishDate":"2018-09-10T15:13:41","id":6853,"type":null,"title":"Robinhood Crypto: The fine print behind &#x27;free&#x27; crypto trading","category":["CRYPTOCURRENCY"],"content":["Robinhood is an incredibly impressive company: pioneering unlimited free trading in the U.S., first of stocks, then of cryptocurrencies, and options. Founded in 2013, Robinhood has grown unto a behemoth with a $5.6 billion valuation, <a href=\"https:\/\/www.crunchbase.com\/organization\/robinhood#section-overview\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">$539 million raised<\/a>,&nbsp;<a href=\"https:\/\/www.cnbc.com\/2018\/09\/06\/robinhood-is-on-the-path-to-ipo-and-is-searching-for-a-cfo.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">more than 5 million customers<\/a>&nbsp;and copycat services such as banking giant J.P. Morgan Chase's <a href=\"https:\/\/www.chase.com\/personal\/investments\/you-invest\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">You Invest<\/a>. Against this backdrop of incredible growth, the company is <a href=\"https:\/\/www.cnbc.com\/2018\/09\/06\/robinhood-is-on-the-path-to-ipo-and-is-searching-for-a-cfo.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">seeking a CFO<\/a> as it prepares for an IPO in the medium term.","A public offering will certainly bring greater scrutiny, particularly about how it is able to turn a profit while offering commission-free trading. As the old saying goes: \"If you're not paying, you are the product.\" This is the case for Robinhood customers, whose <a href=\"https:\/\/startupsventurecapital.com\/robinhoods-exceptionally-clever-business-model-arbitraging-privacy-776663d4d855\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">order flow data is sold to giant exchanges &amp; market makers<\/a> who themselves profit via high frequency trading. In other words, Robinhood order data is used by large institutions to allow them to profit on order information ahead of retail customers, sometimes called \"front running.\" Note that this is a common brokerage business model -- Robinhood is not unique in this respect -- but the company does a clever job of marketing the \"free\" aspect of its product while downlaying the potential \"slippage.\" <a id=\"jump\" data-v-f87c67ca=\"\"><\/a>That slippage is the difference between the best market price available and the price a Robinhood customer pays for the security or cryptocurrency purchased.","Which brings us to the topic of <a href=\"https:\/\/crypto.robinhood.com\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Robinhood Crypto<\/a>, a separate entity from Robinhood Financial, where the other assets the company makes available are traded. Launched in early 2018, Robinhood Crypto had a <a href=\"https:\/\/www.investopedia.com\/news\/over-1-million-sign-waitlist-join-robinhood-crypto-trading\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">waitlist of more than 1 million users<\/a> prior to launch. Robinhood launched the crypto trading product with the \"<a href=\"https:\/\/www.youtube.com\/watch?v=233RzfqYExI\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Don't Sleep<\/a>\" campaign, which has received more than 2.9 million views on YouTube. The theme is pulsing energy, a Tron-style, game-like design and the implication that crypto trading is a 24\/7 affair. (And that's true, crypto markets have no fixed trading day, nor do they take holidays.)","Today, Robinhood Crypto operates like a real-time casino with constant chatter, constant trading, and occasionally fierce moves in cryptocurrencies -- one of the single most volatile asset classes on earth even before the company came along. When new tokens are added to Robinhood Crypto, <a href=\"https:\/\/twitter.com\/mdudas\/status\/1035864848637284352\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">as Dogecoin ($DOGE) recently was<\/a>, the price can spike and decline in rapid succession. While this occurs, the level of discourse in the crypto ticker pages shows many unsophisticated investors are participating. It is clear that some are simply pushing buttons, inspired by the rapid moves of cryptocurrencies and Robinhood's marketing of cryptocurrency trading as a frictionless, commission-free game.","More than simply introducing users to cryptocurrency as if it is a game, Robinhood Crypto is also taking liberties with the very concept of cryptocurrency ownership. A fundamental premise of crypto is that it allows people to practice financial sovereignty via ownership of their cryptocurrency \"private keys.\" As&nbsp;<a href=\"https:\/\/www.investopedia.com\/terms\/p\/private-key.asp\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Investopedia<\/a>&nbsp;describes it:&nbsp;<em data-v-f87c67ca=\"\">\"A&nbsp;private key&nbsp;is a sophisticated form of cryptography that allows a user to access his or her&nbsp;cryptocurrency. A&nbsp;private key&nbsp;is an integral aspect of&nbsp;bitcoin&nbsp;and altcoins, and its security make up helps to protect a user from theft and unauthorized access to funds.\"&nbsp;<\/em>","In the case of Robinhood Crypto, <a href=\"https:\/\/twitter.com\/ummjackson\/status\/1037017046209388544\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">it is not clear who holds the private key<\/a> to the cryptocurrency the user has purchased -- and that user is therefore not in control of the cryptocurrency or able to directly access it. Furthermore, users are not actually able to withdraw or move their cryptocurrency, so the crypto offering at Robinhood has been reduced to only one high-risk use case: speculation. There is no opportunity for usage as a medium of exchange in payments or to securely and safely store the cryptocurrency oneself. In fact, Robinhood Crypto violates its own description of cryptocurrency in the fine print on its site: <em data-v-f87c67ca=\"\">\"Cryptocurrency is a digital representation of value that functions as a medium of exchange, a unit of account, or a store of value, but it does not have legal tender status.\"<\/em>","Finally, in the 19-page \"Robinhood Crypto User Agreement\", we learn that \"commission free\" crypto trading isn't actually free:","<em data-v-f87c67ca=\"\">c) Rebates and Pass-On of Fees. I understand that RHC reserves the right to pass on any fees charged by any Cryptocurrency exchanges, brokers, market-makers, liquidity providers, or other types of Cryptocurrency counterparties, trading venues, or intermediaries (each, a “Market Actor”), including in connection with the withdrawal of Cryptocurrencies to an external wallet or any fees related to any enhanced due diligence related to my RHC Account. I further understand that RHC may receive activity-based rebates from Market Actors in relation to Cryptocurrency transactions.<\/em>","Well then, it looks as if this \"free\" trading could get quite expensive for Robinhood Crypto users, although they'll never know the true cost of their buy and sell trades, as the associated fees will be blended into the purchase or sale prices in the form of the aforementioned slippage.&nbsp;","To sum up: While Robinhood has done remarkable things in terms of user growth, trading volume, product innovation, and the reduction of friction in introducing new users to financial products, their Robinhood Crypto product leaves a lot to be desired. It violates many of the core principles of cryptocurrency ownership: basic financial sovereignty through holding private and public keys, the ability to move funds at will, transparent pricing, and the absence of legalese unrelated to the cryptocurrency itself. Robinhood Crypto has a long way to go before it becomes a true force of good in the cryptocurrency ecosystem, teaching and enabling people to interact with cryptocurrency's fundamental properties from the moment they dive in.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Investopedia","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"RHC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"$5.6 billion","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"$DOGE","content":"MONEY"},{"type":"$539 million","content":"MONEY"},{"type":"Robinhood Financial","content":"ORGANIZATION"},{"type":"J.P. Morgan Chase","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Dudas","The Block"]}