{"summary":"Nexo and troubled crypto lender Vauld have ended talks of a potential deal, according to a source and an email obtained by The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197894\/nexo-vauld-deal-terminated","publishDate":"2022-12-26T05:29:54","id":6856,"type":null,"title":"Nexo terminates potential deal with troubled crypto lender Vauld","category":["FINANCE FIRMS"],"content":["Crypto lender Nexo, which was in talks with rival crypto lender Vauld to potentially acquire it, has terminated the discussions.","The potential deal has fallen through after six long months of dialogue, according to a source with direct knowledge of the matter and an email obtained by The Block. The email, dated today and sent by Vauld founder and CEO Darshan Bathija to the firm's creditors, states that \"our discussions with Nexo have unfortunately not come to fruition.\"","Nexo and Vauld had been in <a href=\"https:\/\/www.theblock.co\/post\/155790\/nexo-vauld-offer-potential-acquisition\" data-v-f87c67ca=\"\">discussions<\/a> for a potential deal since early July when Vauld <a href=\"https:\/\/www.theblock.co\/post\/155679\/vauld-halts-withdrawals-hires-legal-financial-advisors\" data-v-f87c67ca=\"\">halted<\/a> client withdrawals after facing a severe liquidity crunch. At the time, Nexo had entered into a 60-day exclusive due diligence agreement with Vauld to potentially acquire it. It then <a href=\"https:\/\/www.theblock.co\/post\/177233\/nexo-once-again-extends-due-diligence-period-on-potential-vauld-deal\" data-v-f87c67ca=\"\">extended<\/a> the due diligence period twice. Now, the two parties have formally ended the discussions.","\"We have since sought a mutual agreement with Nexo to terminate the existing exclusivity arrangements and we are continuing our active engagement with the shortlisted fund managers in developing a viable strategy that would best serve the creditors' interests,\" Bathija's email reads.","The source said there are a couple of reasons why the potential deal didn't go through. These include Vauld losing a significant amount in the collapsed Terra ecosystem, Indian authorities <a href=\"https:\/\/www.theblock.co\/post\/163329\/indian-authorities-freeze-46-million-worth-of-vaulds-assets\" data-v-f87c67ca=\"\">seizing<\/a> its assets, funds <a href=\"https:\/\/www.theblock.co\/post\/188021\/troubled-crypto-lender-vauld-has-10-million-stuck-on-ftx-source\" data-v-f87c67ca=\"\">stuck<\/a> on the bankrupt crypto exchange FTX and huge loan receivables from <a href=\"https:\/\/www.theblock.co\/post\/193616\/amber-group-vauld-ceo-counterparty1-a-130-million\" data-v-f87c67ca=\"\">Amber Group<\/a>. Further, Vauld has many customers in the U.S. and Nexo recently <a href=\"https:\/\/www.theblock.co\/post\/192204\/crypto-lender-nexo-says-its-leaving-the-u-s-cites-regulatory-dead-end\" data-v-f87c67ca=\"\">announced<\/a> its plans to leave the country, so the potential deal did not make sense for Nexo, the source added.","Before terminating the talks, Nexo presented the potential deal terms to Vauld twice. However, Vauld and its creditors weren't happy with those terms. Bathija's email reads:","\"The Revised Nexo Proposal does not allow for a debt tender offer by way of a Reverse Dutch Auction (the 'RDA') which would give creditors an early exit option. We had explained to them that based on our engagement with creditors, an early exit option is vital to the success of any proposed restructuring. Unfortunately, the benefits offered under the Revised Nexo Proposal, such as an early credit withdrawal, are set at a threshold which in our view is generally unachievable by the majority of creditors.\"","\"Given the above, we believe that the Revised Nexo Proposal would not be in the best interests of all the creditors,\" the email continues.","Vauld and its creditors also believe that, in discussions, Nexo wasn't transparent enough about its financial condition. \"Nexo has failed to respond to requests for a comprehensive due diligence exercise on them, including a solvency assessment of Nexo, or otherwise what measures may be able to be agreed upon to provide creditors with a greater level of assurance in the event of Nexo's insolvency,\" Bathija's email reads.","Now that the potential Nexo deal has fallen through, Vauld's proposed restructuring plan is to select a fund manager to manage customer assets.&nbsp;\"In our search process, we identified six potential candidates as fund managers, received proposals from four, and following initial discussions and review, shortlisted two potential fund managers.\" Bathija's email reads. \"We are in the course of developing the proposed strategies and mandate, in consultation with creditors with a view to agreeing terms with the final shortlisted fund manager candidate in the new year.\"","Vauld's financial hole currently stands at $98 million, per the email. \"Overall, in the period from 1 August 2022 when we last provided an update of the financial position of the Company, the net deficit or 'gap' has increased from USD81m to USD98m,\" the email reads. \"This is largely a result of a loss in value due materially to: (i) FTX bankruptcy proceedings where we had a net exposure of USD8.8m; and (ii) depreciation of token prices relative to stables by approximately 24%.\"","Vauld has until Jan. 20 to sort its financial issues, having received another credit protection extension last month. The firm, however, has applied for yet another extension, according to a document obtained by The Block. \"We have the hearing for the moratorium extension on 17th January 2023,\" the document reads.","Nexo, Vauld and its financial advisor, Kroll, did not immediately respond to The Block's requests for comment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Darshan Bathija","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"RDA","content":"ORGANIZATION"},{"type":"Kroll","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Amber Group","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nexo","content":"ORGANIZATION"},{"type":"Jan. 20","content":"DATE"},{"type":"January 2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"$98 million","content":"MONEY"},{"type":"1 August 2022","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Vauld","content":"ORGANIZATION"},{"type":"Bathija","content":"ORGANIZATION"},{"type":"24%","content":"PERCENT"},{"type":"Nexo","content":"PERSON"}],"hashtag":["CRYPTO BANKS AND LENDERS"],"authors":["Yogita Khatri","The Block"]}