{"summary":"Photographs obtained by The Block show the moment Zhu was arrested at Changi Airport in Singapore, after reports first surfaced last week.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255133\/photos-show-the-moment-3ac-co-founder-su-zhu-was-arrested-in-singapore","publishDate":"2023-10-06T10:21:44","id":6857,"type":null,"title":"Photos show 3AC co-founder Su Zhu&#x27;s arrest in Singapore","category":["COMPANIES"],"content":["Su Zhu, co-founder of the collapsed crypto hedge fund Three Arrows Capital, was arrested at Changi Airport in Singapore last week while trying to leave the country.","Teneo, liquidator of the fund, <a href=\"https:\/\/www.theblock.co\/post\/253618\/three-arrows-capital-co-founder-su-zhu-apprehended-in-singapore-bloomberg\" data-v-f87c67ca=\"\">said in a statement on September 29<\/a> that it had received a committal order against Zhu after he failed to cooperate with the firm’s liquidation investigation, despite an earlier Singapore court order compelling him to do so. The order sentenced Zhu to four months in prison. Singapore police <a href=\"https:\/\/www.reuters.com\/world\/asia-pacific\/singapore-police-confirm-arrest-36-year-old-man-responding-query-reported-arrest-2023-10-05\/\" data-v-f87c67ca=\"\">yesterday confirmed the arrest of a “36-year-old man”<\/a> on September 29, without identifying him, according to Reuters.","Photographs obtained by The Block show the moment Zhu was arrested.","<span data-v-f87c67ca=\"\">Su Zhu was apprehended in Changi airport last week. Image: The Block Pro<\/span>","The photographs appear to show Zhu being stopped by two policemen before being escorted through the airport.","<span data-v-f87c67ca=\"\">The moment Su Zhu was arrested. Image: The Block Pro.<\/span>","Lawyers for Zhu did not immediately respond to a request for comment. A Singapore police spokesperson declined to comment further on the arrest, while a spokesperson for Teneo referred to the company’s initial statement on the matter.","<span data-v-f87c67ca=\"\">Su Zhu was escorted through the airport by police. Image: The Block Pro.<\/span>","In its prime, Three Arrows was one of the largest hedge funds in crypto, reportedly managing some $10 billion in assets and investing in everything from liquid tokens to startup equity and NFTs. It <a href=\"https:\/\/www.cnbc.com\/2022\/07\/02\/crypto-hedge-fund-three-arrows-files-for-chapter-15-bankruptcy.html\" data-v-f87c67ca=\"\">filed for bankruptcy in July 2022<\/a>, just a few months after the crypto markets were thrown into turmoil by the collapse of the Terra ecosystem. The fund <a href=\"https:\/\/www.theblock.co\/post\/158169\/three-arrows-capital-3ac-creditors-list-3-5-billion-crypto-affidavits\" data-v-f87c67ca=\"\">owed creditors at least $3.5 billion<\/a>, according to documents filed at the time.","Since then, Three Arrows’ liquidators, Teneo, have repeatedly complained about a lack of cooperation from Zhu and his fellow co-founder Kyle Davies. In January, <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-01-05\/3ac-liquidators-demand-documents-from-founders-via-twitter\" data-v-f87c67ca=\"\">Teneo tried to subpoena the pair via a post on X (formerly Twitter)<\/a>. More recently, in June, reports surfaced that Teneo <a href=\"https:\/\/www.theblock.co\/post\/236717\/3ac-liquidators-seek-1-3-billion-from-zhu-davies-bloomberg\" data-v-f87c67ca=\"\">aimed to recover $1.3 billion from Davies and Zhu<\/a>, after alleging they were responsible for losses equal to that sum due to racking up debt in the months immediately before Three Arrows’ collapse.","In its statement on Zhu’s arrest, Teneo said that Davies had also been committed to prison for 4 months, but added that his “whereabouts remain unknown at this point in time.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kyle Davies","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1.3 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"Su Zhu","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Teneo","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"last week","content":"DATE"},{"type":"Changi","content":"LOCATION"},{"type":"September 29","content":"DATE"},{"type":"Davies","content":"PERSON"},{"type":"Changi Airport","content":"LOCATION"},{"type":"$3.5 billion","content":"MONEY"},{"type":"July 2022","content":"DATE"}],"hashtag":["SU ZHU","THREE ARROWS CAPITAL"],"authors":["Ryan Weeks","The Block"]}