{"summary":"Play-to-earn giant Merit Circle (MC) will pay out $1,750,000 to competitor Yield Guild Games (YGG).","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152064\/yield-guild-games-walks-away-from-merit-circle-with-10-times-its-investment-following-ouster","publishDate":"2022-06-15T06:57:10","id":6858,"type":null,"title":"Yield Guild Games walks away from Merit Circle with 10 times its investment following ouster","category":["COMPANIES"],"content":["Play-to-earn giant Merit Circle (MC) will pay out $1,750,000 to Yield Guild Games (YGG) as a settlement, after the company’s decentralized autonomous organization (DAO) voted to remove YGG as an investor.","Arguably competitors in the space, both Merit Circle (MC) and YGG are play-to-earn-focused DAOs that provide scholarship opportunities for players, as well as making investments in online play-to-earn games.","The payout, which will protect both sides from future litigation, is ten times Philippines-based YGG’s initial investment, according to a <a href=\"https:\/\/medium.com\/yield-guild-games\/merit-circle-dao-yield-guild-games-joint-statement-628d2e933fcf\" data-v-f87c67ca=\"\">joint statement<\/a> released on Tuesday. The refund includes an investment from YGG founder Gabby Dizon’s personal fund, Nifty — which the DAO had initially voted to return, alongside cancelling YGG’s s0-called Simple Agreement for Future Tokens (SAFT).","MC and YGG described the deal as “a solution that still satisfies the will of the Merit Circle community, but was also acceptable to YGG.”","YGG was one of several investors in the fledgling DAO in September last year. However, it became the <a href=\"https:\/\/www.theblock.co\/post\/148428\/merit-circle-yield-guild-games-dao-dispute\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">center of debate at the MC DAO<\/a> after it was criticized by a member named HoneyBarrel for failing to prove its value to the community beyond financial support.","Both YGG and MC disputed this characterization and claimed that YGG had provided support, including introductions to other investors.","The case has attracted attention as a landmark test for the absolute power of DAO decision making. Both within and without the DAO, concerns were raised about the precedent the decision could set and the legal and reputational implications of removing an investor.","As a result, Merit Circle has hinted that changes in governance could be on the way.","“We have a lot of governance improvements in mind that should avoid explosive situations like this in the future and will mitigate the potential doubts parties could have around agreements with DAOs. Of course, we will also rely on input from the community and from external stakeholders to come to the best models,” it said in a statement.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gabby Dizon","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"September last year","content":"DATE"},{"type":"Nifty","content":"ORGANIZATION"},{"type":"Simple Agreement for Future Tokens (SAFT)","content":"ORGANIZATION"},{"type":"MC DAO","content":"ORGANIZATION"},{"type":"Philippines","content":"LOCATION"},{"type":"Yield Guild Games (YGG","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$1,750,000","content":"MONEY"},{"type":"Merit Circle","content":"ORGANIZATION"},{"type":"YGG","content":"ORGANIZATION"}],"hashtag":["DAOS"],"authors":["Callan Quinn","The Block"]}