{"summary":"Coinbase announced Tuesday that it served as the primary execution services partner for MicroStrategy’s bitcoin purchase\nThe purchase took several days and was executed by leveraging humans and algorithms to limit the market impact","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/86155\/coinbase-says-it-was-behind-microstrategys-425-million-bitcoin-purchase","publishDate":"2020-12-01T06:59:51","id":686,"type":null,"title":"Coinbase says it was behind MicroStrategy&#x27;s $425 million bitcoin purchase","category":["The Block"],"content":["Business software company MicroStrategy became crypto's newest darling after it announced it would allocate a sizable chunk of its balance sheet to bitcoin as part of a treasury reserve strategy. In the background, a more familiar face pulled the strings for the purchase: Coinbase.&nbsp;","In an announcement shared with The Block, the San Francisco-based cryptocurrency exchange said its Coinbase Prime unit which spans prime brokerage and over-the-counter (OTC) trading services — served as the primary execution services partner for Virginia-based MicroStrategy's $425 million bitcoin <a href=\"https:\/\/www.theblockcrypto.com\/linked\/77796\/microstrategy-buys-more-bitcoin\" data-v-f87c67ca=\"\">purchase<\/a>&nbsp;made earlier this year.&nbsp;","\"Using our advanced execution capabilities, leading crypto prime brokerage platform, and OTC desk, we were able to buy a significant amount of bitcoin on behalf of MicroStrategy and did so without moving the market,\" Brett Tejpaul, head of institutional sales, custody and prime services at Coinbase, said in a blog post.&nbsp;","Count this as a big win for Coinbase. Across the crypto market, firms are scrambling to link up with new market entrants—including firms looking to buy bitcoin themselves or offer crypto services to their clients. Fidelity Digital Assets, DCG's Genesis Global Trading, and BitGo are among the other firms offering execution and prime-like services in the nascent market.&nbsp;","The trend of public companies adding bitcoin to their balance sheets has become a popular talking point among crypto enthusiasts, who say the move could help propel bitcoin to new highs. Jack Dorsey's Square provides another example, having purchased $50 million worth of bitcoin as <a href=\"https:\/\/www.theblockcrypto.com\/post\/80175\/jack-dorsey-square-purchases-50-million-worth-of-bitcoin\" data-v-f87c67ca=\"\">part of a bet<\/a> that it could become a \"more ubiquitous currency in the future.\"","\"We hope that this is an inflection point for the cryptoeconomy and look forward to helping more corporate companies and institutions looking to diversify their capital allocation strategies with crypto,\" Tejpaul said of recent news by Square and MicroStrategy.","A Coinbase spokeswoman declined to comment on the firm's pipeline for similar deals.&nbsp;","As for MicroStrategy, its bitcoin purchase took place in two tranches with the first $250 million investment being executed over 5 days, according to documents shared with The Block. Coinbase's algorithms chopped up MicroStrategy's order into 200,000 fills.&nbsp;","Here's the relevant passage from the case study:","\"Coinbase’s Time Weighted Average Price (TWAP) algorithm will complete an order over a specified window of time, splitting the main order into many smaller orders that are then sent to different pools of liquidity, using the Smart Order Router to choose the best pool. In the example of the MicroStrategy execution, while the human traders input a few hundred orders, the algorithms converted that into close to 200,000 child fills, where the average fill size was less than 0.3 BTC.\"","Executing the order over several days helped reduce the impact of the order on the market and translated into savings of about $4.25 million, according to the company.&nbsp;"],"hashtag":["COINBASE"]}