{"summary":"The local government of Buenos Aires has launched a digital ID service that utilizes blockchain for storing marriage and death certificates.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253417\/city-of-buenos-aires-launching-blockchain-based-digital-id-service","publishDate":"2023-09-28T10:38:15","id":6861,"type":null,"title":"City of Buenos Aires launching blockchain-based digital ID service","category":["COMPANIES"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The local city government of Buenos Aires is launching a digital ID service that utilizes blockchain technology for storing marriage and death certificates.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The decentralized digital identity protocol uses an application built on Matter Labs’ zkSync Era rollup. Known as QuarkID, it relies partly on technology from the Argentina-based startup&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/extrimian.io\/about-us\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Extrimian<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Starting in October, Buenos Aires residents can download the QuarkID wallet and claim personal identification documents, such as birth and marriage certificates.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The local government plans to roll out more official identity-related credentials on QuarkID over the coming months. In November, proof of income, certificates of academic attendance, and benefit claim documents will also become available to for download and storage on the QuarkID wallet.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"The City of Buenos Aires is driving this new digital trust framework to function as a public good, returning control over data to individuals and enabling a more agile and secure digital interaction between government, companies, and people,\" Buenos Aires City Government Secretary of Innovation Diego Fernandez said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Extrimian COO Pablo Mosquella told The Block the documents are issued as \"verified credentials\" from the Buenos Aires local government platform to the personal ID wallet.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">He added that these credentials are stored on the person's device and only accessible to the user who can present proof of these credentials to be verified in different situations.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"During the first stage, the document will work as an alternative to the original paper documents, not a replacement,\" he added. \"Eventually, everything will move to digital.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The Extrimian COO said the local government has initiated legislative changes necessary to grant digital credentials the same equivalence as their physically signed counterparts.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"These laws are currently in development and are expected to be discussed by the next term,\" he added.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Buenos Aires City Government Secretary of Innovation Diego Fernandez","content":"ORGANIZATION"},{"type":"Argentina","content":"LOCATION"},{"type":"Pablo Mosquella","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Buenos Aires","content":"PERSON"},{"type":"Buenos Aires","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"The City of Buenos Aires","content":"ORGANIZATION"},{"type":"November","content":"DATE"}],"hashtag":["DATA PROVIDERS","DECENTRALIZED INFRASTRUCTURE","IDENTITY","SIDECHAINS","WALLET MAKERS","WALLETS","ZKSYNC"],"authors":["Brian McGleenon","The Block"]}