{"summary":"DeFi and traditional finance are converging, says Robert Leshner of Compound.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110591\/fintechs-are-hungry-for-defi-yields-says-compounds-robert-leshner","publishDate":"2021-07-06T15:05:16","id":6862,"type":null,"title":"Fintechs are hungry for DeFi yields, says Compound’s Robert Leshner","category":["THE BLOCK"],"content":["<i data-v-f87c67ca=\"\">Episode <\/i><strong data-v-f87c67ca=\"\">37<\/strong><i data-v-f87c67ca=\"\"> of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Compound Labs’ Founder Robert Leshner.<\/i>","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on&nbsp;<\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Play<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"5f2f303b3c3e2c2b1f2b373a3d33303c343c2d262f2b30713c3032\">[email&nbsp;protected]<\/a>.<\/i>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/eventussystems.com\/\" data-v-f87c67ca=\"\">Eventus<\/a>, <a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>, and Exodus<\/strong><\/span>","<span data-v-f87c67ca=\"\">Eventus is the leading global provider of multi-asset class trade surveillance, transaction monitoring and market risk solutions. Eventus offers a powerful, award-winning trade surveillance platform that is easy to deploy, customize and operate. Eventus is proven in the most complex, high-volume and real-time environments and supports many of the industry’s leading crypto exchanges including Coinbase, Gemini, ErisX and OSL. The company’s rapidly growing client base relies on Eventus’ responsive support and product development teams to overcome its most pressing regulatory challenges.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Kraken<\/strong><\/span>","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit&nbsp;<\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\">&nbsp;to get started&nbsp;today.<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Exodus<\/strong><\/span>","<br data-v-f87c67ca=\"\">\nIt’s no secret that investors find themselves in a low-yield environment. And that backdrop is forcing investors to explore DeFi.","That’s part of the logic behind the recently announced <a href=\"https:\/\/medium.com\/compound-finance\/announcing-compound-treasury-for-businesses-institutions-83d4484fb82e\" data-v-f87c67ca=\"\">Compound Treasury<\/a>, a new company that allows investors and firms to access the yields on Compound without engaging directly with the blockchain.","On this episode of The Scoop, Compound Labs’ Founder Robert Leshner unpacks how institutional flows hunting for yield are finding their way to DeFi — and how he sees Compound Treasury playing a role facilitating that migration.","“Compound Treasury is what we hope is an embodiment of this, where we can source the yields from the compound protocol and pass it to institutional customers and abstract away all of the nuance of interacting with smart contracts and managing the flow of funds.\" Leshner predicted that over time, DeFi and traditional finance will become more intertwined.","“I think over time, yields will converge,” he noted. Until then, fintechs will look to services like Compound Treasury to juice yields which have been on a downward spiral. Wealthfront — which at one point offered a return of 2.5% APY for cash accounts — currently offers 0.10% APY. Robinhood offers 0.30%.","There are a number of factors that are playing into high DeFi yields, including the existence of “natural risk premiums” in DeFi compared to traditional technical risks in legacy finance. He posited how DeFi could prove to be more resilient against risk relative to traditional financial systems in the long run:","“You have what I would call ‘natural risk premiums’ that exist in DeFi that don't exist in traditional markets. The best being technical risk. So technical risk is the risk that the protocol itself just breaks in an unexpected way. Now, longterm, DeFi is safer infrastructure than anything in traditional markets. The reason being a smart contract when it's immutable, if it works, it'll work forever.”&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"0.10%","content":"PERCENT"},{"type":"0.30%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"2.5%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"OSL","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"Compound Treasury","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Robert Leshner","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["ETHEREUM","FINTECH"],"authors":["Frank Chaparro","The Block"]}