{"summary":"Bitget, the derivatives exchange operator, today announced a new $100 million venture capital fund focused on web3.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225504\/bitget-venture-fund","publishDate":"2023-04-10T05:29:07","id":6863,"type":null,"title":"Bitget unveils $100 million venture fund with focus on Asia","category":["DEALS"],"content":["Bitget, the derivatives exchange operator, today announced a new $100 million venture capital fund focused on web3. The fund will invest globally, with a focus on Asia.","“We strive to support financial innovation in Asia and believe that our platform can act as a reliable, convenient, and secure link between the worlds of DeFi and CeFi. Our team of analysts has already outlined the criteria for project selection and will adhere to them strictly,” said Gracy Chen, managing director of Bitget, in a statement.","The Seychelles-based exchange operator has been busy lately as it pursues a so-called \"go beyond derivatives” strategy. It acquired crypto wallet BitKeep in March after <a href=\"https:\/\/www.theblock.co\/post\/221903\/bitget-bitkeep-acquisition-investment\" data-v-f87c67ca=\"\">investing<\/a> an additional $30 million in the startup. It then <a href=\"https:\/\/www.theblock.co\/post\/224702\/dragonfly-invests-bitget\" data-v-f87c67ca=\"\">took a $10 million strategic investment<\/a> from Dragonfly Capital, the crypto investment firm, on April 4.","A spokesperson for Bitget said the $100 million is an “initial investment” and that the fund is expected to grow over time. It is also “self-funded, leveraging Bitget’s healthy financial status,” they said in response to questions from The Block. They also confirmed that the $100 million has already been allocated to the venture fund.&nbsp;","Bitget is also hoping to team up with venture capital firms Dragonfly Capital, SevenX Ventures, DAO Maker, ABCDE Capital and Foresight Ventures as potential partners. Its spokesperson said these firms “will share their financial and technological expertise, and provide advisory support.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"Gracy Chen","content":"PERSON"},{"type":"April 4","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Bitget","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"$10 million","content":"MONEY"},{"type":"Dragonfly Capital","content":"ORGANIZATION"},{"type":"Seychelles","content":"LOCATION"},{"type":"$30 million","content":"MONEY"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}