{"summary":"Mauve, the compliance-first DEX, attracted some big names to its $15 million round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218447\/coinbase-ventures-brevan-howard-among-early-backers-of-compliant-dex-mauve","publishDate":"2023-03-09T09:56:05","id":6874,"type":null,"title":"Coinbase Ventures, Brevan Howard among early backers of compliant DEX Mauve","category":["CRYPTO INFRASTRUCTURE"],"content":["Violet, which offers compliance and identity infrastructure for decentralized finance, launched its compliance-focused decentralized exchange, Mauve.","Coinbase Ventures and Brevan Howard joined the DEX's $15 million funding round, <a href=\"https:\/\/www.businesswire.com\/news\/home\/20230309005046\/en\/Violet-Launches-Mauve-the-World\" data-v-f87c67ca=\"\">according<\/a> to the firm's announcement. Ethereal Ventures, BlueYard Capital and Balderton were among the other backers.&nbsp;","\"Mauve is a direct response to the FTX fallout,\" Co-Founder Markus Maier said, adding the collapse \"significantly eroded trust in crypto globally\" through the exchange's misappropriation of funds.","Maier said the future of the space is dependent on the continued adoption of non-custodial crypto exchanges, something he says Mauve offers.&nbsp;","Mauve users can trade without having to surrender custody of their assets. \"This means no one can access, much less steal, any retail or institutional investor's funds, helping to restore confidence among market participants,\" Maier said.&nbsp;","The DEX requires all users to pass \"rigorous compliance checks\" to give compliance-conscious users confidence when migrating to DeFi. The platform claims to be fully transparent and audited by smart contracts; it also offers users instant settlement without intermediaries.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DEX","content":"ORGANIZATION"},{"type":"Markus Maier","content":"PERSON"},{"type":"$15 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Maier","content":"PERSON"},{"type":"Brevan Howard","content":"PERSON"},{"type":"BlueYard Capital","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BRIAN ARMSTRONG","COINBASE","DEXS"],"authors":["Adam Morgan McCarthy","The Block"]}