{"summary":"Cryptocurrency advocates and regulators can agree on one thing: Congress should pass new laws for crypto. Whether Congress can agree on what those laws look like remains to be seen. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175080\/despite-call-for-congress-to-act-new-crypto-laws-look-unlikely-this-year","publishDate":"2022-10-05T14:00:38","id":6881,"type":null,"title":"Despite call for Congress to act, new crypto laws look unlikely this year","category":["POLICY"],"content":["Cryptocurrency advocates and regulators can agree on one thing: Congress should pass new laws for crypto.&nbsp;<span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">Whether Congress can agree on what those laws look like remains uncertain.&nbsp;<\/span>","The Financial Stability Oversight Council (FSOC) recommended lawmakers pass legislation to establish a federal framework for stablecoins, allow for direct oversight of cryptocurrency spot markets in bitcoin and ether, and pass legislation to increase transparency around digital asset projects. The report sets an ambitious agenda for lawmakers.&nbsp;","Stablecoin legislation is arguably the furthest down the road, due to the algorithmic stablecoin crash earlier this year and bipartisan talks that have lasted several months. The bill in its current form appears stalled, though Monday's report could restore momentum.","The council reiterated a call for Congress to create clearer rules for stablecoins, with Treasury Secretary Janet Yellen, who chairs the council, stating that FSOC's recommendations were meant to, \"provide a strong foundation for policymakers as we work to mitigate the risks of digital assets while realizing the potential benefits.\"&nbsp; &nbsp;","Rep. Patrick McHenry, R-N.C., has used his position as the top Republican on the House Financial Services Committee to negotiate a bill to do what FSOC recommended. He again called on Tuesday for congressional action on digital assets and took a shot at U.S. Securities and Exchange Commission Chair Gary Gensler’s approach to the industry. &nbsp;","“As I said last month, reports are not a substitute for legislative clarity,” McHenry wrote on Twitter. “It’s clear that congressional action is the only way to end Gary Gensler's regulation by enforcement, and ensure the digital asset ecosystem can thrive here in the U.S.”&nbsp;<span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","FSOC’s encouragement of congressional action to create a new framework around stablecoins appears likely to restore tailwinds for legislation in Congress. It’s unclear, however, if the current bill that McHenry and House Financial Services Committee Chair Maxine Waters, D-Calif., have negotiated will be the one to do so.","But they also saw a possibility of the committee voting on a bill in order for Waters and her fellow Democrats to put down a marker, even if the bill does not yet become law. House Democrats may only hold a majority for the next few months, since Republicans are favored to win control of the House in midterms.","McHenry has led negotiations with Waters, but may want to put his own stamp on the bill if, or when, he becomes chair. But he has spoken to the reality of <a href=\"https:\/\/www.google.com\/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwjIjaGyucn6AhUvg4kEHSg7B34QFnoECBUQAQ&amp;url=https%3A%2F%2Fwww.theblock.co%2Fpost%2F171497%2Fsenior-republican-stablecoins-bill-will-have-multiple-authors&amp;usg=AOvVaw394_qu7iwqvJAiK6rsp-eI\" data-v-f87c67ca=\"\">working with Democrats, the Senate and a Democratic administration<\/a> regardless of the results of the midterms.&nbsp;","Another factor that could add urgency to progress on a bill this year: The possible departure of Yellen after the midterms. Treasury staff lend expertise to the negotiations, and a new secretary might have their own view of how to approach the issue, reshuffling the deck.","“If anything pushes it, it’s the rumors about Yellen leaving,” said one industry advocate of a scenario where the bill becomes law this year.&nbsp;","Spokespeople for both Waters and McHenry did not respond to requests for comment.&nbsp;","Perianne Boring, CEO of the Chamber of Digital Commerce, noted time is running out for lawmakers to advance digital asset legislation before Congress’s two-year session ends.&nbsp;<span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">“While Congress has legislation at various stages that may address some of these concerns, the prospects for the necessary comprehensive proposals for digital assets before the next Congressional session are dimming,” Boring said in a statement to The Block.<\/span>","Even if a stablecoins bill advances to a vote before the whole House, legislation from that side of the Capitol often faces tough odds in the Senate.","A Republican aide familiar with the effort said that top Senate Banking Committee Republican Pat Toomey (Pa.) is not supportive of the current stablecoin draft circulated two weeks ago, which would also hurt the bill’s chances of becoming law during this Congress. Though Toomey retires at the end of the current session, committee Chair Sherrod Brown, D-Ohio, hasn’t appeared to actively engage with the stablecoin effort.","“I think we’ll see a deeper divide in the Senate,” on the issue, the industry advocate said.","The FSOC report also recommended giving markets regulators direct authority over cryptocurrencies that aren’t considered the same asset class as stocks or bonds. This means the two largest ones, bitcoin and ether, which have been treated more as commodities under U.S. law, could also <a href=\"https:\/\/www.google.com\/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwiR_on7u8n6AhUWj4kEHbXvDkgQFnoECAwQAQ&amp;url=https%3A%2F%2Fwww.theblock.co%2Fpost%2F170481%2Fbill-broadening-cftcs-crypto-power-could-get-vote-soon-author-says&amp;usg=AOvVaw39eZtIn4I_J_hTT91f_auu\" data-v-f87c67ca=\"\">see a committee vote<\/a> before the end of the year. But due to time, and possible jurisdictional disagreement, passage of that bill before the end of the year also remains unlikely.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Senate Banking Committee Republican Pat Toomey (Pa.","content":"ORGANIZATION"},{"type":"Janet Yellen","content":"PERSON"},{"type":"Sherrod Brown","content":"PERSON"},{"type":"McHenry and House Financial Services Committee Chair Maxine Waters","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"last month","content":"DATE"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"McHenry","content":"ORGANIZATION"},{"type":"While Congress","content":"ORGANIZATION"},{"type":"Yellen","content":"PERSON"},{"type":"Financial Stability Oversight Council","content":"ORGANIZATION"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Patrick McHenry","content":"PERSON"},{"type":"Ohio","content":"LOCATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Calif.","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Toomey","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"},{"type":"McHenry","content":"PERSON"}],"hashtag":["BITCOIN","CONGRESS","GARY GENSLER","JANET YELLEN","MAXINE WATERS","PATRICK MCHENRY"],"authors":["Colin Wilhelm","Stephanie Murray","The Block"]}