{"summary":"Decentral Games, a major driver of traffic to Decentraland, will receive a $1 million grant in MANA to be used as rewards for stakers in their liquidity pool.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152690\/decentraland-dao-votes-to-give-decentral-games-1-million-grant","publishDate":"2022-06-17T10:17:14","id":689,"type":null,"title":"Decentraland DAO votes to give Decentral Games $1 million grant","category":["WEB3"],"content":["A Decentral Games (DG) <a href=\"https:\/\/governance.decentraland.org\/proposal\/?id=99c66b90-e2d2-11ec-9000-175d8dd584b8\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">proposal<\/a> to the Decentraland metaverse platform’s DAO for a $1 million grant to support its liquidity pool was approved on Thursday evening.","The grant is more than four times larger than the normal maximum community grant of $240,000 — paid out in Decentraland’s native token, MANA — which the DAO uses to support projects that contribute to the growth of the platform.","DG proposed the grant last month to provide rewards for its ICE-USDC liquidity pool on QuickSwap. ICE token is used on DG’s play-and-earn ICE Poker game, which launched in October 2021. The MANA from the DAO will be distributed over three months to those staking USDC-ICE LP tokens.","“This MANA allocation is a stepping stone to assist in boosting our in-game economy as we prepare to launch ICE Poker Sit-n-Go tournaments, along with other key initiatives that drive organic demand and utility for ICE and solidify our ecosystem’s long-term sustainability,” CEO Miles Anthony told The Block in a statement.","DG is a huge player in the Decentraland ecosystem. According to the company, ICE Poker accounts for about 60% of Decentraland’s weekly active users, and has more than 8,000 daily active players across 12 live Decentraland venues. It has also purchased over a thousand Decentraland land parcels.","A total of 191 DAO members with a combined Voting Power (VP) of more than 11 million voted on the proposal. While 151 people voted in favor, versus 40 who were against, it's the amount of VP that determines the outcome, which in this case was 6,162,990 VP for and 4,952,747 against. Additionally, the vote had to exceed a 6 million VP threshhold to be enacted.","VP is calculated based on the total of MANA, NAMES and LAND associated with a voter’s connected wallet.","This means big holders can sway a vote. In this case, just 10 voters accounted for 81% of VP. Among them, DG itself cast two million VP in favor of the proposal, enabling it to reach the threshold for acceptance, and without which the proposal would have failed.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"81%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DG","content":"ORGANIZATION"},{"type":"evening","content":"TIME"},{"type":"60%","content":"PERCENT"},{"type":"October 2021","content":"DATE"},{"type":"6 million","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$240,000","content":"MONEY"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Decentraland","content":"LOCATION"},{"type":"Anthony","content":"PERSON"},{"type":"Decentraland","content":"ORGANIZATION"}],"hashtag":["DECENTRALAND"],"authors":["Callan Quinn","The Block"]}