{"summary":"Securities and Exchange Commission Chair Gary Gensler highlighted his agency’s enforcement actions against Coinbase, BlockFi and other crypto firms during a speech.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182003\/gensler-flexes-crypto-enforcement-record-in-speech","publishDate":"2022-11-02T10:15:59","id":6890,"type":null,"title":"Gensler flexes crypto enforcement record in speech","category":["POLICY"],"content":["Securities and Exchange Commission Chair Gary Gensler touted his agency’s enforcement actions against cryptocurrency firms during a speech in New York City, doubling down on legal moves that have roiled the industry.","In prepared remarks, Gensler told an audience of lawyers that a famous Aristotelian principle guided the SEC's enforcement actions: “Treat like cases alike.”&nbsp;","\"If you fail to register a security as required, or to register appropriately as an investment company, you violate the securities laws, regardless of the ‘form’ or ‘name’ of the securities involved,” Gensler said. He pointed to cases against BlockFi, Coinbase and other crypto companies to make his point.","“When BlockFi failed to register the offers and sales of a crypto lending product, and made materially false and misleading statements about those securities, we charged them,” he added.","The SEC is made up of “public servants, cops on the beat, uniting public zeal with unusual capacity,” Gensler said at a securities regulation event hosted by the Practising Law Institute.&nbsp;","Gensler also highlighted cases against Allianz Global Investors, Archegos Capital Management and Infinity Q Capital Management. The SEC accused the companies, and some executives, of operating fraudulent schemes.","“Fraud is fraud, regardless of the types of investors you have defrauded and the types of securities used in the fraud,” Gensler said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">During his remarks, which extended beyond crypto issues, <\/span><span class=\"s2\" data-v-f87c67ca=\"\">Gensler urged companies that have violated the commission's rules to comply with its investigations. <\/span>Overall, the SEC filed more than 700 actions during the fiscal year that ended Sept. 30, Gensler said. The agency obtained $6.4 billion in judgments and orders, including $4 billion in civil penalties.","\"If you mess up, and people do mess up sometimes, come in and talk to us, cooperate with our investigation, and remediate your misconduct,” Gensler said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","When it comes to clearer rules for digital assets, Gensler said his agency is working to get intermediaries \"up and registered.\" The SEC boss said crypto exchanges, broker-dealers and lenders are likely listing tokens that could be considered securities.","\"They tend to have dozens if not hundreds to thousands of tokens on them and it is statistically improbable that they don't have securities,\" Gensler said. \"It's so important to get those intermediaries within the investor protection perimeter. We're talking to significant intermediaries both in what I might call the crypto and incumbents, as well as traditional financial firms.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"$4 billion","content":"MONEY"},{"type":"Practising Law Institute","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Archegos Capital Management","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Sept. 30","content":"DATE"},{"type":"Allianz Global Investors","content":"ORGANIZATION"},{"type":"Infinity Q Capital Management","content":"ORGANIZATION"},{"type":"$6.4 billion","content":"MONEY"},{"type":"Exchange Commission","content":"ORGANIZATION"}],"hashtag":["BLOCKFI","COINBASE","GARY GENSLER","SEC"],"authors":["Stephanie Murray","The Block"]}