{"summary":"The UK&#x27;s Financial Conduct Authority is launching a permanent version of its Digital Sandbox for firms to test products at an early stage of development.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240766\/uk-financial-regulator-launching-permanent-digital-sandbox","publishDate":"2023-07-20T10:04:09","id":6898,"type":null,"title":"UK financial regulator launching permanent Digital Sandbox","category":["POLICY"],"content":["The UK's Financial Conduct Authority is launching a permanent version of its <a href=\"https:\/\/www.theblock.co\/linked\/29639\/fca-sandbox-graduate-globacap-launches-uk-regulated-digital-securities-platform\" data-v-f87c67ca=\"\">Digital Sandbox<\/a> for firms to test products at an early stage of development.","The <a href=\"https:\/\/www.theblock.co\/post\/240231\/fca-crypto-memes-breach-financial-promotion-rules\" data-v-f87c67ca=\"\">FCA's<\/a> experimental environment is open to innovative concepts for the banking, investment, lending, payments, insurance and pensions sectors. Regulators will be introduced to each innovation at an early stage to observe ongoing technical testing.","\"Following two successful pilots, our digital sandbox will be made available permanently on 1 August 2023, opening up the platform to an even broader range of innovative businesses, start-ups and data providers,\" the regulator <a href=\"https:\/\/www.fca.org.uk\/news\/news-stories\/launch-permanent-digital-sandbox\" data-v-f87c67ca=\"\">announced<\/a> Thursday.","In the <a href=\"https:\/\/www.fca.org.uk\/firms\/innovation\/digital-sandbox\" data-v-f87c67ca=\"\">sandbox's second pilot stage<\/a>, projects were assessed for their sustainability performance, which included the utilization of eco-friendly decentralized ledgers.","The FCA said the digital sandbox will provide participants with a secure platform for experimentation. Participants will have access to over 200 datasets and more than 1000 APIs for testing and validating their innovations. The datasets cover payments, transactions, social media and credit data.","\"The Digital Sandbox works to foster innovation and growth — more than half of the previous Small to Medium Enterprise participants in the pilots and TechSprints made positive developments including launching new products, securing funding and partnerships, or receiving industry awards or recognitions,\" the FCA added.","The approval process for applicants takes up to 4 weeks. Participants can apply for the Digital Sandbox from August 1.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Digital Sandbox","content":"ORGANIZATION"},{"type":"UK's Financial Conduct Authority","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"August 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"August 1","content":"DATE"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["FCA"],"authors":["Brian McGleenon","The Block"]}