{"summary":"The move lets restakers delegate their whole stake to their preferred operator, among other new functionalities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287435\/eigenlayer-restaking-platform-and-eigenda-data-availability-layer-debut-on-ethereum-mainnet","publishDate":"2024-04-09T17:07:50","id":69,"type":null,"title":"EigenLayer and EigenDA launch on Ethereum mainnet","category":["LAYER 2S AND SCALING"],"content":["The restaking platform EigenLayer and its data availability layer EigenDA launched on the Ethereum mainnet Tuesday.&nbsp;","The move lets restakers delegate their whole stake to their preferred operator and allows operators to decide whether to run an actively validated service (AVS) on EigenLayer, according to an official <a href=\"https:\/\/www.blog.eigenlayer.xyz\/mainnet-launch-eigenlayer-eigenda\/\" data-v-f87c67ca=\"\">statement<\/a> by EigenLayer's developers. In addition, it permits AVSs to sign up for the beta version of EigenDA.","EigenLayer allows users to <a href=\"https:\/\/www.theblock.co\/learn\/271529\/how-does-staking-work-and-where-does-the-yield-come-from\" data-v-f87c67ca=\"\">stake ether<\/a> and earn a liquid staking token (LST), which can then be restaked for more rewards. The native restaking is done through EigenPod, a user-managed smart contract that helps monitor balance and withdraw statuses.&nbsp;","\"Until now, restaking in EigenLayer meant simply depositing LSTs, or setting validator withdrawal credentials to an EigenPod,\" EigenLayer said in a release. \"Now that operators and an AVS (EigenDA) are live, being an active restaker means delegating to one of the top 200 operators running AVSs. Over the next few weeks we expect high operator turnover in the top 200 active set, as new operators, delegations, and AVSs come online.\"","The mainnet launch does not entail AVS in-protocol payments to operators or slashing, however. \"We are allowing the EigenLayer marketplace to develop and stabilize before introducing in-protocol payments and slashing to mainnet later this year,\" the protocol added in the statement.&nbsp;","\"Slashing\" refers to the punitive measure where validators can lose a portion of their staked ETH as a penalty for bad behavior or failure to comply with protocol rules.","EigenLayer maintains around $13.4 billion in total value locked (TVL), according to the crypto data tracker DeFiLlama. EigenLayer surpassed the <a href=\"https:\/\/www.theblock.co\/post\/280310\/eigenlayers-total-value-locked-surpasses-10-billion\" data-v-f87c67ca=\"\">$10 billion<\/a> TVL threshold on March 3, 2024, The Block previously reported.&nbsp;","EigenDA, <a href=\"https:\/\/www.theblock.co\/post\/250483\/eigenlabs-gears-up-to-launch-upcoming-data-availability-solution\" data-v-f87c67ca=\"\">announced<\/a> in Sept. 2023, aims to lower data storage costs for Ethereum Layer 2 rollups. This can help scale decentralized applications of all forms, but <a href=\"https:\/\/www.theblock.co\/post\/263473\/eigenlayer-to-enable-staking-with-operators-of-data-availability-layer-in-h1-2024\" data-v-f87c67ca=\"\">particularly<\/a> gaming and social media projects.&nbsp;","EigenLayer's daily TVL in native restaking alone hit $9.46 billion as of April 8, according to The Block's Data Dashboard.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/restaking\/eigenlayer-total-value-locked-per-staking-type\/embed\" title=\"EigenLayer Total Value Locked by Restaking Type\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The crypto-focused venture firm Andreessen Horowitz invested <a href=\"https:\/\/www.theblock.co\/post\/282540\/eigenlayer-teases-mainnets-final-roadmap-before-launch\" data-v-f87c67ca=\"\">$100 million<\/a> in EigenLayer's developer EigenLabs in February of this year.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Sept. 2023","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EigenLayer","content":"ORGANIZATION"},{"type":"EigenLayer","content":"PERSON"},{"type":"March 3, 2024","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"$9.46 billion","content":"MONEY"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"April 8","content":"DATE"},{"type":"$13.4 billion","content":"MONEY"}],"hashtag":["ETHEREUM"],"authors":["MK Manoylov","The Block"]}