{"summary":"The Securities and Exchange Commission (SEC) has expanded its definition of qualified accredited investor to lower the barrier for some individuals and entities\nCommissioner Hester Peirce supported the step, but advocated for further lowering the barriers to private markets\nCommissioners Allison Herren Lee and Caroline Crenshaw cautioned against the wealth threshold without adjusting for inflation, arguing it could expose some populations to more risk","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/76086\/sec-expands-accredited-investor-definition-lowering-the-barrier-to-private-markets","publishDate":"2020-08-26T11:40:07","id":69,"type":null,"title":"SEC expands accredited investor definition, lowering the barrier to private markets","category":["Regulation"],"content":["The Securities and Exchange Commission (SEC) <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2020-191\" data-v-f87c67ca=\"\">announced<\/a>&nbsp;Wednesday that it it has officially widened the accredited investor definition to include individuals.","The update allows for \"natural persons\" to qualify if they have achieved certain designations or credentials.&nbsp;\"The amendments allow investors to qualify as accredited investors based on defined measures of professional knowledge, experience or certifications in addition to the existing tests for income or net worth,\" the agency said in its announcement.","Some licensed investment advisers may meet the standards for the broader definition. The new category for individuals includes holders of series 7, 65 and 82 licenses under the definition — credentials related to private securities sales and investment advising. More license designations, or other forms of credentials, may be added in the future, according to the SEC. The regulator said it's open to the proposal of additional certifications to satisfy the rule.","In addition to individuals, the amendment allows Native American tribes, governmental bodies, funds and entities under foreign law that have more than $5 million in investments to qualify. Limited liability companies (LLCs), rural business investment companies (RBICs) family offices and SEC and state-registered investment advisers with over $5 million in assets also qualify. Spousal equivalents, or long-term, cohabitating partners, can also pool their assets to reach the $5 million.","The agency also expanded the qualified institutional buyer definition to include LLCs and RBICs if they meet the required $100 million in securities owned and invested.","Commissioner Hester Peirce called the update a \"cautious\" expansion, advocating for an even wider definition to allow smaller investors access to growing private markets.","\"These newly minted accredited investors are not your typical mom and pop retail investors, a fact that should assuage the concerns of those that fear any expansion of the definition,\" said Peirce in her statement. \"It does not assuage&nbsp;<i data-v-f87c67ca=\"\">my<\/i> concerns. Why shouldn't mom and pop retail investors be allowed to invest in private offerings? Why should I, as a regulator, decide what other Americans do with their money?\"","<a href=\"https:\/\/www.sec.gov\/news\/public-statement\/peirce-accredited-investor-2020-08-26\" data-v-f87c67ca=\"\">Peirce's statement<\/a> highlights an argument from one commenter against the long-held standard that wealthy investors have proved with their wealth that they have substantial financial knowledge, and thus need less protection. Legal precedent has established that wealth equates to financial sophistication in the eyes of the law.","The commenter argued access to information in registration statements makes the largest difference to an investor, advocating for an exemption that allows investors to access private markets based on issuer information on the investment rather than investor wealth. Peirce welcomed feedback on the potential solution to&nbsp; help \"get us out of the business of deciding who is sophisticated and who is not.\"","\"A person's economic status may demonstrate an ability to withstand losses, but it certainly does not demonstrate financial sophistication,\" said Peirce. \"The result of pretending that wealth is a good measure of sophistication is a standard that discriminates against financially sophisticated, lower- income and net worth Americans.\"","Still, Peirce said that today's amendment recognizes the differences between wealth and sophistication, calling the series 7, 65 and 82 licenses the \"tip of the iceberg\" for designations.","While Peirce was encouraged by the movement, Commissioners Allison Herren Lee and Caroline Crenshaw cautioned against private market expansion without more analysis in their<a href=\"https:\/\/www.sec.gov\/news\/public-statement\/lee-crenshaw-accredited-investor-2020-08-26\" data-v-f87c67ca=\"\"> joint statement.<\/a> Specifically, Herren Lee and Crenshaw took issue with the lack of indexing the wealth thresholds for inflation in the definition, since failing to do so widens the number of qualifying households significantly.&nbsp;","The SEC chose not to index for inflation at the risk of reducing the capital supply for exempt offerings, which Herren Lee and Crenshaw argue isn't in danger given its growth rate in private markets. The SEC argued that the information now available to investors further levels the playing field. According to Herren Lee and Crenshaw, the accessible information isn't enough.","\"This ignores the naturally opaque nature of the private market where issuers are not required to provide the robust disclosures that are features of public offerings,\" wrote the Commissioners. \"No matter how powerful your computer is, you cannot access information that is not there.\"","The Commissioners also argue seniors are at higher risk of fraud given older households are more likely to meet the wealth standards in the broader definition and many schemes target the older population.&nbsp;","The road to an updated Rule 144A, the section of the Securities Act of 1933 that governs accredited investors and qualified institutional buyers, began in December of 2015. At that time, the SEC issued a staff report examining the definition and looking to comments and recommendations for amendments. This led to a preliminary proposal in June of 2019, opening a comment period. By December of 2019, the SEC had proposed its amendment to the definition.&nbsp;","The next review of the definition is set to occur in four years, <a href=\"https:\/\/www.sec.gov\/news\/public-statement\/roisman-statement-amendments-accredited-investor-definition\" data-v-f87c67ca=\"\">according to Commissioner Elad Roisman<\/a>. This set of amendments will take effect 60 days after publication in the Federal Register."],"hashtag":["SEC"]}