{"summary":"Crypto industry leaders share their thoughts on the digital assets outlook for the year ahead, covering everything from spot bitcoin ETFs to stablecoins, real-world assets, NFTs and regulations.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269018\/from-spot-bitcoin-etfs-to-real-world-assets-industry-leaders-share-their-crypto-outlook-for-2024","publishDate":"2023-12-22T08:36:42","id":690,"type":null,"title":"From spot bitcoin ETFs to real-world assets, industry leaders share their crypto outlook for 2024","category":["People"],"content":["Crypto industry leaders at Kraken, Avalanche, Anchorage Digital and others shared their thoughts with The Block on the outlook for digital assets in the year ahead, covering everything from spot bitcoin ETFs to stablecoins, real-world assets, NFTs and regulations.","Let’s take a look at what they expect in 2024.","Kraken UK Managing Director <a href=\"https:\/\/www.theblock.co\/post\/259739\/kraken-names-new-uk-boss-with-halliday-set-to-depart\" data-v-f87c67ca=\"\">Bivu Das<\/a> said the crypto industry in 2024 has the potential to take another “major leap” toward mass adoption, especially within the UK.","Beyond the short-term anticipation of <a href=\"https:\/\/www.theblock.co\/post\/268399\/bitcoin-spot-etf-approvals-look-nailed-on-for-january-k33-research-says\" data-v-f87c67ca=\"\">spot bitcoin ETF approvals<\/a> in the United States, Das said he reckons the overall market will remain optimistic going into Q1 of 2024. “This is because there are major milestones on the horizon for two of the largest crypto assets by market cap, including Bitcoin’s next halving and Ethereum’s Dencun upgrade,” he said.","In the UK, following the Treasury’s recent policy <a href=\"https:\/\/www.theblock.co\/post\/260020\/uk-treasury-releases-final-proposals-for-crypto-asset-regulation\" data-v-f87c67ca=\"\">statement<\/a>, ahead of an intention to bring out crypto asset regulation next year, Das expects the country to be “noticeably closer” to becoming a global crypto hub by the end of 2024.","Greater regulatory clarity means UK-based firms are no longer at a disadvantage to those offering services from overseas, according to Das. “I see institutional trading volume significantly picking up within the UK market, as more products and services come to market that meet the needs and expectations of these institutional investors,” he said.","“This is being supplemented by the Government’s Digital Securities Sandbox, which will fast-track the adoption of crypto asset technology in traditional markets, and recent work by the Asset Management Taskforce which outlines a vision for the tokenization of investment funds,” Das added.","John Wu, President of Avalanche developer <a href=\"https:\/\/www.theblock.co\/post\/258257\/ava-labs-avalanche-india-plans\" data-v-f87c67ca=\"\">Ava Labs<\/a>, sees 2024 as the year where stablecoin product market fit is established, with stablecoin settlements exceeding annual Visa volumes for the first time.","Wu is among many in the industry anticipating a spot bitcoin ETF will be approved, and he predicts bitcoin’s market cap will increase by 50% next year as a result.","Elsewhere in the crypto space, Wu expects web3 gaming to have its first mainstream hit, with a breakout game seeing a nine-digit user base and leading traditional game developers to join the space. He also anticipates a resurgence of NFTs as they gain new utility beyond collectibles. “Real-world applications such as customer engagement strategies will demonstrate more clear use-cases like loyalty programs,” he said.","Finally, Wu expects AI to make web3 more secure and vice versa. “Large Language Models are perfect for reviewing smart contracts and other vital code to ensure would-be exploits are stopped before they start. DeFi hacks and smart contracts exploits will become rare,” he added.","According to <a href=\"https:\/\/www.theblock.co\/post\/258805\/gnosis-chains-total-value-locked-doubles-to-150-million-after-makerdaos-spark-protocol-expansion\" data-v-f87c67ca=\"\">Gnosis<\/a> co-founder Dr. Friederike Ernst, “2024 will be the year that the web3 ecosystem either rises to the challenge of providing more user-friendly experiences or remains niche for yet another year.”","“If Ethereum and other credibly neutral blockchains are going to become the global settlement layer, then the applications that run on it need to be made usable to a much wider audience,” he said. “It’s time we turn the very abundant research and proof of concept work that’s been achieved over the last few years into actual UX improvements for live products.”","Developments in account abstraction technology mean that seed phrases could become a historical practice for most in 2024, Ernst added. “The idea that the safety of assets meant having 12 words that you can never lose, but no one else can ever access, is outdated and to a large extent has been holding back progress for actual user adoption,” he said.","Concordium co-founder <a href=\"https:\/\/www.theblock.co\/post\/254879\/concordium-founder-identity-verification-needed-to-prevent-crypto-scams\" data-v-f87c67ca=\"\">Lars Seier Christensen<\/a> was less optimistic about the prospect of spot bitcoin ETF approvals and the Bitcoin halving event leading to a new bull market in 2024.","“It is all a little bit too much ‘textbook stuff’ for my taste — halving, ETF approval and then a new bull market. Normally, in traditional financial markets, these types of scenarios aren’t necessarily predictable because experienced participants are able to anticipate potential developments beyond the obvious,” he said. “But maybe, due to the immaturity of crypto markets, it will play out as everyone predicts. I would be very careful, though. I think we will be in for some surprising deviations from the generally predicted path.”","Christensen was more positive on blockchain-based stablecoin and real-world asset adoption in the year ahead. “I think stablecoins right now are the most important use case for blockchain, eventually to be replaced or expanded by more general RWA tokenization,” he said. “In their current stage, stablecoins make a lot of sense when it comes to transfers, settlement and finality. For these reasons, they will be embraced further in 2024, both in private solutions and new public sector experiments.”","Christensen also argued reliable and trustworthy ID solutions on blockchain were becoming a necessity, especially given the rise of deepfakes and identity theft.","Sunny Lu, CEO at VeChain, also didn’t think the bitcoin halving would have much of an impact, but that spot bitcoin ETF approvals and market regulations are much more significant for the year ahead.","“The attention of the entire crypto market is on ETF progress for bitcoin spot, which I believe may be the biggest milestone in bitcoin and crypto’s history,” Lu said. “The ETF will open the door for the world’s biggest institutional investors to enter the crypto space.”","Major regulatory progress stemming from examples like the Markets in Crypto-Assets regulations (<a href=\"https:\/\/www.theblock.co\/post\/238100\/afme-defi-mica-exclusion\" data-v-f87c67ca=\"\">MiCA<\/a>) in Europe will also pave the way for the mass adoption of blockchain and crypto in the real world, according to Lu.","Anchorage Digital co-founder <a href=\"https:\/\/www.theblock.co\/post\/251503\/ether-staking-fourfold-anchorage-digital\" data-v-f87c67ca=\"\">Diogo Mónica<\/a> said that crypto was at the beginning of an institutional-led bull market heading into 2024, with institutions becoming the driving force behind a cycle for the first time.&nbsp;","Mónica expects to see a broader range of institutional players enter the crypto ecosystem in the year ahead — including asset managers, hedge funds and RIAs.","“Rising institutional participation means market structure reform will be front and center,” Mónica said. “Applying traditional market structure standards — like separating custody and exchange functions — to crypto was once just an ideal; now, it is a prerequisite for the future of the ecosystem.”"],"hashtag":["AVALANCHE","BITCOIN","EUROZONE REGULATION","INVESTMENT FIRMS","KRAKEN","PAYMENTS","TOKENIZATION"]}