{"summary":"The Lido team has submitted its design for withdrawals of ether on the protocol once the Ethereum Shanghai upgrade happens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205376\/lido-presents-design-for-staked-ether-withdrawals-after-shanghai-upgrade","publishDate":"2023-01-25T08:31:28","id":6900,"type":null,"title":"Lido presents design for staked ether withdrawals after Shanghai upgrade","category":["CRYPTO ECOSYSTEMS"],"content":["The Lido team proposed plans for how the protocol should support ether withdrawals once Ethereum's upcoming Shanghai upgrade has been activated.","The Lido team <a href=\"https:\/\/research.lido.fi\/t\/withdrawals-for-lido-on-ethereum\/3690\" data-v-f87c67ca=\"\">put forward<\/a> its designs to the Lido DAO, the project's form of governance, via a post on the community’s forum. The feature will enable users to <a href=\"https:\/\/www.theblock.co\/post\/189496\/ethereum-client-teams-test-staking-withdrawals-on-devnet\" data-v-f87c67ca=\"\">unstake their staked ether tokens<\/a> once the <a href=\"https:\/\/www.theblock.co\/post\/204639\/developers-finalize-first-shadow-fork-for-ethereums-shanghai-upgrade\" data-v-f87c67ca=\"\">Shanghai upgrade<\/a> happens.","The Lido team described the designing process for the withdrawal feature as a complex task. This complexity is due to the way staked ether withdrawals will work following the Shanghai upgrade. The process will be asynchronous, which means withdrawals won’t happen at the same time for all participants.","Lido’s planned withdrawal feature will have two modes, the design <a href=\"https:\/\/hackmd.io\/@lido\/SyaJQsZoj#Lido-on-Ethereum-Withdrawals-Landscape\" data-v-f87c67ca=\"\">document<\/a> stated. The first mode called “turbo” will process unstaking requests as quickly as possible while the “bunker” mode will be triggered under mass slashing conditions. Slashing is a penalty incurred by validators in a proof-of-stake network when they run foul of consensus rules. In Ethereum, validators get penalized by having a portion of their staked tokens burned. Lido’s bunker mode aims to prevent sophisticated actors from profiting at the expense of the community, the design document added.","For Lido, the withdrawal feature is an important aspect of its operations going forward. Lido is the <a href=\"https:\/\/www.theblock.co\/post\/154089\/lido-dao-begins-voting-on-whether-to-limit-its-ethereum-staking-dominance\" data-v-f87c67ca=\"\">most dominant liquid staking protocol<\/a> on Ethereum. The project accounts for 29% of all staked ether, according to a Dune <a href=\"https:\/\/dune.com\/hildobby\/ETH2-Deposits\" data-v-f87c67ca=\"\">dashboard<\/a>.","Lido DAO will deliberate on the design specifics in the coming days. The community will vote on any new recommendations before the plans will be implemented in the protocol.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"29%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Lido DAO","content":"LOCATION"},{"type":"Lido","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Shanghai","content":"LOCATION"}],"hashtag":["DERIVATIVES","ETHEREUM","LIDO FINANCE","STAKING","VALIDATORS"],"authors":["Osato Avan-Nomayo","The Block"]}