{"summary":"The New York Department of Financial Services is preparing to introduce changes to the infamous BitLicense, and it could make the process for listing","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50125\/nydfs-proposes-new-guidance-for-listing-tokens-on-licensed-crypto-firms","publishDate":"2019-12-11T09:29:12","id":6904,"type":null,"title":"NYDFS proposes new guidance for listing tokens on licensed crypto firms","category":["REGULATION"],"content":["The New York Department of Financial Services is preparing to introduce changes to the infamous BitLicense, and it could make the process for listing coins more rigorous.&nbsp;","In a <a href=\"https:\/\/www.dfs.ny.gov\/apps_and_licensing\/virtual_currency_businesses\/pr_guidance_regarding_listing_of_vc\" data-v-f87c67ca=\"\">press release<\/a>, NYDFS superintendent Linda Lacewell laid out the agency's \"first step\" in its review of the license, which has been granted to digital asset firms operating in New York since 2015. Since then, at least 18 cryptocurrency companies <a href=\"https:\/\/www.theblockresearch.com\/nydfs-is-granting-more-bitlicenses-than-ever-before-8-already-this-year-49317\" data-v-f87c67ca=\"\">have been granted the license<\/a>, including Coinbase, Robinhood, Square, and Tagomi.&nbsp;","As their primary regulator, NYDFS works with these firms on a one-on-one basis for listing tokens. The agency's denial depends on a number of factors including a coin's liquidity and the impact it will have on the overall ecosystem, according to a source familiar with the process. In some cases, the NYDFS will not weigh in and an exchange may proceed to list the coin without their blessing. The licenses don't come cheap either. The legal fees associated with the license run over $100,000 in most cases, several sources have told The Block.&nbsp;","","","To enhance the process, NYDFS is proposing two new options to the coin listing process. The first would be a web-page that outlines a list of coins permitted by the agency. The second proposal is a framework for listing new coins \"that can be tailored to a VC licensee's specific business model and risk profile.\"&nbsp;","As part of Wednesday's announcement, the agency outlined a proposed model framework for coin-listing, highlighting the risk, governance, and monitoring characteristics it thinks should be considered. For instance, the guidance suggested license-holders should \"conduct and document a full risk assessment of such coin in a way that is entirely free of conflicts of interest.\"","To be sure, most cryptocurrency exchanges have their own framework around listing coins. Still, it is not clear if the one ultimately proposed by NYDFS will line up with existing frameworks. That could force firms to pull back on the number of coins they have listed — at least in the state of New York.&nbsp;","The regulator is seeking comments on these proposals and the deadline to submit comments is January 27, 2020. The update would not require firms to reapply for their licenses.&nbsp;","“New York is the center of both innovation and consumer protection, and the Department must strive to deliver speed to market and continually adapt to keep pace as the financial services industry continues to rapidly evolve,”&nbsp;said Superintendent Lacewell.&nbsp;“This is an important first step in our review of our virtual currency regime and is designed to make it easier for those who have obtained a New York license to periodically add new coins to their existing products.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"2015","content":"DATE"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"Department","content":"ORGANIZATION"},{"type":"Lacewell","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Linda Lacewell","content":"PERSON"},{"type":"Tagomi","content":"ORGANIZATION"},{"type":"January 27, 2020","content":"DATE"}],"hashtag":[],"authors":["Celia Wan","Frank Chaparro","The Block"]}