{"summary":"Crypto financial services provider BlockFi is launching a Visa credit card in the U.S. early next year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/86200\/blockfi-credit-card-launching-earn-back-bitcoin","publishDate":"2020-12-01T09:00:16","id":6906,"type":null,"title":"BlockFi&#x27;s credit card is launching in the U.S. and lets users earn back bitcoin","category":["BITCOIN"],"content":["Crypto financial services provider BlockFi is launching a Visa credit card in the U.S. early next year.","The card had been <a href=\"https:\/\/blockfi.com\/bitcoin-rewards-credit-card-cheddar-interview\" data-v-f87c67ca=\"\">under development<\/a> for at least a year, and the forthcoming launch means BlockFi users will soon be able to spend in fiat and get rewarded in bitcoin (BTC).","\"It's the first credit card in the crypto ecosystem, and the first time the bitcoin logo has been featured prominently on a physical card,\" BlockFi founder and CEO Zac Prince told The Block. \"We hope this card will be a valuable personal financial tool for our clients to earn bitcoin while making everyday purchases.\"","BlockFi will offer a flat 1.5% reward in bitcoin for every transaction via the card. It will also provide a $250 bonus in bitcoin for spending $3,000 on the card in the first three months. The card comes at an annual fee of $200.","Accumulated rewards will automatically get deposited into users' BlockFi accounts. They will be then able to use it for various purposes, including lending, trading, collateral for borrowing, or even withdrawing to an external wallet.&nbsp;","BlockFi has today opened up a waitlist for existing clients with funded accounts, and will make the waiting list available publicly in January. The firm will then will start shipping cards \"in spring of next year.\" The cards will be issued by Evolve Bank &amp; Trust and powered by Deserve.","The card will be available in \"all 50 U.S. states,\" Prince told The Block. \"We plan to launch in other countries with this card product or something similar over time.\"","While the card initially offers rewards in bitcoin, Prince said the support for other cryptocurrencies could also be added in the future.","Next year, <a href=\"https:\/\/www.theblockcrypto.com\/post\/82683\/coinbase-visa-crypto-debit-card-us-launch-bitcoin-2021\" data-v-f87c67ca=\"\">Coinbase<\/a> is also set to launch its Visa card that would offer spending rewards in bitcoin, but that's a debit card. When asked why BlockFi opted for a credit card instead, Prince said, \"credit cards enable higher reward rates to consumers and also come with other benefits, including better purchase protections, greater reward rates, and opportunities for building credit.\"","As for tax implications of bitcoin rewards on the BlockFi credit card, Prince said: \"The cash rewards value is treated as a merchant rebate and as a result not taxable as income. But converting the cash value into bitcoin establishes a cost basis for the bitcoin, which is subject to traditional rules around the taxation of bitcoin holdings.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3,000","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Prince","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"1.5%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"Zac Prince","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Evolve Bank &amp; Trust","content":"ORGANIZATION"},{"type":"spring","content":"DATE"},{"type":"$200","content":"MONEY"},{"type":"$250","content":"MONEY"}],"hashtag":["BLOCKFI"],"authors":["Yogita Khatri","The Block"]}