{"summary":"Bored Ape Yacht Club said it would validate the leaderboard and then share the results.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209968\/bayc-freezes-dookey-dash-leaderboard-with-nearly-73-million-in-trading-volume","publishDate":"2023-02-08T18:52:59","id":6909,"type":null,"title":"BAYC freezes Dookey Dash leaderboard with nearly $73 million in trading volume","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">Blue-chip NFT collection Bored Ape Yacht Club has frozen the leaderboard for players of Dookey Dash, the video game inspired by the popular non-fungible token brand.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">For three weeks users who possessed Bored Apes’ “Sewer Pass” NFTs were able to play the Dookey Dash video game in an attempt to get the highest possible score, which on Wednesday afternoon Pacific Time, became locked to each individual token. When the leaderboard closed, sales volumes for the NFTs had clocked in just shy of $73 million, <a href=\"https:\/\/www.cryptoslam.io\/sewerpass\" data-v-f87c67ca=\"\">according to CryptoSlam<\/a>.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Although the process is shrouded in mystery, Bored Apes’ creator Yuga Labs has plans to award gamers based on how high they scored. The top score will win a “key,” which is expected to lead to a prize that could carry significant monetary vale on the open market, considering the high value attached to Bored Apes’ NFTs. Some BAYC tokens have sold for more than $1 million.<\/span>","<span data-v-f87c67ca=\"\">Yuga Labs said via Bored Apes’ Twitter account that it had frozen the leaderboard and would share the results once the company had completed validation and reviewing the locked scores. Earlier in the day, Yuga Labs said <\/span><span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/post\/209603\/bayc-cracks-down-dookey-dash-cheaters\" data-v-f87c67ca=\"\">it was removing<\/a> some Dookey Dash scores from the leaderboard due to cheating.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">During the three weeks, some Sewer Pass holders hired <a href=\"https:\/\/www.theblock.co\/post\/206337\/a-load-of-crap-bored-ape-nft-game-attracts-pros-angling-for-a-piece-of-the-dookey\" data-v-f87c67ca=\"\">more experienced gamers<\/a> to play on their behalf in an effort to secure a better score. Although the leaderboard is frozen, Sewer Pass holders are allowed to continue trading the NFTs among themselves for a week. Then, Bored Apes will award each Sewer Pass its prize based on its highest score.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nYuga Labs is calling the awarding phase \"The Summoning.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Yuga Labs","content":"PERSON"},{"type":"Bored Apes","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Pacific Time","content":"ORGANIZATION"},{"type":"afternoon","content":"TIME"},{"type":"$73 million","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}