{"summary":"Decentralized perpetual futures trading exchange GMX gave the bounty last year but it is just now being made public.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253395\/gmx-granted-1-million-bug-bounty-to-colliders-research-arm","publishDate":"2023-09-28T11:05:05","id":6912,"type":null,"title":"GMX granted $1 million bug bounty to Collider’s research arm","category":["SECURITY"],"content":["Decentralized perpetual futures trading exchange GMX gave a $1 million bug bounty to Collider’s research team for finding a bug in an internal mechanism tracking outstanding debt. The bug bounty was handed out in 2022 but details of the bug are only now being made available. GMX has patched the bug.","The bug resulted in liquidity providers on GMX V1 receiving inaccurate quotes on the fair value of tokens. This resulted in the price of GLP, the exchange’s liquidity provider token, moving from its fair value.&nbsp;","\"Our top priority is risk management. For every position, we implement an extensive due diligence process, which encompasses thorough reviews, relying not only on external sources but also on our own audits,” said Shlomo Kraus, head of Collider Research.","Collider is an Israel-based venture fund focused on infrastructure, middleware and safety in the crypto space. GMX is an Arbitrum-based decentralized exchange focused on perpetual futures trading. It has $473 million of value locked in its smart contracts, <a href=\"https:\/\/defillama.com\/protocol\/gmx\" data-v-f87c67ca=\"\">according to DefiLlama<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arbitrum","content":"LOCATION"},{"type":"$473 million","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"Israel","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Shlomo Kraus","content":"PERSON"},{"type":"Collider Research","content":"ORGANIZATION"},{"type":"DefiLlama","content":"ORGANIZATION"}],"hashtag":["DERIVATIVES","DEXS","SMART CONTRACTS"],"authors":["Tim Copeland","The Block"]}