{"summary":"The governor also wants to ban central bank digital currencies because the government would have easy access to take your money.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229539\/they-want-to-get-rid-of-crypto-florida-governor-ron-desantis-warns","publishDate":"2023-05-04T12:50:14","id":6922,"type":null,"title":"Biden wants to get rid of crypto, Florida Gov. DeSantis says","category":["COMPANIES"],"content":["Florida Governor Ron DeSantis said the Sunshine state would soon move against any kind of a central bank digital currency, with lawmakers advancing with legislation that could be on his desk within \"the next couple of weeks.\"","\"Florida rejects the idea of a central bank digital currency,\" DeSantis said at a <a href=\"https:\/\/www.facebook.com\/GovRonDeSantis\/videos\/140682988977473\" data-v-f87c67ca=\"\">press conference<\/a> on May 2. \"You could just get fined, and they'll just take it right out of your digital currency, without any due process or anything like that. And so it gives the government a huge amount of power over your economic self sufficiency and independence.\"","The Republican is an avid critic of centrally controlled digital currencies, but he's expressed support in the past for decentralized cryptocurrencies because the government has no control over them.","DeSantis, who's widely considered as a possible presidential candidate in next year's election, has <a href=\"https:\/\/www.theblock.co\/post\/221281\/desantis-touts-bill-that-would-ban-use-of-cbdcs-in-florida\" data-v-f87c67ca=\"\">previously accused<\/a> President Joe Biden of eyeing the technology for “surveillance and control.” He first announced the legislation that would outlaw centralized digital currencies in the state <a href=\"https:\/\/www.flgov.com\/2023\/03\/20\/governor-ron-desantis-announces-legislation-to-protect-floridians-from-a-federally-controlled-central-bank-digital-currency-and-surveillance-state\/\" data-v-f87c67ca=\"\">in March<\/a>.&nbsp;","His Tuesday comments came amid <a href=\"https:\/\/www.theblock.co\/post\/229070\/crypto-regulatory-crackdown-bloomberg\" data-v-f87c67ca=\"\">widespread discussion<\/a> of what's been perceived by some to be a broad <a href=\"https:\/\/www.theblock.co\/post\/228300\/usdc-value-usa-crackdown-allaire\" data-v-f87c67ca=\"\">crackdown<\/a> on the crypto sector by the U.S. Securities and Exchange Commission. Coinbase, a U.S.-listed crypto exchange, is <a href=\"https:\/\/www.theblock.co\/post\/228283\/coinbase-vs-the-sec-a-gamble-to-take-on-a-regulator-undefeated-on-crypto\" data-v-f87c67ca=\"\">suing the regulator<\/a> and calling for clear rules.&nbsp;&nbsp;","\"They want to get rid of crypto,\" DeSantis said. \"They don't like crypto because they can't control crypto, so they want to put everything in a central bank digital currency.\"","\"My view is is like, if you want to invest in crypto, it's up to you,\" DeSantis continued. \"You can do it. I mean, like, you can make those decisions.\"","DeSantis' press office said in an emailed response to questions that he was referring to \"those such as the Biden Administration.\" In the Tuesday remarks, the governor said&nbsp;an agenda was being imposed by an \"elite\" with access to \"to a lot of financial might, a lot of business resources, corporate resources.\"","DeSantis said the pending legislation in Florida would provide preemptive protection from a U.S. central bank digital currency, even though one doesn't yet exist.&nbsp;&nbsp;","\"I don't think Congress would authorize it,\" DeSantis said. \"But if the Fed or the Treasury tries to do it unilaterally, in Florida, we'll have a prohibition against that. And I think that that's ensuring your financial independence and making sure that we don't have a financial surveillance state, where they know every transaction that you're making.\"","DeSantis first raised his opposition to centralized digital currencies last year, but he has previously taken a <a href=\"https:\/\/www.theblock.co\/post\/221281\/desantis-touts-bill-that-would-ban-use-of-cbdcs-in-florida\" data-v-f87c67ca=\"\">friendlier approach<\/a> toward decentralized tokens and has said he was working on ways for Floridians to pay taxes with crypto.","The Biden administration has developed <a href=\"https:\/\/www.whitehouse.gov\/briefing-room\/statements-releases\/2022\/09\/16\/fact-sheet-white-house-releases-first-ever-comprehensive-framework-for-responsible-development-of-digital-assets\/\" data-v-f87c67ca=\"\">policy objectives<\/a> for a possible CBDC system in the U.S., with the Federal Reserve and Treasury Department both conducting research in the area.","(<em data-v-f87c67ca=\"\">Updates with response from DeSantis press office in eighth paragraph.<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ron DeSantis","content":"PERSON"},{"type":"May 2","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Florida","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"DeSantis","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Biden Administration","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Federal Reserve and Treasury Department","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"}],"hashtag":["CBDCS","FEDERAL RESERVE","TREASURY DEPARTMENT"],"authors":["Nathan Crooks","The Block"]}