{"summary":"Solana is back online following an outage on Friday night caused by a misconfigured node that stopped the blockchain from processing transactions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174182\/solana-back-online-following-latest-network-outage","publishDate":"2022-10-01T05:37:39","id":6923,"type":null,"title":"Solana back online following latest network outage","category":["BLOCKCHAIN"],"content":["Solana is back online following an outage on Friday night caused by a misconfigured node that stopped the blockchain from processing transactions.","A validator appeared to be running a duplicate validator instance, meaning that instead of the validator producing a single block, each instance produced one each.","“Not an issue in itself and something the network should handle,” said software and blockchain company Stakewiz, which operates a validator node on Solana, in a <a href=\"https:\/\/twitter.com\/laine_sa_\/status\/1576106191834738688?s=46&amp;t=wCdJDWlyq7IhvumcncYIBQ\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Twitter thread<\/a>.","This caused the blockchain to fork because validators couldn’t agree on which one was correct. This fork caused an obscure code path that left validators unable to switch back to the main fork. Stakewiz suggested the Solana network’s failure to rectify the situation could be due to a failed node failover setup.","A decision was made to restart the network from 153139220, the last confirmed slot. The restart was completed at 7 a.m. UTC. Dapps are working to restore services.","Despite promoting itself as a high-performance blockchain, Solana has suffered a <a href=\"https:\/\/status.solana.com\/history?page=1\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">series of outages<\/a> over the last year. In September 2021, it went offline for almost 18 hours.","It also froze for about seven hours in early May until validators restarted, and was <a href=\"https:\/\/www.theblock.co\/linked\/149698\/solana-blockchain-suffers-new-network-outage\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">knocked offline<\/a> for about four hours in June. The network saw degraded performance in January, March, April and May.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"7 a.m.","content":"TIME"},{"type":"September 2021","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"March, April","content":"DATE"},{"type":"night","content":"TIME"},{"type":"Solana","content":"LOCATION"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}