{"summary":"Riot agreed to acquire 33,280 next-generation bitcoin miners from MicroBT, nearly doubling Riot&#x27;s existing self-mining capacity to 20.1 EH\/s.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236612\/riot-bitcoin-miners","publishDate":"2023-06-27T06:36:13","id":6929,"type":null,"title":"Riot purchases 33,000 bitcoin miners for $163 million","category":["DEALS"],"content":["Bitcoin mining and data center hosting company Riot Platforms has agreed to purchase 33,280 next-generation bitcoin miners from manufacturer MicroBT, nearly doubling its existing capacity by mid-2024.","The miners will be produced by MicroBT within the United States for Riot’s Corsicana facility in Texas at a cost of $162.9 million, according to an <a href=\"https:\/\/www.riotplatforms.com\/news-media\/press-releases\/detail\/155\/riot-purchases-7-6-ehs-of-next-generation-miners-from\" data-v-f87c67ca=\"\">announcement<\/a> on Monday. Once deployed, the new machines will see Riot's <a href=\"https:\/\/www.riotplatforms.com\/\" data-v-f87c67ca=\"\">existing<\/a> self-mining hashrate rise to 20.1 EH\/s.&nbsp;","The purchase agreement represents a 35% increase in Riot’s current <a href=\"https:\/\/www.riotplatforms.com\/\" data-v-f87c67ca=\"\">94,176 miners<\/a>, according to its website. Riot also has the option to secure an additional 66,650 M56S++ miners from MicroBT under the same terms, which could expand its computing power by a further 15.3 EH\/s to 35.4 EH\/s, if executed.","The new miners, designed and produced specifically for immersion cooling systems — like those used at Riot’s Corsicana facility — are among the most powerful and efficient miners to date.","“These new miners will contribute an additional 7.6 EH\/s to Riot’s self-mining capacity when fully deployed and will further enhance our already strong fleet efficiency in advance of the upcoming Bitcoin halving,” Riot CEO Jason Les said in the announcement.","MicroBT will manufacture the miners at its facility in Pittsburgh.&nbsp;","“The M56S+ and M56S++ are the most powerful machines we have developed,” said MicroBT COO Jordan Chen. “All machines purchased by Riot will be manufactured in our facility in the United States, and this order will drive expansion of our operations allowing us to hire and train new staff to fulfill our growing United States-based manufacturing business.”","The delivery of the new miners is set to begin in December 2023, with deployment planned to start in the first quarter of 2024.","In March, Riot <a href=\"https:\/\/www.theblock.co\/post\/216780\/bitcoin-miner-riot-reports-rising-output-triples-hashrate-in-2022\" data-v-f87c67ca=\"\">reported<\/a> $259.2 million in revenue for the year ending December 2022. It also tripled its hashrate last year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the first quarter of 2024","content":"DATE"},{"type":"Jordan Chen","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Pittsburgh","content":"LOCATION"},{"type":"Jason Les","content":"PERSON"},{"type":"$259.2 million","content":"MONEY"},{"type":"Texas","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"35%","content":"PERCENT"},{"type":"December 2022","content":"DATE"},{"type":"December 2023","content":"DATE"},{"type":"Corsicana","content":"LOCATION"},{"type":"$162.9 million","content":"MONEY"},{"type":"Riot Platforms","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["BITCOIN","MINING COMPANIES"],"authors":["James Hunt","The Block"]}