{"summary":"Constitution DAO has so far raised $11 million in its quest to bid on a very rare print of the U.S. Constitution.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124601\/constitution-dao-has-raised-11-million-so-far-with-one-day-to-go","publishDate":"2021-11-17T06:31:08","id":6934,"type":null,"title":"Constitution DAO has raised $11 million so far — with one day to go","category":["CRYPTOCURRENCY"],"content":["Constitution DAO, a newly formed group of crypto investors, has so far raised $11 million in its quest to bid on a very rare print of the U.S. Constitution.","But it is still a few million away from the auction house's minimum of $14 million and even further from the group's own target of $20 million. It only has until tomorrow.","This is the <a href=\"https:\/\/www.theblockcrypto.com\/post\/124288\/a-dao-is-trying-to-buy-a-rare-print-of-the-us-constitution\" data-v-f87c67ca=\"\">story<\/a> of an ambitious plan that was put in motion just one week ago. The idea was to pool thousands of people's funds together to collectively bid on an early surviving copy of the U.S. Constitution, with the goal of distributing control of it to those who got involved.","The copy of the U.S. Constitution is going on sale at Sotheby’s on Thursday at 18:30 EST<span class=\"css-1s30ybv\" data-v-f87c67ca=\"\"><span class=\"css-5oyi0c\" data-v-f87c67ca=\"\"><span class=\"css-dh61hq\" data-v-f87c67ca=\"\">. According to the DAO, as long as they have a sufficient amount of ether (ETH) — and meet some other requirements — the auction house will let them bid on the rare text. Those who contribute to the fundraise will receive governance tokens that they will be able to use to vote on what should happen to the rare print.&nbsp;<\/span><\/span><\/span>","But it's a stretch goal. After getting some initial soft commitments, the DAO started raising funds in cryptocurrency on November 15. In that timeframe they have raised 2,632 ETH, currently worth $11.1 million — although that could change depending on the price of ether.","The goal is to get to between $15 to $20 million, which is the auction house's estimated range. Even if they meet this target, however, the auction could exceed expectations and move beyond their purchase power.","\"We don’t know how much other bidders are planning to bid. We know that $14MM allows us to participate in the auction, $30MM will make us competitive, and $40MM+ gives us a great chance of winning,\" said a <a href=\"https:\/\/docs.google.com\/document\/d\/1oMbg2d_7QmhO7QtoLmIeqg9HCdNfZgoC_w7oi7RMD7Q\/edit\" data-v-f87c67ca=\"\">FAQ document<\/a> provided by the DAO.","In just the short time period, the DAO has already formed an LLC company to bid on the auction, since the DAO was unable to bid directly. While the auction house will accept its ether balance as proof of funds, it will need to swap the funds for dollars if its bid is successful. Crypto exchange FTX has offered to fulfil that service if needed.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sotheby’s","content":"ORGANIZATION"},{"type":"$11 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"LLC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$15","content":"MONEY"},{"type":"$14 million","content":"MONEY"},{"type":"18:30 EST","content":"TIME"},{"type":"November 15","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$11.1 million","content":"MONEY"},{"type":"$30MM","content":"MONEY"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$40MM","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"$14MM","content":"MONEY"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}