{"summary":"Crypto-related issues are consuming the CFTC&#x27;s resources as its Chair Rostin Behnam again urged lawmakers to act on legislation soon.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280952\/legislation-needed-to-regulate-crypto-cftc-chair-behnam-says-citing-cryptos-recent-uptick-in-value","publishDate":"2024-03-06T14:43:36","id":6939,"type":null,"title":"Legislation needed to regulate crypto, CFTC Chair Behnam says, citing crypto&#x27;s recent uptick in value","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Cryptocurrency related issues are consuming the Commodity Futures Trading Commission's resources as its Chair Rostin Behnam again urged lawmakers to act on legislation that would give the agency new authorities over the industry.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">More than 49 percent of the CFTC's enforcement actions in fiscal year 2023 were related to digital assets, and the market is continuing to grow, Benham said on Wednesday as he testified before the House Agriculture Committee.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It's a staggering statistic that a market we don't directly regulate is taking up half of our enforcement docket and it's not just the Division of Enforcement's resources that are consumed,\" Behnam told lawmakers. \"We need the experts from the different divisions to build a case.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Behnam also pointed to the recent <a href=\"https:\/\/www.theblock.co\/post\/280357\/bitcoin-price-breaks-above-previous-all-time-high-of-69000-after-846-days\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">increase<\/span><\/a> in cryptocurrencies' value and optimism from retail investors, calling it a \"cautionary tale.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"We need a regulatory structure,\" Behnam said. \"This is not about legitimizing the technology. This is about protecting Americans and protecting investors.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The House Agriculture Committee and the House Financial Services Committee worked last summer to advance the Financial Innovation and Technology for the 21st Century Act out of their committees. The bill would shift more <\/span><span class=\"s3\" data-v-f87c67ca=\"\">responsibility to the CFTC and would direct regulators to create a clear pathway for a digital asset to transition from being a security investment to a commodity.&nbsp;<\/span>","The <a href=\"https:\/\/www.theblock.co\/post\/262219\/cftc-chair-rostin-behnam-says-congress-needs-to-play-a-more-pivotal-role-in-how-agencies-regulate-crypto\" data-v-f87c67ca=\"\">bill's chances<\/a> of passing and reaching President Joe Biden's desk have been minimal due to a lack of necessary support.","During Wednesday's hearing, lawmakers, including Rep. Nikki Budzinski, D-Ill., asked about the potential for the CFTC to implement its regulatory framework quickly if the bill were to advance. Behnam said it would take the agency a year, while also adding that bitcoin's all time highs highlights a need for action.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">\"This notion of crypto going away I think is just a false narrative and it wouldn't be an understatement to suggest that there's another period of irrational exuberance going on with these price swings and the volatility,\" Behnam said. \"This just validates the fact that we need to act, Congress needs to act to fill this gap, specifically around bitcoin, which I think clearly is a commodity.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Other lawmakers said they were concerned about the bill being premature given that there experts appear confused on how to define centralized versus decentralized and that the CFTC is already heavily focused on crypto enforcement.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"You've got an industry that in just the last three years have lost $2 trillion on its market cap – that's 60 percent that is lost,\" said Rep. Greg Casar, D-Texas. \"It's really volatile, so I worry about that when we really need to be protecting farmers and ranchers and dealing with oil and wheat. This other industry where some of these experts are saying we still can't even really define what decentralized is, I worry about setting the CFTC up or the American people up for failure here.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Behnam said his priority is always going to be traditional commodity markets, but cited an increase in the value of crypto as a demonstration that there is \"real persistent adoption and demand from Americans to invest in this asset.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"We need to act, it is consuming a huge amount of our resources because there's so much fraud out there in the public space,\" Behnam said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Behnam was also asked during Wednesday's hearing about whether ether is a security or a commodity. Behnam has said ether is a commodity, while fellow regulators at the Securities and Exchange Commission have not been as clear.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">This comes as crypto platform Prometheum received a special purpose broker dealer license from the SEC last year and announced last month that its s<\/span><span class=\"s3\" data-v-f87c67ca=\"\">ubsidiary, Prometheum Capital LLC, will provide custodial services for <a href=\"https:\/\/www.theblock.co\/post\/276482\/digital-asset-firm-prometheum-sets-sights-on-offering-ether-custodial-services\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">ether<\/span><\/a>.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I am concerned that the SEC will use this as an opportunity to circumvent Congress and even the CFTC in the space to further confuse participants who are already in the field,\" said Rep. Zach Nunn, R-Iowa, on Wednesday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Behnam said earlier during the hearing that he had not been in communication with Prometheum but said it was an independent decision by the firm to custody ether and was not a decision by the SEC.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"How this plays out obviously is really critical,\" Behnam said. \"If we do have any action by the SEC to essentially validate that decision i.e. constituting ether as a security, it would then put our registrants, our exchanges who list ether as a futures contract sort of in non compliance of SEC rules as opposed to CFTC rules.\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zach Nunn","content":"PERSON"},{"type":"Financial Innovation","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Nikki Budzinski","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Prometheum","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"last summer","content":"DATE"},{"type":"49 percent","content":"PERCENT"},{"type":"Behnam","content":"PERSON"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"Greg Casar","content":"PERSON"},{"type":"$2 trillion","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Iowa","content":"LOCATION"},{"type":"House Agriculture Committee","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Benham","content":"PERSON"},{"type":"Ill.","content":"LOCATION"},{"type":"Texas","content":"LOCATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"60 percent","content":"PERCENT"},{"type":"last year","content":"DATE"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"fiscal year 2023","content":"DATE"},{"type":"Prometheum Capital LLC","content":"ORGANIZATION"},{"type":"Division of Enforcement","content":"ORGANIZATION"}],"hashtag":["HOUSE AGRICULTURE COMMITTEE","SEC"],"authors":["Sarah Wynn","The Block"]}