{"summary":"The FTX drainer wallet linked to a possible hack of the now-bankrupt crypto exchange continues to swap more tokens for ether.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188565\/ftx-drainer-consolidates-ether-holdings-to-reach-302-million","publishDate":"2022-11-19T04:39:46","id":6944,"type":null,"title":"FTX drainer consolidates ether holdings to reach $302 million","category":["CRYPTO ECOSYSTEMS"],"content":["The main crypto wallet associated with the FTX drainer, an entity responsible for siphoning funds from the bankrupt crypto exchange, now holds 250,735.1 ether (ETH) worth $302.6 million, according to an update by blockchain security outfit PeckShield.","The FTX drainer’s current ether holdings make this <a href=\"https:\/\/etherscan.io\/address\/0x59abf3837fa962d6853b4cc0a19513aa031fd32b\" data-v-f87c67ca=\"\">wallet<\/a> the 27th-biggest ETH holder, <a href=\"https:\/\/twitter.com\/peckshieldalert\/status\/1593878595180453888?s=46&amp;t=-uu_iV4e_PDeV3ZBd80nsQ\" data-v-f87c67ca=\"\">according<\/a> to PeckShield. It was <a href=\"https:\/\/www.theblock.co\/post\/187463\/ftx-drainer-sells-more-bnb-now-34th-largest-holder-of-eth\" data-v-f87c67ca=\"\">previously 34th<\/a> in the rankings, but a consolidation from other associated addresses increased its ETH funds.","Today’s fund consolidation was as follows: One associated account swapped over 44,000 binance coins (BNB) for 3,000 ETH and $7.5 million in stablecoins. The stablecoins were then swapped for 6,200 ETH and a total of 9,200 ETH was <a href=\"https:\/\/etherscan.io\/tx\/0x2a51e424bfaf6e400a65d902408da4a701493239d9447e86105db0ba534442be\" data-v-f87c67ca=\"\">transferred<\/a> to the main FTX drainer address. Two other associated wallets also transferred a total of more than 10,000 ETH to the main address.","The source of the FTX drainer funds comes from unusual crypto outflows from FTX amid the exchange’s collapse last week. The unusual nature of the outflows at a time when FTX paused withdrawals caused some speculation that it was a hack perpetrated by insiders. These funds have also been included in the <a href=\"https:\/\/www.theblock.co\/post\/187011\/ftx-million-creditors\" data-v-f87c67ca=\"\">FTX bankruptcy proceedings<\/a>.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$302.6 million","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"PeckShield","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$7.5 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX","USDC"],"authors":["Osato Avan-Nomayo","The Block"]}