{"summary":"MultiversX has introduced Guardians, an on-chain two-factor authentication (2FA) feature for wallet security.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239592\/multiversx-on-chain-2fa","publishDate":"2023-07-14T05:07:41","id":6945,"type":null,"title":"MultiversX introduces on-chain 2FA to combat theft and scams","category":["SECURITY"],"content":["MultiversX, formerly Elrond, introduced Guardians, an opt-in, on-chain two-factor authentication (2FA) security standard that aims to mitigate the risk of crypto scams and theft.","By leveraging popular 2FA methods like Microsoft Authenticator, Authy or Google Authenticator, users can ensure that only authorized actions are performed on their accounts, MultiversX said in a statement.","Cryptocurrency users have long been vulnerable to various scams and thefts, tricking them into validating fraudulent transactions and resulting in the loss of billions of dollars each year. A <a href=\"https:\/\/www.ftc.gov\/news-events\/news\/press-releases\/2022\/06\/new-analysis-finds-consumers-reported-losing-more-1-billion-cryptocurrency-scams-2021\" data-v-f87c67ca=\"\">report<\/a> from the Federal Trade Commission revealed that crypto phishing attacks alone lead to losses of over $1 billion annually. More broadly, total DeFi exploits are approaching <a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/exploits\/funds-stolen-by-defi-attackers\" data-v-f87c67ca=\"\">$3 billion<\/a> in funds stolen, according to The Block’s data dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/exploits\/funds-stolen-by-defi-attackers\/embed\" title=\"Funds Stolen by DeFi Attackers\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","With Guardians, users gain an added layer of security against common scams and thefts, MultiversX said, claiming that even in the event of compromised private keys, users can maintain control of their funds.","“The Guardians feature has been thoroughly battle-tested in a public $20,000 hacking competition, where hundreds of participants, including security experts, unsuccessfully tried to get the bounty from a guarded account despite knowing the 24 words secret phrase that has been leaked publicly,” it said.","“We still see too many users losing funds because they share their keys with strangers or on fake websites,\" MultiversX CEO Beniamin Mincu added. The cost of not taking action is easily in the billions of dollars and a significant obstacle adoption-wise. Guardians introduce an industry-first protection for users and make wallet accounts resilient against the most common scams and theft.”","The feature has already been integrated into multiple wallet solutions with a combined 1 million users, MultiversX claimed.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"billions of dollars","content":"MONEY"},{"type":"$3 billion","content":"MONEY"},{"type":"Federal Trade Commission","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$20,000","content":"MONEY"},{"type":"Beniamin Mincu","content":"PERSON"},{"type":"Microsoft Authenticator","content":"ORGANIZATION"},{"type":"Google Authenticator","content":"ORGANIZATION"}],"hashtag":["EXPLOITS","HACKS","WALLETS"],"authors":["James Hunt","The Block"]}