{"summary":"Elon Musk has moved to end the $44 billion deal to acquire Twitter, according to regulatory filings. \nTwitter, for its part, indicated that it plans legal action to enforce the Musk deal.","author":["Anushree Dave","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156722\/elon-musk-aims-to-terminate-44-billion-twitter-deal","publishDate":"2022-07-08T18:09:40","id":695,"type":null,"title":"Elon Musk aims to terminate $44 billion Twitter deal","category":["Companies"],"content":["Elon Musk has decided not to move forward with a $44 billion deal to acquire Twitter after a disagreement with the company about the number of spam and fake accounts. The details were revealed in a regulatory <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1418091\/000110465922078413\/tm2220599d1_ex99-p.htm\" data-v-f87c67ca=\"\">filing<\/a> on Friday.&nbsp;","Musk claims that Twitter did not provide adequate information regarding the number of spam accounts on Twitter.&nbsp;","\"In short, Twitter has not provided information that Mr.&nbsp;Musk has requested for nearly two months notwithstanding his repeated, detailed clarifications intended to simplify Twitter’s identification, collection, and disclosure of the most relevant information sought in Mr.&nbsp;Musk’s original requests,\" reads the filing.","In a filing in May, Twitter estimated that 5% of its accounts were fake.&nbsp;","\"While Twitter has provided some information, that information has come with strings attached, use limitations or other artificial formatting features, which has rendered some of the information minimally useful to Mr. Musk and his advisors,\" the filing reads.","Twitter, for its part, indicated that it plans legal action to enforce the Musk deal. \"The Twitter Board is committed to closing the transaction on the price and terms agreed upon with Mr. Musk and plans to pursue legal action to enforce the merger agreement,” Bret Taylor, chairman of the board, <a href=\"https:\/\/twitter.com\/btaylor\/status\/1545526087089696768\" data-v-f87c67ca=\"\">said in a tweet<\/a> late Friday. “We are confident we will prevail in the Delaware Court of Chancery.”","Twitter may have a legal edge, according to <a href=\"https:\/\/www.reuters.com\/technology\/twitter-has-legal-edge-deal-dispute-with-musk-2022-07-09\/\" data-v-f87c67ca=\"\">an analysis by Reuters<\/a>. Often in such cases, companies end up re-negotiating deals, or the acquirer pays the target company a settlement to walk away, it said.","<em data-v-f87c67ca=\"\">This story has been updated to include Twitter’s response.<\/em>"],"hashtag":[]}