{"summary":"Here are some trends to watch in the world of cryptocurrencies as we draw near 2023.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197850\/four-major-cryptocurrency-stories-to-track-as-we-head-toward-the-new-year","publishDate":"2022-12-25T06:07:54","id":6950,"type":null,"title":"Four major cryptocurrency stories to track as we head toward the New Year","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">There are trending stories to watch for in the world of crypto as we head toward 2023. Though it may be the holiday season, it seems there is always action in crypto. Here's what's potentially on the docket in the next few weeks:<\/span>","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Sam Bankman-Fried to face hearing<\/span><\/strong>","<span data-v-f87c67ca=\"\">Sam Bankman-Fried, the disgraced former CEO of major crypto exchange FTX, is <a href=\"https:\/\/www.nytimes.com\/2022\/12\/23\/business\/dealbook\/sbf-ftx-epic-fraud-lawsuit.html\" data-v-f87c67ca=\"\">scheduled to face<\/a> a legal hearing in New York on Jan. 3, following an array of fraud charges filed against him. Bankman-Fried was arrested in the Bahamas on Dec. 12 and after consenting to <a href=\"https:\/\/www.theblock.co\/post\/196807\/sam-bankman-fried-signs-us-extradition-papers-abc-news\" data-v-f87c67ca=\"\">extradition,<\/a> he arrived in the United States last week and was subsequently freed on bail.<\/span>","<span data-v-f87c67ca=\"\">The court proceedings have major implications not only for Bankman-Fried, but for the entire crypto industry.<\/span>","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">FTX, Binance and market stability<\/span><\/strong>","<span data-v-f87c67ca=\"\">The recent collapse of FTX, one of the biggest cryptocurrency exchanges, left many investors feeling uneasy about the safety of their funds. In response, many major exchanges attempted to demonstrate proof of reserves in order to reassure customers that their money was safe.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Even Binance, the world's biggest crypto exchange, has seen recent outflows and fought to restore confidence, with the company's leader promising to \"lead by example\" in embracing transparency, according to a Reuters <a href=\"https:\/\/www.reuters.com\/technology\/binances-books-are-black-box-filings-show-crypto-giant-tries-rally-confidence-2022-12-19\/\" data-v-f87c67ca=\"\">report<\/a>.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Binance CEO Changpeng Zhao first engaged accounting firm Mazars for an agreed-upon-procedures attestation. This differs from a traditional financial audit in that it only requires the accountant to perform specific verification procedures requested by the client. Mazars' work with Binance, therefore, did not instill the same level of confidence as a full independent audit might have, particularly with regard to the exchange's liabilities. <\/span><span data-v-f87c67ca=\"\">This was further compounded when Mazars <a href=\"https:\/\/www.theblock.co\/post\/195623\/mazars-pauses-crypto-audits\" data-v-f87c67ca=\"\">removed<\/a> its crypto attestations and announced that it would no longer work with crypto companies. <\/span>","<span data-v-f87c67ca=\"\">Without a full audit, there is no obvious way to independently verify whether crypto companies hold sufficient assets to cover their liabilities. Still, <\/span><span data-v-f87c67ca=\"\">Zhao has also questioned the abilities of large accounting firms to accurately audit crypto exchanges. <\/span>","<span data-v-f87c67ca=\"\">Over the next few weeks, it will be interesting to see if there are new developments on this front.<\/span>","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The fate of crypto markets in the New Year<\/span><\/strong>","The crypto asset market saw more than its fair share of drawdowns in 2022. As of the year's end, the largest crypto asset Bitcoin settled at about $16,000 from its all-time high of more than $69,000. Other cryptocurrencies have been struggling to stay afloat amid the market plunge and financial crises facing multiple firms operating in the space.","Even as the crypto market has been dragged down by losses this year, many enthusiasts are hopeful that 2023 will bring stability and increased liquidity to the space. Recently, there have been declines in trading volume; understandable given it is the time of year when many traders may be taking well-deserved breaks after a challenging period. Still, it is difficult to predict what will happen imminently and whether a recovery might begin in the first few weeks of the New Year.","Some analysts say that it will require some time before we see a stabilization of prices across different cryptos as well as Bitcoin itself. Still, as we enter 2023 there is some optimism among crypto enthusiasts who hope for a better performance than the \"bear market\" that was experienced in 2022.","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bad weather and Bitcoin<\/span><\/strong>","<span data-v-f87c67ca=\"\">Weather-related issues may continue to impact bitcoin miners in coming days — something that all cryptocurrency enthusiasts should keep an eye on as we move into the New Year. <\/span><span data-v-f87c67ca=\"\">The past week saw a major winter storm sweep across the United States, bringing bitter temperatures and power outages to many parts of the country. <\/span>","<span data-v-f87c67ca=\"\">In particular, the weather event has <a href=\"https:\/\/www.theblock.co\/post\/197800\/crypto-miners-bracing-for-impact-from-brutal-winter-storm\" data-v-f87c67ca=\"\">created<\/a> a unique set of challenges for bitcoin miners in the US. They rely on access to reliable electricity to conduct their operations, so any prolonged power outages have serious implications for their ability to engage in mining activities. Additionally, extreme cold can cause systems malfunctions that could further hinder operations. This will bear watching.<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/span><\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$16,000","content":"MONEY"},{"type":"Mazars","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$69,000","content":"MONEY"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Zhao","content":"PERSON"},{"type":"Dec. 12","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Jan. 3","content":"DATE"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"last week","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"December 2022","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}