{"summary":"Paxos has raised $300 million in fresh funding as it seeks out more PayPal-sized business clients.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/103142\/paxos-raises-300-million-as-it-looks-to-onboard-more-paypal-sized-clients","publishDate":"2021-04-29T06:00:10","id":6954,"type":null,"title":"Paxos raises $300 million as it looks to onboard more PayPal-sized clients","category":["BITCOIN"],"content":["\"You have to make hay while the sun is shining.\"","Chad Cascarilla, CEO and founder of Paxos, has had a lot of time to think about hay while staying in rural, upstate New York during the coronavirus pandemic.&nbsp;","He used the analogy to describe why his firm has raised a $300 million Series D fundraising round. The firm, which announced a Series C just a few months ago, said Thursday the latest round was led by Oak HC\/FT with participation from previous investors such as Declaration Partners, PayPal Ventures, and the Peter Thiel-cofounded Mithril Capital, among others. The fundraise values Paxos at $2.4 billion.","In an interview with The Block, Carscarilla cited the company's existing performance and opportunities as to why it's raising more money now. It's not so much price-based, but rather tied to the number of inbounds it is getting from large potential clients. The firm—known for powering the crypto trading offering for PayPal and Venmo—has several similarly sized clients it is engaging with seriously, according to Cascarilla, who cut his teeth as a hedge fund executive during the financial crisis.&nbsp;","\"We want to be able to invest in the team and the platform\" he said. \"Those clients want to make sure we are well-capitalized. These are the things we want to take advantage of in that window of opportunity.\"","Cascarilla spoke ambitiously about Paxos' recent growth. \"We thought we could add one customer the size of PayPal this year. I think we can add three to five,\" he told The Block.","Paxos <a href=\"https:\/\/www.theblockcrypto.com\/post\/81794\/paypal-to-enable-crypto-purchases-with-the-help-of-paxos\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">announced in October<\/a> that it would power the back-end of PayPal's crypto offering, providing the liquidity and regulatory capabilities for crypto buys and sells. While Paxos' native exchange itBit has sat on the lower end of crypto exchange rankings, it has seen significant growth since it stuck the deal. And new deals could lead to further growth.&nbsp;","","","Paxos thinks its regulatory approach to the crypto market will serve as a differentiator for would-be clients. Indeed, Paxos became the third crypto firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/102711\/paxos-occ-national-trust-bitlicense-charter\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">to nab a trust license<\/a> from the US Office of the Comptroller of the Currency last week.&nbsp;","Elsewhere, Paxos continues to wait for full clearance from the Securities and Exchange Commission to operate as a clearing agency. It was granted the go-ahead to clear stocks on the blockchain via a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/100630\/credit-suisse-instinet-same-day-settlement-paxos-blockchain-service\" data-v-f87c67ca=\"\">no-action<\/a> relief from the agency.&nbsp;","That blockchain-based settlement business, though not a money-maker today, could be the long-term business play that proves to be a boon for deep-pocketed investors, according to Cascarilla.&nbsp;","\"Crypto is a $2 trillion market,\" he said. \"But there is $70 trillion in market cap elsewhere and being able to operate in tokenizing real-world assets is part of our mission.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Peter Thiel","content":"PERSON"},{"type":"$2 trillion market","content":"MONEY"},{"type":"Paxos","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"PayPal Ventures","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Paxos","content":"PERSON"},{"type":"Carscarilla","content":"PERSON"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"upstate New York","content":"LOCATION"},{"type":"Chad Cascarilla","content":"PERSON"},{"type":"Mithril Capital","content":"ORGANIZATION"},{"type":"$2.4 billion","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$70 trillion","content":"MONEY"},{"type":"Cascarilla","content":"PERSON"},{"type":"US Office","content":"ORGANIZATION"},{"type":"$300 million","content":"MONEY"},{"type":"October","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}