{"summary":"Other ideas included discussing his antidepressant use, finding an ally in the media, and even polling Twitter on what to do next.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282969\/sam-bankman-fried-considered-blaming-lawyers-woke-agenda-to-protect-image","publishDate":"2024-03-16T19:28:54","id":6956,"type":null,"title":"Sam Bankman-Fried considered blaming lawyers, &quot;woke agenda&quot; to protect image","category":["COMPANIES"],"content":["\"Go on Tucker Carlsen [<em data-v-f87c67ca=\"\">sic<\/em>], come out as a republican.\" \"Come out as extremely pro crypto, pro freedom.\" \"Come out with a strong anti-Binance message.\"&nbsp;","These were just a few of the \"random\" and \"probably bad\" ideas that Sam Bankman-Fried reportedly considered in the days following his arrest, according to a new document published by prosecutors, as part of their argument that Bankman-Fried should be served with a <a href=\"https:\/\/www.theblock.co\/post\/282916\/prosecutors-lock-up-sbf-for-up-to-50-years\" data-v-f87c67ca=\"\">hefty sentence<\/a> of up to 50 years.&nbsp;","In the <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.590940\/gov.uscourts.nysd.590940.410.3_1.pdf\" data-v-f87c67ca=\"\">document<\/a>, a Google Doc written by Bankman-Fried, he appears to consider a variety of ways to restore his public image, though he acknowledged, \"these are all random probably bad ideas that aren’t vetted.\" Many of them involve blaming the lawyers and the bankruptcy process for stealing away his company, a line of argument Bankman-Fried has been <a href=\"https:\/\/www.nytimes.com\/2023\/09\/21\/technology\/ftx-sam-bankman-fried-lawyers.html\" data-v-f87c67ca=\"\">insistent<\/a> in promoting, though he was forbidden from arguing such during the trial.&nbsp;","In fact, were Bankman-Fried able to make it on Tucker Carlson's show, he planned on coming out as a republican and against \"the woke agenda,\" but also talking about \"...how the cartel of lawyers is destroying value and throwing entrepreneurs under the bus in order to cover up the incompetence of lawyers.\"&nbsp;","Bankman-Fried also considered speaking with other journalists, including Matt Levine of Bloomberg and Michael Lewis, who wrote the book Going Infinite chronicling Bankman-Fried's rise and fall. A separate document lists <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.590940\/gov.uscourts.nysd.590940.410.4_1.pdf\" data-v-f87c67ca=\"\">other potential figures in the media<\/a> whom Bankman-Fried thought might serve as allies.&nbsp;","Bankman-Fried may also have been considering discussing the effects of his antidepressant; the entry on the Google Doc simply reads \"Send this EmSam tweet thread,\" referencing the <a href=\"https:\/\/slate.com\/technology\/2022\/12\/sam-bankman-fried-ftx-emsam-patch-testimony-arrested.html\" data-v-f87c67ca=\"\">prescription medication<\/a> he has taken for most of his adult life and linking to another, unfortunately inaccessible, document.&nbsp;","Bankman-Fried's final two ideas? \"Send out a twitter poll asking people what to do\" and \"Try to get people to supor [<em data-v-f87c67ca=\"\">sic<\/em>] the true narratives.\"&nbsp;","Bankman-Fried is set to be sentenced on March 28. Bankman-Fried's lawyers and supporters have <a href=\"https:\/\/www.theblock.co\/post\/279630\/sam-bankman-frieds-family-and-jail-bunkmate-appeal-for-leniency-in-sentencing-citing-safety-concerns\" data-v-f87c67ca=\"\">asked<\/a> the court to impose a much more moderate sentence of 63 to 78 months.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tucker Carlsen","content":"PERSON"},{"type":"fall","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 28","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Google Doc","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Tucker Carlson","content":"PERSON"},{"type":"Matt Levine","content":"PERSON"},{"type":"Michael Lewis","content":"PERSON"}],"hashtag":["SAM BANKMAN-FRIED"],"authors":["Zack Abrams","The Block"]}