{"summary":"Late last night, the crypto exchange Bitfinex resolved a platform outage that temporarily halted trading.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285749\/bitfinex-platform-outage-halting-trading","publishDate":"2024-03-30T04:32:51","id":6957,"type":null,"title":"Bitfinex resolves platform outage after briefly halting trading","category":["EXCHANGES"],"content":["Late last night, the crypto exchange Bitfinex resolved a platform outage that temporarily halted trading.","\"We are investigating issues with platform reduced performances and have temporarily halted trading,\" the exchange's official X account <a href=\"https:\/\/twitter.com\/bitfinex\/status\/1773871772107948413\" data-v-f87c67ca=\"\">posted<\/a>.","Approximately two hours later, Bitfinex noted that it had identified the issue and began implementing a fix.","Less than ten minutes after that, the exchange announced that it was nearing a successful completion and would return in view-only mode with the option to cancel orders five minutes before re-opening trading.","The issue was officially resolved at 3:48 am UTC.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last night","content":"TIME"},{"type":"November 2023","content":"DATE"},{"type":"Bitfinex","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"}],"hashtag":[],"authors":["Adam James","The Block"]}