{"summary":"Amsterdam-based Flow Traders, a leading liquidity provider in the ETP space, has proclaimed itself Europe’s number crypto ETP market maker.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/95174\/etf-market-maker-flow-traders-revenue-crypto","publishDate":"2021-02-17T16:15:52","id":696,"type":null,"title":"European trading giant Flow Traders reports revenue bump thanks to crypto rally","category":["BITCOIN"],"content":["Amsterdam-based Flow Traders, a leading liquidity provider in the global market for exchange-traded products (ETPs), has proclaimed itself Europe’s number one market maker in cryptocurrency ETPs after seeing a spike in revenues in the fourth quarter of 2020.","In recently published financial results, the firm’s chief trading officer Folkert Joling said crypto trading had a “positive effect” on the business in the fourth quarter.","The company’s crypto trading activities still represent just a tiny fraction of the overall business. A Flow spokesperson told The Block it had traded more than $500 million in crypto ETPs on exchange and more than $100 million in crypto ETPs through Request for Quote trading in 2020. &nbsp;","By comparison, Flow traded more than €1.5 trillion in ETPs last year. Its overall net profit for the fourth quarter came in at €66.2 million, bringing net profit for the year to €464.5 million.","Market makers in the wider crypto market are also posting volumes that dwarf Flow’s crypto ETP business. The market maker B2C2, for example, regularly trades $1 billion over the counter (OTC) in a single day with institutional counterparties.&nbsp;","But in the still-nascent market for crypto ETPs, Flow — which provides liquidity to 15 exchanges globally — appears to be positioning itself for growth.","“We have seen a considerable increase in volumes both on screen and OTC. This has been evident in both the underlying spot markets as well as for ETP,” said Michael Lie, head of digital asset trading at Flow.","Bitcoin’s recent bull run — which has seen its price top $52,000 — appears to have triggered a similar spike in volumes in the crypto ETP market.","According to data sourced by Flow through Bloomberg, assets under management in Europe’s crypto ETP market grew from $746 million in January 2020 to more than $4.5 billion in January this year, while average daily volumes rose from $6 million to $149 million. CoinShares, VanEck, 21Shares are some of the best-known crypto ETP issuers, and many of their products are listed on the SIX Swiss Exchange.","The uptick in ETP volumes in Europe reinforces the narrative that bitcoin’s latest boom has been driven predominantly by institutional investment.","“The ETP and ETF market without a doubt provides a solid entry platform for institutions,” said Lie. “Many institutions still do not, or cannot, get direct exposure to the underlying spot market. This may be due to compliance, credit or operational reasons, such as how to custody the assets. Securities such as the ETF and ETPs remove a lot of these barriers.”","Since launching its crypto desk, Flow has been steadily building its capabilities and team to correspond with the growth of the wider crypto market, according to Lie.","Flow also runs trading both OTC and on-screen trading activities in spot crypto markets in order to sharpen its ETP pricing. &nbsp;","“Our wide presence on numerous venues covering spot and derivatives provides the tools to hedge and trade large block sizes with minimal impact,” Lie said.","European regulators — particularly those in Switzerland — have been more relaxed about the advent of crypto ETPs than their North American counterparts. Numerous attempts to launch similar products in the United States have stalled. The Ontario Securities Commission, meanwhile, has recently <a href=\"https:\/\/www.theblockcrypto.com\/linked\/95072\/ontario-securities-regulator-evolve-bitcoin-etf-approval\" data-v-f87c67ca=\"\">waved through a pair of bitcoin ETFs<\/a>. &nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Amsterdam","content":"LOCATION"},{"type":"January 2020","content":"DATE"},{"type":"Switzerland","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"Europe","content":"LOCATION"},{"type":"Swiss Exchange","content":"ORGANIZATION"},{"type":"Michael Lie","content":"PERSON"},{"type":"Folkert Joling","content":"PERSON"},{"type":"$746 million","content":"MONEY"},{"type":"$6 million","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Ontario Securities Commission","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"$52,000","content":"MONEY"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$4.5 billion","content":"MONEY"},{"type":"VanEck","content":"PERSON"},{"type":"$500 million","content":"MONEY"},{"type":"the fourth quarter of 2020","content":"DATE"},{"type":"OTC","content":"ORGANIZATION"},{"type":"$149 million","content":"MONEY"},{"type":"ETP","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"the fourth quarter","content":"DATE"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}