{"summary":"Zengo has launched a new feature called Legacy Transfer that allows users to designate a beneficiary who will inherit their cryptocurrency.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247937\/zengo-adds-crypto-inheritance-feature-to-its-keyless-wallet","publishDate":"2023-08-29T11:05:44","id":6964,"type":null,"title":"Zengo adds crypto inheritance feature to its keyless wallet","category":["CRYPTO ECOSYSTEMS"],"content":["Cryptocurrency wallet provider <a href=\"https:\/\/zengo.com\/\" data-v-f87c67ca=\"\">Zengo<\/a> has launched a feature called Legacy Transfer that allows users to designate a beneficiary who will inherit their cryptocurrency assets (in a non-custodial manner) if they become inactive for a specified period of time.","Users of Zengo’s wallet can designate future recipients for their crypto assets and have the flexibility to change or cancel these assignments as they see fit.","The Legacy Transfer feature is built upon Zengo’s existing Multi-Party Computation (MPC) infrastructure, which eliminates the need for traditional private keys or seed phrases. Instead, it centers on user controls and three-factor authentication (3FA).","“Because ensuring secure (and simple) self-custody remains a centerpiece of the crypto industry, we developed Legacy Transfer to offer a multi-chain inheritance-style solution for cryptoassets,” the team wrote.","Rather than relying on a single point of failure with traditional private keys, Zengo’s infrastructure divides the responsibilities of private key generation and signing between the user’s device and its servers. These components are secured through Threshold Signature Scheme (TSS) cryptography.","Since the shards are never stored in one location, this scattered approach enhances the security of the digital assets, providing better resilience against theft when compared to traditional single-point-of-failure private key wallets.","A <a href=\"https:\/\/github.com\/ZenGo-X\/public-docs\/blob\/main\/Zengo%20Legacy%20Transfer%20White%20Paper.pdf\" data-v-f87c67ca=\"\">whitepaper<\/a> outlining the technical aspects of the Legacy Transfer feature has been released by the Zengo X Research Team. Led by co-founder and CTO Tal Be’ery, the paper explains how the system leverages non-KYC, inheritance-style asset transfer methods.","Zengo is one of the leading MPC wallet providers, alongside firms like Fireblocks, Coinbase, Web3Auth, and others.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Zengo","content":"PERSON"},{"type":"Zengo X Research Team","content":"ORGANIZATION"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"TSS","content":"ORGANIZATION"},{"type":"CTO","content":"ORGANIZATION"}],"hashtag":["DEVELOPER TOOLS","WALLETS"],"authors":["Vishal Chawla","The Block"]}