{"summary":"Aave acquired web3 social mobile gaming app Sonar to integrate decentralized identities via Lens Protocol, targeting a launch in 2023.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192247\/aave-acquires-web3-social-gaming-app-sonar-to-expand-lens-protocol","publishDate":"2022-12-05T15:03:37","id":6966,"type":null,"title":"Aave acquires web3 social gaming app Sonar to expand Lens Protocol","category":["GAMING"],"content":["Aave purchased Sonar, a social gaming application with web3 support, to integrate its open-source tech stack for building decentralized social networks, Lens Protocol.","<span data-v-f87c67ca=\"\">Aave hired brothers and Sonar co-founders Ben South Lee and Randolph Lee to lead the effort expanding Lens across web3 services.<\/span>","<span data-v-f87c67ca=\"\">Aave Companies acquired Sonar, a mobile social gaming app that supports NFT-based avatars, in an effort to expand Lens Protocol for identity across web3 consumer products.<\/span>","<span data-v-f87c67ca=\"\">Sonar co-founder Ben South Lee joins Aave as senior vice president of product and design. His brother, Sonar co-founder Randolph Lee, will transition to a principal engineer role with Aave. The two will lead a team focused on developing mobile facing applications that integrate Aave’s Lens protocol, an open-source tech stack for building decentralized social networks.<\/span>","<span data-v-f87c67ca=\"\">Available on iOS, Sonar hosts thousands of active users who may interact with one another with avatars depicted as colorful dots or 3D characters for users who equip Moji NFTs to their profiles. <\/span><span data-v-f87c67ca=\"\">Aave is targeting 2023 for wider integration between Lens Protocol, Sonar as well as other web3 applications.<\/span>","<span data-v-f87c67ca=\"\">“Sonar will be the first social mobile metaverse powered by Lens Protocol,\" an Aave representative told The Block via email. \"For niche communities, being able to move seamlessly between applications in the Lens ecosystem without having to start from scratch will be important and one of the biggest differentiations from web2 apps.\"<\/span>","<span data-v-f87c67ca=\"\">The identity system provided by Lens will also integrate with Sonar. “Users will be able to mint Lens profiles and get ownership of their profiles and benefit from all the features Lens Protocol provides,” said Aave.<\/span>","<span data-v-f87c67ca=\"\">Specific terms of the deal were not disclosed.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Ben South Lee","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Randolph Lee","content":"PERSON"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}