{"summary":"Zeng Jiajun, a TikTok whistleblower, has raised $3 million for his web3 social recovery tool Soul Wallet, backed by Struck Crypto.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/220439\/struck-crypto-backs-social-recovery-tool-soul-wallet","publishDate":"2023-03-16T08:13:27","id":6968,"type":null,"title":"Struck Crypto backs TikTok whistleblower&#x27;s social recovery tool Soul Wallet","category":["DEALS"],"content":["Zeng Jiajun <a href=\"https:\/\/timesofmalta.com\/articles\/view\/censor-cannot-hold-pressure-ontrolling-chinas-internet.985796\" data-v-f87c67ca=\"\">used<\/a> to sit at his desk as a product manager at ByteDance in China generating lists of sensitive terms for content moderators to flag and potentially censor.","ByteDance is the Chinese internet technology company behind popular social media app TikTok. Through the Chinese Communist Party’s Content Quality Center, the Chinese government <a href=\"https:\/\/www.youtube.com\/watch?v=Q6ITajMN38g\" data-v-f87c67ca=\"\">played<\/a> a role in heavily censoring content on the platform. Once Jiajun recognized what he was <a href=\"https:\/\/timesofmalta.com\/articles\/view\/censor-cannot-hold-pressure-ontrolling-chinas-internet.985796\" data-v-f87c67ca=\"\">being<\/a> tasked to do was ultimately detrimental to society, he fled to the U.S. and <a href=\"https:\/\/www.youtube.com\/watch?v=Q6ITajMN38g\" data-v-f87c67ca=\"\">blew<\/a> the whistle on TikTok and China's content moderation practices.","He has now raised $3 million from investors including Struck Crypto to build Soul Wallet, a social recovery tool focused on helping users regain access to their wallets, according to a statement shared with The Block.&nbsp;","\"The wallet is the gateway, fundamental infrastructure for people to access such decentralized internet,\" said Jiajun in the statement.","“If we said bitcoin is the separation of currency and states, Ethereum is the separation of internet and states since it can run apps on top of it (the Ethereum network) permissionlessly while being censorship-resistant, which means states, especially authoritarian states like China, can’t shut down a decentralized application simply because they don’t like it,” he added.","Jiajun's Soul Wallet also <a href=\"https:\/\/blog.ethereum.org\/2023\/02\/14\/layer-2-grants-roundup\" data-v-f87c67ca=\"\">received<\/a> a Layer 2 community grant from the Ethereum Foundation. He hopes the tooling he builds will help combat censorship.","\"Soul Wallet brings important innovation to the Ethereum community in the form of account abstraction and social recovery, enabling users to recover a lost wallet in minutes,\" said Struck Crypto in the statement. \"This core technology innovation brings us one step closer to proliferating noncustodial wallets to the masses, lowering the barriers to accessing Ethereum for billions of users.\"","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Correction: Story updated after Soul Wallet corrected the size of their fundraise<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Zeng Jiajun","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"ByteDance","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Jiajun","content":"PERSON"},{"type":"Struck Crypto","content":"ORGANIZATION"},{"type":"$3 million","content":"MONEY"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Chinese Communist Party’s Content Quality Center","content":"ORGANIZATION"}],"hashtag":["SEED &AMP; PRE-SEED","WALLET MAKERS","WALLETS"],"authors":["Kari McMahon","The Block"]}