{"summary":"After overcoming regulatory hurdles, digital assets could overtake local currencies as a medium of exchange, a unit of account, and a store of value.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/92439\/crypto-electronic-store-value-bank-singapore-gold-1","publishDate":"2021-01-25T15:09:58","id":6972,"type":null,"title":"Cryptocurrencies could eventually partially replace gold, says new report by Bank of Singapore","category":["CRYPTOCURRENCY"],"content":["Cryptocurrencies could one day serve as a kind of electronic store of value, according to a report penned by the Bank of Singapore's chief economist.","<a href=\"https:\/\/www.bankofsingapore.com\/research\/will-cryptocurrencies-rival-gold-.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">The report<\/a> was written by chief economist Mansoor Mohi-uddin. The Bank of Singapore is a unit of Singapore's second-largest bank OCBC.","Mohi-uddin writes that cryptocurrencies are most likely to become more widely accepted as stores of value. As Mohi-uddin notes: \"Digital money may compete in future with gold as a potential safe-haven asset.\"","Yet in the report, Mohi-uddin couches this contention by stating that bitcoin and other cryptocurrencies are unlikely to take on a major role as a medium of exchange, noting:","\"Bitcoin’s staggering rally is on a par with the great investment booms of the last few decades including gold in the 1970s, Japanese equities in the 1980s, internet stocks in the 1990s, oil prices in the 2000s and technology companies in the 2010s. But cryptocurrencies are still very unlikely to replace national currencies as any economy’s principal medium of exchange. Instead, digital money over time may partially displace gold by offering an electronic - rather than physical - store of value.\"","As Mohi-uddin's argues, cryptocurrencies still need to overcome several hurdles, including trust, volatility, and regulatory acceptance in order to be perceived as a significant asset in investor portfolios.","Mohi-uddin also contends that recent changes in the U.S. regulatory sphere may also prove positive for cryptocurrency adoption. In terms of regulation, U.S. regulators may become more accepting of cryptocurrencies. The former head of the Commodity Futures Trading Commission (CFTC) Gary Gensler has been <a href=\"https:\/\/www.theblockcrypto.com\/linked\/90936\/gensler-biden-sec-nomination-report\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">nominated<\/a> to serve as the next chairman of the U.S. Securities and Exchange Commission (SEC).","According to the report, his expected appointment may result in the broader investment in cryptocurrencies as well as the approval of crypto-centric products like an exchange-traded fund (ETF) for bitcoin or another cryptocurrency.","\"This would, offer a trustworthy, reliable investment vehicle, allow fresh participants to enter digital currencies, improve liquidity, lower volatility, and help deal with reputational risks,\" the report states.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"1980s","content":"DATE"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"1990s","content":"DATE"},{"type":"Mohi","content":"LOCATION"},{"type":"Mohi","content":"PERSON"},{"type":"1970s","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Mansoor Mohi","content":"PERSON"},{"type":"Bank of Singapore","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"OCBC","content":"ORGANIZATION"},{"type":"2000s","content":"DATE"},{"type":"2010s","content":"DATE"}],"hashtag":["BITCOIN","CFTC","ETHEREUM","SEC"],"authors":["Saniya More","The Block"]}