{"summary":"Coinbase card allows users to liquidate the crypto in their accounts for GBP instantly, allowing them to pay at millions of stores or to withdraw cash. The Visa debit card is issued by PaySafe and can be managed using the Coinbase Card app.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/19139\/coinbase-launches-crypto-to-fiat-debit-card-in-the-uk-filling-gap-left-by-shift-shutdown","publishDate":"2019-04-10T19:01:30","id":6973,"type":null,"title":"Coinbase launches crypto-to-fiat debit card in the UK","category":["EXCHANGES"],"content":["<strong data-v-f87c67ca=\"\">Quick take&nbsp;<\/strong>","It didn’t take long. Just two months after <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/coinbase-partner-is-shutting-down-its-debit-card-in-april\/\" data-v-f87c67ca=\"\">Shift withdraw its debit card services from Coinbase<\/a>, the exchange has launched its own branded card for UK customers, <a href=\"https:\/\/medium.com\/@zeeshanf\/4c840e59a8d8\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">according to a press release.<\/a>","<a href=\"https:\/\/support.coinbase.com\/customer\/en\/portal\/articles\/2228646-the-shift-card\" data-v-f87c67ca=\"\">As with the Shift card<\/a>, the Coinbase card allows users to liquidate the crypto in their accounts for GBP instantly, allowing them to pay at millions of stores or to withdraw cash.","The Visa debit card is issued by PaySafe and can be managed using the Coinbase Card app. This links to users' accounts and allows them to pay in any crypto asset on their balance.","For now, the card is restricted to UK consumers, who can begin using the card as soon as it is posted. The company says it “plan[s] to support other European countries in the oncoming months.”","However, there are some fees attached, unlike with normal domestic Visa transactions. Issuing the card costs £4.95 ($6.48) and will charge 2.49% on each purchase (1.49% crypto conversion fee + 1% transaction fee). There is also a spending cap of £10,000 ($13,092) per day. There is no maintenance fee, but reversing a transaction will cost £20 ($26.19)","Whether the Brexit-weary country has an appetite for the card remains to be seen. Sources suggest Swift was discontinued due to low demand, though unconfirmed.","“I doubt there will be high demand or usage for it until people are incentivized to spending crypto, maybe more appealing in edging markets,” said Paul Veradittakit, a partner at Pantera.","“There are several challenges. People are not used to buying sandwiches with Apple stock, and most crypto assets fall into a similar mental bucket,” said Lex Sokolin, former director of Autonomous research. “Riding the open loop networks of Visa and MasterCard is a faster way to market, but not a transformational one in terms of industry economics.” Nonetheless, he praised Coinbase’s experience in the payment field and said the step was a “strategic option.\"","In 2017, <a href=\"https:\/\/www.businessinsider.com\/london-block-exchange-launches-prepaid-cryptocurrency-debit-card-2017-11?r=US&amp;IR=T\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">London Block Exchange planned to issue a prepaid Visa debit card<\/a> to convert crypto to GBP, with a £20 up-front fee. However, supply-complications meant it never reached the market.","In that sense, the Coinbase card is the first of its kind for a major crypto exchange in the UK. “Making crypto easier to use and spend is central to our mission to create a more open financial system,\" said UK CEO at Coinbase, Zeeshan Feroz.&nbsp;","A spokesperson clarified that crypto, equivalent to the amount spent, is liquidated immediately into fiat ensuring the correct value is captured at the time of the transaction. Funds are debited immediately from the customer's account.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2.49%","content":"PERCENT"},{"type":"$13,092","content":"MONEY"},{"type":"Coinbase, Zeeshan Feroz","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"$26.19","content":"MONEY"},{"type":"Lex Sokolin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"LOCATION"},{"type":"Brexit","content":"PERSON"},{"type":"London Block Exchange","content":"ORGANIZATION"},{"type":"1.49%","content":"PERCENT"},{"type":"GBP","content":"ORGANIZATION"},{"type":"MasterCard","content":"ORGANIZATION"},{"type":"$6.48","content":"MONEY"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Pantera","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"PaySafe","content":"ORGANIZATION"},{"type":"Paul Veradittakit","content":"PERSON"}],"hashtag":[],"authors":["Isabel Woodford","The Block"]}