{"summary":"Ethereum users have flooded into Puffer Finance in less than two weeks due to the lure of a potential airdrop.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277137\/puffer-finance-hits-850-million-in-tvl-now-second-largest-liquid-restaking-protocol","publishDate":"2024-02-12T09:39:10","id":6974,"type":null,"title":"Puffer Finance hits $850 million in TVL, now second-largest liquid restaking protocol","category":["CRYPTO ECOSYSTEMS"],"content":["The total amount of value locked in Ethereum liquid restaking protocol Puffer Finance has reached $850 million, making it the second-largest protocol of its kind.","Puffer Finance, which launched on Feb. 1, lets users deposit ether and receive a liquid staking token that earns yield from ETH staking and restaking (where the same ETH is staked with multiple protocols to get extra yield).&nbsp;","On its first day, Puffer Finance saw a TVL of $146 million, <a href=\"https:\/\/defillama.com\/protocols\/liquid%20restaking\" data-v-f87c67ca=\"\">according to DefiLlama<\/a>. A few days later it had overtaken similar projects Renzo and Kelp DAO to break into second place among liquid restaking protocols. On Feb. 10 it passed the $850 mark and remains not far off the market leader ether.fi, which has $1.04 billion in TVL —&nbsp;a figure that has been <a href=\"https:\/\/defillama.com\/protocol\/ether.fi\" data-v-f87c67ca=\"\">increasing exponentially<\/a>.","To encourage adoption, Puffer Finance has been running a five-stage points program that gives points to those depositing their assets and interacting with the platform — something that may have spurred the rise in TVL.&nbsp;","Points are an <a href=\"https:\/\/www.theblock.co\/post\/274587\/crypto-projects-40-billion-points?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">increasing trend<\/a> in the industry, where they are often used ahead of an airdrop to decide how it’s allocated. However, airdrops are typically not confirmed in advance, and points programs don’t necessarily result in them.","Another reason behind the increase in adoption may be Puffer Finance’s anti-slashing tool. “In theory this should allow validators to reduce the risk of slashing while enhancing capital efficiency,” Charles Booth, growth at Parsec Finance, noted in a recent newsletter.&nbsp;","“While an element of the TVL growth will be driven by airdrop farmers looking for a piece of the native Puffer governance token, the rapid pace of TVL growth could be the market tipping its hand with respect to which might be the leading [native liquid restaking protocol] going forward,” he said.","Ahead of its launch, Puffer Finance <a href=\"https:\/\/www.theblock.co\/post\/275102\/binance-labs-puffer-investment\" data-v-f87c67ca=\"\">announced investment<\/a> from Binance Labs. Before Binance Labs' investment, Puffer raised funds from other high-profile investors, including Brevan Howard Digital, Jump Crypto and Lightspeed Faction. The project<a href=\"https:\/\/www.prnewswire.com\/news-releases\/puffer-finance-raises-5-5m-seed-funding-to-strengthen-ethereum-decentralization--scalability-301896002.html\" data-v-f87c67ca=\"\"> raised<\/a> a $5.5 million seed round last August and a $650,000 pre-seed round initially.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TVL","content":"ORGANIZATION"},{"type":"$146 million","content":"MONEY"},{"type":"Feb. 10","content":"DATE"},{"type":"Brevan Howard Digital","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Feb. 1","content":"DATE"},{"type":"Charles Booth","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$1.04 billion","content":"MONEY"},{"type":"Lightspeed Faction","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Parsec Finance","content":"ORGANIZATION"},{"type":"$850 million","content":"MONEY"},{"type":"$850 mark","content":"MONEY"},{"type":"Jump Crypto","content":"LOCATION"},{"type":"$650,000","content":"MONEY"},{"type":"$5.5 million","content":"MONEY"},{"type":"DefiLlama","content":"ORGANIZATION"},{"type":"Puffer Finance","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["STAKING"],"authors":["Tim Copeland","The Block"]}