{"summary":"A mistake enabled someone to spend $50,000 to receive $1.43 million of olympus (OHM) tokens when they should have received far less.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/125170\/olympusdao-mistake-lets-user-spend-50000-to-buy-1-43-million-in-ohm","publishDate":"2021-11-23T12:17:13","id":6976,"type":null,"title":"OlympusDAO mistake lets user spend $50,000 to buy $1.43 million in OHM","category":["CRYPTOCURRENCY"],"content":["A mistake enabled someone to spend $50,000 to receive $1.43 million of olympus (OHM) tokens when they should have received far less, according to an <a href=\"https:\/\/discord.com\/channels\/798328113087119371\/805854637163806751\/912700252753104908\" data-v-f87c67ca=\"\">update<\/a> in the OlympusDAO Discord.","\"Earlier today someone bonded an OHM\/DAI bond that was presumed to be closed off. This enabled the user to have a substantial discount resulting in the user receiving 1697 ohm instead of 59 ohm. After this occurred, we took immediate action and the bond contract has been shut down in the meantime,\" wrote an admin named Wartull.","OlympusDAO is an experimental project in the cryptosphere. The DAO manages a token treasury that's used to back the OHM currency. The purpose of the treasury is to make sure the token maintains a certain floor price. If the token drops below that price, the assets in the treasury can be sold to buy back OHM tokens — with the goal to bring its price back above that mark.","The DAO uses a process for helping the token to stay above that mark called Bonding. The DAO buys assets from investors (to go into the treasury) and issues OHM tokens to replace them. These bonds usually get a 5-10% discount and the tokens are handing out after a vesting period, which is currently set to five days.","One bond is for liquidity tokens (LP) for the OHM\/DAI pool on SushiSwap. Olympus DAO mistakenly believed they had shut down this bond but didn't actually do so.","Somebody used this bond to sell $50,000 of OHM\/DAI LP tokens <a href=\"https:\/\/etherscan.io\/tx\/0x15ad11aa3d9ca8aebe840ebc0defd03bc374356ff6c112d83464160f6bd86b82\" data-v-f87c67ca=\"\">for 1,697 OHM<\/a>, worth $1.43 million. Instead, they should have received only around $52,000 to $55,000 of OHM. The OHM tokens they received will be distributed over five days.","According to the update, there was a safety limit in place that stopped the user from being able to withdraw even more tokens. The OlympusDAO community is scheduled to host a community call on Thursday to discuss the incident.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1697","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"$50,000","content":"MONEY"},{"type":"Wartull","content":"PERSON"},{"type":"$52,000","content":"MONEY"},{"type":"DAI LP","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$1.43 million","content":"MONEY"},{"type":"OHM","content":"ORGANIZATION"},{"type":"ohm","content":"ORGANIZATION"},{"type":"$55,000","content":"MONEY"}],"hashtag":["CRYPTO"],"authors":["Tim Copeland","The Block"]}