{"summary":"Block is building out its Bitcoin mining and wallet team in an ongoing hiring blitz. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179211\/block-is-on-a-bitcoin-mining-and-wallet-hiring-spree","publishDate":"2022-10-22T19:52:34","id":6977,"type":null,"title":"Block is on a Bitcoin mining and wallet hiring spree","category":["COMPANIES"],"content":["Payments firm Block is on a hiring spree to build out its Bitcoin mining and wallet hardware businesses.&nbsp;","The company is hiring heads of <a href=\"https:\/\/www.linkedin.com\/jobs\/search\/?currentJobId=3305262637&amp;f_C=80086817&amp;keywords=block\" data-v-f87c67ca=\"\">Bitcoin mining policy<\/a>, <a href=\"https:\/\/www.linkedin.com\/jobs\/search\/?currentJobId=3121528079&amp;f_C=80086817&amp;keywords=block\" data-v-f87c67ca=\"\">communications<\/a>, and <a href=\"https:\/\/www.linkedin.com\/jobs\/search\/?currentJobId=3273793854&amp;f_C=80086817&amp;keywords=block&amp;start=25\" data-v-f87c67ca=\"\">partnerships<\/a>, according to several job postings published to LinkedIn over the past two weeks.&nbsp;","In a job advertisement posted to LinkedIn on Saturday for a \"test hub lead,\" the firm said its mining team develops \"bitcoin mining ASIC, bitcoin mining rig, and associated systems, software and infrastructure.\"","The test hub, according to the ad, will \"host Block's mining hardware and will be used to test the hardware and software and the overall operational issues (power, cooling, dust, restart, performance monitoring, connectivity to pool) of the mining system.\"","The firm is also hiring product and engineering talent \"to develop the next generation of mining ASIC\" and to build its \"first mining rig\" and \"future mining rig product lines.\" It also has several positions related to wallet design. Block revealed its <a href=\"https:\/\/www.protocol.com\/bulletins\/block-bitcoin-hardware-wallet\" data-v-f87c67ca=\"\">Bitcoin hardware wallet<\/a> this past spring.&nbsp;","Formerly known as Square, Block has made a huge bet on Bitcoin and decentralized finance.","For instance, Block's decentralized finance unit, TBD, <a href=\"https:\/\/www.theblock.co\/post\/174714\/how-circles-new-partnership-with-tbd-is-connecting-crypto-to-the-real-world\" data-v-f87c67ca=\"\">announced<\/a> earlier this month a stablecoin partnership with Circle.","As for mining, Block’s general manager for hardware, Thomas Templeton, outlined the company's Bitcoin mining ambitions in January, as <a href=\"https:\/\/www.cnbc.com\/2022\/01\/13\/block-formerly-square-is-building-a-system-for-bitcoin-miners.html\" data-v-f87c67ca=\"\">reported<\/a> by CNBC.","“Common issues we’ve heard with current systems are around heat dissipation and dust. They also become non-functional almost every day, which requires a time-consuming reboot. We want to build something that just works,” Templeton said on Twitter. “They’re also very noisy, which makes them too loud for home use.”","Block is making a push into mining during a period that’s difficult for the sector. Companies have seen their profit margins squeezed in the past few months, as bitcoin’s value dropped and energy prices went up, along with global hash rate and mining difficulty.","<em data-v-f87c67ca=\"\">Catarina Moura contributed reporting.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Block","content":"ORGANIZATION"},{"type":"Square","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"spring","content":"DATE"},{"type":"Thomas Templeton","content":"PERSON"},{"type":"Catarina Moura","content":"ORGANIZATION"},{"type":"TBD","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Templeton","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"}],"hashtag":["BLOCK","HIRING"],"authors":["Kollen Post","The Block"]}