{"summary":"The Block’s Frank Chaparro chats with Galaxy Digital&#x27;s Head of Mining Amanda Fabiano in today&#x27;s episode.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109338\/galaxy-digitals-mining-lead-breaks-down-china-and-bitcoins-energy-footprint","publishDate":"2021-06-23T15:03:13","id":6978,"type":null,"title":"Galaxy Digital&#x27;s mining lead breaks down China and bitcoin&#x27;s energy footprint","category":["THE BLOCK"],"content":["<i data-v-f87c67ca=\"\">Episode <\/i><strong data-v-f87c67ca=\"\">34<\/strong><i data-v-f87c67ca=\"\"> of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Galaxy Digital’s Head of Mining Amanda Fabiano. <\/i>","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on <\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Play<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\"> or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"a4d4cbc0c7c5d7d0e4d0ccc1c6c8cbc7cfc7d6ddd4d0cb8ac7cbc9\">[email&nbsp;protected]<\/a>.<\/i>","<strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/eventussystems.com\/\" data-v-f87c67ca=\"\">Eventus<\/a>, <a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>, and Exodus<\/strong>","<em data-v-f87c67ca=\"\">Eventus is the leading global provider of multi-asset class trade surveillance, transaction monitoring and market risk solutions. Eventus offers a powerful, award-winning trade surveillance platform that is easy to deploy, customize and operate. Eventus is proven in the most complex, high-volume and real-time environments and supports many of the industry’s leading crypto exchanges including Coinbase, Gemini, ErisX and OSL. The company’s rapidly growing client base relies on Eventus’ responsive support and product development teams to overcome its most pressing regulatory challenges.<\/em>","<strong data-v-f87c67ca=\"\">About Kraken<\/strong>","<em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit <\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\"> to get started today.<\/em>","<strong data-v-f87c67ca=\"\">About Exodus<\/strong>","&nbsp;","<span data-v-f87c67ca=\"\">Bitcoin mining continues to make headlines this week as China ramps up its clampdown on the long-running — and once-dominant — sector.<\/span>","<span data-v-f87c67ca=\"\">In the latest episode of The Scoop podcast, Amanda Fabiano — who leads Galaxy Digital’s mining business — explained exactly what is happening in China, noting that authorities there recently ordered bitcoin mining projects to close in the southwest province of Sichuan. <\/span>","<span data-v-f87c67ca=\"\">However, this could provide a bull case for North American mining, as miners are pushed out of China in search of areas with cheaper sources of energy <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/109190\/bit-mining-bitcoin-miners-kazakhstan\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">like Kazhakstan<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">“A lot of people have built lives there on Bitcoin mining. They were the first people who dove into how to set up these large mining facilities. They have been holding the Bitcoin network up and running it forever. So I genuinely feel for the groups that have been working on that... On the other side, I think it's really bullish for North American mining. And I also think it's a testament to how the Bitcoin network is so resilient. An entire country just banned Bitcoin mining that is supposedly accounting for the largest hash distribution in the world. And yet the Bitcoin network continues on.”<\/span>","<span data-v-f87c67ca=\"\">Rising concerns about curbing the energy consumption in bitcoin mining in China have also lead to ESG initiatives in the hopes of producing sustainable mining solutions. <\/span>","<span data-v-f87c67ca=\"\">But the promise of a sustainable coin seems like one too good to be true. Fabiano dispels some of the misconceptions around bitcoin mining and what it really looks like for a coin to be mined with renewable energy.<\/span>","<span data-v-f87c67ca=\"\">“So when we think about the amounts of electricity, for example, that's lost in energy end transmission and distribution it's 19 times that of the Bitcoin network. And the energy footprint of always-on electrical devices in America is 12.1 times that of the Bitcoin network,\" Fabiano said, adding:<\/span>","<span data-v-f87c67ca=\"\">\"But what we always hear is how Bitcoin is ruining the world. <\/span><span data-v-f87c67ca=\"\">We don't care about how your toaster being left on is ruining the world because people don't care that much about it. I think it's really easy to pick on bitcoin’s energy consumption <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">because it is so transparent<\/span><\/i><span data-v-f87c67ca=\"\">.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sichuan","content":"LOCATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"Fabiano","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"America","content":"LOCATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"OSL","content":"ORGANIZATION"},{"type":"Kazhakstan","content":"LOCATION"},{"type":"Spotify","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"ESG","content":"LOCATION"},{"type":"Galaxy Digital’s Head of Mining Amanda Fabiano","content":"ORGANIZATION"},{"type":"Amanda Fabiano","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["BITCOIN","MINING"],"authors":["Frank Chaparro","The Block"]}