{"summary":"FINRA found some common themes in a sweep of its member firms, including false statements that crypto functioned like cash or cash equivalents, according to a report released on Tuesday. ","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274133\/finra-says-70-of-crypto-communications-it-reviewed-violated-rules","publishDate":"2024-01-23T13:47:20","id":698,"type":null,"title":"FINRA says 70% of crypto communications it reviewed violated rules","category":["Policy"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A top watchdog overseeing brokerage firms and exchange markets says 70 percent of communications about crypto may have violated its rules to be fair and balanced with the public.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Financial Industry Regulatory Authority, or FINRA, found some common themes in a sweep of its member firms, including false statements that crypto functioned like cash or cash equivalents. It also saw comparisons of crypto to other assets such as stocks and misrepresentations that federal securities laws or FINRA rules applied to crypto, according to a <a href=\"https:\/\/www.finra.org\/rules-guidance\/guidance\/targeted-examination-letters\/sweep-update-jan2024\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">report<\/span><\/a> released on Tuesday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">FINRA, which is overseen by the Securities and Exchange Commission, began the <a href=\"https:\/\/www.theblock.co\/post\/188284\/finra-is-investigating-communications-of-crypto-firms\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">sweep<\/span><\/a> in November that was tasked with reviewing member firms' communications with retail customers related to crypto and crypto services.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Specifically, FINRA analyzed 500 retail communications to see whether the firms were compliant with its rules that require broker-dealer communications with the public to be \"fair and balanced\" and prohibit claims that are \"exaggerated, promissory, unwarranted or misleading,\" FINRA said a handful of firms in the exam had most of the potential violations.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"With the growth in this market and increased interest in crypto assets, the potential harm caused by problematic communications has also increased … [I]n order to have enough information to evaluate a crypto asset investment or service, communications need to clearly describe its risks and features,” Ira Gluck, senior director in FINRA's advertising regulation department, said in a statement.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">FINRA reviews written communications such as print ads, but also \"anything from a 90-minute podcast by the firm or a 15-second spot during the Super Bowl\" Gluck also noted during a FINRA episode posted on Tuesday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Regulatory agencies, including the SEC and the Commodity Futures Trading Commission, have also turned their focus to crypto over the years. Just this past year, both agencies levied enforcement actions against large crypto exchanges and firms.&nbsp;&nbsp;<\/span>"],"hashtag":[]}