{"summary":"How FTX impacted NFTs and gaming. Removing royalties pays off for Magic Eden&#x27;s market share. Remembering the brief hype that was Art Gobblers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191365\/november-nft-data-wrap-has-removing-royalties-paid-off-for-magic-eden","publishDate":"2022-12-01T13:23:18","id":6987,"type":null,"title":"November NFT data wrap: Has removing royalties paid off for Magic Eden?","category":["METAVERSE & NFT"],"content":["While November has been a rough month for a lot of people with the fall of FTX reverberating around the crypto space, most NFT and gaming firms have so far been spared the brunt of the fallout.","Amid the chaos, NFT marketplaces are continuing to battle it out for market share. Blur has surpassed X2Y2 in terms of transactions and sales volume, while Magic Eden's gamble on removing royalties appears to have paid off.","We also take a look at some of the data behind NFT collections that hit the headlines last month. What happened when the hype around Art Gobblers died down? And does it pay to be doxxed? Read on.","Of the mint revenues of the top 45 NFT projects, 15.4% of the funds were <a href=\"https:\/\/www.theblockresearch.com\/rapid-insights-ftx-collapse-largely-spares-nft-treasuries-186765\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">sent to FTX<\/a>, according to The Block research. Of that, 94.9% belonged to Yuga Labs and was earned from the Mutant Ape Yacht Club Launch. The remainder came from the Taiwanese king of pop Jay Chou’s PhantaBear collection.","Yuga Labs denied it had funds on FTX on Nov. 9. Two days later it said that it had used FTX US in the past but had moved 19,700 ETH off the exchange on the same day it denied having funds on it.","Star Atlas had less luck, with about half of its treasury now stuck on FTX. It said it’s looking for investors, but it’s also launched four NFT mints for this month, selling ships for its as-yet-unreleased game at heavily discounted prices.","In terms of <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-alameda-research-ftx-ventures-portfolio-185597\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">investments<\/a>, about 25% of Alameda and FTX Venture’s portfolio is tied to NFTs and gaming.","","","One firm in which it invested, Solana-based Metaplex, has since <a href=\"https:\/\/www.theblock.co\/post\/188357\/solana-based-metaplex-lays-off-staff-following-ftx-collapse\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">laid off some staff<\/a> but said it was not a direct result of the FTX collapse.&nbsp;","Frank, founder of Dust Labs and its NFT collections DeGods, t00bs and y00ts, was doxxed at the end of November. In real life, he’s 23-year-old <a href=\"https:\/\/twitter.com\/frankdegods\/status\/1597645542787411968\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Rohun Vora<\/a>, a former student at UCLA and former fellow at Y-Combinator. He said he’s decided that he likes the name Frank and is going to keep it.","The revelations led to several Solana NFT influencers doxxing themselves in solidarity, and it seems to have had a positive impact on the floor prices of the collections.","","","DeGods’ floor price (above) rose from 311.69SOL ($4,159) on Nov. 29 to 382.69SOL ($5,414) by Dec. 1, according to data from <a href=\"https:\/\/solanafloor.com\/nft\/degods\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Solana Floor<\/a>.","As of the end of October, companies filed 4,997 metaverse-related U.S. trademark applications. The number already dwarfs 2021’s total of 1,890 for the entire year.","But things are decelerating. Application filings peaked in March with 773, <a href=\"https:\/\/twitter.com\/KondoudisLaw\/status\/1589637194066821120\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">according<\/a> to trademark lawyer Mike Kondoudis. For October, the number was less than half that at just 334.","","","The totals aren’t yet tallied up for November, but among those Kondoudis has flagged as submitting applications are Nike, Mastercard, BMW, Home Deport, the University of Alabama, Enterprise and Rolex.","Meta filed four new trademark applications claiming plans for virtual and augmented reality hardware on Nov. 4.","Around 41% of women had used a primary metaverse platform or participated in a digital world for more than a year compared to 34% of men, <a href=\"https:\/\/www.mckinsey.com\/featured-insights\/diversity-and-inclusion\/even-in-the-metaverse-women-remain-locked-out-of-leadership-roles\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">data<\/a> from McKinsey reveal. A further 35% of women surveyed spend more than three hours a week in the metaverse versus 29% of men.","","","Women are more likely to engage in hybrid use cases in the metaverse, traversing both physical and digital worlds to take part in activities such as gaming, fitness, education, live events, and shopping via AR\/VR technologies.","","","\"By contrast, men are using the metaverse to participate in purely digital experiences such as gaming, trading non-fungible tokens (NFTs), and attending social events,” the company said.","But while female executives were also more likely to implement multiple metaverse initiatives at their companies, metaverse companies themselves are still dominated by men.","Of all the companies that the study looked at, namely members of the Metaverse Standards Forum and the Open Metaverse Alliance for Web3 (OMA3), only 8-10% are led by women.","That’s roughly the same as the percentage of Fortune 500 companies run by women, McKinsey said.","Newcomer NFT aggregator Blur has taken the number two spot on the Ethereum NFT marketplace leagues tables from slightly older newcomer X2Y2. In November, Blur had $131.19m in sales volumes compared to $119.64m at X2Y2.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/nft-marketplace-monthly-volume\/embed\" title=\"NFT Marketplace Monthly Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The dethroned X2Y2 held the spot for the past seven months, with only OpenSea claiming more transactions and a higher sales volume on Ethereum.","Despite attempts by other markets to lure away its customers with low-or-no transaction fees, removing royalties and tempting customers away with airdrops, OpenSea remains the most popular platform for NFTs on Ethereum.","It has generated over <a href=\"https:\/\/www.theblock.co\/post\/190900\/opensea-nft-creators-earned-1-billion-royalties\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">$1 billion in royalties<\/a> for creators from Jan 1. and stood by the royalty system even as other prominent marketplaces said they had no choice but to make them optional.","But its market share has shrunk substantially in the face of its aggressive new competitors.","At the start of this year, it had 95.9% of the Ethereum NFT market. By the end of November, that had fallen to under 45%.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/share-of-nft-marketplace-volume\/embed\" title=\"Share of NFT Marketplace Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","On Solana, Magic Eden faced a similar dilemma of shrinking market share earlier this year. But it made royalties optional, even while singing their praises and <a href=\"https:\/\/www.theblock.co\/post\/178362\/magic-eden-coo-calls-0-royalties-a-prisoners-dilemma\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">pledging<\/a> to find ways to enforce them.","But the switch to optional royalties on its own platform had the desired effect, and it has clawed back market share from competitors. Since Oct.14, it has expanded its share from just under 80% to 93%.","","","You may have already forgotten, but Art Gobblers NFTs were all the rage at the start of November. After launching on Oct. 31, they reached a floor price of 13 ETH within 12 hours, peaking on Nov.2 at 20.4 ETH, according to <a href=\"https:\/\/opensea.io\/collection\/artgobblers\/analytics\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">OpenSea<\/a>. A few days later, the floor price was down to around 4 ETH, where it’s sat ever since.","","","Designed by Rick and Morty co-creator Justin Roiland, Art Gobblers faced criticism for handpicking individuals for initial allowlist spots for its mint. Others claimed influencers promoted the project without disclosing their arrangements with the Art Gobblers team. Proponents of Art Gobblers have denied this.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nov. 29","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Nov. 4","content":"DATE"},{"type":"Rick","content":"PERSON"},{"type":"34%","content":"PERCENT"},{"type":"McKinsey","content":"ORGANIZATION"},{"type":"Mutant Ape Yacht Club Launch","content":"ORGANIZATION"},{"type":"Nov. 9","content":"DATE"},{"type":"$5,414","content":"MONEY"},{"type":"Rohun Vora","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Frank","content":"PERSON"},{"type":"Kondoudis","content":"PERSON"},{"type":"35%","content":"PERCENT"},{"type":"Jay Chou","content":"PERSON"},{"type":"94.9%","content":"PERCENT"},{"type":"Justin Roiland","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Solana NFT","content":"ORGANIZATION"},{"type":"$131.19","content":"MONEY"},{"type":"45%","content":"PERCENT"},{"type":"University of Alabama, Enterprise","content":"ORGANIZATION"},{"type":"93%","content":"PERCENT"},{"type":"41%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Oct. 31","content":"DATE"},{"type":"Metaverse Standards Forum","content":"ORGANIZATION"},{"type":"Open Metaverse Alliance","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"95.9%","content":"PERCENT"},{"type":"Magic Eden","content":"ORGANIZATION"},{"type":"Ethereum NFT","content":"ORGANIZATION"},{"type":"15.4%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"$1 billion","content":"MONEY"},{"type":"BMW","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"UCLA","content":"ORGANIZATION"},{"type":"29%","content":"PERCENT"},{"type":"Nov.2","content":"DATE"},{"type":"Dec. 1","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"$119.64","content":"MONEY"},{"type":"$4,159","content":"MONEY"},{"type":"Nike","content":"ORGANIZATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"Morty","content":"ORGANIZATION"},{"type":"Oct.14","content":"DATE"},{"type":"Solana Floor","content":"ORGANIZATION"},{"type":"Home Deport","content":"LOCATION"},{"type":"Mike Kondoudis","content":"PERSON"},{"type":"October","content":"DATE"}],"hashtag":["MAGIC EDEN","OPENSEA"],"authors":["Callan Quinn","The Block"]}