{"summary":"The BIS outlined three approaches to addressing risks in crypto markets, including banning in extreme cases.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201636\/bank-of-international-settlements-outlines-policy-approaches-to-ban-contain-or-regulate-crypto","publishDate":"2023-01-12T13:21:37","id":6988,"type":null,"title":"Bank of International Settlements outlines policy approaches to ban, contain or regulate crypto","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">The Bank of International Settlements (BIS) suggests that authorities can take three different approaches when it comes to crypto following a particularly turbulent year: Regulate, contain or call for a complete ban of the sector.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The global group of central bankers also posed an alternative to “encourage sound innovation” with Central Bank Digital Currencies, according to the report about addressing risks in crypto <\/span><a href=\"https:\/\/www.bis.org\/publ\/bisbull66.htm\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">published<\/span><\/a><span data-v-f87c67ca=\"\"> on Thursday.<\/span>","<span data-v-f87c67ca=\"\">The BIS outlined the advantages and drawbacks of each of the three approaches and noted they could be mixed and matched to apply to different risks they perceive. The ongoing saga surrounding the collapse of FTX and the crash of the stablecoin TerraUSD were the main events cited.<\/span>","<span data-v-f87c67ca=\"\">Without “gateways” like centralized exchanges, “crypto would have to rely on users taking self-custody of their funds in digital wallets using private keys,” the report said. “Given the risks involved, mainstream adoption would be inconceivable.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Banning crypto would be an “extreme option” and limit innovation. The BIS acknowledges that banning borderless decentralized activities is difficult. Putting a ban on centralized intermediaries would be more effective, but could push such activities to another jurisdiction.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The other options would be to isolate crypto from traditional financial economies and to regulate the sector in a way similar to the financial services sector.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bank of International Settlements (BIS","content":"ORGANIZATION"},{"type":"Central Bank Digital Currencies","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BIS","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Inbar Preiss","The Block"]}