{"summary":"Leslie Alessandra, the owner of the property that sold for $650K backed by an NFT, spent over $15K listing the property, not including lawyer fees.\nAlessandra, the founder of DeFi Unlimited, says she worked with Propy, a real estate-focused blockchain startup, to “prove the concept.”","author":["Anushree Dave","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/136863\/a-qa-with-the-seller-of-a-650000-nft-backed-florida-home","publishDate":"2022-03-08T17:36:12","id":699,"type":null,"title":"A Q&amp;A with the seller of a $650,000 NFT-backed Florida home","category":["NFTs"],"content":["<em data-v-f87c67ca=\"\">Pictured above: The Florida property sold last month in an NFT-tied transaction.<\/em>","Last month, The Block <a href=\"https:\/\/www.theblockcrypto.com\/linked\/134006\/propys-sale-of-nft-tied-florida-home-nets-over-650k\" data-v-f87c67ca=\"\">covered<\/a> the sale of a home that sold in Florida through Propy, a real estate blockchain company. The home netted over $650,000, and was tied to an NFT that authenticated the sale and the rightful owner.&nbsp;","The Block caught up with the seller of the property, Leslie Alessandra, to learn more about the sale and the process involved.","<em data-v-f87c67ca=\"\">The interview has been edited for clarity and length.&nbsp;<\/em>","<strong data-v-f87c67ca=\"\">Anushree Dave:&nbsp;<\/strong>What prompted you to sell a property backed by an NFT? Why not just sell it the regular old-school way that we all do now?","<strong data-v-f87c67ca=\"\">Leslie Alessandra: <\/strong>So I’m a real estate investor. I've been investing in real estate for several years now with long-term holds and fix-and-flips. And then a couple years ago, I kind of fell down the crypto rabbit hole, and just could not get enough of learning about crypto and blockchain technology. So much so that my cousin and I opened up DeFi unlimited, a crypto company that helps traditional businesses move on to the blockchain. So we really started off as a small crypto company just trying to help small businesses start to accept cryptocurrency for payments, or to use NFT for marketing.","And what we realized is that there was a real gap in the knowledge base of the average person on crypto and blockchain and the benefits of blockchain. And so, we realize most people when they thought of NFTs, they just thought of the sale of Beeple, the artwork that sold for multi-million dollars. But they didn't understand the practical use of the technology. So, I was talking to my cousin, and I said, why don't we consider selling this property as an NFT? And, that way we can show people, a practical example in real estate because everyone at some point in their life is either going to buy or sell a piece of property.","<strong data-v-f87c67ca=\"\">AD:&nbsp;<\/strong>How did you get in touch with Propy to use their platform?","<strong data-v-f87c67ca=\"\">LA: <\/strong>So we were going to do it ourselves. But then we ended up going to the Bitcoin Conference, which is where we met [Propy CEO] Natalia. She had mentioned that she had an auction platform already set up. So we decided to partner with her.","<strong data-v-f87c67ca=\"\">AD:<\/strong> What did it cost you?","<strong data-v-f87c67ca=\"\">LA: <\/strong>Yeah, to be honest, it was relatively expensive for me, because this is the first-time Propy’s really done this in the United States. When you're the first to do something, you don't really know what the issues are going to be until you're in kind of in the thick of it working through them. So the fees that I paid to Propy – and these are separate from other fees – I paid $3,700 for them to mint the NFT. We were going to mint it, but they already had a minting platform and we just had decided that once we committed to partner with them, we would use their platform. So, they minted it for $3,700, something like that.","<strong data-v-f87c67ca=\"\">AD:<\/strong> Is that a fixed rate or was that based on something, like the cost of your home?","<strong data-v-f87c67ca=\"\">LA: <\/strong>I believe that was a fixed rate. And then there was a $5,000 marketing fee for them to market the property. And then, they told me they were going to do a 1% of the sale price, but towards the end when we were about to go to the office, they changed that and said that it would be a $6,000 flat fee, just for handling the whole auction process.","<strong data-v-f87c67ca=\"\">AD:<\/strong> So it cost a total of $14,700 to list and market the property?","<strong data-v-f87c67ca=\"\">LA:<\/strong> Well, I also decided, because I really wanted to be protected myself and make sure that I wasn't putting myself in any kind of legal issues, I hired a real estate attorney to represent me as well throughout the process. So, I paid that out of my own pocket…Since my real estate agent at the time, Amy, is the one that found this property, I told her that I would give her commission, regardless of whether we went through the auction or not. So, I also paid that commission right out of my profits. So that was also an additional expense.","<strong data-v-f87c67ca=\"\">AD:<\/strong> Taking into consideration all this expense, would you do this again? Was it worth it to sell your home backed by an NFT?","<strong data-v-f87c67ca=\"\">LA:<\/strong> I would say it depends. I did it because I wanted to prove the concept, I was comfortable knowing that there’s a lot of uncertainty and we weren't sure how it's going to all end up. I knew my numbers.","<strong data-v-f87c67ca=\"\">AD:<\/strong> Would you recommend this method to your friends? Or should they still list their property the way we do now?","<strong data-v-f87c67ca=\"\">LA:<\/strong> The system is still clunky, this is just like the very beginning of the internet stages, I think you have to be the right candidate to be moving forward on the sale or purchase of a property as an NFT at this stage in the game. It's not where it's going to be five years from now. But where we're at right now, it's still clunky. And if you're going to do it, you're doing it because you want to be part of that development process.","<strong data-v-f87c67ca=\"\">AD:<\/strong> Did the person who bought your property buy it with crypto or dollars?","<strong data-v-f87c67ca=\"\">LA:&nbsp;<\/strong>It was with cryptocurrency, Ethereum.","<strong data-v-f87c67ca=\"\">AD:<\/strong> Did you liquidate that? If the price fluctuates, couldn’t you lose a lot?","<strong data-v-f87c67ca=\"\">LA:<\/strong> Oh well, yeah, I am living this…I still have not liquidated, and I have lost a significant amount of money because I have not liquidated. So, at the time, there's a lot of talk about using stablecoins for real estate transactions and that probably will be beneficial, at least for the next few years. Because that way, at least the price of sale and everything kind of stands stays pretty stable throughout the process. For me, it’s not like that.","<strong data-v-f87c67ca=\"\">AD:<\/strong> So how much did you gain or lose?","<strong data-v-f87c67ca=\"\">LA:<\/strong> I gained like $30,000 from the day it sold to the next day. And I didn't liquidate because I was exhausted from everything. And then by the following day...the stuff that was going on with Russia came out in the news and crypto plummeted. I lost $60,000 or something like that. And this is why I'm saying this isn't for the faint of heart. And we're not at a finished product yet.","But we're getting there. We’re kind of in the Wild West."],"hashtag":[]}