{"summary":"Tether, the largest stablecoin issuer, has minted 1 billion of USDT on the Ethereum blockchain as an &quot;inventory replenish.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234170\/tether-mints-one-billion-usdt-ethereum","publishDate":"2023-06-12T05:13:57","id":6998,"type":null,"title":"Tether mints 1 billion of USDT on Ethereum to support chain swaps","category":["STABLECOINS"],"content":["Tether, the largest stablecoin issuer, has <a href=\"https:\/\/twitter.com\/paoloardoino\/status\/1668165749926424580?s=20\" data-v-f87c67ca=\"\">minted<\/a> 1 billion USDT tokens on the Ethereum blockchain as part of its \"inventory replenish.\"","While some perceive the minting of new USDT as a catalyst for increased crypto demand, Tether CTO Paolo Ardoino told The Block that new USDT tokens are minted to support chain swap functions.","\"Tether periodically works with different third parties (exchanges, hedge funds, etc.) to help them rebalance the liquidity of their USDT across different chains,\" Ardoino said. \"For example, since exchanges support Tether USDT on multiple chains, they might end up having most of [their] Tether USDT tokens on one chain (i.e. Tron), but they might need to process withdrawals for another chain (i.e. Ethereum). Hence such third parties ask to proceed with a chain swap.\"","Chain swap refers to the process of transferring tokens from one blockchain network to another. The process allows users to bridge assets across multiple chains.","After the publication of this story, <a href=\"https:\/\/twitter.com\/binance\/status\/1668218926721818624?s=20\" data-v-f87c67ca=\"\">Binance tweeted<\/a> that it will swap 750 million USDT on Tron for USDT on Ethereum directly with Tether later today “to ensure stablecoin liquidity across all chains for our users.” In a separate tweet, <a href=\"https:\/\/twitter.com\/Tether_to\/status\/1668233122066907137?s=20\" data-v-f87c67ca=\"\">Tether confirmed<\/a> the upcoming chain swap with a third party without naming Binance, but Ardoino confirmed the party is Binance.","This is Tether's <a href=\"https:\/\/www.theblock.co\/post\/227529\/tether-another-billion-usdt-stablecoin-ethereum\" data-v-f87c67ca=\"\">second billion-dollar USDT mint<\/a> in less than two months. The stablecoin issuer minted one billion USDT tokens on Ethereum in April. Minted USDT tokens sit in Tether's treasury and are \"authorized but not issued\" and, therefore, are not part of its total market capitalization.","Tether remains the largest stablecoin issuer on all blockchains according to <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\" data-v-f87c67ca=\"\">The Block's Data Dashboard.<\/a> USDT's current total supply stands at over 83 billion tokens.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<em data-v-f87c67ca=\"\">(Updates with tweets from Binance and Tether).<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tether CTO","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"83 billion","content":"MONEY"},{"type":"Ardoino","content":"PERSON"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["TETHER"],"authors":["Yogita Khatri","The Block"]}