{"summary":"Blockchains are poised to become a foundational element of digital infrastructure. This report focuses on fundamental differences in blockchain design","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272435\/protocol-prism-unveiling-the-architectural-tradeoffs-of-modern-blockchains-presented-by-solana","publishDate":"2024-01-15T09:01:27","id":70,"type":null,"title":"Protocol Prism: Unveiling the Architectural Tradeoffs of Modern Blockchains- Presented by Solana","category":["THE BLOCK"],"content":["<b data-stringify-type=\"bold\" data-v-f87c67ca=\"\">The Block Research has created “Protocol Prism: Unveiling the Architectural Tradeoffs of Modern Blockchains”. To access the full report in PDF format via email, please fill out the form below:&nbsp;<\/b>","Blockchains are poised to become a foundational element of digital infrastructure. This report focuses on fundamental differences in blockchain design that have been chosen by different protocols to pave the way for mass adoption. Despite all modern blockchains aiming to deliver public rails that are performant and secure, their approaches and timelines to achieve those goals vary.","To shed light on these differences, we outline the main functions blockchains perform and introduce a framework to categorize them. With case study-type analyses of Ethereum and Cosmos, along with a thorough review of Solana’s design approach, we compare their strengths and weaknesses. Our study highlights the critical differences between horizontal and vertical scaling and the trade-offs between them. This comparison provides a detailed perspective on the technological choices and strategies influencing the evolution of smart contract platforms as the backbone of a growing on-chain financial economy.","The report is structured as follows: Part 1 defines the core functions of a blockchain system, and then classifies modern blockchains into several encompassing architectures according to the variations across their functions. Part 2 contextualizes the tradeoffs required for scaling blockchains across each function (such as data storage or execution), highlighting the way in which scalability optimization impacts important properties such as decentralization, security and interoperability. Part 3 takes a deep dive into Solana’s design philosophy as an execution-focused, vertically integrated blockchain, as well as the many unique hurdles it has faced in the pursuit of achieving greater scalability. Finally, Part 4 compares the key design choices taken by protocols in the context of their varying scaling approaches, offering insights into their progress to date alongside critical commentary from the builders and thinkers shaping the future of blockchain design.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Architectural Tradeoffs of Modern Blockchains”","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Block Research","content":"ORGANIZATION"}],"hashtag":[],"authors":["Kevin Peng","The Block"]}