{"summary":"Venture capital firm Andreessen Horowitz (a16z) has said that crypto cycles look “chaotic,” but they have consistently led to new ideas, projects and startups.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/65576\/crypto-cycles-look-chaotic-but-they-have-consistently-led-to-new-projects-says-a16z","publishDate":"2020-05-18T07:15:25","id":700,"type":null,"title":"Crypto price cycles look &#x27;chaotic,&#x27; but they have consistently led to new projects, says a16z","category":["CRYPTOCURRENCY"],"content":["Venture capital firm Andreessen Horowitz (a16z) appears to remain bullish on the crypto and blockchain space.","In a new report <a href=\"https:\/\/a16z.com\/2020\/05\/15\/the-crypto-price-innovation-cycle\/\" data-v-f87c67ca=\"\">published<\/a> Friday, the firm said crypto cycles look “chaotic,” but they have consistently led to new ideas, projects and startups.","There have been three crypto cycles - 2009-2012, 2012-2016, and 2016-2019 - according to a16z. All three cycles have seen a peak period in which crypto prices shot up, led to new interest and social media activity, more people and developers getting involved, and saw more projects and product launches.","For instance, the first cycle, which peaked in 2011 saw the largest exchanges, miners, and wallets getting founded. The next cycle peaked in 2013 and saw \"many important\" projects getting created and funded, including Ethereum. Finally, the third crypto cycle, which peaked in 2017, captured mainstream attention, said a16z.","“The 2017 cycle spawned dozens of exciting projects in a wide range of areas including payments, finance, games, infrastructure, and web apps. Many of these projects are launching in the near future, possibly driving a fourth crypto cycle,” it added.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Ten years of data&nbsp;<\/strong><\/span>","A16z analyzed ten years of data, including Reddit comments in crypto subreddits, Github commits in crypto repositories and Pitchbook funding data, and then came up with the following compound annual growth rates (CAGR) for each metric from 2010 to the present:","","","“Technologists and entrepreneurs will continue to push crypto forward in the coming years. We are excited to see what they build,” a16z concluded.","Just two weeks ago, a16z launched its <a href=\"https:\/\/www.theblockcrypto.com\/linked\/63555\/a16z-raises-515-million-for-its-second-crypto-fund\" data-v-f87c67ca=\"\">second crypto fund<\/a>, worth $515 million. The fund is set to invest in crypto and blockchain startups that are focused on payments, decentralized finance (DeFi), Web 3 and more.","A16z's first crypto fund, worth $350 million, was launched in 2018. That fund has invested in notable firms, including Coinbase, Libra, Maker, Compound, and more.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"Reddit","content":"LOCATION"},{"type":"$350 million","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"2010","content":"DATE"},{"type":"2011","content":"DATE"},{"type":"2012","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Github","content":"ORGANIZATION"},{"type":"$515 million","content":"MONEY"},{"type":"2009","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"two weeks ago","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Libra","content":"LOCATION"}],"hashtag":["ANDREESSEN HOROWITZ","BITCOIN"],"authors":["Yogita Khatri","The Block"]}