{"summary":"The request for comment lays out some core questions about how to define and classify different digital assets. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167205\/sec-and-cftc-want-help-building-new-crypto-reporting-regime-for-hedge-funds","publishDate":"2022-09-01T14:42:17","id":7004,"type":null,"title":"SEC and CFTC want help building new crypto reporting regime for hedge funds","category":["POLICY"],"content":["Regulators want help assembling a regime for private funds to report their crypto exposure.&nbsp;","On September 1, the Securities and Exchange Commission and the Commodity Futures Trading Commission <a href=\"https:\/\/www.federalregister.gov\/documents\/2022\/09\/01\/2022-17724\/form-pf-reporting-requirements-for-all-filers-and-large-hedge-fund-advisers\" data-v-f87c67ca=\"\">put out<\/a> a request for comment on proposed changes to Form PF.","The SEC and CFTC are the key regulators for U.S. financial markets. Form PF is a confidential filing that hedge funds make to the SEC to report their exposure to certain assets. It originated after the 2008 financial crash, which was largely a product of opaque private funds holding junk assets — most famously, subprime mortgages.","The current <a href=\"https:\/\/www.sec.gov\/files\/formpf.pdf\" data-v-f87c67ca=\"\">Form PF<\/a> features no mention of digital assets at all. The two regulators <a href=\"https:\/\/www.theblock.co\/post\/162770\/sec-cftc-consider-new-crypto-reporting-rule-for-large-hedge-funds\" data-v-f87c67ca=\"\">agreed to a joint proposal<\/a> to add digital asset reporting early in August. \"The proposal would add a new sub-asset class for digital assets and define the term 'digital asset,'\" the request for comment explains.","The questions that appear in the request for comment are, consequently, pretty foundational: Should reporting entities have to identify the specifics of their holdings by name or by type of digital asset, should there be different standards for fiat-redeemable stablecoins and central bank digital currencies, and should tokens that represent equity be another class.&nbsp;","The comment period ends October 11.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fiat","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"September 1","content":"DATE"},{"type":"October 11","content":"DATE"},{"type":"2008","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["CFTC","SEC"],"authors":["Kollen Post","The Block"]}