{"summary":"“We don’t know the details of a term sheet, is that something other potential firms could compete around?” Allaire said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184751\/lack-of-ftx-buyer-would-leave-giant-hole-in-crypto-markets-circle-ceo","publishDate":"2022-11-09T08:24:15","id":7007,"type":null,"title":"Lack of FTX buyer would leave &#x27;giant hole&#x27; in crypto markets: Circle CEO","category":["MARKETS"],"content":["FTX’s collapse was “sort of a shock,” that spoke to the lack of public visibility into the company’s balance sheet, said Circle CEO Jeremy Allaire during a Wednesday appearance on CNBC.","Asked what Binance backing out of a preliminary deal to acquire its troubled rival would do to crypto markets as a whole, Allaire said the possibility of no one buying FTX and its assets would leave a “giant hole” that would be “far worse” than what investors and markets are concerned about right now.","“We don’t know the details of a term sheet, is that something other potential firms could compete around?” Allaire said.","“There was a perception that FTX was one of the strongest firms in the space,” said Allaire, who added that the exchange’s rapid decline speaks to the “importance of having a clear regulatory structure” around digital assets in the U.S.","Allaire noted FTX’s base outside of the U.S. and its lack of financial transparency was, “at some level, not the visibility you would have in a regulated markets context.”","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Allaire","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Allaire","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Colin Wilhelm","The Block"]}