{"summary":"Blockchain-powered video game from Take-Two Interactive Software launching with token mint later this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244783\/grand-theft-auto-dev-take-twos-first-crypto-game-launching-on-ethereum","publishDate":"2023-08-14T13:43:00","id":7009,"type":null,"title":"&#x27;Grand Theft Auto&#x27; dev Take-Two&#x27;s first crypto game launching on Ethereum","category":["GAMING"],"content":["<span data-v-f87c67ca=\"\">In what could end up being a watershed moment in the advancement of blockchain-enabled video games, publisher of the multi-billion dollar blockbuster “Grand Theft Auto” gaming franchise, Take-Two Interactive Software, is launching its first web3 game.<\/span>","<span data-v-f87c67ca=\"\">Through Take-Two’s mobile gaming publishing subsidiary Zynga, which it bought for $12.7 billion last year, the company is releasing “Sugartown,” a web3 title built on Ethereum, the companies announced in a statement.<\/span>","<span data-v-f87c67ca=\"\">The companies are also billing the launch as the first instance of a “major mobile game developer” building a crypto game “from the ground up.”<\/span>","<span data-v-f87c67ca=\"\">Players will use an Ethereum (or ERC-721) token to access the “Sugartown” game, where they will be able to stake to “earn energy” that allows them to play games and earn “an in-game currency that can be used to access” rewards,\" the companies said.<\/span>","<span data-v-f87c67ca=\"\">Additionally, the access tokens, called Oras, will be available for minting later this year when Zynga releases 10,000 of them as part of an \"initial run.\"<\/span>","<span data-v-f87c67ca=\"\">Take-Two’s push into web3 gaming through Zynga could profoundly change the video game landscape if “Sugartown” is a hit, potentially motivating other major developers to take steps to compete in what could be a highly-lucrative market. The company <a href=\"https:\/\/www.theblock.co\/post\/174638\/brevan-howard-and-morgan-creek-lead-web3-gaming-startups-40-million-series-a-bloomberg\" data-v-f87c67ca=\"\">also invested<\/a> in a web3 gaming startup last year.<\/span>","<span data-v-f87c67ca=\"\">\"Sugartown\" video game art. Courtesy: Zynga<\/span>","<span data-v-f87c67ca=\"\">The company’s CEO Strauss Zelnick has in the past expressed interest in NFTs, but not without a healthy dose of skepticism.<\/span>","<span data-v-f87c67ca=\"\">“We’re a leader in the [digital goods] space,” Zelnick said last year in an interview. He also added that his company, which has collected billions of dollars in microtransactions related to Take Two’s “Grand Theft Auto,” had interest in how NFTs could be used in their titles. But he also pointed out the NFT market’s speculative nature and reinforced a desire to avoid a \"speculative economy.”<\/span>","<span data-v-f87c67ca=\"\">Zynga, which is the developer behind mobile titles like FarmVille and Words With Friends, had <\/span><a href=\"https:\/\/www.theblock.co\/linked\/133707\/gaming-giant-zynga-plans-to-launch-nft-based-game-this-year\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">originally planned<\/span><\/a><span data-v-f87c67ca=\"\"> to launch a game with NFTs by the end of last year.<\/span>","<span data-v-f87c67ca=\"\">\"We're excited to launch ‘Sugartown’ both as Zynga’s first web3 game and as the first new web3 game with an original IP,\" said Matt Wolf, Zynga’s vice president of web3.<\/span>","Although the NFT market is down dramatically since the last bull run, when play-to-earn game Axie Infinity was rising high with monthly trading volumes totaling hundreds of millions of dollars, optimism has continued to surround the segment of blockchain as it is viewed as the path toward widespread adoption.","New investment in the NFT-Gaming space slipped in June to its lowest amount in over two years but then rebounded last month when the sector raised $177 million, a 65% increase month-on-month, according to The Block Research.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/gaming\/ethereum-gaming-nft-trade-volume\/embed\" title=\"Ethereum Gaming NFT Trade Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$177 million","content":"MONEY"},{"type":"Strauss Zelnick","content":"PERSON"},{"type":"65%","content":"PERCENT"},{"type":"$12.7 billion","content":"MONEY"},{"type":"Sugartown","content":"LOCATION"},{"type":"FarmVille","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Zynga","content":"ORGANIZATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"millions of dollars","content":"MONEY"},{"type":"Matt Wolf","content":"PERSON"},{"type":"Zelnick","content":"PERSON"}],"hashtag":[],"authors":["RT Watson","The Block"]}