{"summary":"Swing has rolled out a new widget and SDK for cross-chain developers.\nThe project says these software tools will simplify the process of deploying cross-chain solutions.","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203244\/swing-launches-software-tool-cross-chain-solutions","publishDate":"2023-01-18T09:00:31","id":701,"type":null,"title":"Swing launches software tool for easier deployment of cross-chain solutions","category":["Crypto Ecosystems"],"content":["Decentralized cross-chain liquidity protocol Swing debuted a new widget and software developer kit (SDK) to simplify cross-chain crypto deployments.","Swing’s new widget and SDK support 21 EVM-compatible chains including Ethereum, BNB Chain, Arbitrum and Optimism, the project announced on Wednesday. Swing also plans to expand to cover four non-EVM networks like Solana and Cosmos.","Cross-chain solutions like bridges enable the transfer of crypto assets across different networks. Swing says developing these solutions usually takes several weeks, hence the need for its software package. Developers can now complete bridge integrations for their decentralized applications in a matter of hours using the SDK. Using the widget, the process may even a few minutes, the announcement added.","Simplifying the cross-chain deployment process is necessary to eliminate so-called liquidity fragmentation, where liquidity is siloed across different blockchains and cannot easily flow between chains, according to Swing. Founder Viveik Vivekananthan said easy access to cross-chain liquidity is crucial for blockchain expansion.","With cross-chain liquidity transfers comes the need for secure bridges. <a href=\"https:\/\/www.theblock.co\/post\/175403\/bnb-smart-chain-halted-amid-potential-bridge-exploit\" data-v-f87c67ca=\"\">Hackers stole<\/a> billions of dollars worth of crypto from several <a href=\"https:\/\/www.theblock.co\/linked\/153973\/harmonys-cross-chain-bridge-hit-by-eth-theft-worth-nearly-100-million\" data-v-f87c67ca=\"\">bridges<\/a> last year. Vivekananthan told The Block that the new tools also enable developers to handle such situations.","“In the event of bridge hacks, Swing’s SDK and widget mitigate risk by allowing developers to turn off compromised bridges quickly and immediately enable a new bridge that supports the same routing token lists so as not to disrupt user flow,” Vivekananthan told The Block.","Vivekananthan also said projects reliant on a single bridge are vulnerable — hence the need for tools like Swing’s that can help developers aggregate different bridges for their apps. Apart from supporting 21 EVM chains, Swing also supports multiple bridges. The website lists nine bridge protocols covered by the project, including Celer, Wormhole and Hop."],"hashtag":["CROSS-CHAIN SWAPS","INTEROPERABILITY"]}