{"summary":"Adaptive blamed insufficiencies in crypto&#x27;s market structure during a last week&#x27;s sell-off for its losses and closure.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59343\/crypto-hedge-fund-adaptive-capital-is-shutting-down-after-it-took-a-big-hit-during-last-weeks-bitcoin-price-plunge","publishDate":"2020-03-20T11:03:40","id":7013,"type":null,"title":"Crypto hedge fund Adaptive Capital is shutting down after it &#x27;took a big hit&#x27; during last week&#x27;s bitcoin price plunge","category":["STARTUPS"],"content":["Crypto hedge fund Adaptive Capital is shutting down, The Block has learned.","In an investor letter reviewed by The Block, Adaptive said that it plans to return remaining capital to its Limited Partners following a steep drop in bitcoin's price during the March 12-13 trading session.","\"Adaptive has made the decision to close operations and return the remaining funds to investors,\" the firm wrote. \"We are convinced that the risks of continuing operations in such an unstable environment outweigh the potential benefits.\"","The price of bitcoin <a href=\"https:\/\/www.theblockcrypto.com\/post\/59172\/surfing-the-spread-crypto-market-turmoil-arbitrage\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">fell<\/a> by more than $1,000 on March 13, following a period of relative calm for the digital asset compared to the U.S. stock market. The Dow Jones Industrial Average had been in free-fall mode since the beginning of the month.&nbsp;","","","Adaptive blamed \"infrastructural insufficiencies\" for its inability to respond properly to the sell-off. BitMEX, which isn't named in the letter, went out of service for about 45-minutes during the price-plunge. BitMEX said it had a \"hardware issue\" with its cloud service provider, which caused requests to be delayed between 02:16 and 02:40 UTC. Normal service resumed at 03:00 UTC, it added. Sources told The Block that Adaptive maintained accounts on BitMEX, which were liquidated.&nbsp;","\"A number of respectable exchanges, platforms, and tools that we use daily have halted their operations during the selloff significantly hindering our ability to act accordingly,\" Adaptive said in the letter.","Two sources familiar with Adaptive's business told The Block that the firm came out of the drawdown down more than 50%. That's an eye-popping number, considering Adaptive was reported to be up 552.77% from October 3, 2018, through May 3, 2019, according to a pitch deck reviewed by The Block.","The firm made one bullish call in 2018 on December 7, according to the deck. Bitcoin's value is up more than 50% since that date.&nbsp;","","","The firm tied its ability to time the market to its proprietary indicators built on data \"pertaining to the majority of the largest blockchain networks in real-time,\" according to the deck.","The firm is led by Murad Mahmudov, a Princeton University-graduate who had brief stints at Glencore and Goldman Sachs. He maintains a significant following in crypto social media circles, with more than 70,000 followers on <a href=\"https:\/\/twitter.com\/MustStopMurad?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" data-v-f87c67ca=\"\">Twitter<\/a>.&nbsp;","Mahmudov did not respond to an emailed request for comment by press time.","In U.S. equities, hedge funds have experienced similar woes as the number of opportunities for an outsized return continues to shrink. $160 billion Bridgewater Associates is one notable victim of the coronavirus-linked market turmoil. According to an investor letter reviewed by The Block, the net performance of its \"All Weather\" and Pure \"Alpha Funds\" are down on a net basis. Its Pure Alpha (18% vol) fund leads in losses, down ~21%, according to the document.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fall","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"May 3, 2019","content":"DATE"},{"type":"Murad Mahmudov","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"October 3, 2018","content":"DATE"},{"type":"Princeton University","content":"ORGANIZATION"},{"type":"Adaptive","content":"ORGANIZATION"},{"type":"Bridgewater Associates","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"13","content":"DATE"},{"type":"21%","content":"PERCENT"},{"type":"$1,000","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"March 13","content":"DATE"},{"type":"March 12","content":"DATE"},{"type":"18%","content":"PERCENT"},{"type":"December 7","content":"DATE"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"$160 billion","content":"MONEY"},{"type":"Glencore","content":"ORGANIZATION"},{"type":"552.77%","content":"PERCENT"},{"type":"Adaptive","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}