{"summary":"Coinbase has reiterated its argument that the SEC had already made up its mind to deny its request for new rules and pointed to public comments from SEC Chair Gary Gensler.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231872\/coinbase-hits-back-at-sec-with-new-court-filing-in-ongoing-lawsuit","publishDate":"2023-05-23T13:07:50","id":7018,"type":null,"title":"Coinbase hits back at SEC with new court filing in ongoing lawsuit","category":["COMPANIES"],"content":["Coinbase has hit back at the U.S. Securities and Exchange Commission in its <a href=\"https:\/\/www.theblock.co\/post\/228047\/coinbase-sues-the-sec-for-answer-on-rule-specific-to-digital-assets\" data-v-f87c67ca=\"\">ongoing lawsuit<\/a> against the regulator, telling a court that its petition for a response about new digital asset regulation was still warranted.","\"The SEC is talking out of both sides of its mouth, and it is wrong at each end,\" Coinbase said in a <a href=\"https:\/\/assets.ctfassets.net\/c5bd0wqjc7v0\/4Y8RdHCBOhXBvqYH51pw5P\/564dd375bfeaaf866180888ef9a96432\/2023.05.22_-_Dkt._27_-_Coinbase_Mandamus_Reply.pdf\" data-v-f87c67ca=\"\">23-page filing<\/a> to the Third Circuit of the U.S. Court of Appeals late Monday.","Coinbase filed the <a href=\"https:\/\/www.theblock.co\/post\/230935\/the-sec-calls-coinbases-suit-over-digital-asset-rules-petition-baseless\" data-v-f87c67ca=\"\">lawsuit last month<\/a>, using what's called a <a href=\"https:\/\/www.justice.gov\/jm\/civil-resource-manual-215-mandamus\" data-v-f87c67ca=\"\">writ of mandamus<\/a> that seeks court action against federal officials in \"exceptional circumstances.\" The action is seeking a specific response from SEC about a previous request for new rules about digital assets.&nbsp;","At the center of the dispute is the <a href=\"https:\/\/www.theblock.co\/post\/231759\/coinbase-takes-lobbying-effort-tv-ad\" data-v-f87c67ca=\"\">longstanding debate<\/a> over which which digital assets should be considered security and thereby subject to SEC trading rules. The regulator told the court <a href=\"https:\/\/www.theblock.co\/post\/230935\/the-sec-calls-coinbases-suit-over-digital-asset-rules-petition-baseless\" data-v-f87c67ca=\"\">earlier this month<\/a> that Coinbase's most recent legal action was “baseless” and that it still had more time to consider the original request.&nbsp;","In the latest filing, Coinbase reiterated its argument that the SEC had already made up its mind to deny its request for new rules and pointed to public comments from SEC Chair Gary Gensler.","\"The SEC’s and its Chair’s words and actions leave no doubt of the agency’s plans,\" Coinbase wrote. \"The SEC has no intention of engaging in such a rulemaking in the foreseeable future, and that decision may be unreviewable indefinitely unless the Court grants Coinbase’s mandamus petition.\"","Coinbase also argued that the SEC's enforcement actions demonstrate that it is not considering the petition, and it accused the regulator of ignoring other petitions from the crypto industry for years.&nbsp;","\"The SEC’s threatened enforcement action against Coinbase dispels any doubt,\" it said, referring to a recent <a href=\"https:\/\/www.theblock.co\/post\/222084\/sec-investigating-coinbase-for-its-earn-product-wallet-service-and-exchange-activity\" data-v-f87c67ca=\"\">Wells notice<\/a> it received that signals a pending investigation. \"These actions presuppose that the agency believes the securities laws are clear and workable as applied to digital assets and that additional rulemaking is unnecessary.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Third Circuit of the U.S. Court of Appeals","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Nathan Crooks","The Block"]}