{"summary":"The Lido Finance plan to sell 10 million LDO tokens to Dragonfly Capital was originally rejected last month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161461\/lido-dao-approves-treasury-token-sale-to-dragonfly-capital","publishDate":"2022-08-04T12:24:27","id":7030,"type":null,"title":"Lido DAO approves treasury token sale to Dragonfly Capital after terms tweaked","category":["GOVERNANCE"],"content":["The Lido DAO voted to support a sale of treasury tokens to the venture capital firm Dragonfly Capital after the deal's terms were <a href=\"https:\/\/www.theblock.co\/post\/159848\/lido-proposes-new-terms-for-treasury-token-sale-to-dragonfly-capital\" data-v-f87c67ca=\"\">tweaked<\/a> following last month's rejection of the plan.&nbsp;","A poll on Lido's <a href=\"https:\/\/research.lido.fi\/t\/treasury-diversification-2-part-2\/2657\" data-v-f87c67ca=\"\">proposal<\/a> to sell 10 million treasury tokens (worth about $25 million at the current market price) to Dragonfly ended today at 12 p.m. ET with more than 99% approval, according to the voting <a href=\"https:\/\/snapshot.org\/#\/lido-snapshot.eth\/proposal\/0x2a8415951a9462c5800522f2e2ac1e3ca52996494931a23c900fd4c8a7aff589\" data-v-f87c67ca=\"\">page<\/a> on Snapshot.","The vote is half of a treasury diversification plan for liquid staking giant Lido Finance. The entire plan involves liquidating 20 million LDO tokens for dai stablecoin. Lido plans to sell half of this sum to Dragonfly Capital.","A previous vote last month was <a href=\"https:\/\/www.theblock.co\/post\/159521\/lido-dao-votes-no-to-selling-14-5-million-in-ldo-tokens-to-dragonfly-capital\" data-v-f87c67ca=\"\">blocked<\/a>&nbsp;by the community, with DAO members objecting to the terms of the token sale. These objections revolved around the quoted price for the token sale and the absence of any vesting requirement on the part of Dragonfly.","Lido Finance subsequently filed a revamped proposal that addressed these concerns, including two price ranges for the LDO token sale. The first price is based on the combination of a previous average spot price and a 50% premium that amounts to about $1.45 per coin while the second is based on a seven-day backward-looking average at the end of the vote. Dragonfly will buy the coins at the higher of the two prices. The venture capital firm can exit the deal if the higher of the two price benchmarks exceeds $2.25. Lido’s revamped proposal also includes a one-year lock-up period for the tokens sold to Dragonfly.","<a href=\"https:\/\/twitter.com\/hasufl\" data-v-f87c67ca=\"\">Hasu<\/a>, a pseudonymous advisor to Lido Finance and strategy lead at Flashbots, told The Block that the previous deal's structure was unpopular — and highlighted some of the unique problems associated with negotiating business deals with decentralized organizations like DAOs.","“The first proposal didn’t have a contingency for the case that the LDO price increased after posting and that’s why the vote predictably failed. The second proposal does have a contingency — the purchase price now moves up together with the spot price — and it also addresses another concern the community had around lockups,” Hasu told The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"99%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"12 p.m.","content":"TIME"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"$2.25","content":"MONEY"},{"type":"Lido","content":"LOCATION"},{"type":"$1.45","content":"MONEY"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"$25 million","content":"MONEY"},{"type":"Hasu","content":"PERSON"},{"type":"Dragonfly Capital","content":"ORGANIZATION"}],"hashtag":["DRAGONFLY CAPITAL"],"authors":["Osato Avan-Nomayo","The Block"]}