{"summary":"Meta&#x27;s stock price soared today as the company&#x27;s core businesses outperformed analysts expecations last quarter.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228576\/meta-stock-gains-after-focus-on-facebook-instagram","publishDate":"2023-04-27T13:14:11","id":7049,"type":null,"title":"Meta stock pops 14% as focus on Facebook, Instagram pays off","category":["COMPANIES"],"content":["Traders seem to appreciate Meta's prioritization of its core business lines during the first quarter of 2023.","The stock surged 14.6% a day after the company reported revenue and earnings that both handily beat analyst expectations. Forecasts for the current quarter were also higher than estimates, prompting a bevy of increased price targets.&nbsp;","During <a href=\"https:\/\/www.theblock.co\/post\/228541\/meta-zuckerberg-metaverse-ai?utm_source=rss&amp;utm_medium=rss\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Meta's Q1 earnings call<\/a> Thursday, CEO Mark Zuckerberg spoke extensively about the focus on platforms like Instagram and Facebook. Zuckerberg notably spoke less about the metaverse — Meta's virtual reality gambit on which it has spent billions of dollars — and more about artificial intelligence.&nbsp;","Still, Zuckerberg sought to counter the idea that Meta is backing away from the metaverse in spite of a $4 billion Q1 loss in its metaverse division.&nbsp;","\"A narrative has developed that we're somehow moving away from focusing on the metaverse vision. I just want to say upfront that is not accurate,\" he said.&nbsp;","Yet actions like <a href=\"https:\/\/www.theblock.co\/post\/219462\/meta-announces-plans-to-stop-working-on-nfts\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a move away<\/a> from digital collectibles and non-fungible tokens, disclosed in a Twitter thread in March by head of commerce and financial technologies Stephanie Kasriel, signaled a priority shift to core businesses amid a broad belt-tightening phase. Meta laid off 10,000 employees in March, months after a move of a similar scale in November.&nbsp;","As The Block's RT Watson noted Wednesday, Meta has yet to release a version of Horizon Worlds, its flagship metaverse play, for desktop or mobile.&nbsp;","Revenue reached $28.6 billion for the quarter, above the $27.7 billion estimate reported by FactSet. Meta calls these the \"Family of Apps\" — with $11.2 billion in operating income, representing a 40% operating margin, it played a large role in the earnings beat.&nbsp;","<span data-v-f87c67ca=\"\">Meta stock price moves via TradingView<\/span>","Meta's revenue guidance for the second quarter \"was better than expected as headwinds ease,\" TD Cowen analysts led by John Blackledge wrote in a note published today. The investment bank raised its outlook for Meta.","TD Cowen's price target was revised to $220 from $195. UBS has set a price target of $232.50 for Meta shares, the 12-month outlook is even higher at $280.&nbsp;","UBS maintains that investment in the metaverse is a downward risk for Meta, saying heavy investment into Reality Labs metaverse division comes \"with an uncertain outcome and lack of a product\/market fit today.\"","JPMorgan was more positive about the firm's metaverse operations. Analysts wrote that meta is building muscle for long-term financial discipline while creating room for critical AI and metaverse investments. The investment bank's price target for December was revised to $305 from $270.&nbsp;","\"Greater efficiency will enable Meta to invest in the 2 major tech waves of AI and the metaverse,\" Doug Anmuth and Katy Ansel wrote.","Facebook rebranded to Meta in October 2021, while crypto prices were at all-time highs. The metaverse was closely tied to this, with a number of blockchain teams developing virtual reality capabilities.&nbsp;","Mark Zuckerberg <a href=\"https:\/\/about.fb.com\/news\/2021\/10\/founders-letter\/\" data-v-f87c67ca=\"\">wrote<\/a> at the time the metaverse would \"open up more opportunity no matter where you live\" and that as a user, one could \"spend more time on what matters to you, cut down time in traffic, and reduce your carbon footprint.\"","The firm's stock price slipped over the coming months. During that time, the global economy grappled with increasing inflation as the world exited Covid-related restrictions.&nbsp;","","","In early 2022 the U.S. Federal Reserve announced its intention to fight rising inflation by increasing interest rates. Tech stocks began to tank, and Meta was no exception — as Zuckerberg noted, the economic environment impacted digital advertising.","Compounding the turbulent rate environment was the firm's exorbitant spending on its new direction. The firm's <a href=\"https:\/\/www.theblock.co\/post\/206819\/nearing-14-billion-metas-2022-metaverse-losses-piling-up\" data-v-f87c67ca=\"\">metaverse-related losses<\/a> approached $14 billion in 2022. Zuckerberg took responsibility for Meta's underperformance and job losses.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$305","content":"MONEY"},{"type":"billions of dollars","content":"MONEY"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"$4 billion","content":"MONEY"},{"type":"Watson","content":"PERSON"},{"type":"UBS","content":"ORGANIZATION"},{"type":"Meta","content":"PERSON"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"October 2021","content":"DATE"},{"type":"$28.6 billion","content":"MONEY"},{"type":"$280","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"$220","content":"MONEY"},{"type":"second quarter","content":"DATE"},{"type":"FactSet","content":"ORGANIZATION"},{"type":"Katy Ansel","content":"PERSON"},{"type":"the first quarter of 2023","content":"DATE"},{"type":"14.6%","content":"PERCENT"},{"type":"Horizon Worlds","content":"LOCATION"},{"type":"Reality Labs metaverse","content":"ORGANIZATION"},{"type":"Zuckerberg","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"$232.50","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Meta","content":"ORGANIZATION"},{"type":"$11.2 billion","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"early 2022","content":"DATE"},{"type":"$27.7 billion","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"John Blackledge","content":"PERSON"},{"type":"$14 billion","content":"MONEY"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"Cowen","content":"ORGANIZATION"},{"type":"Stephanie Kasriel","content":"PERSON"},{"type":"$270","content":"MONEY"},{"type":"$195","content":"MONEY"},{"type":"Doug Anmuth","content":"PERSON"}],"hashtag":["ANALYST REPORTS","EARNINGS","EQUITY MOVERS"],"authors":["Adam Morgan McCarthy","The Block"]}