{"summary":"Treasury Deputy Secretary Adewale Adeyemo said that the use of crypto by bad actors will only grow without necessary authoritative tools.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287133\/us-treasury-official-calls-on-congress-for-necessary-tools-to-fight-crypto-linked-illicit-finance","publishDate":"2024-04-09T01:12:17","id":7052,"type":null,"title":"US Treasury official calls on Congress for ‘necessary tools’ to fight crypto-linked illicit finance","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">U.S. Treasury Deputy Secretary Adewale O. Adeyemo has urged Congress to take action to provide the government with “necessary tools” to combat illicit finance tied to cryptocurrencies.<\/span>","<span data-v-f87c67ca=\"\">Adeyemo said that terrorist groups have been trying to take advantage of cryptocurrencies over the past few years, according to his written <\/span><a href=\"https:\/\/www.banking.senate.gov\/hearings\/an-update-from-the-treasury-department-countering-illicit-finance-terrorism-and-sanctions-evasion\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">testimony<\/span><\/a><span data-v-f87c67ca=\"\"> for the Senate Banking, Housing and Urban Affairs Committee Hearing scheduled for Tuesday.<\/span>","<span data-v-f87c67ca=\"\">“For example, five years ago, al-Qaeda and affiliated terrorist groups, largely based out of Syria, operated a bitcoin money laundering network using social media platforms to solicit cryptocurrency donations,” he noted.<\/span>","<span data-v-f87c67ca=\"\">Adeyemo continued that one of the agency’s bottlenecks lies in the fact that bad actors are “increasingly finding ways to hide their identities and move resources using virtual currency.”<\/span>","<span data-v-f87c67ca=\"\">With existing approaches to combating terrorist financing through the traditional financial system, the agency has effectively made it harder for terrorist groups to move money. However, “the more effective our targeting has been, the more reason there is for these terrorist groups to look into virtual assets,” Adeyemo said.<\/span>","<span data-v-f87c67ca=\"\">He added that Russia is also increasingly turning to alternative payment mechanisms, including stablecoins, to “try to circumvent our sanctions and continue to finance its war machine.”<\/span>","<span data-v-f87c67ca=\"\">In December, a group of bipartisan U.S. senators <\/span><a href=\"https:\/\/www.theblock.co\/post\/266660\/bipartisan-group-of-senators-introduce-bill-to-expand-treasury-departments-sanctions-powers-and-provide-more-resources-to-address-crypto\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">introduced a bill<\/span><\/a><span data-v-f87c67ca=\"\"> that would broaden the Treasury’s sanctions powers to cover more terrorist groups including Hamas, and give them more resources to address crypto.<\/span>","<span data-v-f87c67ca=\"\">Adeyemo noted that the Treasury sent proposals to the Committee in November in the hope of strengthening the government’s counter-terrorist financing authorities.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">He explained in the testimony that the proposals generally covered three reforms — the introduction of a secondary sanctions tool, modernizing and closing gaps in existing authorities, and addressing jurisdictional risk from offshore crypto platforms.<\/span>","<span data-v-f87c67ca=\"\">Currently, the Treasury has the power to prohibit U.S. correspondent accounts and transaction processing for foreign financial institutions with suspicious activities. “But, unlike banks, foreign cryptocurrency exchanges and some money services businesses do not have or depend on correspondent accounts for all of their transactions,” Adeyemo said, adding that a new secondary sanctions tool would help the Treasury to evolve its targeting capabilities.<\/span>","<span data-v-f87c67ca=\"\">“While we continue to assess that terrorists prefer to use traditional financial products and services, we fear that without Congressional action to provide us with the necessary tools, the use of virtual assets by these actors will only grow,” he continued.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Qaeda","content":"PERSON"},{"type":"Adeyemo","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Committee","content":"ORGANIZATION"},{"type":"Hamas","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Senate Banking","content":"ORGANIZATION"},{"type":"Adewale O. Adeyemo","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Syria","content":"LOCATION"},{"type":"Russia","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Urban Affairs Committee Hearing","content":"ORGANIZATION"}],"hashtag":["CONGRESS","CRIME","SENATE BANKING COMMITTEE","TREASURY DEPARTMENT"],"authors":["Timmy Shen","The Block"]}