{"summary":"If it were already in force, the European Union’s MiCA regulation could have mitigate the impact of the FTX debacle.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187719\/eus-mica-regulation-would-have-had-limited-impact-on-ftx-debacle-lawmaker-says","publishDate":"2022-11-16T13:58:51","id":7058,"type":null,"title":"EU&#x27;s MiCA regulation would have had limited impact on FTX debacle, lawmaker says","category":["POLICY"],"content":["EU lawmakers differ in their view on how the bloc's upcoming crypto regulation would have cushioned the blow from FTX's collapse.","<span data-v-f87c67ca=\"\">The effects of FTX's <a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">filing<\/a> for bankruptcy protection are rippling through the crypto industry. Other firms with exposure to the crypto giant are tumbling over. On Tuesday, crypto lending firm BlockFi <\/span><a href=\"https:\/\/www.theblock.co\/post\/187278\/blockfi-preps-possible-chapter-11-bankruptcy-protection-filing-wsj\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">prepared<\/span><\/a><span data-v-f87c67ca=\"\"> to file for bankruptcy protection too. Today, Genesis <\/span><a href=\"https:\/\/www.theblock.co\/post\/187663\/crypto-exchange-gemini-reports-broad-outage-says-client-funds-secure\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">halted<\/span><\/a><span data-v-f87c67ca=\"\"> withdrawals.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Some EU officials believe the Markets in Crypto Assets regulation — expected to be implemented by 2024 — would strongly protect EU citizens from the FTX ricochet. Others are less certain.<\/span>","<span data-v-f87c67ca=\"\">“I don't see exactly how MiCA would be able to fully stop or prevent this,” Ondrej Kovarik, center-right member of the European Parliament (MEP) who was a co-legislator on MiCA, told The Block in an interview.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I can imagine that some aspects of it would be mitigated or some or alleviated,” he said, but added: \"It would be too simple to just to say that only crypto asset regulation would solve this.”<\/span>","<span data-v-f87c67ca=\"\">The MiCA framework outlines licensing processes for crypto service providers, like exchanges, to operate within the EU. It includes requirements on risk management, segregation of client and firm funds, prudential requirements, and the disclosure of conflict of interest — all of which could be relevant in addressing mishaps leading up to FTX’s collapse. The exact details still need to be fleshed out by Europe’s financial regulators.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While MEP Stefan Berger, who was the Parliament’s main negotiator on the crypto laws, previously <\/span><a href=\"https:\/\/www.theblock.co\/post\/184719\/eu-crypto-legislation-will-mitigate-events-like-ftx-collapse-policy-experts\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">told<\/span><\/a><span data-v-f87c67ca=\"\"> The Block that “MiCA is the bulwark against Lehman Brothers moments such as the FTX case,\" Kovarik is more reserved.<\/span>","<span data-v-f87c67ca=\"\">The issue is broader than just crypto, according to Kovarik. “The real causes of the crash lie also somewhere else than what a crypto asset regulation can actually cover.”<\/span>","<span data-v-f87c67ca=\"\">The Czech MEP pointed out that the developing story in the crypto world is not limited to just one exchange. “We are talking about quite a high number of companies that were operating together. And that's quite a broad financial services ecosystem.”<\/span>","<span data-v-f87c67ca=\"\">Kovarik highlights that policymakers need time to see how the story plays out. “We should first analyze what exactly happened in this case and whether this is something that can be fully resolved by only adjusting the regulatory framework on crypto assets.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Crypto Assets","content":"ORGANIZATION"},{"type":"Stefan Berger","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"\" Kovarik","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Kovarik","content":"PERSON"},{"type":"Ondrej Kovarik","content":"PERSON"},{"type":"Lehman Brothers","content":"ORGANIZATION"},{"type":"Parliament","content":"ORGANIZATION"}],"hashtag":["EUROPEAN PARLIAMENT"],"authors":["Inbar Preiss","The Block"]}