{"summary":"Joseph Bankman and Barbara Fried will be subject to strict cellphone monitoring while Sam Bankman-Fried is under house arrest at their home.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227971\/sam-bankman-fried-parents-phones","publishDate":"2023-04-24T12:19:15","id":706,"type":null,"title":"Judge approves new phone restrictions for Sam Bankman-Fried’s parents","category":["COMPANIES"],"content":["Sam Bankman-Fried's parent will have their cellphones strictly monitored while the disgraced former FTX chief is under house arrest in their&nbsp; California home after a judge approved the new rules.&nbsp;","A consultant will review keystroke logs and screenshots of Joseph Bankman and Barbara Fried’s cell phones at least three times per week under the <a href=\"https:\/\/www.courtlistener.com\/docket\/66631291\/133\/united-states-v-bankman-fried\/\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">new court order<\/span><\/a>.","Judge Lewis Kaplan approved a proposal on Saturday to install monitoring software on the mobile phones of Joseph Bankman and Barbara Fried that will keep close watch over their internet browsing, apps and messages.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“We believe these restrictions are sufficient to prevent Mr. Bankman-Fried from using the Parents’ Phones to circumvent his bail conditions,” Bankman-Fried’s lawyers wrote in a letter to the judge.","Bankman-Fried, the former FTX CEO, has pleaded not guilty to criminal charges tied to his role at the defunct crypto exchange and its sibling crypto trading firm, Alameda Research.","He is awaiting an October trial, while three other FTX executives have pleaded guilty to criminal charges.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The new phone restrictions come after lawyers struggled to carry out an earlier court order tied to a dispute over Bankman-Fried’s bail.","Prosecutors sought tighter restrictions after Bankman-Fried allegedly contacted a witness in his criminal case using an encrypted app and used a <a href=\"https:\/\/www.theblock.co\/post\/211539\/bankman-fried-used-vpn-to-watch-super-bowl-will-stop-using-private-network-until-bail-is-settled\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">virtual private network<\/span><\/a>, which obscures a user’s internet activity.","As part of <a href=\"https:\/\/www.theblock.co\/post\/225138\/sam-bankman-fried-bail-ftx-video-games\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">Bankman-Fried's new bail terms<\/span><\/a>, the former FTX boss recently traded in his smartphone for a model that can’t access the internet and a laptop computer for a new version that is outfitted with monitoring software and curbs his internet use.","The U.S. District Court for the Souther District of New York initially ordered that monitoring software on Bankman-Fried’s parents’ phones should photograph the user every five minutes to ensure that the former FTX boss is not using their devices.","“The monitoring software does not, in fact, have this capability,” Bankman-Fried’s lawyers wrote in a court filing.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Judge Lewis Kaplan approved the new monitoring plan.<\/span>","Under the new rules, parents Bankman and Fried will give lawyers and the government a list of apps they use on their cellphones. The monitoring software will screenshot any activity on the app store and preserve a record if any new apps are downloaded to their phones.","The software will “preserve a record and\/or take screenshots” of any internet browsing, along with any iMessages, voice calls and FaceTime calls sent or received by their phones. A technical consultant will review the keystroke logs and screenshots at least three times a week to ensure “no unauthorized activity is taking place” on the parents’ phones.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Bankman and Fried are also barred from using ephemeral messaging apps like Signal, after their son was accused of using Signal to contact a potential witness.","A spokesperson for Bankman-Fried declined to comment.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Barbara Fried","content":"PERSON"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"California","content":"LOCATION"},{"type":"FaceTime","content":"ORGANIZATION"},{"type":"Barbara Fried","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Souther District of New York","content":"ORGANIZATION"},{"type":"Joseph Bankman","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"Saturday","content":"DATE"}],"hashtag":["FTX"],"authors":["Stephanie Murray","The Block"]}