{"summary":"Telegram Messenger has integrated the crypto wallet TON Space for its over 800 million monthly active users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250634\/telegram-crypto-wallet","publishDate":"2023-09-13T03:33:06","id":7061,"type":null,"title":"Telegram integrates TON-based crypto wallet for its 800 million users","category":["INFRASTRUCTURE"],"content":["<span data-v-f87c67ca=\"\">Telegram Messenger has integrated The Open Network-based self-custodial crypto wallet for its over 800 million monthly active users. The wallet, called <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248363\/toncoin-ton-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ton_symbol.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">TON<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +7.42%\n    <\/span><\/a> <!----><\/span> Space, will be accessible via Telegram settings, The Open Network Foundation said Wednesday.<\/span>","Starting today, all Telegram Wallet users can access TON Space. (Telegram Wallet is a bot that allows users to buy and sell cryptocurrencies like bitcoin). Then, beginning in November, all global Telegram users will be able to access the self-custodial wallet — excluding the U.S. and some other countries.","Telegram's partnership with TON Foundation brings TON one step closer to its original vision.","<a href=\"https:\/\/www.theblock.co\/linked\/64955\/telegram-founder-pavel-durov-says-the-firms-ton-blockchain-project-is-over\" data-v-f87c67ca=\"\">In 2020, Telegram abandoned TON<\/a> after developing it for over two years as its involvement was halted due to a lawsuit from the U.S. Securities and Exchange Commission. <a href=\"https:\/\/www.theblock.co\/post\/43039\/the-sec-sues-telegram-says-gram-tokens-are-securities\" data-v-f87c67ca=\"\">The SEC had sued Telegram<\/a> in 2019 for raising $1.7 billion through an initial coin offering using a token called Grams, which they claimed was an unregistered security. To resolve the matter, Telegram settled with the SEC, refunding unused investor funds and paying an $18.5 million fine. Since 2020, TON has been running as an open-source community project.","The TON Space wallet now serves as a new infrastructure layer for the TON ecosystem. As part of its launch, Telegram will also give priority access for TON projects and partners to its global advertising platform, Telegram Ads, TON Foundation said.","\"Telegram's mission has always been to enable freedom of speech, but speech is so much more in this digital age. We believe users have the right to own their identities and assets. With TON Space, users now have the technology to make that convenient,\" John Hyman, Telegram's chief investment officer, said in a statement.","\"With this partnership, we are putting digital ownership rights in the hands of our entire user base. While also giving TON projects the tools to reach our audience in the largest Web3\/Web2 partnership there has ever been.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TON Foundation","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"+7.42%","content":"PERCENT"},{"type":"Telegram Wallet","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"TON Space","content":"ORGANIZATION"},{"type":"$18.5 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"November","content":"DATE"},{"type":"The Open Network Foundation","content":"ORGANIZATION"},{"type":"John Hyman","content":"PERSON"},{"type":"Telegram","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$1.7 billion","content":"MONEY"}],"hashtag":["WALLETS"],"authors":["Yogita Khatri","The Block"]}