{"summary":"Former FTX CEO Sam Bankman-Fried discussed customer funds in a new interview with The Wall Street Journal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191955\/sbf-says-he-can-only-speculate-about-where-wired-alameda-funds-ended-up-wsj","publishDate":"2022-12-03T22:18:13","id":7065,"type":null,"title":"SBF says he &#x27;can only speculate&#x27; about where wired Alameda funds ended up: WSJ","category":["EXCHANGES"],"content":["FTX founder and former CEO Sam Bankman-Fried \"can only speculate\" about what happened to billions in funds after FTX customers wired them to its sister trading firm Alameda Research, he told the<a href=\"https:\/\/www.wsj.com\/articles\/ftx-founder-sam-bankman-fried-says-he-cant-account-for-billions-sent-to-alameda-11670107659\" data-v-f87c67ca=\"\">&nbsp;Wall Street Journal<\/a> in an interview published Saturday evening.","<span data-v-f87c67ca=\"\">\"One phrasing of it...would be to say that Alameda effectively sent those dollars from its FTX account to the user, but that’s a ledger transfer of course,\" Bankman-Fried said. \"<\/span><span data-v-f87c67ca=\"\">Outside of that the answer is, they were wired to Alameda — I can only speculate about what happened after that.\"<\/span>","FTX is <a href=\"https:\/\/www.theblock.co\/post\/184882\/u-s-regulators-investigating-ftxs-handling-of-customers-funds-relationship-with-ftx-us-bloomberg\" data-v-f87c67ca=\"\">under scrutiny<\/a> for its handling of client funds and its financial relationship with entities including Alameda. Just two days after FTX and more than 100 affiliated entities filed for Chapter 11 bankruptcy protection on Nov. 11, Reuters <a href=\"https:\/\/www.reuters.com\/markets\/currencies\/exclusive-least-1-billion-client-funds-missing-failed-crypto-firm-ftx-sources-2022-11-12\/\" data-v-f87c67ca=\"\">reported<\/a> that at least $1 billion in customer funds had \"vanished\" from the crypto exchange, with FTX transferring billions in customer funds to Alameda.","When asked by Wall Street Journal reporter Alexander Osipovich how these accounting issues emerged, Bankman-Fried explained that back in 2019 -2020 the crypto exchange supported cryptocurrency wallets but not bank accounts to support the onboarding of fiat currency.","\"So some of them would wire money to Alameda and then ask to be credited on their FTX account,\" Bankman-Fried said. He estimates more than half of Alameda's total position came through these wired customer funds to its bank accounts — and thinks this would be more than $5 billion.","\"I can now go back and take a guess at...where they were ultimately spent, or used, or something,\" Bankman-Fried said when asked to clarify that he did not know what happened to that $5 billion. \"But dollars are fungible with each other, so it's not like this one dollar bill over here that you can trace through from start to finish. What you get is more just omnibus pots of assets at various forms.\"","Osipovich then asked Bankman-Fried how he could own 90% of Alameda and not know what was happening there, to which he replied that he was busy with FTX and also didn't want to get too closely involved with Alameda due to concerns about conflicts of interest.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alexander Osipovich","content":"PERSON"},{"type":"90%","content":"PERCENT"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$5 billion","content":"MONEY"},{"type":"evening","content":"TIME"},{"type":"Fried","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Alameda","content":"ORGANIZATION"},{"type":"Nov. 11","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"}],"hashtag":["FTX"],"authors":["Kristin Majcher","The Block"]}