{"summary":"Huobi, one of the most popular cryptocurrency exchanges, is backing a blockchain project that manufactures blockchain smartphones which can be purchased","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/38320\/huobi-backs-blockchain-smartphones-for-cryptocurrency-traders-purchasable-with-huobi-token","publishDate":"2019-09-03T12:13:10","id":7074,"type":null,"title":"Huobi backs blockchain smartphones for cryptocurrency traders, purchasable with Huobi Token","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">Huobi, one of the most popular cryptocurrency exchanges, is backing a blockchain project that manufactures blockchain smartphones which can be purchased with Huobi Token.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The smartphones are issued by blockchain project Whole Network, which is partly funded by Huobi’s venture capital arm Huobi Capital. The network’s native token, NODE, will also be listed on Huobi Prime, Huobi’s initial exchange offering (IEO) platform, according to a company statement.<\/span>","<span data-v-f87c67ca=\"\">With a total planned circulation of 10 billion tokens, NODE will be mainly distributed in a way to encourage adoption of the smartphones. Activities such as downloading mobile apps, watching advertisements, inviting new users, sharing and distributing content will be rewarded with NODE. The remaining tokens will be distributed to private investors, the developer team, and others. The aim of this distribution mechanism is to encourage users to generate behavioral data that will inform marketing campaigns and mobile app design, according to the Whole Network white paper.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Targeting cryptocurrency traders, these smartphones will also have built-in cryptocurrency wallets and offer optional plug-in cold wallets. Each phone is pre-installed with an app store dedicated to cryptocurrency-related apps and dApps.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The news came on the heels of China’s state owned-telecommunications conglomerate, China Telecom, issuing a white paper on blockchain smartphones. The telecom giant is looking to turn 5G smartphones into individual digital asset management platforms and integrating these phones with ethereum,<\/span><a href=\"https:\/\/www.8btc.com\/article\/470890\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">per a report<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Huobi CEO Livio Weng, the push for blockchain smartphones may be driven by the increasing use of mobile devices to manage cryptocurrencies and the deployment of the 5G network in China. China Telecom, along with two other major telecommunications providers in China, <a href=\"https:\/\/news.sina.com.cn\/c\/2019-06-06\/doc-ihvhiqay4045084.shtml\" data-v-f87c67ca=\"\">are reportedly slated to test<\/a> the 5G network in a few cities this year. <br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">“As the industry develops and as innovations like 5G become increasingly integrated into our telecommunications systems, we believe more and more crypto communities will want to trade and transact from mobile devices. Given this, the need for devices optimized for blockchain seems clear. This move is our first step to meet those users' needs,” said Weng.&nbsp;&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The smartphones are priced at $515 and will become available in China on Sept. 11. Huobi allows customers to purchase the phones with Huobi Token and offers discounts to customers on Huobi Prime.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$515","content":"MONEY"},{"type":"Huobi CEO Livio Weng","content":"PERSON"},{"type":"Huobi Token","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Huobi Prime","content":"ORGANIZATION"},{"type":"Sept. 11","content":"DATE"},{"type":"China Telecom","content":"LOCATION"},{"type":"Huobi","content":"ORGANIZATION"},{"type":"Huobi Token","content":"PERSON"},{"type":"Huobi Capital","content":"ORGANIZATION"},{"type":"Whole Network","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"China Telecom","content":"ORGANIZATION"}],"hashtag":["HARDWARE","HTX"],"authors":["Celia Wan","The Block"]}