{"summary":"Coinbase CEO Brian Armstrong thinks the upcoming U.S. presidential election next year could be a potential turning point for the crypto industry. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236029\/coinbase-ceo-sees-2024-election-playing-key-role-in-crypto-regulation","publishDate":"2023-06-22T13:04:47","id":7075,"type":null,"title":"Coinbase CEO sees 2024 election playing key role in crypto regulation","category":["COMPANIES"],"content":["Coinbase CEO Brian Armstrong thinks the upcoming U.S. presidential election next year could be a potential turning point for the crypto industry.&nbsp;","Speaking at a <a href=\"https:\/\/stateofcryptosummit.live.ft.com\/agenda\/session\/1151273\" data-v-f87c67ca=\"\">conference<\/a> in New York on Thursday, Armstrong said a recent lawsuit brought against the exchange by the U.S. Securities and Exchange Commission could ultimately provide increased regulatory clarity for the industry as the case works its way through the courts.","\"Frankly, the 2024 election is also a factor here,\" Armstrong added. \"It’s kind of politically unpopular to be anti-crypto right now, and we are going to see potentially a change here, whether in administration, parties or the SEC chair.\"","Armstrong also alluded to the SEC's suit against rival exchange Binance.","\"As we’ve seen other enforcement actions come down — which, I have to remind people, we’re engaged with the SEC on a civil matter, that’s kind of a technical matter on what is a commodity and what is a security, the courts can help get clarity there,\" he said. \"The other issue we’re seeing is different. There are criminal matters. There are allegations of [illegal] trading, commingling of funds, executives and CEOs being named personally. None of that is really an issue at Coinbase.\"","Coinbase has been in a lengthy dispute with the SEC, having <a href=\"https:\/\/www.theblock.co\/post\/228047\/coinbase-sues-the-sec-for-answer-on-rule-specific-to-digital-assets\" data-v-f87c67ca=\"\">sued<\/a> it earlier this year in an attempt to force it to provide new rules for the digital asset industry. The regulator responded with its own lawsuit against the exchange earlier this month, accusing it of&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">violating<\/a> securities law.&nbsp;","Besides the courts, Coinbase has engaged in a prominent campaign to find public support for its cause. Last month, the exchange ran a TV <a href=\"https:\/\/www.theblock.co\/post\/231759\/coinbase-takes-lobbying-effort-tv-ad\" data-v-f87c67ca=\"\">ad<\/a> to confront what it said is a \"naive view\" of digital assets.","There are already signs, indeed, that crypto policy is emerging as a campaign issue, especially among challengers to the leading candidates in the race.&nbsp;","Florida Governor Ron DeSantis, the Republican who <a href=\"https:\/\/www.theblock.co\/post\/232135\/desantis-promises-to-protect-bitcoin-in-presidential-campaign-launch-event\" data-v-f87c67ca=\"\">launched<\/a> his presidential campaign in a Twitter Spaces event with Elon Musk last month, said he'd protect bitcoin if he's elected. On the Democrat side, candidate Robert F. Kennedy Jr. has spoken favorably of the world's largest crypto by market capitalization.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ron DeSantis","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Florida","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Robert F. Kennedy Jr.","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["BRIAN ARMSTRONG"],"authors":["MK Manoylov","The Block"]}