{"summary":"Arran Schlosberg says a phishing attack tricked Rose into signing a malicious signature that let the hacker transfer his valuable NFTs. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205890\/proofs-vp-of-engineering-says-its-nfts-are-safe-following-founders-1-million-hack","publishDate":"2023-01-26T10:57:12","id":7076,"type":null,"title":"Proof Collective says NFTs are safe following founder&#x27;s $1 million hack","category":["METAVERSE & NFT"],"content":["Arran Schlosberg, vice president of engineering at the NFT collection organization Proof Collective, said its NFTs are safe after its founder, Kevin Rose, was hacked yesterday.&nbsp;","Proof's NFTs, ether and other assets require multiple approval for access, Schlosberg explained in a Jan. 26 Twitter thread. Proof Collective sells NFTs that give the holder access to the community. Each of these NFTs are worth at least 32 ETH ($51,680) and all 1,000 of them have brought Proof 22,255 ETH ($35.9 million), according to the NFT marketplace <a href=\"https:\/\/opensea.io\/collection\/proof-collective\" data-v-f87c67ca=\"\">OpenSea<\/a>.&nbsp;","Schlosberg also noted that the hack was limited to a crafted signature accepted by OpenSea's smart contract. After Proof noticed the attack, Schlosberg and another Proof engineer investigated and attempted to stop the hack. Now, Proof is working with the anti-fraud teams at OpenSea and web3 wallet firm Ledger and \"are considering all avenues, including legal,\" Schlosberg wrote.","Rose confirmed the <a href=\"https:\/\/www.theblock.co\/post\/205606\/moonbirds-creator-kevin-rose-hacked-at-least-1-million-in-nfts-stolen\" data-v-f87c67ca=\"\">hack<\/a> soon after Twitter users noticed NFTs moving out of his account and into the hacker's wallet on Jan. 25. He lost around 40 NFTs, which in total were valued at least $1 million. Rose managed to save his more valuable NFTs, including a rare zombie version of a CryptoPunk that can fetch over $1 million on its own, The Block previously reported.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Arran Schlosberg","content":"PERSON"},{"type":"Jan. 26","content":"DATE"},{"type":"$35.9 million","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"Schlosberg","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"OpenSea","content":"ORGANIZATION"},{"type":"$51,680","content":"MONEY"},{"type":"Jan. 25","content":"DATE"},{"type":"Kevin Rose","content":"PERSON"}],"hashtag":["HACKS","PROOF COLLECTIVE"],"authors":["MK Manoylov","The Block"]}