{"summary":"Filecoin tokens on the platform has been moved to an unknown external address, the STFIL team said on X.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287163\/filecoin-stfil-china","publishDate":"2024-04-09T03:47:58","id":7077,"type":null,"title":"Filecoin liquid staking platform STFIL claims team members under investigation by Chinese police","category":["ASIA"],"content":["The core team members of Filecoin-based liquid staking protocol STFIL are currently under investigation by Chinese police for reasons unknown, the team claimed in a post shared on X.","<span data-v-f87c67ca=\"\">“We understand lawyers have been hired to understand the current situation and provide legal assistance to the individuals under detention,” STFIL <\/span><a href=\"https:\/\/twitter.com\/stfil_io\/status\/1777560493017686264\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">wrote<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","The team further stated that Filecoin tokens from the platform were moved to an external address last week while the core technical team members were under detention. This address currently holds 2.5 million FIL tokens ($22 million). The funds were moved amid an unscheduled update to the protocol, which the team said was “abnormal.”","“Upon learning the above information, the team is actively seeking assistance,” STFIL wrote. “We hope that the community can help track this unknown address and discuss ways to protect the interests of stakeholders.”","STFIL is a liquid staking protocol on Filecoin lets users earn staking rewards on their FIL tokens while still use them in DeFi by giving them liquid staking tokens (LSTs) in exchange for their deposits. Its total value locked stands at <a href=\"https:\/\/defillama.com\/protocol\/stfil#information\" data-v-f87c67ca=\"\">$40 million<\/a>, dropping nearly 60% since the start of April.","Last August, Chinese authorities <a href=\"https:\/\/www.theblock.co\/post\/244929\/chinese-filecoin-mining-firm-charged-for-allegedly-orchestrating-83-3-million-pyramid-scheme\" data-v-f87c67ca=\"\">charged<\/a> a local Filecoin mining firm and its executives for allegedly orchestrating an $83.3 million pyramid scheme. In 2021, the local police <a href=\"https:\/\/www.theblock.co\/post\/123489\/china-seize-62-million-crypto-filecoin-ponzi-ipfsunion\" data-v-f87c67ca=\"\">seized<\/a> $62 million from a Filecoin miner.","STFIL did not immediately respond to The Block’s request for further comments.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"$62 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"$22 million","content":"MONEY"},{"type":"Filecoin miner","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"August","content":"DATE"},{"type":"$83.3 million","content":"MONEY"}],"hashtag":["ASIAN REGULATION"],"authors":["Danny Park","The Block"]}