{"summary":"The crypto CEO&#x27;s political donations, and claims he&#x27;s made during his recent media blitz, could land him in even more legal trouble.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193401\/watchdog-group-wants-fec-investigation-into-bankman-fried-donations","publishDate":"2022-12-08T15:19:09","id":7078,"type":null,"title":"Watchdog group wants FEC investigation into Bankman-Fried donations","category":["POLICY"],"content":["A campaign watchdog group is using Sam Bankman-Fried's claim that he was a secret GOP megadonor to file a complaint with the Federal Election Commission.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The nonprofit Citizens for Responsibility and Ethics in Washington filed an FEC <a href=\"https:\/\/www.citizensforethics.org\/wp-content\/uploads\/2022\/12\/SBF-FEC-Complaint-FINAL.pdf\" data-v-f87c67ca=\"\">complaint<\/a> alleging Bankman-Fried violated federal laws by not disclosing millions he boasted of giving to GOP-affiliated \"dark money\" groups, and potentially distributing donations under the names of other people.&nbsp;","The embattled former FTX CEO and major political donor <a href=\"https:\/\/perma.cc\/HHA3-YA3N\" data-v-f87c67ca=\"\">told<\/a> YouTuber Tiffany Fong last month that he used dark money groups to hide his contributions to Republicans, because he believed press coverage would be less favorable.&nbsp;","Bankman-Fried gave roughly $37 million to Democrats and Democratic-leaning groups and said in the interview that he gave “the same amount to both parties” during the 2022 election cycle. But public records show the FTX co-founder, who has come under investigation by law enforcement the exchange's collapse and been criticized by the company's new leadership for lack of record-keeping, reporting $320,400 in donations to Republicans and Republican-aligned groups, according to CREW.&nbsp;","“All my Republican donations were dark. The reason was not the regulatory reason. It’s because reporters freak the fuck out if you donate to a Republican because they’re all super liberal. And I didn’t want to have that fight,” Bankman-Fried said in the <a href=\"https:\/\/www.youtube.com\/watch?v=6DezodR9hNI\" data-v-f87c67ca=\"\">interview<\/a>.","Bankman-Fried’s comments about intentionally concealing political donations could be evidence he violated the Federal Election Campaign Act, according to the watchdog group, since donations above $200 to influence election outcomes must be disclosed by the donor, and the correct person who funded the donation must be named. Millions of dollars-worth of political donations made by other FTX executives, some to Republicans, have also come under scrutiny since the corporate empire's rapid collapse.&nbsp;","“Mr. Bankman-Fried’s frankness amounts to an admission that he, and other unknown persons, violated federal laws designed to ensure Americans have transparency into those funding elections,” the group said in its complaint.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> \"Federal laws against straw contributions, however, prohibit such schemes where the original contributor intends their funds to influence elections and routes the money through intermediaries to the recipient who then fails to disclose the original source.\"<\/span>","The complaint names Bankman-Fried and the “other unknown persons,” he donated to. It’s unclear how much money Bankman-Fried actually gave to dark money groups, or which organizations received donations. The organizations do not report donations, and a Bankman-Fried spokesperson did not share the size and scope of his Republican political giving.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$320,400","content":"MONEY"},{"type":"GOP","content":"ORGANIZATION"},{"type":"FEC","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"$37 million","content":"MONEY"},{"type":"Fried","content":"ORGANIZATION"},{"type":"Millions of dollars","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"YouTuber Tiffany Fong","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Federal Election Commission","content":"ORGANIZATION"},{"type":"$200","content":"MONEY"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}