{"summary":"BinanceUS&#x27; banking customers are set to cut off USD payments support next week, according to a late Thursday announcement.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233917\/binanceus-suspends-usd-deposits-says-bank-partners-will-pause-dollar-payments-next-week","publishDate":"2023-06-08T23:28:06","id":7083,"type":null,"title":"BinanceUS suspends USD deposits, says bank partners will pause dollar payments next week","category":["EXCHANGES"],"content":["BinanceUS said late Thursday that its banking partners will stop processing its dollar payments as early as the day a federal judge will hear arguments over a temporary restraining order on the U.S. trading affiliate.","The announcement comes days after the Securities and Exchange Commission announced a <a href=\"https:\/\/www.theblock.co\/post\/233146\/us-sec-sues-binance-ceo-zhao-for-breaking-securities-rules\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">lawsuit<\/a> against the firm as well as crypto exchange giant Binance and its CEO, Changpeng Zhao. The SEC is <a href=\"https:\/\/www.theblock.co\/post\/233369\/sec-files-temporary-restraining-order-against-binance\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">seeking<\/a> a freeze on BinanceUS' assets, though the SEC has asked to court to approve a temporary restraining order that would allow BinanceUS to continue to process withdrawal requests from customers.","The resulting regulatory pressure, BinanceUS said, has \"created challenges for the banks with whom we work.\"","The exchange <a href=\"https:\/\/twitter.com\/BinanceUS\/status\/1666996908651323393\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said on Twitter<\/a>:","\"As a result, in an effort to protect our customers and platform, today we are suspending USD deposits and notifying customers that our banking partners are preparing to pause fiat (USD) withdrawal channels as early as June 13, 2023. We encourage customers to take appropriate action with their USD.\"","In a notice to customers shared on Twitter, BinanceUS said that it \"will start delisting USD pairs (e.g., BTC-USD) on our platform, while continuing to support stablecoin pairs (e.g., BTC-USDT).\"","The exchange advised customers to withdraw USD via bank transfer \"by June 13, 2023\" and said, \"Due to elevated volumes and weekend bank closures, ACH withdrawals may take longer than usual to process (e.g. up to several days; we appreciate your patience).\"","BinanceUS called the moves \"proactive steps as we–for a time–transition to a crypto-only exchange. To be clear, we maintain 1:1 reserves for all customer assets.\"","BinanceUS announced earlier Thursday that it would <a href=\"https:\/\/www.theblock.co\/post\/233915\/binance-us-now-says-its-only-removing-10-trading-pairs-in-wake-of-lawsuit?utm_source=news.xml&amp;utm_medium=social\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">remove<\/a> ten different trading pairs in light of the SEC lawsuit.","<em data-v-f87c67ca=\"\">UPDATE: Updated to reflect that a federal judge will hear arguments over the SEC's request for a temporary restraining order on BinanceUS. <\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Twitter","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"June 13, 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"LOCATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"late Thursday","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}