{"summary":"This report examines the often overlooked and complex topic of blockchain settlement. It outlines how layer-1 networks come to agreement (i.e., reach consensus) and how this impacts when transactions executed on them can be deemed final, or more precisely, irreversible. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/135059\/finality-unpacking-blockchain-settlement-commissioned-by-flexa","publishDate":"2022-02-22T12:00:26","id":7084,"type":null,"title":"Finality: Unpacking Blockchain Settlement — Commissioned by Flexa","category":["RESEARCH"],"content":["<b data-v-f87c67ca=\"\">The Block Research was commissioned by Flexa to create “Finality: Unpacking Blockchain Settlement” which examines how transactions are settled across different blockchain networks.<\/b>","<b data-v-f87c67ca=\"\"><\/b><b data-v-f87c67ca=\"\">To access the full report in PDF format, please fill out the form below:<\/b><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><b data-v-f87c67ca=\"\"><\/b>","<b data-v-f87c67ca=\"\">Abstract<\/b><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Blockchains are often touted for facilitating rapid transactions on a global basis.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But what goes on behind the scenes to make this happen? And how can users be sure that transactions are actually final?<\/span>","<span data-v-f87c67ca=\"\">This report examines the often overlooked and complex topic of blockchain settlement. It outlines how layer-1 networks come to agreement (i.e., reach consensus) and how this impacts when transactions executed on them can be deemed final, or more precisely, irreversible.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The report covers both proof-of-work and proof-of-stake layer-1 blockchains. It outlines the nuances that need to be taken into account to holistically evaluate the settlement guarantees that different blockchains provide. Additionally, it identifies several real-life events (i.e, chain reorganizations, spam attacks and network congestion\/downtime), which routinely impact settlement in live production environments; irrespective of how finality is theoretically achieved.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Finally, the report outlines how layer-2 scaling solutions, which decouple transaction execution and transaction finalization, are introducing new complications when it comes to analyzing finality.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Block Research","content":"ORGANIZATION"}],"hashtag":[],"authors":["The Block Research","The Block"]}