{"summary":"The decentralized derivate trading platform announced today that it has completed a funding round led by Hashed and Arrington Capital.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275048\/bbo-exchange-preseed-funding","publishDate":"2024-01-30T08:00:07","id":7085,"type":null,"title":"Decentralized BBO Exchange secures $2.7 million in pre-seed funding","category":["VENTURE CAPITAL"],"content":["<span data-v-f87c67ca=\"\">BBO Exchange, a decentralized derivate exchange, has raised $2.7 million in its pre-seed funding round led by Hashed and Arrington Capital, the company announced today.<\/span>","<span data-v-f87c67ca=\"\">In a statement shared with The Block, BBOX said that the funding round also attracted participation from investors, including Consensys, CMS Holdings, Flow Traders, Manifold Trading, Mask Network and Nomura’s Laser Digital.<\/span>","<span data-v-f87c67ca=\"\">BBOX explained that its automated market maker model allows liquidity providers to “correlate its price ranges with other assets, emulating the strategies of proactive market makers while maintaining the ease of passive liquidity provision.”<\/span>","<span data-v-f87c67ca=\"\">The trading platform said it is working to launch its signal-driven AMM on <\/span><a href=\"https:\/\/www.theblock.co\/post\/238865\/consensys-linea-layer-2\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Linea<\/span><\/a><span data-v-f87c67ca=\"\">, a zkEVM Layer 2 Network for scaling Ethereum dApps. BBOX added that the registration has opened for its private testnet.<\/span>","<span data-v-f87c67ca=\"\">“We aim to provide the entire DeFi ecosystem with both the infrastructure and the liquidity layer for derivative trading, and our ultimate goal is to create a venue where users can trade everything, earn on everything, and do both very effectively,” Ray, founder of BBOX, said in the statement.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nomura’s Laser Digital","content":"ORGANIZATION"},{"type":"” Ray","content":"PERSON"},{"type":"Arrington Capital","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Manifold Trading","content":"ORGANIZATION"},{"type":"Linea","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"CMS Holdings","content":"ORGANIZATION"},{"type":"$2.7 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Mask Network","content":"ORGANIZATION"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["Timmy Shen","The Block"]}