{"summary":"A Texas state regulator wants to hear from Sam Bankman-Fried.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190788\/texas-regulator-wants-bankman-fried-testimony-in-securities-case","publishDate":"2022-11-29T18:07:14","id":7088,"type":null,"title":"Texas regulator wants Bankman-Fried testimony in securities case","category":["LEGAL"],"content":["Former FTX CEO Sam Bankman-Fried has a hearing date in Texas.","The Texas State Securities Board wants Bankman-Fried to testify on Feb. 2 in response to <a href=\"https:\/\/www.ssb.texas.gov\/sites\/default\/files\/2022-11\/NOH_SOAH_312_23_06226.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">an enforcement action<\/a> issued today alleging that FTX violated multiple state securities laws.","The investigation pre-dates FTX's early November collapse and relates to the company's interest-bearing accounts and stock trading. The agency was already looking into the firm <span class=\"s2\" data-v-f87c67ca=\"\">before<\/span> it filed for bankruptcy protection earlier this month.","The Texas State Securities Board sought to delay FTX from purchasing assets from<a href=\"https:\/\/www.theblock.co\/post\/177721\/ftx-shouldnt-be-able-to-buy-voyager-assets-until-after-investigation-texas-authorities\" data-v-f87c67ca=\"\"> failed crypto lender Voyager<\/a> Digital in October, citing concerns that FTX may have violated Texas securities and money transmitter laws and an ongoing investigation into the matter.&nbsp;","Today the regulator formally accused the Bankman-Fried, the former head of the company, of multiple violations stemming from FTX corporate activity in the state, as well as, \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">intentionally failed to disclose material facts,\" requested by the regulator.&nbsp;<\/span>","David Mills, who is named as Bankman-Fried’s counsel in the enforcement action, did not respond to a request for comment. Bankman-Fried stepped down as CEO of FTX when the firm filed for bankruptcy protection.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The Texas State Securities Board is far from the only agency looking into FTX’s business dealings. Multiple congressional committees have <a href=\"https:\/\/www.theblock.co\/post\/190370\/house-lawmakers-set-first-ftx-hearing-for-dec-13\" data-v-f87c67ca=\"\">scheduled<\/a> FTX-focused hearings, and the firm's leadership has said it is cooperating with investigations by the Justice Department and Securities and Exchange Commission.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this month","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Texas State Securities Board","content":"ORGANIZATION"},{"type":"Voyager<\/a> Digital","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"David Mills","content":"PERSON"},{"type":"Feb. 2","content":"DATE"},{"type":"October","content":"DATE"},{"type":"the Justice Department and Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Stephanie Murray","The Block"]}