{"summary":"Crypto exchange Bybit is cutting jobs because &quot;operational efficiency has gotten worse despite our growing size.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153040\/crypto-exchange-bybit-layoffs","publishDate":"2022-06-20T07:27:33","id":7090,"type":null,"title":"Bybit becomes latest crypto exchange to cut staff amid market slide","category":["EXCHANGES"],"content":["Bybit, the second-largest crypto futures exchange, joined rivals in cutting jobs to weather the ongoing downturn in crypto markets.&nbsp;","Affected staff will be \"accorded a severance package and access to Bybit’s employee career support in their job transition,\" a spokesperson for Bybit told The Block on Monday. They declined to comment on how many jobs will go or how many people the exchange currently employs. Bybit has more than 660 employees, according to its LinkedIn <a href=\"https:\/\/www.linkedin.com\/company\/bybitexchange\/\" data-v-f87c67ca=\"\">page<\/a>.","Bybit is the latest crypto exchange to announce layoffs. In recent weeks, Coinbase, Gemini, BitMEX and Crypto.com have all cut jobs. A minimum of 1,500 people have lost jobs in the crypto space in the past two months, <a href=\"https:\/\/www.theblock.co\/post\/152059\/crypto-firms-have-laid-off-more-than-1500-people-in-the-last-two-months-as-downturn-fears-persist\" data-v-f87c67ca=\"\">The Block reported recently<\/a>.","Bybit employed \"a few hundred\" people at the start of 2020 and has expanded by 300% since then, according to an email to staff from CEO Ben Zhou seen by The Block. Bybit's spokesperson declined to comment on whether the message was genuine.&nbsp;","\"Our organization size had grown exponentially but the overall business growth did not grow in the same way,\" Zhou said in the email. \"During the latest staff review, internal efficiency is still the biggest problem that Bybit has now. This means our operational efficiency has gotten worse despite our growing size. It's evident that we haven't utilized our fast-growing resources properly.\"","Bybit was founded in 2018 in Singapore and quickly grew popular in the derivates space. It is currently the second-largest crypto exchange in futures trading, according to The Block's Data Dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/volume-of-bitcoin-futures-monthly\/embed\" title=\"Volume of Bitcoin Futures\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>&nbsp;","Bybit's \"fundamentals remain strong\" with more than 6 million users in over 160 countries, the spokesperson said.","\"We are committed to continuously investing in strategic web3 projects and acquisitions, as well as sponsoring non-profit organizations as we streamline our expansion plans based on our business priorities,\" they added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zhou","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"300%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Ben Zhou","content":"PERSON"},{"type":"Bybit","content":"PERSON"},{"type":"2020","content":"DATE"}],"hashtag":["LAYOFFS"],"authors":["Yogita Khatri","The Block"]}