{"summary":"Former IcomTech CEO Marco Ruiz Ochoa was sentenced to five years in prison for his role in promoting the crypto firm.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273629\/former-icomtech-ceo-sentenced-to-five-years-in-prison-for-his-role-in-crypto-ponzi-like-scheme","publishDate":"2024-01-19T16:10:49","id":7091,"type":null,"title":"Former IcomTech CEO sentenced to five years in prison for his role in crypto Ponzi-like scheme","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Former IcomTech CEO Marco Ruiz Ochoa was sentenced to five years in prison for his role in promoting the crypto firm which promised returns for investors, but federal prosecutors say was run more like a Ponzi scheme.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Ochoa, 35, was <a href=\"https:\/\/www.justice.gov\/usao-sdny\/pr\/ceo-cryptocurrency-ponzi-scheme-icomtech-sentenced-five-year-prison-term\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">sentenced<\/span><\/a> on Friday before a U.S. district judge after pleading <a href=\"https:\/\/www.theblock.co\/post\/253268\/former-icomtech-executive-pleads-guilty-over-role-in-crypto-ponzi-scheme\" data-v-f87c67ca=\"\">guilty<\/a> in September to wire fraud.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"Ochoa took advantage of the hype around cryptocurrency to con unsuspecting victims into investing in the IcomTech pyramid scheme. This significant sentence sends a message to anyone considering following in his footsteps: that path leads to serious prison time,\" U.S. Attorney Damian Williams said in a statement on Friday.&nbsp;&nbsp;&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Ochoa was also sentenced to two years of supervised release and was ordered to forfeit $914,000 in criminal proceeds, according to the Justice Department.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">IcomTech, an alleged crypto mining and trading company, <a href=\"https:\/\/www.justice.gov\/usao-sdny\/us-v-david-carmona-et-al-22-cr-551-jlr-icomtech\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">promised<\/span><\/a> investors profits in exchange for their purchase of \"purported cryptocurrency-related investment products.\" Ochoa, along with others, promised profits from the companies’ crypto trading and mining arm that they said would result in daily returns.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">IcomTech's crypto trading and mining business did not exist, prosecutors said, and investor money was used for other schemes and personal expenditures.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Promoters for IcomTech showed up to events in expensive cars and wearing luxury clothes in a move to appear successful, prosecutors said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The atmosphere of these events was festive and designed to generate excitement about the schemes,\" they said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">When investors began trying to withdraw money in 2018, they were then met with excuses, delays and hidden fees.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Despite these complaints, IcomTech promoters, including Ochoa, continued to promote IcomTech and accept victims’ investments,\" prosecutors said. By the end of 2019, IcomTech collapsed.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">The Commodity Futures Trading Commission also brought charges against Ochoa, and other IcomTech executives including David Carmona, Juan Arellano Parra and Moses Valdez in May. The CFTC said the group targeted Spanish-speaking communities.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$914,000","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Damian Williams","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"David Carmona","content":"PERSON"},{"type":"Moses Valdez","content":"PERSON"},{"type":"Ochoa","content":"PERSON"},{"type":"Marco Ruiz Ochoa","content":"PERSON"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Juan Arellano Parra","content":"PERSON"}],"hashtag":["CRIME"],"authors":["Sarah Wynn","The Block"]}