{"summary":"Nibiru Chain, a general-purpose layer 1 blockchain, has successfully closed its latest round of funding, securing $12 million to set the stage for an","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275890\/nibiru-chain-secures-12-million-to-fuel-developer-focused-l1-blockchain","publishDate":"2024-02-05T09:01:56","id":7094,"type":null,"title":"Nibiru Chain Secures $12 Million to Fuel Developer-Focused L1 Blockchain","category":["SPONSORED"],"content":["<a href=\"https:\/\/nibiru.fi\/?utm_source=theblock&amp;utm_medium=article&amp;utm_campaign=fundraise\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Nibiru Chain<\/span><\/a><span data-v-f87c67ca=\"\">, a general-purpose layer 1 blockchain, has successfully closed its latest round of funding, securing $12 million to set the stage for an ambitious phase of growth. Venture investments included contributions from Kraken Ventures, ArkStream, NGC Ventures, Master Ventures, Tribe Capital, and Banter Capital.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","","","<span data-v-f87c67ca=\"\">“Nibiru has taken all of the best in class technology and research developed over the past few cycles and packed them into the best new chain we have ever analyzed. They optimize for developers with a built-in dev toolkit, easy-to-use APIs, language SDKs, and a native oracle. MV Capital could not be more excited to be a partner with Nibiru as we move into the new level of adoption for crypto.” - Tom Dunleavy, CIO and Partner at Master Ventures Capital<\/span>","<span data-v-f87c67ca=\"\">Nibiru’s Community Sale on CoinList sold out its initial allocation of $3M in 9 minutes. An additional $3M extension sold out as well within 11 minutes. By the end, this sale had 842% in pre-funded excess interest, attracting 42,713 registrants and over 5,000 purchasers of the network’s staking and utility token, NIBI.<\/span>","<span data-v-f87c67ca=\"\">Nibiru Chain stands out with its innovative tech and emphasis on developer and user-centricity. Key partners expressed their enthusiasm:<\/span>","<span data-v-f87c67ca=\"\">“We look forward to supporting the distinctive Layer 1 model Nibiru has designed, where the core primitives are built alongside the core foundation for maximum interoperability — all while incentivizing developers and users through its smart contract royalty mechanism.” - Brandon Gath, Managing Partner at Kraken Ventures<\/span>","<span data-v-f87c67ca=\"\">It’s the platform of choice for developers who prioritize security and performance. Boasting 40K transactions per second (TPS), 1.4s block times, and robust security, Nibiru Chain’s versatility spans multiple sectors including real-world assets (RWAs), gaming, DeFi, and more. Developers build on Nibiru Chain with confidence, leveraging CosmWasm smart contracts for enhanced security or the familiarity of the EVM.<\/span>","<span data-v-f87c67ca=\"\">Additionally, developers can leverage Nibiru’s “dev gas” royalty mechanism to ensure a sustainable model for long-term growth. At its core, Nibiru Chain is driven to create the optimal environment for developers and users.<\/span>","<span data-v-f87c67ca=\"\">\"Nibiru's integrated super applications, native oracle, and data-indexing significantly reduce the technical selection difficulties for Web3 projects while simultaneously lowering the likelihood of security incidents. This will heighten user and developer confidence and the consequent growth and prosperity of the Nibiru ecosystem. - Allen Su, General Partner at ArkStream Capital<\/span>","<span data-v-f87c67ca=\"\">In 2024, Nibiru Chain sets its sights on expanding the ecosystem. Key developments include several initiatives such as a gamified engagement airdrop, integration with major liquidity centers, listing on several top-tier centralized exchanges, implementing parallel optimistic execution, and achieving full EVM-compatibility.<\/span>","<span data-v-f87c67ca=\"\">This year is marked by the anticipated launch of Nibiru Chain’s flagship dApps such as Nibi-Perps, Nibi-Swap, and NUSD. These releases will mark major milestones in Nibiru Chain’s journey towards a user and developer-centric platform.<\/span>","<b data-v-f87c67ca=\"\">About Nibiru Chain<\/b>","<span data-v-f87c67ca=\"\">Nibiru Chain is a breakthrough L1 blockchain and smart contract ecosystem sporting superior throughput and unparalleled security. Nibiru aims to be the most developer-friendly and user-friendly smart contract ecosystem, leading the charge toward mainstream Web3 adoption by innovating at each layer of the stack: dApp development, infra, consensus, a comprehensive dev toolkit, value accrual.<\/span>","<span data-v-f87c67ca=\"\">For more information visit:<\/span> <a href=\"https:\/\/nibiru.fi\/?utm_source=theblock&amp;utm_medium=article&amp;utm_campaign=fundraise\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">nibiru.fi<\/span><\/a>","<b data-v-f87c67ca=\"\">Contact:<\/b> <a href=\"\/cdn-cgi\/l\/email-protection#83eee6e7eae2c3edeae1eaf1f6adecf1e4\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"eb868e8f828aab85828982999ec584998c\">[email&nbsp;protected]<\/span><\/span><\/a>","<b data-v-f87c67ca=\"\">Nibiru Chain Socials: <\/b><a href=\"https:\/\/linktr.ee\/nibiruchain\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/linktr.ee\/nibiruchain<\/span><\/a>","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">This post is commissioned by Nibiru Chain and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/span><\/em>","&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nibiru Chain","content":"LOCATION"},{"type":"$12 million","content":"MONEY"},{"type":"General Partner","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Tribe Capital","content":"ORGANIZATION"},{"type":"Tom Dunleavy","content":"PERSON"},{"type":"Brandon Gath","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"ArkStream Capital","content":"ORGANIZATION"},{"type":"Nibiru’s Community Sale","content":"ORGANIZATION"},{"type":"Master Ventures","content":"ORGANIZATION"},{"type":"Allen","content":"PERSON"},{"type":"Nibiru","content":"PERSON"},{"type":"$3M","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Nibi","content":"PERSON"},{"type":"842%","content":"PERCENT"},{"type":"NGC Ventures","content":"ORGANIZATION"},{"type":"Nibiru","content":"ORGANIZATION"},{"type":"Nibiru Chain","content":"ORGANIZATION"},{"type":"Kraken Ventures","content":"ORGANIZATION"},{"type":"Master Ventures Capital","content":"ORGANIZATION"},{"type":"EVM","content":"ORGANIZATION"},{"type":"NUSD","content":"ORGANIZATION"},{"type":"Perps","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}