{"summary":"Tether CTO Paolo Ardoino said the likelihood of a potential U.S. default is low since it would have catastrophic consequences for the U.S. economy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232160\/tether-cto-says-us-default-unlikely-because-it-would-be-catastrophic","publishDate":"2023-05-25T10:40:29","id":7097,"type":null,"title":"Tether CTO says US default unlikely because it would be &#x27;catastrophic&#x27;","category":["CRYPTO ECOSYSTEMS"],"content":["Tether CTO Paolo Ardoino said the likelihood of a potential U.S. default is low as it would have \"catastrophic\" consequences for the U.S. economy.","“I think this thing with the potential U.S. default that, by the way, I don’t think will happen — I mean, it would be catastrophic for the U.S. economy,\" Ardoino said, on <a href=\"https:\/\/www.theblock.co\/post\/232194\/paolo-tether-diversification\" data-v-f87c67ca=\"\">The Scoop podcast<\/a>. \"I think everyone is sitting tight to monitor what’s going on and what will happen.\"","Ardoino discussed what events could be a catalyst to shake things up in the market, where liquidity has dried up. He noted that while Bitcoin has rebounded from below $20,000 to around $27,000, there's a bit less space for more volatile investments in general because interest rates are ramping up. He added that people are leaning toward having a 5% yield that's more certain.","\"So you can see that overall, despite the fact that Tether grew in market cap, you see the entire stablecoin market as a sum it went down I think 23% from the all-time highs because in the end people prefer to sit on their dollars and earn interest on it, and so that also leaves less space, less liquidity to actually reinvest that liquidity in the crypto markets,\" he said.","But he put forward one possible optimistic path forward. \"And so it’s kind of multi-factor, but definitely if we are starting to see the US inflation numbers going down, if the Fed will stop ramping up the interest rates, I believe that we will be in a situation where the markets will start healing, not just the crypto market, the market in general,\" he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Ardoino","content":"PERSON"},{"type":"Fed","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"$20,000","content":"MONEY"},{"type":"23%","content":"PERCENT"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"$27,000","content":"MONEY"}],"hashtag":["TETHER"],"authors":["Tim Copeland","The Block"]}