{"summary":"Mezo, a Bitcoin scaling network built by Matt Luongo&#x27;s Thesis, has emerged from stealth with $21 million in funding.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287245\/bitcoin-mezo-thesis-funding","publishDate":"2024-04-09T07:45:09","id":71,"type":null,"title":"Bitcoin scaling network Mezo raises $21 million led by Pantera Capital","category":["DEALS"],"content":["Mezo, a Bitcoin scaling network built by Matt Luongo's Thesis, has emerged from stealth with $21 million in funding.","Pantera Capital led the funding, with Multicoin Capital, Hack VC, ParaFi Capital, Nascent, Draper Associates, Primitive Ventures, Asymmetric Ventures and others participating, Thesis said Tuesday.","Thesis began raising funds for Mezo last December and closed the round this week, Luongo, CEO of Thesis and founder of Mezo, told The Block. The round occurred in two tranches, totaling $21 million, Luongo said. He declined to comment on valuation and the structure of the round, but Mezo will have a native token.","Thesis calls Mezo a Bitcoin \"economic layer,\" which will focus on creating an ecosystem of applications based on users' economic needs, from groceries to tuition.","\"Our goal with Mezo is to extend the Bitcoin network to bring 25% of the world's economy on-chain — roughly in line with the size of the US economy today,\" Luongo said.","Mezo uses \"proof of HODL\" as a consensus mechanism. Users secure the network by locking BTC and MEZO tokens. \"The focus is aligning Mezo economically with BTC holders, who stake and earn rewards for running the network,\" Luongo said.","Mezo has opened up bitcoin deposits and has already reached over $26 million in total value locked, according to its website. Mezo said the longer bitcoin deposits are locked by users, the greater their HODL score will be. HODL score is a points program.","Users will receive five one-time invitations to extend to their friends upon joining Mezo. Subsequently, Mezo will distribute reciprocal earnings based on the duration and amount of their friends' bitcoin deposits made through the invitations.","Besides BTC, users can also deposit <a href=\"https:\/\/www.theblock.co\/post\/112214\/crypto-venture-studio-thesis-21-million-series-a-funding\" data-v-f87c67ca=\"\">Thesis<\/a>-built <a href=\"https:\/\/www.theblock.co\/linked\/60745\/venture-production-studio-thesis-closes-a-7-7-million-funding-round-as-it-prepares-for-tbtcs-launch-in-april\" data-v-f87c67ca=\"\">TBTC<\/a>, a wrapped bitcoin, as well as WBTC, another wrapped bitcoin, with Mezo, Luongo said.","The Mezo funding brings the total funding of all Thesis projects to over $90 million, Luongo said. Currently, 48 people are working on Thesis projects, and Luongo plans to nearly double the headcount this year.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mezo","content":"ORGANIZATION"},{"type":"Asymmetric Ventures","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Draper Associates","content":"ORGANIZATION"},{"type":"$26 million","content":"MONEY"},{"type":"Primitive Ventures","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Matt Luongo","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$21 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"Luongo","content":"PERSON"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"Nascent","content":"ORGANIZATION"},{"type":"$90 million","content":"MONEY"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"US","content":"LOCATION"}],"hashtag":["BITCOIN","SERIES A"],"authors":["Yogita Khatri","The Block"]}