{"summary":"Standard Custody just received its license to operate as a New York state-chartered trust last week.\nIt’s the first digital asset firm to receive approval on a de novo application for a New York trust license.\nIt’s looking to build out custody services for institutions without ever offering exchange services, and it thinks that will differentiate it from other all-in-one giants.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/104979\/standard-custody-qualified-custodian-raise-bank-charter","publishDate":"2021-05-16T13:06:53","id":71,"type":null,"title":"Standard Custody takes new route to &#x27;qualified custodian&#x27; status","category":["Regulation"],"content":["Standard Custody received its license to operate as a New York state-chartered trust <a href=\"https:\/\/www.dfs.ny.gov\/reports_and_publications\/press_releases\/pr202105041\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">on May 4<\/a>, and it's already making a play to gate-crash the institutional custody space.","Just days after its licensing, the firm announced the close of a $53 million Series B round for its parent firm, PolySign.","Cowen Digital Asset Investment Company led the round with a $25 million strategic investment. The two will also partner, with PolySign providing digital asset custody solutions for Cowen clients through its newly licensed trust arm, Standard Custody. Blockchain.com and Race Capital also participated in the round.","Through Standard Custody, PolySign is looking to fill a gap in the custody space. While many crypto firms are attempting to build all-in-one services, with exchange, brokerage and custody housed under the same roof,&nbsp; CEO Jack McDonald says Standard Custody plans to differentiate itself by focusing solely on custody-based services for institutions.","Though Standard Custody plans to expand its range of services, McDonald says it will stop short of being an exchange unlike others in the custody space.","\"We think that ultimately the institutions that are wading into the space, more and more of the traditional institutional asset managers, are going to want to see a segregation of duties there between exchange activity and custody activity,\" he said.","That could mean hedge funds, family offices, endowments and exchanges could make up its client base going forward, but not retail-facing activities. It does serve parent companies with retail clientele, like Blockchain.com. Others serving the retail market have expressed interest in Standard Custody's services, mostly due to its recent licensure. It's the first to get approval for a de novo trust application in New York, and that's positioning it to emerge as a favorable partner for a variety of clients, according to McDonald.&nbsp;","To build out custody and escrow services, Standard Custody needed to be a qualified custodian. There's more than one way to gain the distinction, but some fit better than others. To be a qualified custodian, firms can either become a registered broker-dealer with the Financial Industry Regulatory Authority (FINRA), a futures commodities merchant regulated by the Commodities Futures Trading Commission (CFTC) or you can be a federally or state-licensed trust bank.","For firms mainly looking to custody, it makes the most sense to become a trust but it's recently become unclear how far a trust license extends outside state borders. The Securities and Exchange Commission (<a href=\"https:\/\/www.theblockcrypto.com\/daily\/64185\/robinhood-top-lawyer-sec-commissioner-scrappy-roots\" data-v-f87c67ca=\"\">SEC<\/a>) is currently seeking comment on how it should view state-licensed qualified custodians in the wake of a letter from Wyoming's regulators. On the national level, Congress is still debating how much power the Office of the Comptroller of the Currency (OCC) should have to designate digital asset firms as national trusts and therefore qualified custodians.","Still, a New York trust license from the New York Start Department of Financial Service is the gold standard of state licenses. It's the highest barrier of the state licensure frameworks, and also has more reciprocity than other states, meaning some other states recognize the New York trust charter and don't require an additional license. Standard Custody is the first to receive a de novo approval, meaning it's operating a new business as opposed to converting a previous entity like Gemini and Coinbase. That's made it more attractive to businesses looking to set up shop in the U.S. without going through onerous regulatory frameworks.","\"We do have a lot of interest in our technology from some of the more retail-oriented strategics out there and specifically wanting to tap our capabilities to business in New York and more broadly in the U.S.,\" said McDonald."],"hashtag":["OCC"]}