{"summary":"BitMEX&#x27;s BTC futures daily trading volume is now less than that of Binance, OKEx, or Huobi according to data from Skew.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61236\/bitmex-bitcoin-futures-dominance-binance-huobi-okex","publishDate":"2020-04-08T13:53:57","id":7101,"type":null,"title":"BitMEX cedes bitcoin futures market dominance as Binance, Huobi, and OKEx inch ahead","category":["MARKETS"],"content":["BitMEX – the marketplace that once dominated the bitcoin derivatives trading market with its perpetual swaps product – has seen its market share slide since March 12's market sell-off.&nbsp;","Data from analytics provider Skew indicates that the crypto derivatives exchange's daily BTC futures trading volume (perpetual swaps included) dropped significantly on March 14. This was two days after bitcoin's price fell nearly 50% at one point.","Meanwhile, Huobi, OKEx, and Binance have all surpassed BitMEX in daily trading volume during the same period.","Take April 7 as the latest example. Binance, Huobi, and OKEx saw $3.1 billion, $2.6 billion, and $2.3 billion in total bitcoin futures trading volumes, respectively, on that day. BitMEX trailed behind them with $2.2 billion in trading volume.&nbsp;","","","It's worth mentioning that OKEx and Huobi were among the exchanges that allegedly display fake spot trading volumes,<a href=\"https:\/\/finance.yahoo.com\/news\/86-total-reported-cryptocurrency-trading-131645663.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> according to an analysis by Bitwise Asset Management<\/a>.&nbsp;","Meanwhile, the order book depth, which is provided by market makers when they offer how many contracts they are willing to buy or sell, <a href=\"https:\/\/twitter.com\/skewdotcom\/status\/1247806770103193601?s=20\" data-v-f87c67ca=\"\">has not been able to come<\/a> back to its pre-selloff level either.","As one trader told The Block, market participants were traditionally drawn to BitMEX for its large pool of liquidity, which is also why it was able to maintain its dominance in BTC futures despite growing competition from other exchanges.","However, as liquidity on BitMEX shrank, pricing also became less favorable and thus drove traders to other exchanges.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2.3 billion","content":"MONEY"},{"type":"$2.2 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"March 14","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"March 12","content":"DATE"},{"type":"Bitwise Asset Management","content":"ORGANIZATION"},{"type":"April 7","content":"DATE"},{"type":"$2.6 billion","content":"MONEY"},{"type":"Huobi","content":"PERSON"},{"type":"Binance","content":"PERSON"}],"hashtag":["DERIVATIVES"],"authors":["Celia Wan","The Block"]}