{"summary":"Checkout.com is no longer servicing Binance. In response, Binance is considering its options for legal action.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246313\/checkout-binance-partnership-ends","publishDate":"2023-08-18T12:42:00","id":7106,"type":null,"title":"Checkout.com ends Binance partnership","category":["COMPANIES"],"content":["Payments processor Checkout.com is no longer servicing Binance, a spokesperson from the crypto exchange told The Block.","The partnership between the two companies ended Aug. 16, but there is \"no impact on our services and users can continue to use on-and off-ramps as usual,\" the spokesperson said.","Forbes first <a href=\"https:\/\/www.forbes.com\/sites\/davidjeans\/2023\/08\/18\/payment-processor-checkout-drops-binance-over-money-laundering-compliance-concerns\/?sh=341ec43d5623\" data-v-f87c67ca=\"\">reported<\/a> the news, saying that Checkout.com cut ties with Binance citing \"reports of regulators actions and orders in relevant jurisdictions\" and \"inquiries from partners\" as well as additional concerns over Binance's anti-money laundering, sanctions and compliance controls.","\"We do not agree with Checkout's purported basis for termination and are considering our options for legal action,\" the Binance spokesperson said. \"We remain committed to continuing to collaborate with regulators and partners around the world to ensure clarity and the best services and protections for our users.\"","Checkout.com first <a href=\"https:\/\/www.binance.com\/en\/blog\/ecosystem\/binance-launches-payments-technology-company-bifinity-421499824684903541\" data-v-f87c67ca=\"\">partnered<\/a> with Binance in March 2022 to help it launch Bifinity (later renamed Binance Connect), the crypto exchange's official fiat-to-crypto payments platform that linked businesses, merchants and users to the crypto world. Merchants could use the platform to accept crypto payments, and users could access buy-sell crypto services.","Binance <a href=\"https:\/\/www.theblock.co\/amp\/post\/245454\/binance-shuts-down-fiat-to-crypto-payment-platform-reports\" data-v-f87c67ca=\"\">shut down<\/a> the Binance Connect platform also on Aug. 16, the same day its partnership with Checkout.com ended.","Binance did not mention Checkout.com while terminating Binance Connect. It said it took the decision \"due to strategic reasons,\" without specifying.","\"We periodically review our products and services to ensure that our resources continue to be focused on core efforts that align with our long-term strategy,\" a Binance spokesperson reportedly said. \"We consistently adapt and modify our business approach in response to changing market and user needs.\"","Checkout.com did not immediately respond to a request for comment from The Block.","Binance is currently <a href=\"https:\/\/www.theblock.co\/post\/237907\/binance-cz-crypto-trading-volumes\" data-v-f87c67ca=\"\">embroiled<\/a> in a legal battle with regulators in the U.S., with the Commodity Futures Trading Commission and the Securities and Exchange Commission both suing the exchange for allegedly violating federal laws.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Checkout.com","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Aug. 16","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"March 2022","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Yogita Khatri","The Block"]}