{"summary":"Web3 gaming investors are backing the revamp of 90s virtual pet game Neopets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203724\/neopets-meta-raises-4m-in-funding-from-polygon-ventures-blizzard-avalanche","publishDate":"2023-01-19T07:11:21","id":7107,"type":null,"title":"Neopets Meta raises $4m in funding from Polygon Ventures, Blizzard Avalanche","category":["METAVERSE"],"content":["The web3 spin-off of the classic virtual pet game Neopets raised $4 million in a new funding round.","Polygon Ventures, Blizzard Avalanche Ecosystem Fund, Hashkey Capital, IDG Capital and its parent company Chinese gaming firm NetDragon Websoft were among the investors, according to a release.","Neopets Meta launched the <a href=\"https:\/\/www.theblock.co\/post\/164993\/neopets-alpha-metaverse-to-launch-friday\" data-v-f87c67ca=\"\">alpha version of its metaverse<\/a> in August. Several popular games were revamped for web3 including Turmac Roll, Meera Chase and Ultimate Bullseye.","It also recently rolled out Neopets Meta Alpha: Winter Edition, which features Neopia Central and Terror Mountain, two popular areas on the original Neopets gamemap, which is available to play until the end of the month.","The Neopets community has been divided over the web3 pivot. Over its more than 20 years of existence — it launched in 1999 — 150 million people signed up for the original Neopets.","Fans pushed back against the inclusion of NFTs in the new platform and expressed concerns that the original game would be shut down in favour of the new web3 version. The Neopets Meta team previously told The Block that it operates independently of the OG team and that it's not intended to replace the original platform. But it's still hoping to win over both current players and new fans.","\"This funding will allow us to provide a genuinely inclusive and immersive gaming experience that will capture the spirit of the Neopets community,” said Neopets Meta Chief Metaverse Officer, Dominic Law.","The original platform is still accessible but it's been scaled back since its heyday, in part due to the end of support for Adobe Flash, which was a requirement for many of its games.","But although it still has a devoted following among hardcore fans, Neopets' popularity has dwindled in recent years.&nbsp; The brand was bought and sold by several companies, including Viacom. Jumpstart purchased the brand in 2014 and was itself acquired by NetDragon in 2017.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Winter Edition","content":"ORGANIZATION"},{"type":"NetDragon Websoft","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"$4 million","content":"MONEY"},{"type":"Meera Chase and Ultimate Bullseye","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Hashkey Capital","content":"ORGANIZATION"},{"type":"NetDragon","content":"ORGANIZATION"},{"type":"Viacom","content":"ORGANIZATION"},{"type":"1999","content":"DATE"},{"type":"Neopets Meta","content":"ORGANIZATION"},{"type":"Neopia Central","content":"ORGANIZATION"},{"type":"OG","content":"ORGANIZATION"},{"type":"IDG Capital","content":"ORGANIZATION"},{"type":"Adobe Flash","content":"ORGANIZATION"},{"type":"Neopets Meta Chief Metaverse Officer","content":"ORGANIZATION"},{"type":"Dominic Law","content":"ORGANIZATION"},{"type":"Neopets","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}