{"summary":"Governance tokens for liquid staking protocols on Ethereum have fallen in price over the last few days.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225889\/ethereum-shapella-shanghai-liquid-staking-governance-tokens-price","publishDate":"2023-04-12T07:28:47","id":7111,"type":null,"title":"Ethereum liquid staking governance tokens fall ahead of Shapella upgrade","category":["CRYPTO ECOSYSTEMS"],"content":["The prices of major governance tokens for Ethereum liquid staking protocols have dropped ahead of the network’s upgrade slated for later today.","The three biggest governance tokens for liquid staking protocols have dropped between 4.6% and 9% in the last 24 hours, according to <a href=\"https:\/\/www.coingecko.com\/en\/categories\/liquid-staking-governance-tokens\" data-v-f87c67ca=\"\">CoinGecko<\/a> —&nbsp;cementing losses of 7% to 13.7% over the last week. These tokens are lido DAO, rocket pool and frax share.","<span data-v-f87c67ca=\"\">The price of lido DAO has slid over the last week. Image: CoinGecko<\/span>","These losses are worse than ether, which has only lost 2.4% of its value in the last 24 hours and 2% over the last week.","Arkham Intelligence <a href=\"https:\/\/twitter.com\/ArkhamIntel\/status\/1646077981591236608\" data-v-f87c67ca=\"\">noted<\/a> that wallets it has tagged as belonging to prominent anonymous crypto trader Sisyphus sold $400,000 of lido DAO over the last few days.&nbsp;","Liquid staking protocols allow people to stake their ether and receive a derivative token that represents the locked cryptocurrency. This derivative is able to be used across various crypto markets, effectively making the locked coins liquid. The governance tokens are used to manage how the protocols develop and are typically associated with its success.","The <a href=\"https:\/\/www.theblock.co\/post\/225655\/ethereum-shapella\" data-v-f87c67ca=\"\">Shapella upgrade<\/a> —&nbsp;a portmanteau of two upgrades called Shanghai and Shapella —&nbsp;will take place at epoch 620,9536, expected at 6:27 p.m. EDT on April 12. It will allow ether stakers to unstake their ether and withdraw their coins.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"9%","content":"PERCENT"},{"type":"13.7%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"$400,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"4.6%","content":"PERCENT"},{"type":"2.4%","content":"PERCENT"},{"type":"April 12","content":"DATE"},{"type":"6:27 p.m. EDT","content":"TIME"},{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"lido DAO","content":"ORGANIZATION"},{"type":"Shanghai","content":"LOCATION"}],"hashtag":["DERIVATIVES","ETHEREUM","LIDO FINANCE","STAKING"],"authors":["Tim Copeland","The Block"]}