{"summary":"Coinbase is planning to file an order in court on Friday to dismiss the SEC’s lawsuit against it in its entirety.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243128\/coinbase-plans-friday-filing-to-seek-dismissal-of-secs-case-in-its-entirety","publishDate":"2023-08-03T18:48:01","id":7113,"type":null,"title":"Coinbase plans Friday filing to seek dismissal of SEC&#x27;s case &quot;in its entirety&quot;","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Coinbase has “full confidence” in its arguments made to the court, Paul Grewal, chief legal officer at Coinbase, said in an earnings call on Thursday.&nbsp;<\/span>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">Coinbase is planning to file an order in court on Friday to dismiss the Securities and Exchange Commission’s lawsuit against it \"in its entirety\" after the agency accused the exchange of violating securities laws earlier this summer.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Coinbase has “full confidence” in its arguments made to the court, Paul Grewal, chief legal officer at Coinbase, in an <a href=\"https:\/\/www.theblock.co\/post\/243100\/coinbase-q2-revenues-beat-estimates-but-usdc-interest-income-falls-to-151-million\" data-v-f87c67ca=\"\">earnings call<\/a> on Thursday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“With respect to litigation with the SEC, I want to be very clear — we do think we can win, we expect to win,” Grewal said, adding that the exchange wants to work with the SEC and lawmakers to obtain “regulatory clarity.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC charged Coinbase in June over several aspects of its business, including not registering as an exchange, broker or a clearing agency. The regulator also charged the crypto behemoth for the unregistered offer and sale of securities tied to its staking-as-a-service program.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Coinbase has argued that the SEC has not engaged in rulemaking and is instead pursuing a “regulation by enforcement approach,” Coinbase CEO Brian Armstrong said during the call.&nbsp;<\/span>","\"Well, tomorrow, as it turns out, in our case in the Southern District of New York, we will be moving the court for an order dismissing the case in its entirety,\" <span class=\"s1\" data-v-f87c67ca=\"\">Grewal said, adding that the company<\/span> would be submitting a brief that will be taken into consideration at the end of October.","<span class=\"s1\" data-v-f87c67ca=\"\">SEC lawyers argued <a href=\"https:\/\/www.theblock.co\/post\/238500\/coinbase-knew-it-violated-securities-law-sec-says\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">last month<\/span><\/a> that the exchange knew it violated securities laws, specifically pushing back on a claim that its approval of a 2021 registration statement related to Coinbase’s initial public offering meant that its enforcement action had no merit.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"Coinbase, a multi-billion-dollar entity advised by sophisticated legal counsel, argues it was unaware that its conduct risked violating the federal securities laws, and suggests that by approving Coinbase’s registration statement in 2021 the SEC confirmed the legality of Coinbase’s underlying business activities—at that time and for all time,\" SEC lawyers wrote to Judge Katherine Polk Failla of the Southern District Court of New York.<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">SEC Chair Gary Gensler too has urged crypto platforms to register with the agency, calling the industry “largely non-compliant.”&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">“Our agency has put out rules about what it is to be an exchange, what it means to be a broker-dealer, what it is to be an adviser of custody and assets, and how to register a securities offering,” Gensler said in <a href=\"https:\/\/www.theblock.co\/post\/230957\/gary-gensler-sec-crypto-false-narrative-decentralization\" data-v-f87c67ca=\"\">May<\/a> at a financial markets conference. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Katherine Polk Failla","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Grewal","content":"PERSON"},{"type":"the Southern District Court of New York","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Paul Grewal","content":"PERSON"}],"hashtag":["COINBASE","SEC"],"authors":["Sarah Wynn","The Block"]}