{"summary":"USA v. Nerayoff and Hlady, Cr. №19-MJ-830 (E.D.N.Y. filed September 19, 2019) Link to complaint A bedrock principle of the American legal system is the","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/40546\/self-described-inventor-of-the-initial-coin-offering-nabbed-by-feds-in-alleged-crypto-extortion-scheme","publishDate":"2019-09-21T10:18:08","id":7119,"type":null,"title":"Self-described inventor of the Initial Coin Offering nabbed by feds in alleged crypto extortion scheme","category":["LEGAL"],"content":["<a class=\"br cx ls lt lu lv\" href=\"https:\/\/www.justice.gov\/usao-edny\/press-release\/file\/1203466\/download\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Link to complaint<\/a>","A bedrock principle of the American legal system is the idea that you are innocent until proven guilty. The government must prove its case against you beyond a reasonable doubt before you are convicted of a crime. What does that mean? Oversimplifying a little, the evidence has to be so overwhelming that no reasonable person would look at it and think “yeah, the defendant is totes innocent.” [That is a *direct* quote from a jury instruction in the eastern district of millennial -- SP]. &nbsp;But, remember, the government has to <em class=\"lr\" data-v-f87c67ca=\"\">prove<\/em> the case. This new criminal case comes out of the Eastern District of New York and the allegations are pretty incredible.","So, where to start? &nbsp;The US government has arrested Steven Nerayoff and Michael Hlady for allegedly running an extortion scheme to extract funds from a Seattle based blockchain company referred to as Company 1 in the complaint run by John and Jane Doe. Who are the defendants? Well, Nerayoff is a licensed attorney in the State of New York who runs a couple of consulting companies that purport to help blockchain companies launch ICOs, etc. Also, Nerayoff is the self-proclaimed architect of the ICO, specifically, the Ethereum ICO.","Hlady was hired by Nerayoff to be his Chief Operations Officer at one of his companies. According to the complaint, Hlady allegedly, and I quote:","“falsely claimed to be a former member of the United States military and a former government agent who had worked for the National Security Agency, the Federal Bureau of Investigation and the Central Intelligence Agency.”","I submit to you dear reader that almost no one fits that profile. I don’t know, maybe David Goggins, but that guy is like a superhero. But I digress. Okay, so what did these two individuals allegedly do?","Allegedly, on July 22, 2017, Nerayoff was hired to help Company 1 launch an ICO for their company and take them to the moon. As compensation, Nerayoff was set to receive:","“22.5% of all the cryptocurrency tokens sold by Company 1 and 22.5% of all the funds raised by Company 1, including in the form of cryptocurrency and cash, “regardless of the method and manner in which [the funds] are raised.”","Once the contract was signed, the defendants allegedly started committing some crimes, specifically, they “took various actions to threaten John Doe, Jane Doe and Company 1 in order to extract additional compensation without promising or rendering any additional services.” In particular, the government is alleging three different instances of extortion.","Company 1’s ICO was set to launch on November 7, 2017. Some time a week before the ICO, Nerayoff and a co-conspirator (sidebar: somebody else is gonna get arrested in connection with all this) demanded an additional payment of 30,000 eth or they would do everything to tank the ICO. Eventually, the Does relented and signed agreements transferring over the 30,000 ether. Allegedly, no additional services were rendered.","Some time in March, 2018, is when the second alleged extortion occurred to the tune of a 10,000 ether “loan” that Nerayoff demanded from Company 1. At this time Nerayoff introduced the Does to Hlady who allegedly told them he had taken down a head of state, could carry a firearm onto airplanes, and was a member of every special forces and intelligence agency on the planet. I’m paraphrasing.","Allegedly, Jane Doe visited Nerayoff’s house and stayed there on March 21st and 22nd, because her flight was cancelled due to a snow storm in New York. According to the complaint, in the middle of the night on the 22nd, both Hlady and Nerayoff entered Doe’s room where she was sleeping and menacingly demanded that she accede to their demands or they would crush her company. Additional threats were made in the following days, and eventually, on April 1, an employee of Company 1 was instructed to transfer the 10,000 ether loan to Nerayoff.","Through all of this Nerayoff allegedly made multiple statements that he intended to acquire Company 1 outright. On or about May 10, 2018, an email was exchanged between Nerayoff, Hlady, and co-conspirator 1 that stated","“Something has to be done to explain when they [i.e., Jane Doe and John Doe] make a deal they stick to it regardless of the consequences. And then when we renegotiate they stick to that deal. Enough is enough. We are acquiring them and going to make them fucking rich as hell and she [i.e., Jane Doe] will pay off everything and get what she would never have without us so tell her to chill out.”","There was a meeting in a hotel room with the Does on May 15, 2018. Hlady’s threats came up, which Nerayoff acknowledged, and an employee of Nerayoff’s noted they were running an intervention concerning Hlady, and that no one was trying to gang up on the Does. I suspect the Does contacted law enforcement some time after that.","According, to 18 USC Section 1951, extortion is “the obtaining of property from another, with his consent, induced by wrongful use of actual or threatened force, violence, or fear, or under color of official right.” This initial filing was filed to get an arrest warrant for Nerayoff, and Hlady. As noted in the filing:","“…the purpose of this Complaint is to set forth only those facts necessary to establish probable cause to arrest, I have not described all the relevant facts and circumstances of which I am aware. In addition, where the contents of documents, or the actions, statements and conversations of others are reported herein, they are reported in sum and substance and in part, except where otherwise indicated.”","There is more to the story, and we haven’t heard the defendants side of the story yet. The charges are quite serious. What is interesting to consider is if Nerayoff was indeed the architect of the Ethereum ICO, he necessarily would be influential in the crypto community. What connections does he have? What other projects did he work on? Who <em class=\"lr\" data-v-f87c67ca=\"\">helped<\/em> Nerayoff as he ran his businesses? There is a hearing scheduled for September 24th. This is just the beginning of this tale.","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Disclaimer: Crypto Caselaw Minute is provided for educational purposes only by Nelson Rosario (@nelsonmrosario) and Stephen Palley (@stephendpalley). These summaries are not legal advice. They are our opinions only, aren’t authorized by any past, present or future client or employer. Also, we might change our minds. We contain multitudes. &nbsp;<\/em><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">As always, Rosario summaries are “NMR” and Palley summaries are “SDP”. &nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"September 24th","content":"DATE"},{"type":"Nelson Rosario (","content":"PERSON"},{"type":"David Goggins","content":"PERSON"},{"type":"USC","content":"ORGANIZATION"},{"type":"Nerayoff","content":"PERSON"},{"type":"Federal Bureau of Investigation","content":"ORGANIZATION"},{"type":"March, 2018","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"March 21st","content":"DATE"},{"type":"Nerayoff","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Jane Doe","content":"PERSON"},{"type":"Michael Hlady","content":"PERSON"},{"type":"November 7, 2017","content":"DATE"},{"type":"Hlady","content":"PERSON"},{"type":"Ethereum ICO","content":"ORGANIZATION"},{"type":"Seattle","content":"LOCATION"},{"type":"July 22, 2017","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"May 15, 2018","content":"DATE"},{"type":"April 1","content":"DATE"},{"type":"John","content":"ORGANIZATION"},{"type":"1951","content":"DATE"},{"type":"Central Intelligence Agency","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"John Doe","content":"PERSON"},{"type":"May 10, 2018","content":"DATE"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Eastern District of New York","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"National Security Agency","content":"ORGANIZATION"},{"type":"22.5%","content":"PERCENT"},{"type":"Palley","content":"PERSON"},{"type":"Doe","content":"PERSON"},{"type":"Steven Nerayoff","content":"PERSON"}],"hashtag":[],"authors":["Nelson Rosario","The Block"]}