{"summary":"Initia is planning to launch its incentivized testnet in the next two months, with its mainnet coming shortly after.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279038\/former-terra-developers-raise-7-5-million-for-rollup-focused-blockchain-initia-targeting-q2-launch","publishDate":"2024-02-27T09:00:12","id":7126,"type":null,"title":"Former Terra, Cosmos developers raise $7.5 million for rollup-focused blockchain Initia, targeting Q2 launch","category":["CRYPTO ECOSYSTEMS"],"content":["A group of former Terra and Cosmos developers raised $7.5 million for a blockchain platform called Initia that is natively designed to support many Layer 2 networks.","The funding round was co-led by Delphi Ventures and Hack VC, with participation from Nascent, Figment Capital, Big Brain and A.Capital. Angels included pseudonymous crypto traders <a href=\"https:\/\/www.theblock.co\/post\/165453\/crypto-whale-cobie-donates-100000-to-youtuber-sued-by-bitboy\" data-v-f87c67ca=\"\">Cobie<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/263924\/a-dao-is-funding-a-lawsuit-against-its-own-founding-team\" data-v-f87c67ca=\"\">DCF God<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/273562\/ex-ledgerprime-employees-start-liquid-token-hedge-fund-called-split-capital\" data-v-f87c67ca=\"\">Split Capital<\/a> co-founder Zaheer Ebtikar, <a href=\"https:\/\/twitter.com\/Fiskantes\" data-v-f87c67ca=\"\">Fiskantes<\/a> and <a href=\"https:\/\/twitter.com\/wsbmod\" data-v-f87c67ca=\"\">WSB Mod<\/a>. Celestia COO Nick White also participated.","The round was a SAFE agreement with a token warrant. The team declined to comment on the specific valuation but said it was in the low nine-figure range.","Initia is currently live on a closed testnet. A few projects are already building DeFi applications on the testnet, with plans to go live on an incentivized testnet set to launch around the start of April. Once any kinks have been ironed out, the project will launch its mainnet, tentatively set for Q2.","Two of Initia’s core developers, Zon and Stan Liu, were working at Terraform Labs during its heyday. Terraform Labs was behind the Cosmos-based Terra blockchain and its sister stablecoin UST. Zon was a smart contract developer while Liu was researching <a href=\"https:\/\/www.theblock.co\/learn\/245701\/what-is-maximal-extractable-value-mev\" data-v-f87c67ca=\"\">MEV<\/a>, where miners extract value by ordering transactions in a certain way.&nbsp;","Both developers left to start a Cosmos-based DeFi blockchain. Yet it wasn’t long before the entire Terra\/Luna ecosystem collapsed, impacting the wider crypto space. The developers stopped their initial fundraise, returning funds to their investors, as they didn’t think it was best to launch a new blockchain in that climate.","After this, they spent some time thinking about what to do next before focusing on Initia. For this, they hired developers from the core team behind the Cosmos Hub — the foundational blockchain in the Cosmos ecosystem —&nbsp;and Terra Station, the biggest wallet in the Terra ecosystem. The team has now reached a size of around 25 people.","In October 2023, Initia emerged from stealth with a <a href=\"https:\/\/www.theblock.co\/post\/256143\/layer-1-project-initia-emerges-from-stealth-with-a-pre-seed-investment-from-binance-labs\" data-v-f87c67ca=\"\">pre-seed investment from Binance Labs<\/a>, the venture capital and incubation arm of the crypto exchange Binance. The team, which is based in Singapore, did not disclose the investment amount from Binance Labs.","Initia’s goal is to make it easy for anyone to spin up a Layer 2 network with instant support for various Ethereum and Cosmos features and networks.","“From a high level view, it's to allow the product developer to solely worry about the product itself. If you're running your own appchain — and that is the thesis that you believe in — you shouldn't have to worry about all of these underlying features, like all the data piping. All of that stuff should be just fetched for you when you start,” said Liu.","“We want to provide the underlying infrastructure that unifies all these different types of applications in one specific ecosystem. That was the big vision we had when we were coming up with this whole initial platform,” he added.","The core idea is similar to <a href=\"https:\/\/www.theblock.co\/post\/274498\/dymension-ceo-says-mainnet-is-very-close-and-anticipates-rollapp-summer-like-ico-boom\" data-v-f87c67ca=\"\">Dymension<\/a>, which launched recently alongside a token airdrop. Initia’s developers said a key difference between the two is that Dymension uses sovereign rollups, while Initia uses optimistic rollups — with a framework that it built using the Cosmos software-development kit.&nbsp;","Initia’s framework has a shared infrastructure layer that supports various smart contract languages, including those from the Ethereum ecosystem. This enables the Layer 2 networks to have instant bridging and ability to use the IBC network — which connects chains in the Cosmos ecosystem — as well as access to oracles. It will use Celestia for data availability.","One novel aspect of chains designed to support Layer 2 networks from the get-go is that they can be built to incentivize activity on the networks. Initia is planning to do just that by allocating a large portion of its token supply to an incentive program.","Every month, there will be a vote on the Initia’s Layer 1 blockchain by stakers of the network’s upcoming governance token called INIT. Voters will be able to decide how the allocated tokens will be distributed between Layer 2 networks built on Initia. They will also be able to set key performance indicators, so that the networks only receive the tokens if they achieve certain targets. Developers of the networks will be able to take a slice of the tokens as a commission.","“In some sense it acts like a decentralized grants program for products that are being built on top of Initia, as well as providing additional marketing incentives for these Layer 2 teams to attract more users,” said Liu.","This program somewhat mirrors the Curve bribing system (called the vote-escrowed mechanism), where token holders lock up their tokens for a period of time and receive voting power. They are able to use this voting power to decide how CRV tokens are distributed between token pools.","Another core element of Initia is that it has what it calls enshrined liquidity. This provides native liquidity at the heart of the Initia network, making it easier for users to swap tokens when moving between Layer 2 networks.","“In this way, we are enshrining liquidity into the Layer 1 for major assets, and using those assets as an interchange router,” said Zon. “So if you're moving from USDC on one Layer 2 to ETH on another Layer 2, there's a huge hub of liquidity on the Layer 1 that gets swapped through as you're sending between them.”","This works by having token holders pair certain liquidity provider tokens with INIT tokens and staking them. At the same time, the INIT tokens that are staked in these pairs can also be used for voting in the incentive program.&nbsp;","On the Layer 1 network, anyone can pay transaction fees using any of the tokens that are used for the enshrined liquidity. On Layer 2 networks, transaction fees can be paid in any token.","Beyond this, the network also provides native .init usernames. These work across all Layer 2 networks built on Initia and provide a more user-friendly way for the token holders to send money to themselves and other users.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cobie","content":"PERSON"},{"type":"Stan Liu","content":"PERSON"},{"type":"DCF","content":"ORGANIZATION"},{"type":"Binance Labs","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"October 2023","content":"DATE"},{"type":"Nascent","content":"ORGANIZATION"},{"type":"Zaheer Ebtikar","content":"PERSON"},{"type":"Cosmos","content":"LOCATION"},{"type":"escrowed","content":"ORGANIZATION"},{"type":"Terra","content":"LOCATION"},{"type":"Liu","content":"PERSON"},{"type":"Zon","content":"PERSON"},{"type":"$7.5 million","content":"MONEY"},{"type":"Terra blockchain","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Initia","content":"ORGANIZATION"},{"type":"Dymension","content":"LOCATION"},{"type":"CRV","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Figment Capital","content":"ORGANIZATION"},{"type":"COO Nick White","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Terraform Labs","content":"ORGANIZATION"},{"type":"IBC","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Dymension","content":"ORGANIZATION"},{"type":"Delphi Ventures","content":"ORGANIZATION"},{"type":"Terra\/Luna","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Initia","content":"LOCATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"Terra Station","content":"ORGANIZATION"},{"type":"WSB Mod","content":"ORGANIZATION"}],"hashtag":["COSMOS","ETHEREUM"],"authors":["Tim Copeland","The Block"]}