{"summary":"The OSC has issued another consumer alert warning residents of unregistered crypto platforms, including Kucoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/165377\/ontario-securities-regulator-warns-against-kucoin-in-latest-alert","publishDate":"2022-08-23T17:59:53","id":7128,"type":null,"title":"Ontario securities regulator warns against Kucoin in latest alert","category":["REGULATION"],"content":["The Ontario Securities Commission (OSC) has issued another consumer alert calling out a swath of crypto firms, including Kucoin and its affiliates, for not being registered to deal in the Canadian province.","The OSC issued a similar <a href=\"https:\/\/www.theblock.co\/post\/161003\/ontario-regulator-includes-crypto-firms-in-latest-consumer-protection-alert\" data-v-f87c67ca=\"\">alert<\/a> earlier this month that also named Kucoin as an unregistered entity. Today's alert names 13 firms, many of them crypto businesses, as companies that are not registered to deal or advise in securities in Ontario. The list includes subsidiaries of Kucoin, which the commission took aim at earlier when it successfully barred the firm from operating in Ontario with a courtroom <a href=\"https:\/\/www.theblock.co\/linked\/153686\/ontario-regulator-fines-bybit-and-bars-kucoin-in-continued-fight-against-unregistered-crypto-exchanges\" data-v-f87c67ca=\"\">win<\/a> – one that also included a $1.6 million fine.&nbsp;","The Kucoin case came as part of a wider crypto crackdown following a 2021 decision from regulators to treat custodial exchanges as securities exchanges regardless of whether the assets traded were securities. Since then, the OSC has gone after unregistered platforms.","As Kucoin has weathered the storm, CEO Johnny Lyu sought to <a href=\"https:\/\/www.theblock.co\/post\/155608\/kucoin-ceo-dismisses-rumors-of-halting-withdrawals-reserves-right-to-legal-action\" data-v-f87c67ca=\"\">dispel<\/a> rumors that suggested the company might halt withdrawals.&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kucoin","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"OSC","content":"ORGANIZATION"},{"type":"Ontario","content":"LOCATION"},{"type":"$1.6 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Ontario Securities Commission (OSC","content":"ORGANIZATION"},{"type":"Johnny Lyu","content":"PERSON"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}