{"summary":"An attempt by OpenSea to solve a problem of NFTs selling at unexpectedly low prices has somehow led to more such sales.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131961\/opensea-is-trying-to-save-peoples-nfts-but-pesky-frontrunners-are-poaching-them","publishDate":"2022-01-27T08:15:30","id":7139,"type":null,"title":"OpenSea tries to save NFTs but pesky frontrunners are poaching them","category":["NFTS"],"content":["NFT marketplace OpenSea is trying to fix an issue that has led to the loss of multiple expensive NFTs, at rock bottom prices. Only one of its attempts to solve the problem has somehow made things worse.","The issue in question is that some NFTs are <a href=\"https:\/\/www.theblockcrypto.com\/post\/131443\/opensea-reimburses-users-sold-nfts-below-market-value-ui-issue\" data-v-f87c67ca=\"\">getting sold<\/a> at old offer prices that were made when the NFTs were much less valuable. A typical example is that someone offered a Bored Ape for only a few thousand dollars, but instead of cancelling the offer, they move it to a different wallet. This appears to cancel it on the OpenSea website. However, if they move the NFT back to that wallet, users are often unaware that the original offer is still valid. And if the NFT has gone up significantly in price, then the original offer could be an absolute bargain.","OpenSea is trying multiple ways to solve this problem, including by providing more information to users about the state of their NFTs and any offers on them. Today it has started sending out emails informing users that have such older listings that have not been cancelled. The email encouraged the user in question to cancel them.","Yet while this advice made sense, it has actually led to the loss of yet more NFTs.","On the Ethereum blockchain, there is a persistent issue of frontrunning. This is where someone watches transactions being broadcast to the network and identifies ones they would like to either frontrun (either by making a different trade beforehand or by copying what they see is a highly profitable trade and doing it first). In order to make sure their transaction is processed first, frontrunners will typically bribe Ethereum miners and pay them a portion of the proceeds.","In this case, when users went to cancel their NFT listings, it actually exposed that the old offer was still there — and these aren't always that easy to find. <a href=\"https:\/\/twitter.com\/dingalingts\/status\/1486654458201542657\" data-v-f87c67ca=\"\">According to<\/a> an NFT collector known as Dingaling, this happened to a user called Swolfchan. This user submitted a transaction to cancel their listing of a Mutant Ape for 6 ETH. But someone else saw this transaction and then used a frontrunning service, such as Flashbots, to <a href=\"https:\/\/etherscan.io\/tx\/0x5280eb4f1c6900d9c3d22e944f20744232cf9c9a93387524bde2738154ba2b56\" data-v-f87c67ca=\"\">buy the NFT<\/a> before the listing was cancelled. They acquired it for a roughly 70% discount to the collection's floor price.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">So Opensea basically just told everyone to go and cancel their old listings, but in turn actually got everyone to give the 'exploiters' the exact info needed to buy their NFTs at the original low price<\/span>,\" said Dingaling.&nbsp;","Dingaling added that users should transfer their NFTs out of addresses that have inactive listings before cancelling them, in order to avoid having them poached in this way.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Dingaling","content":"LOCATION"},{"type":"Ethereum blockchain","content":"PERSON"}],"hashtag":["MEV","OPENSEA"],"authors":["Tim Copeland","The Block"]}