{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley . They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/9942\/arms-dealer-turns-out-to-be-the-fbi-2","publishDate":"2019-02-01T13:00:11","id":7147,"type":null,"title":"Arms dealer turns out to be the FBI","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario [twitter:<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>] and Stephen Palley [twitter:<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>]. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","[As always, Rosario summaries are “NMR” and Palley summaries are “SDP”]","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]USA v. Faison, Case №4–19–70023 KAW (N.D. Cal. Jan. 22, 2019) [NMR]<\/strong><\/em>","<a href=\"https:\/\/scholar.google.com\/scholar_case?case=15182321090304758761\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Link to motion and order<\/a>","Did you know that bitcoin utilizes a public ledger that keeps track of all transactions? In fact, almost every single cryptocurrency known to man uses some sort of public ledger that allows for the tracking of all the transactions on the network. So, you might guess that law enforcement likes bitcoin, and you would be right.","This case involves some pretty troubling allegations. The defendant is accused of attempting to purchase a toxic chemical to use as a chemical weapon in a purported scheme to kill his spouse. This is, of course, terrible if true, but what does this have to do with bitcoin? Well, not much, but it is indicative of a trend.","Allegedly on Dec. 8, 2018, the defendant accessed a website on the Dark Web, and reached out to a person who had posted an advertisement for the toxic chemical. That person who posted the ad was an Online Covert Employee (OCE) of the FBI. Yep, there are some FBI employees who are Always Online just like the rest of us. Over the course of the next month there were multiple messages between the two concerning the purchase and delivery of the toxic chemical.","Allegedly, on Dec. 15, 2018, the defendant sent some bitcoin to the OCE as payment for the toxic chemical. Prior to this time the defendant had problems setting up payment allegedly saying in a message “I’ve been frustrated from having to pool alt-coins into BTC (and do so anonymously), but will resume funding my DM wallet this week. W[i]ll then order ASAP!” Apparently, the price was also allegedly an issue for the defendant “I got the BTC but then-of course-the value of BTC went down. Gonna wait it out some to avoid having to lose more in transfer fees.”","Ultimately, FBI agents delivered the chemical, and using an electronic tracking device in the package executed a search warrant of the defendant’s home when the tracking device indicated the package had been opened. It looks as if the FBI has lots of incriminating evidence, so the bitcoin involved is somewhat of an afterthought. What is definitely not an afterthought is the fact that the website is known to the authorities and bitcoin is commonly used to purchase things on it, so the traceability of bitcoin is very likely to play a role in future investigations.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dec. 15, 2018","content":"DATE"},{"type":"Jan. 22, 2019","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"v. Faison","content":"PERSON"},{"type":"OCE","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Nelson Rosario [","content":"PERSON"},{"type":"FBI","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"N.D. Cal","content":"LOCATION"},{"type":"Dec. 8, 2018","content":"DATE"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"}],"hashtag":[],"authors":["Contributor Network","The Block"]}