{"summary":"Elon Musk finally got what he wanted: Twitter. What does this mean for Crypto Twitter?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/143461\/heres-how-elon-musk-could-change-crypto-twitter","publishDate":"2022-04-25T18:15:34","id":7149,"type":null,"title":"Here&#x27;s how Elon Musk could change &#x27;Crypto Twitter&#x27;","category":["PEOPLE"],"content":["On Monday, Elon Musk <a href=\"https:\/\/www.theblockcrypto.com\/post\/143257\/twitter-accepts-elon-musks-44-billion-takeover-offer\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">finally got what he wanted<\/a>: Twitter.","The $44 billion-odd deal, the rumblings of which began late this weekend, closed the book on the theatrical swirl around the billionaire entrepreneur's efforts to acquire the social media site he uses so assiduously. The deal will see Musk, who already runs the electric automaker Tesla and private space contractor SpaceX, take the reins at Twitter, which was founded in 2006. Musk became a user in mid-2009.","Since Musk unveiled his takeover bid, a fair share of digital ink has been splashed on the question of what impact such a deal would entail. But what about the impact on the social media site’s crypto ecosystem? What changes may come to “Crypto Twitter” now that Musk is in charge?","In a press release, Musk offered a few clues:","\"I also want to make Twitter better than ever by enhancing the product with new features, making the algorithms open source to increase trust, defeating the spam bots, and authenticating all humans. Twitter has tremendous potential – I look forward to working with the company and the community of users to unlock it.\"","Earlier this month, Musk discussed his potential approach during a TED talk stage appearance. It was during that discussion that Musk highlighted what is likely to be his most visible impact with respect to Crypto Twitter: the bots.","If you spend any time in crypto Twitter, you’d have to be using the site incorrectly to not notice the near-constant deluge of spam bot replies attempting to point you in the direction of the latest Twitter-based crypto scam. Musk himself has been a prominent target of numerous impersonation attempts, a history that has no doubt informed his position on the matter.","“Frankly, a top priority I would have is eliminating the spam and scam bots and the bot armies that are on Twitter,” Musk said. “They make the product much worse. If I had a dogecoin for every crypto scam I saw, I would have a hundred billion dogecoin.\"","Unclear, however, is what Musk will do differently than what Twitter is doing today to combat the situation. But it’s undeniable that the scam bot campaigns are having <a href=\"https:\/\/www.theblockcrypto.com\/post\/142403\/latest-twitter-scam-aims-to-capitalize-on-moonbirds-success-and-snares-bernie-sanders-sons-verified-account\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a real economic impact<\/a> on their targets, and Musk would be under pressure to affect change now that he’s in charge.","Musk is not alone among the critics of Twitter’s content moderation approach — in fact, many Crypto Twitter personalities share his views. As the site’s new owner, he's now in a position to change the company’s direction on this issue.","But it's a complicated problem. Musk is very likely not going to toss the whole system in the trash and create digital Wild West, given possible opposition by Twitter's board and the larger risk of allowing violent and sexually exploitative content to spread unfettered.","If he follows through on his pledge to open-source the site’s algorithms, that will provide a wealth of information about how Twitter governs the site. The public response to that may shape whatever actions Musk takes with respect to moderation approaches.","Musk’s influence will likely be most tangibly felt in what is known as the “gray area,” referring to posts on cultural, political and sociological fault lines where the responsibility for drawing the line between genuine discourse and outright malice falls on the site’s content moderators. For instance, it's possible that Musk could push to relax the ways in which an account might be suspended or banned.&nbsp;","It is here where the ideological battle of Twitter is most acutely seen, where trigger-happy fingers hit “report” and the accusations that the site’s moderators are prioritizing one faction over another are loudest.","It is also here where many crypto enthusiasts side with Musk, and they may be more likely to increase their use of the platform. Those that disagree with Musk, on the other hand, may leave Crypto Twitter and shift more of their focus to platforms like Discord, or they could invest more time and resources into decentralized <a href=\"https:\/\/prestonbyrne.com\/2022\/04\/24\/build_detwitter\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">alternatives<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"SpaceX","content":"ORGANIZATION"},{"type":"$44 billion","content":"MONEY"},{"type":"Twitter","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"2006","content":"DATE"},{"type":"Musk","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"weekend","content":"DATE"},{"type":"Crypto Twitter","content":"PERSON"},{"type":"Tesla","content":"PERSON"}],"hashtag":["ELON MUSK","TWITTER"],"authors":["Michael McSweeney","The Block"]}