{"summary":"Messari founder Ryan Selkis said his Twitter account was reinstated after it had been &quot;permanently suspended&quot; in error.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200043\/messari-founder-ryan-selkis-says-twitter-account-reinstated-after-unfortunate-error","publishDate":"2023-01-08T16:51:44","id":7151,"type":null,"title":"Messari founder Ryan Selkis says Twitter account reinstated after &#x27;unfortunate error&#x27;","category":["COMPANIES"],"content":["Messari founder Ryan Selkis said his Twitter account was reinstated after it had been \"permanently suspended\" in error.","\"Looks like it’s working again,\" he <a href=\"https:\/\/twitter.com\/twobitidiot\/status\/1612160596950061056\" data-v-f87c67ca=\"\">said<\/a> on Sunday, attributing the suspension to a \"simple \/ unfortunate error.\" \"Good to be back to this hell on earth app I call home.\"","On a secondary <a href=\"https:\/\/twitter.com\/RyanSelkis\/status\/1612070236416774146\" data-v-f87c67ca=\"\">account<\/a>, Selkis said the suspension had been initially instated for allegedly impersonating himself.","Selkis, who has around 300,000 followers on his primary Twitter account, said he was \"rooting\" for the company and owner Elon Musk to \"get through this stress test and win long term,\" but he also called for new investment into decentralized competitors.","\"I just also think we need to invest in decentralized social media where users own their IP (content and social graphs),\" he wrote. \"It’s one of the most important tech needs of the decade.\"","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Selkis","content":"PERSON"},{"type":"Elon Musk","content":"LOCATION"},{"type":"Ryan Selkis","content":"PERSON"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}