{"summary":"Stablecoin issuer Circle is discontinuing its support for consumer accounts, requiring users to make alternative arrangements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260200\/circle-stablecoin-individual-accounts","publishDate":"2023-10-31T11:38:50","id":7153,"type":null,"title":"Circle will no longer support stablecoin minting for individual consumer accounts","category":["STABLECOINS"],"content":["Stablecoin issuer Circle is <a href=\"https:\/\/help.circle.com\/s\/article-page?articleId=ka08b000000R3nbAAC\" data-v-f87c67ca=\"\">discontinuing support<\/a> for consumer Circle Mint accounts.","\"Circle is phasing out support for legacy consumer accounts and has notified individual consumers of this decision,\" a company spokesperson told The Block. \"Account closures do not apply to business or institutional Circle Mint accounts.\"","Circle on Tuesday sent out an email about the end of support to consumer accounts with zero balances, which will be closed on Nov. 30.","The move means that users who wish to mint Circle stablecoins like USDC and EURC will need to turn to other platforms.","\"Lots of noise about @circle limiting individuals from using Circle Mint. There is nothing new here. We haven't allowed individuals to open Circle accounts in years, and have been institution only for years as well,\" Circle CEO Jeremy Allaire wrote in a <a href=\"https:\/\/twitter.com\/jerallaire\/status\/1719428016869142933?s=20\" data-v-f87c67ca=\"\">post on X<\/a>. \" We have tremendous retail partners all around the world, including our strategic partner @coinbase who offers excellent retail access to USDC without fees and always 1:1.\"","\"The only change is that for a few thousand individual user accounts that were still open with us, we are no longer going to support those accounts,\" he added. \"Please ignore the FUD, conspiracy theories, etc.\"","Circle rival Tether still supports individual consumer accounts, but with a minimum limit of $100,000.","\"Tether allows both individuals and corporate customers to participate in its primary market for issuances and redemptions,\" <a href=\"https:\/\/www.theblock.co\/post\/256298\/tether-paolo-ardoino-new-ceo\" data-v-f87c67ca=\"\">Tether CEO Paolo Ardoino<\/a> told The Block. \"Tether maintains a minimum limit of 100k USD for issuances and redemptions allowing Tether compliance team to focus on professional participants, enforcing a deeper due diligence on KYC\/AML compared to its competitors.\"","Tether remains the largest stablecoin issuer in the market, with a total supply of around $91 billion for its USDT token, while Circle follows with a total supply of about $27 billion for <a href=\"https:\/\/www.theblock.co\/learn\/251863\/what-is-usdc-and-how-does-it-work-a-guide-to-circles-stablecoin\" data-v-f87c67ca=\"\">USDC<\/a>, according to <a href=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\/total-stablecoin-supply\" data-v-f87c67ca=\"\">The Block's Data Dashboard.<\/a>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","(<em data-v-f87c67ca=\"\">Updates with comment from Circle CEO.<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Allaire","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$91 billion","content":"MONEY"},{"type":"$100,000","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Nov. 30","content":"DATE"},{"type":"EURC","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"$27 billion","content":"MONEY"},{"type":"Paolo Ardoino","content":"PERSON"}],"hashtag":["TETHER","USDC"],"authors":["Yogita Khatri","The Block"]}