{"summary":"The New York Assembly just passed a controversial moratorium on certain kinds of crypto mining. Here&#x27;s what could happen next.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/144427\/what-is-next-for-new-yorks-crypto-mining-moratorium-bill","publishDate":"2022-04-29T17:09:27","id":7156,"type":null,"title":"What is next for New York’s crypto mining moratorium bill?","category":["MINING"],"content":["<span data-v-f87c67ca=\"\">Earlier this week, the <\/span><span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblockcrypto.com\/post\/143658\/new-york-assembly-passes-two-year-crypto-mining-moratorium-bill\" data-v-f87c67ca=\"\">New York Assembly voted yes<\/a> on a controversial bill that would place a two-year moratorium on certain types of crypto mining operations that use electricity generated by \"carbon-based fuel.\"<\/span>","<span data-v-f87c67ca=\"\">The debate over the bill has attracted a fair amount of attention from cryptocurrency advocates opposed to the policy. But in order for it to become law — at least during this legislative session — a version of it has to pass in the state Senate before the session ends on June 2.<\/span>","<span data-v-f87c67ca=\"\">At the moment, moving it through the Senate does not appear to be on the agenda. But that could still change.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Senate version is currently in the Environmental Conservation Committee, which is meeting next Tuesday. And according to the <a href=\"https:\/\/www.nysenate.gov\/calendar\/meetings\/environmental-conservation\/may-03-2022\/environmental-conservation-meeting\" data-v-f87c67ca=\"\">agenda posted online Thursday<\/a>, the moratorium bill will not be heard. As of publication time, the committee has not scheduled any additional meetings before the end of the legislative session.<\/span>","<span data-v-f87c67ca=\"\">It's still possible for the bill to make it to the floor if the Democratic majority leadership decides to move it. <\/span><span data-v-f87c67ca=\"\">The open question now is whether or not there is enough support among New York State senators to put the bill to a vote before the session adjourns.<\/span>","<span data-v-f87c67ca=\"\">“That discussion among the conference of majority Senators has not yet taken place,” Democratic Senator Todd Kaminsky, the Chair of the Environmental Conservation Committee, told The Block. “And I expect there to be a real robust discussion.”<\/span>","<span data-v-f87c67ca=\"\">The bill has not been debated in committee or by the Senate majority, according to Kaminsky, so its future is largely unknown.<\/span>","The bill specifically calls for a moratorium on new permits for proof-of-work mining operations that use behind-the-meter electricity generated by fossil fuel, allowing the state time to act on a comprehensive impact study. <span data-v-f87c67ca=\"\">The Assembly passed it with a tally of 95 in favor and 52.<\/span>","But it has been drawn criticism from cryptocurrency advocates who have cast it as an anti-crypto ban. <span data-v-f87c67ca=\"\">Assemblywoman Anna Kelles — a democrat and the main sponsor of the bill — has repeatedly insisted that it was not a ban and would only apply to a select number of fossil-fuel power plants.<\/span>","<span data-v-f87c67ca=\"\">Other Assembly members were concerned that it would send the wrong signal to the financial services sector in New York and drive miners away from the state. An earlier version of the bill, which called for a three-year moratorium on a broader scope of mining facilities, died in the Assembly in June of last year.<\/span>","<span data-v-f87c67ca=\"\">Senator Kaminsky said he’s worried that even this scaled-back version could make New York look like “an anti-crypto state.”<\/span>","<span data-v-f87c67ca=\"\">“I think that it's important that crypto as a nascent but powerful industry be nurtured in New York,” he said. “We want to find a way to get them to stay in New York and be green.”<\/span>","<span data-v-f87c67ca=\"\">Kaminsky argued that while there are “bad actors” in the industry, that only represents a “very small” amount of the state’s energy usage.<\/span>","<span data-v-f87c67ca=\"\">Parallel to the moratorium bill, there is another bill making its way through the legislature, sponsored by the same lawmakers, which calls only for a study on crypto mining with renewable energy. It is currently on the Senate’s floor calendar and in committee in the Assembly.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I think if there is a bill that could help green the industry without hurting the industry and driving it out of New York it would be something I'd be very interested in looking at,” Kaminsky said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2","content":"DATE"},{"type":"New York Assembly","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"June of last year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Anna Kelles","content":"PERSON"},{"type":"New York State","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Todd Kaminsky","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Kaminsky","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"},{"type":"Environmental Conservation Committee","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}