{"summary":"BNB Greenfield is a decentralized data storage network touting cross-chain programmability and data access controls.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/257926\/bnb-chain-launches-greenfield-mainnet-for-decentralized-data-storage","publishDate":"2023-10-17T10:57:02","id":7160,"type":null,"title":"BNB Chain launches Greenfield mainnet for decentralized data storage","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\"><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248351\/bnb-bnb-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bnb-icon2_2x.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BNB<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.77%\n    <\/span><\/a> <!----><\/span> Chain has rolled out the Greenfield storage network on the public mainnet after being in development and testing phase for over a year.<\/span>","Greenfield is a decentralized storage-oriented network tailored to accommodate data-heavy decentralized applications within the BNB ecosystem. The network seeks to provide programmable storage options that interface with smart contracts on the <a href=\"https:\/\/www.theblock.co\/learn\/249523\/what-is-bnb-chain-and-how-does-it-work-a-beginners-guide-to-bnb-cryptocurrency\" data-v-f87c67ca=\"\">BNB Smart Chain<\/a>.","It touts cross-chain programmability, fast bandwidth speeds and data access permissions. Another offshoot of BNB Greenfield is the ability to create a data marketplace where users can list, trade or sell their data.&nbsp;","The network facilitated over 200,000 on-chain transactions involving 150,000 unique wallet addresses during its testing phase, according to a statement.&nbsp;","\"BNB Greenfield is a transformative development in web3 data ownership and data economy, as it provides users with a decentralized alternative to conventional Cloud services. Distinct from centralized offerings, BNB Greenfield empowers users with control over their data, mitigating the risk of breaches and data loss,\" said BNB Chain senior solution architect Arnaud Bauer in a statement.","Greenfield is one of multiple networks within the BNB ecosystem, alongside others such as BNB Beacon Chain, BNB Smart Chain, opBNB and zkBNB.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BNB","content":"ORGANIZATION"},{"type":"BNB Greenfield","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Greenfield","content":"LOCATION"},{"type":"-0.77%","content":"PERCENT"},{"type":"BNB Smart Chain","content":"ORGANIZATION"},{"type":"Arnaud Bauer","content":"PERSON"}],"hashtag":["BNB CHAIN"],"authors":["MK Manoylov","The Block"]}