{"summary":"Genesis&#x27; payment to the SEC will only follow the payment of all allowed claims by the bankruptcy court, including retail investors from Gemini Earn.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283400\/genesis-penalty-bankruptcy-claims","publishDate":"2024-03-19T09:18:38","id":7172,"type":null,"title":"Genesis agrees to $21 million penalty, with bankruptcy claims to be paid first","category":["REGULATION"],"content":["Genesis Global Capital agreed to pay a $21 million civil penalty as part of a settlement over charges it engaged in the unregistered offer and sale of securities through Gemini Earn.","A permanent injunction has been imposed, according to <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2024-37\" data-v-f87c67ca=\"\">a press release<\/a> from the United States Securities and Exchange Commission.","Payment to the SEC will only follow the payment of all allowed claims by the bankruptcy court. As noted by the agency, this includes retail investors from Gemini Earn.&nbsp;","“We charged Genesis with failing to register its retail crypto lending product before offering it to the public, bypassing essential disclosure requirements designed to protect investors,” SEC Chair Gary Gensler stated. “Today’s settlement builds on previous actions to make clear to the marketplace and the investing public that crypto lending platforms and other intermediaries need to comply with our time-tested securities laws.\"","\"Doing so best protects investors,\" he added. \"It promotes trust in markets. It’s not optional. It’s the law.”","The SEC's Division of Enforcement director, Gurbir S. Grewal, also weighed in, saying, “The collapse of the Gemini Earn program underscores the unknown risks that investors are exposed to when market participants fail to comply with the federal securities laws.\"","\"As this enforcement action makes clear, no amount of hype and advertising can substitute for the investor-protection disclosures required by the federal securities laws,\" they added.","The SEC charged Genesis and Gemini Trust Company on January 12, 2023. Central to the complaint was the Gemini Earn program, which allowed retail investors to loan their crypto assets to Genesis in exchange for the company's promise to pay interest earned on the loaned assets.","Gemini Earn investors <a href=\"https:\/\/www.theblock.co\/post\/192401\/gemini-committee-creditors-earn\" data-v-f87c67ca=\"\">could not withdraw their crypto assets<\/a> as of November 2022 due to a lack of liquidity from Genesis — which <a href=\"https:\/\/www.theblock.co\/post\/190311\/digital-currency-groups-genesis-global-files-for-bankruptcy-protection\" data-v-f87c67ca=\"\">filed for voluntary Chapter 11<\/a> in the U.S. Bankruptcy Court for the Southern District of New York on January 19, 2023.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"United States Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$21 million","content":"MONEY"},{"type":"Gemini Earn","content":"ORGANIZATION"},{"type":"Gemini Earn","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gurbir S. Grewal","content":"PERSON"},{"type":"January 19, 2023","content":"DATE"},{"type":"January 12, 2023","content":"DATE"},{"type":"Genesis Global Capital","content":"ORGANIZATION"},{"type":"Gemini Trust Company","content":"ORGANIZATION"},{"type":"November 2022","content":"DATE"},{"type":"Division of Enforcement","content":"ORGANIZATION"}],"hashtag":["INVESTMENT FIRMS"],"authors":["Adam James","The Block"]}