{"summary":"Ethereum core developer Artem Vorotnikov says development work on the Akula client will stop in the wake of a Paradigm competitor.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189716\/ethereum-node-project-akula-shuts-down-in-wake-of-paradigm-competitor","publishDate":"2022-11-24T08:08:05","id":7177,"type":null,"title":"Ethereum node project Akula shuts down in wake of Paradigm competitor","category":["CRYPTO ECOSYSTEMS"],"content":["The developers behind Akula, an Ethereum client implementation, have decided to scrap the project because they cannot compete with a newly announced rival project called Reth that has similar features and is run by crypto VC firm Paradigm.","Akula is a high-performance Ethereum client written in Rust. Ethereum clients are software applications that allow nodes to read blocks on the network and interact with smart contracts. Ethereum core developer Artem Vorotnikov began building the project as an open-source client implementation in 2021 with a small team of developers.","Only this development work is now at an end, according to an <a href=\"https:\/\/erigon.substack.com\/p\/winding-down-support-for-akula-project\" data-v-f87c67ca=\"\">announcement<\/a> issued on Wednesday. The developers will no longer maintain or run the project, but the code remains available because it's open source. The announcement cited the emergence of an identical node client by a team with access to better funding but did not name the project.","“Sadly, we cannot outcompete multibillion VCs who copy-paste our architecture and code,” <a href=\"https:\/\/twitter.com\/vorot93\/status\/1595480997117706241\" data-v-f87c67ca=\"\">said<\/a> Vorotnikov in a tweet on Wednesday.","This rival project is Reth, a Rust-based Ethereum client run by the <a href=\"https:\/\/www.theblock.co\/post\/176512\/paradigm-leads-blockchain-indexer-nxyzs-40-million-raise\" data-v-f87c67ca=\"\">crypto VC outfit Paradigm<\/a>, according to a comment from Vorotnikov via Twitter DM. Vorotnikov <a href=\"https:\/\/twitter.com\/vorot93\/status\/1595552048962994179\" data-v-f87c67ca=\"\">shared<\/a> screenshots showing Paradigm’s CTO Georgios Konstantopoulos asking highly detailed questions about Akula. At the time, Vorotnikov asked what Paradigm was building, assuming it would be built on Akala, but received no response.","After that conversation, the developers of Akula heard that Paradigm was indeed working on its own project. In response, they decided to discontinue work on Akula because they figured the competitor would quickly match and surpass it. “We do not see how Akula will be able to attract future funding from grants (and this is how it is funded now), and consequently, it does not make sense to spend our scarce resources on it,” the announcement stated.","Vorotnikov added that he will take a step back from Ethereum development for the foreseeable future. He had also been contributing to Erigon, an Ethereum client written in Go.","Following Akula's statement, Konstantopoulos announced Reth and provided some core details about it. He claimed Reth is not a copy or a rewrite of any other client implementation, adding, “Reth does not include code from any existing client but stands on the shoulders of giants including Geth, Erigon and Akula.”","<em data-v-f87c67ca=\"\">Update: This article has been updated with a comment from Vorotnikov confirming that he was referring to Reth.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Artem Vorotnikov","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Erigon","content":"LOCATION"},{"type":"Erigon","content":"ORGANIZATION"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"Georgios Konstantopoulos","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Reth","content":"ORGANIZATION"},{"type":"Vorotnikov","content":"PERSON"},{"type":"Konstantopoulos","content":"PERSON"},{"type":"Vorotnikov","content":"ORGANIZATION"}],"hashtag":["DEVELOPER TOOLS","ETHEREUM"],"authors":["Osato Avan-Nomayo","The Block"]}