{"summary":"Ripple Labs won a partial victory in court on Thursday as a federal judge ruled that some of its sales of the XRP token, which were challenged as securities violations by the Securities and Exchange Commission, did not fully meet the definition of a securities offering. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239559\/sec-faces-wake-up-call-after-ripple-ruling-though-appeal-likely","publishDate":"2023-07-13T18:30:57","id":7179,"type":null,"title":"SEC faces &#x27;wake up call&#x27; after Ripple ruling, though appeal likely","category":["POLICY"],"content":["Ripple Labs won a <a href=\"https:\/\/www.theblock.co\/post\/235926\/sec-lawsuit-over-whether-xrp-is-a-security-will-go-to-trial\" data-v-f87c67ca=\"\">partial victory<\/a> in court on Thursday as a federal judge ruled that some of its sales of the XRP token, which were challenged as securities violations by the Securities and Exchange Commission, did not fully meet the definition of a securities offering.&nbsp;","The decision, which <a href=\"https:\/\/www.theblock.co\/post\/239537\/sec-leaves-door-open-for-appeal-in-ripple-case\" data-v-f87c67ca=\"\">the SEC said it is still reviewing for possible appeal<\/a>, does not fully exonerate Ripple or its lead executives from possible civil consequences. Judge Analisa Torres of the Southern District of New York ordered a trial by jury for Ripple CEO Brad Garlinghouse and Executive Chairman Chris Larsen over whether they are liable in illegal securities sales to institutional investors who bought hundreds of millions of dollars worth of XRP.&nbsp;","But the crypto industry at large celebrated the partial win for Ripple, framing it as a development that showed cracks in the SEC's armor. The agency has an undefeated track record in enforcement cases brought against crypto firms dating back to the initial coin offering bubble of 2017.&nbsp;","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">\"Looking forward to getting a refund on my Acela tickets now that I no longer need to come in and talk to the <\/span><span class=\"r-18u37iz\" data-v-f87c67ca=\"\"><a class=\"css-4rbku5 css-18t94o4 css-901oao css-16my406 r-1cvl2hr r-1loqt21 r-poiln3 r-bcqeeo r-qvutc0\" dir=\"ltr\" role=\"link\" href=\"https:\/\/twitter.com\/SECGov\" data-v-f87c67ca=\"\">@SECGov<\/a><\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">. Lmfao,\" Gemini co-founder Cameron Winklevoss&nbsp;<\/span><a href=\"https:\/\/twitter.com\/cameron\/status\/1679553974595092480?s=20\" data-v-f87c67ca=\"\">tweeted<\/a> in reaction to the ruling.","In a statement, an SEC spokesperson lauded parts of the judgment that found sales of XRP to be, \"investment contracts in violation of the securities laws in certain circumstances,\" and noted that the court rejected Ripple's preferred definition of a security test for investment contracts.&nbsp;&nbsp;","The full impact of what Thursday's ruling means will continue to play out over months, as experts agree that appeals by both Ripple and the SEC appear likely.&nbsp;","Torres ruled that Ripple's \"blind bid\" sales, in which the company used an algorithm to sell XRP on trading platforms to bidders whose identity it didn't know, was not a securities offering because buyers \"could not have known if their payments of money went to Ripple, or any other seller of XRP.\"&nbsp;","The federal judge noted that these so-called programmatic sales represented less than one percent of global XRP transactions since 2017. Torres seemed to indicate that purchases of XRP in transactions where the buyer either didn't know that Ripple was the seller, as in the programmatic sales, or on the secondary market would not qualify as de facto investments in the company, which would qualify as illicit securities sales.","\"Therefore, the vast majority of individuals who purchased XRP from digital asset exchanges did not invest money in Ripple at all,\" Torres wrote.","She contrasted this with Ripple's sales to institutional buyers, who did know who they bought XRP from, and could reasonably expect to earn a profit from investing in a common enterprise, a hallmark of securities law.&nbsp;","Still, it's not clear whether Torres intended her ruling on blind bid sales to be a broad green light for secondary market sales. In her ruling, the judge wrote that the \"totality of circumstances\" around the transaction would determine whether a secondary sale is an illegal securities offering or not.","Though ruling did not take the company and its lead executives off the hook for potential enforcement repercussions, legal experts saw the programmatic buyer part of Torres's ruling as a win for both Ripple and the broader crypto industry.&nbsp;","<span data-v-f87c67ca=\"\">“The logical conclusion is that secondary sales of XRP are not securities transactions,” said Stephen Palley, partner and co-chair of the digital commerce group at the law firm Brown Rudnick.<\/span>","That could have major implications for the secondary market for digital assets, where most crypto transactions take place. It <span data-v-f87c67ca=\"\">could also bolster industry arguments in other proceedings, like the SEC's case against Coinbase over several of the digital assets the company listed for public trading. <\/span>","<span data-v-f87c67ca=\"\">“This is a major victory for the industry and a major loss for the SEC because in fact by holding that the programmatic sales are not investment contracts, she is holding that secondary market transactions in crypto assets are not securities,” said Gary DeWaal, <\/span><span data-v-f87c67ca=\"\">senior counsel at law firm Katten.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Teresa Goody Guillén, a partner at law firm BakerHostetler, agreed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“So far digital asset issuers have not battled in court this far and obtained a ruling that in some circumstances the transaction involving a digital asset is not a security and so I think you’ll see implications for this in the Coinbase and Binance cases,” she said.&nbsp;<\/span><span data-v-f87c67ca=\"\">“The blind bid seemed to be a big part of her reasoning here that if the buyer and the seller don’t know who each other are then, in these circumstances, there wasn’t an investment contract.” <\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But the order though is not binding and even judges within the same district court could disagree, Goody <\/span><span data-v-f87c67ca=\"\">Guillén added. <\/span><span data-v-f87c67ca=\"\">The judge’s ruling, too, can still be appealed to the Second Circuit Court of Appeals, which multiple experts predict will happen, possibly before a trial to determine whether Garlinghouse and Larsen might be liable in civil court for unlawful securities sales.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I suspect that both the SEC and Ripple are looking at their options there,” said Palley.&nbsp;<\/span><span data-v-f87c67ca=\"\">“If I’m Ripple I’m looking at the ruling on institutional sales and thinking maybe I want to take that up too.”&nbsp;<\/span>","In a note analyzing the ruling, TD Cowen Managing Director Jaret Seiberg called the ruling a \"wake-up call to the SEC that its legal authority may not be as clear as it believed.\"&nbsp;","But he also noted that \"appeals courts often overrule trial court judges\" and that experts at the investment bank \"do not see it as a given that the appeals court will uphold the district court's decision or reasoning.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gemini","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Brown Rudnick","content":"ORGANIZATION"},{"type":"Second Circuit Court of Appeals","content":"ORGANIZATION"},{"type":"Gary DeWaal","content":"PERSON"},{"type":"Katten","content":"PERSON"},{"type":"Brad Garlinghouse","content":"PERSON"},{"type":"Larsen","content":"PERSON"},{"type":"TD Cowen Managing","content":"ORGANIZATION"},{"type":"one percent","content":"PERCENT"},{"type":"millions of dollars","content":"MONEY"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Chris Larsen","content":"PERSON"},{"type":"Teresa Goody Guillén","content":"PERSON"},{"type":"Goody <\/span><span data-v-f87c67ca=\"\">Guillén","content":"ORGANIZATION"},{"type":"Garlinghouse","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Analisa Torres","content":"PERSON"},{"type":"Cameron Winklevoss","content":"PERSON"},{"type":"Palley","content":"PERSON"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"Jaret Seiberg","content":"PERSON"}],"hashtag":["SEC"],"authors":["Colin Wilhelm","Sarah Wynn","The Block"]}