{"summary":"Some features are live, while users wishing to try the new browser extension must join a waitlist to gain access to it in four to six weeks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279176\/uniswap-reveals-wallet-browser-extension-and-other-tools-for-easier-cryptocurrency-transactions","publishDate":"2024-02-27T11:27:52","id":718,"type":null,"title":"Uniswap reveals wallet browser extension and other tools for easier cryptocurrency transactions","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Uniswap <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248366\/uniswap-uni-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/uni.jpg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">UNI<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -12.49%\n    <\/span><\/a> <!----><\/span><\/span> is launching three tools to facilitate easier cryptocurrency transfers.&nbsp;<\/span>","The first is Uniswap Extension, a wallet extension inside a browser sidebar that streamlines swapping digital assets, signing transactions and trading crypto online. The other tools are Limit Orders, which automatically execute's a user's transaction when a token reaches a certain price, and Data &amp; Insight pages displaying charts, pool data, transaction logs and other pertinent information for traders.&nbsp;","Limit Orders and Data &amp; Insight pages launch today. Users must join the Uniswap Extension waitlist by claiming a uni.eth username and expect access to the tool in four to six weeks, according to a company spokesperson.&nbsp;","\"For a long time, we've wanted to build Uniswap into a complete home for swapping. We think these new features are a powerful articulation of what it means to deliver on meeting users where they are,\" said Callil Capuozzo, Vice President of Design at Uniswap Labs. \"We're especially excited to join the world of extensions. Our extension is designed for the swapper in a way that others aren't, and as we build out this platform we expect people will be able to move seamlessly from the web to extension to mobile app and see what they already know and love across all three.\"","The move comes after Uniswap Foundation <a href=\"https:\/\/www.theblock.co\/post\/278840\/uniswap-foundation-proposal-suggests-turning-on-rewards-for-uni-token-holders\" data-v-f87c67ca=\"\">proposed<\/a> changes to its fee structure to reward UNI stakers and delegators, The Block previously reported. Launched on Feb. 23, <a href=\"https:\/\/www.theblock.co\/post\/278771\/uniswap-subdomains-ens\" data-v-f87c67ca=\"\">uni.eth<\/a> usernames make Ethereum addresses readable to humans.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Uniswap Foundation","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Uniswap Labs","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Data &amp; Insight","content":"ORGANIZATION"},{"type":"-12.49%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Feb. 23","content":"DATE"},{"type":"Uniswap Extension","content":"ORGANIZATION"},{"type":"Callil Capuozzo","content":"PERSON"}],"hashtag":["UNISWAP"],"authors":["MK Manoylov","The Block"]}