{"summary":"Up more than 350% over the last year Coinbase surpassed its direct-listing price for the first time in over two years.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281460\/coinbase-shares-top-250-direct-listing-price-for-the-first-time-in-over-two-years","publishDate":"2024-03-08T15:42:24","id":7180,"type":null,"title":"Coinbase shares top $250 direct listing price for the first time in over two years","category":["EQUITIES"],"content":["Coinbase shares entered nearly forgotten territory Friday as the stock price exceeded the company's initial direct-listing price of $250.","It has been more than two years since the exchange's stock traded this high.","Coinbase's prospects have improved along with the crypto market's. In the past year, as the prices of cryptocurrencies, especially bitcoin, increased, so has the U.S.-based exchange's share price. Coinbase's shares are now up more than 350% when compared to one year ago when it was trading at $53.44, according to Yahoo Finance.","At one point on Friday, Coinbase traded as high as $269.65, also according to Yahoo Finance.","While bitcoin's rising price is likely the main reason for Coinbase's shares gaining in value, the company also stands to benefit from serving as custodian for the majority of the U.S. spot bitcoin ETFs currently trading. The recently launched products <a href=\"https:\/\/www.theblock.co\/post\/281381\/spot-bitcoin-etf-cumulative-trading-volume-crosses-100-billion\" data-v-f87c67ca=\"\">have generated<\/a> more than $100 billion in trading volume.","Coinbase still has a ways to go before it nears a new all-time high. The company's shares were at their highest when they hit $342.98 in November 2021, according to Yahoo Finance.&nbsp;&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Yahoo Finance","content":"ORGANIZATION"},{"type":"350%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$269.65","content":"MONEY"},{"type":"$100 billion","content":"MONEY"},{"type":"$53.44","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"November 2021","content":"DATE"},{"type":"$250","content":"MONEY"},{"type":"$342.98","content":"MONEY"}],"hashtag":["COINBASE"],"authors":["RT Watson","The Block"]}