{"summary":"3Commas and FTX found that API keys linked to the former were used to conduct unauthorized trades for DMG trading pairs on the latter.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179237\/ftx-api-keys-3commas-exploited","publishDate":"2022-10-23T05:06:27","id":7182,"type":null,"title":"FTX API keys connected to 3Commas confirmed to have been exploited","category":["HACKS"],"content":["An investigation conducted by trading-bot platform 3Commas and cryptocurrency exchange FTX revealed that API keys linked to the former were used to conduct unauthorized trades for DMG trading pairs on the latter.","The 3Commas team was alerted to the incident on Oct. 20, when various FTX API keys connected to the platform were used to perform unauthorized trades.","The API keys were not taken from 3Commas and were probably obtained from a third-party phishing attack or hack, the platform <a href=\"https:\/\/3commas.io\/blog\/3commas-ftx-security-alert\" data-v-f87c67ca=\"\">said<\/a> in an official blog post.","Through an investigation, the 3Commas team discovered multiple fake websites claiming to be 3Commas were used to phish information by tricking users into connecting their exchange accounts to fraudulent web interfaces. \"The API keys were then stored by the fake website and later used to place the unauthorized trades on the DMG trading pairs on FTX,\" 3Commas said — also noting that third-party browser extensions or malware may have been involved.","The trading-bot platform stressed throughout the security alert that it was not to blame for the cases of user data falling into the wrong hands. \"To reiterate and clarify, there has been no breach of either 3Commas account security databases or API keys,\" 3Commas wrote. \"This is an issue that has affected multiple users who have never been customers of 3Commas so there is no possibility that it is a leak of API keys originating from 3Commas.\"","3Commas said its \"representatives are in close contact with the victims of this 3rd party attack and are working with them to provide assistance and gather more information.\"","One user claimed on Twitter to have lost about $1.5 million from the API exploit — a claim that was <a href=\"https:\/\/twitter.com\/peckshield\/status\/1583863235614154752?s=46&amp;t=CckKXt-MoQ1SC7yx3VVFsA\" data-v-f87c67ca=\"\">retweeted<\/a> by blockchain security and data analytics company PeckShield to its more than 62,000 followers. The Block reached out to the affected user for comment and verification but had not been able to verify the accuracy of the claim by time of publication.","Alameda Research, a principal trading firm with close ties to FTX, <a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/www.theblock.co\/linked\/83417\/alameda-invests-3-million-into-retail-trading-bot-platform-3commas\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/linked\/83417\/alameda-invests-3-million-into-retail-trading-bot-platform-3commas\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">backed<\/a> 3Commas in a $3 million funding round in late 2020. Last month, 3Commas <a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/www.theblock.co\/post\/172136\/automated-crypto-trading-startup-3commas-raises-37-million\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/172136\/automated-crypto-trading-startup-3commas-raises-37-million\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">raised<\/a> $37 million in a Series B funding round led by Alameda Research, Jump Capital, Target Global and Copper CEO Dmitry Tokarev.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$37 million","content":"MONEY"},{"type":"$3 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Oct. 20","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"DMG","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Dmitry Tokarev","content":"PERSON"},{"type":"API","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Adam James","The Block"]}