{"summary":"CoinFLEX has let go of a &quot;significant&quot; portion of its team in an attempt to cut operating costs as it pursues a full recovery.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160287\/coinflex-says-it-has-laid-off-staffers-to-cut-costs-by-50-60","publishDate":"2022-07-29T13:27:44","id":7183,"type":null,"title":"CoinFLEX says it has laid off staffers to cut costs by 50-60%","category":["EXCHANGES"],"content":["Crypto exchange CoinFLEX has let go of a \"significant\" portion of its team in an attempt to cut operating costs as it seeks a full recovery since halting withdrawals last month.&nbsp;","The firm announced the decision in a weekly update today, saying it's cutting costs to give it \"every chance to be a successful business.\" For the time being, that means a leaner one.","To put itself in a position to succeed in its recovery plans, the firm said it had to let go of team members across all departments and geographies. That cut cost base by 50-60%, according to CoinFLEX, and those that remain are focused on product and technology.","\"We will monitor costs to ensure we operate as efficiently as possible and scale as volumes come back,\" said the firm in a <a href=\"https:\/\/coinflex.com\/blog\/coinflex-update-july-29-2022\/\" data-v-f87c67ca=\"\">blog post<\/a>. \"The intention is to remain right-sized for any entity considering a potential acquisition of or partnership opportunity with CoinFLEX.\"","CoinFLEX <a href=\"https:\/\/www.theblock.co\/post\/153871\/coinflex-halts-withdrawals-amid-extreme-market-conditions\" data-v-f87c67ca=\"\">halted<\/a> withdrawals last month due to extreme market conditions and uncertainty with a counterparty, though it assured users that the counterparty was not any of the headline-grabbing lending firms or embattled hedge fund Three Arrows Capital.","At that time, the exchange provided an estimated timeline forward that included having withdrawals operating by June 30th. To restart the platform, CoinFLEX planned to <a href=\"https:\/\/www.theblock.co\/post\/154468\/coinflex-plans-new-token-to-raise-funds-days-after-halting-withdrawals\" data-v-f87c67ca=\"\">raise<\/a> funds by issuing a new token, Recovery Value USD (rvUSD), with promises of 20% annual return. The June 30th deadline passed, the rvUSD plan was halted, and the firm began arbitrage proceedings in Hong Kong to recover $84 million from a client. Meanwhile, the firm said it's looking to raise capital from new investors to eventually <a href=\"https:\/\/www.theblock.co\/post\/155228\/coinflex-cancels-withdrawals-resumption-plan\" data-v-f87c67ca=\"\">resume withdrawals<\/a>.&nbsp;By July 15, it announced it had resumed withdrawal services in a limited capacity.","In this week's update, CoinFLEX said it's still looking to distribute rvUSD tokens and FLEX Coin as part of its recovery. The firm said it's still working with lawyers and the significant creditor group on details and expects to have numbers next week to enable a vote from depositors. The exchange also plans to offer trading of locked balances versus unlocked balances next week.&nbsp;","The remaining team members are exploring new offerings to differentiate it from other exchanges, and the firm is soliciting suggestions from its community. It's considering different ways to list and launch perpetual swaps that make the product \"more DeFi style in nature,\" in addition to \"increasing transparency through decentralization of custody and margining data.\" CoinFLEX is also examining forms of custody decentralization and ways to publicly broadcast anonymized margin and collateral data.","CEO Mark Lamb will join a live <a href=\"https:\/\/twitter.com\/Hayden_Otto\/status\/1552989762239479810?s=20&amp;t=cdFKimooJ2vEvsMZYSbl1A\" data-v-f87c67ca=\"\">AMA<\/a> with crypto influencer Hayden Otto at 2 a.m. EST tomorrow.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"July 15","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"2 a.m. EST tomorrow","content":"TIME"},{"type":"$84 million","content":"MONEY"},{"type":"60%","content":"PERCENT"},{"type":"Mark Lamb","content":"PERSON"},{"type":"June 30th","content":"DATE"},{"type":"AMA","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Recovery Value USD","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Hayden Otto","content":"PERSON"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}