{"summary":"Traders are borrowing ETH to try to game a potential fork at the time of The Merge. Crypto lending platforms are seeking to address this.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168111\/crypto-lending-platforms-react-to-high-eth-borrowing-by-traders-ahead-of-the-merge","publishDate":"2022-09-06T16:30:38","id":7185,"type":null,"title":"Crypto lending platforms react to high ETH borrowing by traders ahead of The Merge","category":["THE MERGE"],"content":["Following The Merge to proof of stake, holders of ETH are hoping for a potential bonus in the form of a \"powETH\" token airdrop. While it's uncertain whether the fork will happen, or if the forked token would have any value whatsoever, that hasn't stopped traders trying to game the system.","Many have taken the approach to borrow ETH on the current blockchain with plans to repay it after The Merge and sell any forked tokens they receive. But this has led to a huge surge in the amount of ETH getting borrowed from lending platforms — causing headaches for those protocols.","The powETH airdrop is anticipated to come as a result of miner operators whose machines facilitate the proof of work-based consensus mechanism used by pre-Merge Ethereum. If these miners opt to reject a transition to proof of stake-based consensus they will cause a fork in the blockchain by continuing to support transactions on the proof of work chain.","Before the airdrop takes place, DAO-based lending protocols are taking varying approaches to reduce widespread market disruption in light of the surge in borrowing activity.","Aave has proposed to halt ETH borrowing and increase the variable borrow APR at 100% utilization from 103% to 1,000% in the interim period leading up to The Merge. In a recently published <a href=\"https:\/\/governance.aave.com\/t\/arc-aave-ethpow-fork-risk-mitigation-plan\/9438\" data-v-f87c67ca=\"\">risk mitigation plan<\/a>, Aave laid out its reasoning, pointing to three latent risk factors related to increasing ETH utilization that include potentially difficult or impossible liquidations, negative APY on ETH positions, and an increase in ETH withdrawals by regular suppliers.","In contrast to Aave’s approach, <a href=\"https:\/\/www.comp.xyz\/t\/proposal-adjust-eth-interest-rate-model\/3493\" data-v-f87c67ca=\"\">Compound’s proposal<\/a> to mitigate overutilization will see the implementation of a borrow cap, swap out the interest rate model with a jump rate model, and increase borrow rates to accommodate withdrawal liquidity. Compound’s jump rate interest model will set rates based on utilization with a 2% rate at 0% utilization, a 20% rate at optimal utilization and a 1,000% rate at 100% utilization, where optimal utilization caps at 80%. Compound asserts that such levels will be sufficient to discourage full utilization of its borrowing and withdrawal markets and reduce cases of insolvency or other market disruption.","Meanwhile, in a <a href=\"https:\/\/twitter.com\/euler_mab\/status\/1567102129763917826?s=20&amp;t=ZcvYD5qXiEXmHsbEinnZDQ\" data-v-f87c67ca=\"\">storm of tweets<\/a>, Euler Labs co-founder and CEO Michael Bentley today described a starkly different approach than those of both Aave and Compound: Do nothing. In a <a href=\"https:\/\/forum.euler.finance\/t\/rfc-don-t-alter-the-eth-interest-rate-model-ahead-of-the-merge\/370\" data-v-f87c67ca=\"\">request for comment<\/a> posted in Euler’s governance forums, Bentley wrote, “Borrowers trying to get in early and front-run the powETH-borrow trade may find that by the time The Merge comes around they’ve paid more in ETH borrow interest than they stand to earn in powETH because of the high last minute costs.”","Bentley went on to propose that Euler refrain from altering its interest rate model for ETH, allowing borrowers to accumulate ETH in the days leading up to the Merge, and letting lenders fill the demand. He added that this tactic may entice lenders targeting higher interest rates to migrate assets to Euler.","Notably, this isn’t the first time a fork in Ethereum has resulted in the creation of a new cryptocurrency. In 2016, when a critical code issue resulted in the freezing of $60 million of ether, the controversial decision to fork and restore the stolen funds resulted in the establishment of Ethereum Classic and today’s Ethereum. In contrast, Bitcoin has also undergone a number of forks related to protocol changes spurring the 2017 creation of bitcoin cash (BCH), and bitcoin gold (BTG) in 2018.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"BCH","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"2017","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"1,000%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Euler Labs","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Euler","content":"LOCATION"},{"type":"Euler","content":"PERSON"},{"type":"103%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"Michael Bentley","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"BTG","content":"ORGANIZATION"},{"type":"$60 million","content":"MONEY"},{"type":"Bentley","content":"PERSON"},{"type":"0%","content":"PERCENT"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"Ethereum Classic","content":"ORGANIZATION"}],"hashtag":["AAVE","ETHEREUM"],"authors":["Jeremy Nation","The Block"]}