{"summary":"U.S. prosecutors said Wednesday that evidence about the absence of crypto regulation is &quot;only likely to confuse the jury.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254655\/current-laws-sufficient-to-charge-sam-bankman-fried-for-alleged-fraud-doj","publishDate":"2023-10-04T04:57:26","id":7193,"type":null,"title":"Current laws sufficient to charge Sam Bankman-Fried for alleged fraud: DOJ","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">U.S. prosecutors reiterated Wednesday that the existing legal framework is sufficient to charge Sam Bankman-Fried for fraud-related violations.<\/span>","<span data-v-f87c67ca=\"\">In a Wednesday <\/span><a href=\"https:\/\/www.courtlistener.com\/docket\/66631291\/312\/united-states-v-bankman-fried\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filing<\/span><\/a><span data-v-f87c67ca=\"\">, the Department of Justice dismissed <\/span><a href=\"https:\/\/www.courtlistener.com\/docket\/66631291\/306\/united-states-v-bankman-fried\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bankman-Fried’s claims<\/span><\/a><span data-v-f87c67ca=\"\"> that “the apparent absence of relevant law or guidance bears directly on whether the alleged use of customer deposits would constitute misappropriation as opposed to a permissible business practice.”<\/span>","<span data-v-f87c67ca=\"\">The prosecutors argued that there are prohibitions on misappropriating customer assets — “they are the very laws that the defendant has been charged for violating.”<\/span>","<span data-v-f87c67ca=\"\">The DOJ added that while the existence of a law might be relevant to establish a statutory duty of care, the absence of regulation is not relevant to whether money was entrusted to the defendant’s care by his victims. <\/span><span data-v-f87c67ca=\"\">“[Evidence] or argument about the absence of regulation is only likely to confuse the jury into believing that there must be a regulation imposing a duty for misappropriation to have occurred,” the DOJ said.<\/span>","<span data-v-f87c67ca=\"\">The DOJ also said that the court should deny Bankman-Fried’s request for reconsideration on a <\/span><a href=\"https:\/\/www.courtlistener.com\/docket\/66631291\/289\/united-states-v-bankman-fried\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">previous granting<\/span><\/a><span data-v-f87c67ca=\"\"> of precluding him from offering evidence concerning the recovery of assets in the FTX bankruptcy proceeding.<\/span>","<span data-v-f87c67ca=\"\">Another point of argument surrounds whether Bankman-Fried could present his “prior good acts” such as charitable giving and philanthropy. The DOJ responded in the Wednesday filing that it does not object to his presenting admissible evidence regarding charitable efforts “so long as the evidence is presented for a proper purpose, including not for propensity or character purposes.”<\/span>","<span data-v-f87c67ca=\"\">The trial for the failed crypto exchange founder <\/span><a href=\"https:\/\/www.theblock.co\/post\/254630\/inside-the-courtroom-sbfs-quiet-first-day-in-court\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">began on Tuesday<\/span><\/a><span data-v-f87c67ca=\"\"> with jury selection.<\/span>","<span data-v-f87c67ca=\"\">It seemed unclear whether the potential jurors had a sense of the scale of the case before them, The Block <a href=\"https:\/\/www.theblock.co\/post\/254630\/inside-the-courtroom-sbfs-quiet-first-day-in-court\" data-v-f87c67ca=\"\">reported from the courtroom<\/a><\/span><span data-v-f87c67ca=\"\">. The potential jurors, from which the final 12 jurors and six alternates will be selected, were instructed not to research the case on their own or discuss the details with anybody.<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["CRIME","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Timmy Shen","The Block"]}