{"summary":"Grayscale has filed documents with the SEC for three new ETFs that include a Bitcoin Composite fund and Ethereum Futures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230115\/grayscale-ethereum-futures-bitcoin-etf-sec","publishDate":"2023-05-09T18:05:14","id":7194,"type":null,"title":"Grayscale files for Ethereum Futures, Bitcoin Composite ETFs","category":["COMPANIES"],"content":["Asset manager <a href=\"https:\/\/twitter.com\/Grayscale\/status\/1656042617660948486\" data-v-f87c67ca=\"\">Grayscale has filed documents<\/a> with the U.S. Securities and Exchange Commission for three new ETFs that aim to expand its offerings in the digital asset space.","The registration statement for the Grayscale Ethereum Futures ETF, Grayscale Global Bitcoin Composite ETF and Grayscale Privacy ETF was sent in conjunction with the creation of Grayscale Funds Trust, a Delaware statutory trust structure, that will allow the firm to independently manage its 1940 Act products.","\"We are putting the necessary foundations in place so Grayscale can continue creating and managing regulated, future-forward products,” Grayscale CEO Michael Sonnenshein <a href=\"https:\/\/www.globenewswire.com\/news-release\/2023\/05\/09\/2665053\/0\/en\/Grayscale-Investments-Forms-Grayscale-Funds-Trust.html\" data-v-f87c67ca=\"\">said in a statement<\/a>.&nbsp;","The move comes while Grayscale has been involved in a <a href=\"https:\/\/www.theblock.co\/post\/217578\/grayscales-day-in-court-is-nearly-here-but-a-major-decision-could-take-time\" data-v-f87c67ca=\"\">lengthy dispute<\/a> with the SEC after the regulator rejected its proposal to convert its flagship GBTC fund into a spot bitcoin ETF. The company has said it expects a final ruling in the court case by the fall.&nbsp;","While the new registration statement has been filed with the SEC, Grayscale said it has not yet become effective. The Ethereum Futures fund and the Bitcoin Composite ETFs will not invest in digital assets directly.","\"The Fund seeks to achieve its investment objective primarily through actively-managed exposure to ethereum futures contracts,\" Grayscale <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1976672\/000113743923000644\/gftn1a052023.htm\" data-v-f87c67ca=\"\">said in the filing<\/a>, referencing the Ethereum Futures fund that will \"seek to purchase a number of Ether Futures so that the total notional value (i.e., the total value of an underlying asset) of the ether underlying the Ether Futures held by the Fund is approximately 100% of the net assets of the Fund.\"","The Bitcoin Composite ETF will seek investment results that track the performance of the Indxx Global Bitcoin Composite Index.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"100%","content":"PERCENT"},{"type":"1940","content":"DATE"},{"type":"Delaware","content":"LOCATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"Grayscale","content":"PERSON"},{"type":"Grayscale Funds Trust","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Grayscale Global Bitcoin Composite ETF","content":"ORGANIZATION"},{"type":"Michael Sonnenshein","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}