{"summary":"Revolut will no longer provide crypto services to United States users, citing a challenging regulatory environment in the country.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243200\/revolut-shut-down-crypto-business-us","publishDate":"2023-08-04T06:51:24","id":7199,"type":null,"title":"Revolut to shut down crypto business in US, citing &#x27;regulatory environment&#x27;","category":["COMPANIES"],"content":["Fintech firm Revolut will no longer provide crypto services to United States users, citing a challenging regulatory environment in the country.","Beginning Sept. 2, Revolut's U.S. customers won't be able to place buy orders for cryptocurrencies, the company said in an email sent to local users that was seen by The Block. Users can continue to place sell orders until Oct. 2, and from Oct. 3, the venue will be fully closed, meaning users won't be able to buy, sell or hold any cryptocurrencies. Decrypt first reported the news.&nbsp;","\"As a result of the evolving regulatory environment and the uncertainties around the crypto market in the U.S., we've taken the difficult decision, together with our U.S. banking partner, to suspend access to cryptocurrencies through Revolut in the U.S.,\" a Revolut spokesperson told The Block. The company's U.S. banking partner is Metropolitan Commercial Bank, the spokesperson said.","The decision does not affect Revolut users outside of the U.S. and impacts less than 1% of Revolut's crypto customers globally, according to the spokesperson. Revolut customers in all other markets can continue signing up and using the platform's crypto services.","The move comes a month after Revolut <a href=\"https:\/\/www.theblock.co\/post\/237499\/revolut-polygon-solana-cardano-crypto-tokens\" data-v-f87c67ca=\"\">said<\/a> it was delisting Polygon (MATIC), Solana (SOL) and Cardano (ADA) in the U.S. — tokens that the U.S. Securities and Exchange Commission have <a href=\"https:\/\/www.theblock.co\/post\/233174\/solana-matic-cardano-others-securities-sec-binance-lawsuit\" data-v-f87c67ca=\"\">alleged<\/a> are unregistered securities. Revolut's U.S. users holding the three tokens were required to sell them before Sept. 18, and those tokens will continue to be delisted on Sept. 18, per the email.","If Revolut's U.S. users don't sell their crypto holdings before Oct. 2, the company will liquidate any remaining balance on Oct. 3, and users will receive the same market price for each token at that time, according to the email.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Oct. 3","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Sept. 2","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Oct. 2","content":"DATE"},{"type":"Sept. 18","content":"DATE"},{"type":"Revolut","content":"PERSON"},{"type":"Revolut","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Cardano (ADA","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}