{"summary":"Ether options open interest for end of April expiry indicates a bullish sentiment in the market, an analyst said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287001\/ether-options-point-to-bullish-market-sentiment-for-end-of-april","publishDate":"2024-04-08T11:38:29","id":72,"type":null,"title":"Ether options point to bullish market sentiment for end of April","category":["MARKETS"],"content":["The options market seems to have taken on more bullish positions in the largest cohort of ether options open interest by expiration date, contracts for the end-of-April expiry. Some $3.3 billion of notional ether options set to expire, according to Deribit <a href=\"https:\/\/metrics.deribit.com\/options\/ETH\" data-v-f87c67ca=\"\">data<\/a>, and roughly two-thirds of that amount have been placed on calls, or bullish bets on price.&nbsp;","\"Call strikes are clustered between $3,700 - $4,000, showing an upside bias and underlying bullish sentiment in the market,\" Wintermute OTC Trader Jake Ostrovskis told The Block.","The Wintermute analyst added that the current open interest skew shows calls trading at a premium to puts, while implied volatility has jumped over the weekend. \"Taken together, this indicates more directional bias and less reliance on writing options to finance premiums,\" Ostrovskis added.","According to Deribit data, the ether put-call ratio for the end of April expiry is currently 0.45, which is a slightly more bullish position compared to bitcoin options, which have a put-call ratio of 0.48.","\"I believe this is driven by traders seeing relative value in ether, which has underperformed its larger counterpart so far in 2024,\" Ostrovskis added.","A put-call options ratio below one indicates that the call volume exceeds the put volume, signifying bullish sentiment in the market. It is assumed that a trader who buys call options is implicitly bullish on the market, while a put buyer is bearish.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/eth-put-call-ratio\/embed\" title=\"ETH Put\/Call Ratio\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Zooming out, Monday's ether put-call ratio on Deribit for all expiries has fallen to 0.4, a low not seen since late February, according to <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>,&nbsp;","However, Ostrovskis added that the perceived negative impacts of regulatory changes on ether are still an overhang for the digital asset.","\"There is still the SEC apparently waging a campaign to categorize it as a security, alongside the market's view that the probability of an ETF being approved by June 30th, 2024, at just 17%. Even last week's report that the SEC is soliciting comments on spot ether ETFs, a trigger that should have been taken well by the market, seems to have been ignored,\" he said.","Ether increased by around 6.8% in the past 24 hours and was changing hands for $3,645 at 11:14 a.m. ET, according to <a href=\"https:\/\/www.theblock.co\/price\/248349\/ethereum-eth-usd\" data-v-f87c67ca=\"\">The Block's Price Page<\/a>.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 30th, 2024","content":"DATE"},{"type":"11:14 a.m. ET","content":"TIME"},{"type":"6.8%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Ostrovskis","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$3.3 billion","content":"MONEY"},{"type":"Wintermute OTC","content":"ORGANIZATION"},{"type":"$3,700","content":"MONEY"},{"type":"$3,645","content":"MONEY"},{"type":"Jake Ostrovskis","content":"PERSON"},{"type":"17%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"$4,000","content":"MONEY"},{"type":"April","content":"DATE"}],"hashtag":["CRYPTO MOVERS"],"authors":["Brian McGleenon","The Block"]}