{"summary":"The team behind the miner-led Ethereum fork has published updates for miners, exchanges, bridges, wallets, and other network participants.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169907\/the-merge-ethereumpow-releases-update-on-its-mainnet-launch","publishDate":"2022-09-14T08:05:22","id":720,"type":null,"title":"The Merge: EthereumPoW releases update on its mainnet launch","category":["THE MERGE"],"content":["EthereumPoW has released further <a href=\"https:\/\/twitter.com\/EthereumPoW\/status\/1569977198366584832\" data-v-f87c67ca=\"\">updates<\/a> for miners, exchanges, and other network participants on EthereumPoW (ETHW), <a href=\"https:\/\/www.theblock.co\/post\/168007\/the-merge-a-look-at-the-miner-led-ethereum-fork-that-might-happen\" data-v-f87c67ca=\"\">the miner-led fork of Ethereum<\/a> that will happen once The Merge occurs.","<a href=\"https:\/\/www.theblock.co\/post\/166708\/the-merge-everything-you-need-to-know-about-ethereums-big-upgrade\" data-v-f87c67ca=\"\">The Merge<\/a> refers to Ethereum’s transition from a proof-of-work to a proof-of-stake blockchain network. This transition eliminates the need for miners, as validators with ether staked on the network will be responsible for processing transactions. Some Ethereum miners are against this transition, hence the creation of a forked chain that still retains the proof-of-work status quo.","According to today’s announcement, ETHW Core, the team developing the <a href=\"https:\/\/www.theblock.co\/post\/169466\/official-ethereumpow-ethw-fork-date-announced\" data-v-f87c67ca=\"\">mainnet for the fork chain<\/a> must deploy the network within 24 hours of The Merge. The ETHW Core team will maintain a copy of the Ethereum blockchain until the exact moment when Ethereum transitions to proof of stake.","ETHW Core has prepared a download link for miners, node operators, exchanges, bridges, wallets, and other interested network participants. They are able to download a snapshot of the chain. The size of the snapshot is about 1.1 terabytes, per the announcement.","Today’s announcement also stated that more mining pools have begun testing their hardware on the ETHPoW testnet. This is in addition to the fact that the major players like Poolin and f2pool have already stated plans to mine ETHW. The Core team has also partnered with Ethwmine as a backup mining pool for the forked chain.","The Core team says all the necessary tasks required to launch the ETHPoW mainnet will take some time. As such, it has urged network participants to exercise some patience.","<i data-v-f87c67ca=\"\">For the latest news and updates about The Merge, make sure to check out our<\/i> <a href=\"https:\/\/www.theblock.co\/post\/169846\/the-merge-live-coverage-of-ethereums-major-upgrade\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">live coverage<\/i><\/a><i data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Ethwmine","content":"PERSON"}],"hashtag":["ETHEREUM"],"authors":["Osato Avan-Nomayo","The Block"]}