{"summary":"Copper is launching an internal review after an event at which sushi was served to guests from the bodies of scantily clad models.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285328\/crypto-custody-copper-sushi-event-apology","publishDate":"2024-03-28T09:18:33","id":7200,"type":null,"title":"Crypto custody firm Copper apologizes for &#x27;embarrassing&#x27; sushi event","category":["COMPANIES"],"content":["Copper is launching an internal review after apologizing for an event at which sushi was served to guests from the bodies of models reportedly wearing thin bodysuits.","\"We did not get this right,\" the firm said in <a href=\"https:\/\/copper.co\/insights\/company-news\/statement-from-copper\" data-v-f87c67ca=\"\">a statement<\/a>. \"We recognize that certain aspects of the event have caused offense and do not reflect Copper's corporate values. We will be conducting an internal review of the existing process for approving events and sponsorship arrangements and the value of such events to the company going forward.\"","Copper is a crypto custody firm chaired by former UK chancellor Lord Philip Hammond. Founded in 2018, its clients are primarily hedge funds, trading houses and institutional investors. It has yet to gain regulatory approval from the Financial Conduct Authority.","The event was hosted at a five-star Mandrake hotel in London. The Financial Times reported earlier this week that the Copper-sponsored party was billed as allowing guests to \"explore all five senses.\"","Copper reportedly claims a third party organized the event.","\"Clearly, the story is embarrassing and, taken in the context presented, is not in line with our values as a company,\" the firm said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"UK","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Philip Hammond","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"2018","content":"DATE"}],"hashtag":["CRYPTO BANKS AND LENDERS"],"authors":["Adam James","The Block"]}