{"summary":"The UK&#x27;s financial regulator warned crypto memes found to be non-compliant with financial promotion rules could result in criminal offenses.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240231\/fca-crypto-memes-breach-financial-promotion-rules","publishDate":"2023-07-18T08:06:57","id":7203,"type":null,"title":"FCA warns crypto memes could breach financial promotion rules","category":["POLICY"],"content":["The UK's financial regulator warned crypto memes found to be non-compliant with financial promotion rules could potentially result in criminal offenses.","The Financial Conduct Authority (FCA) <a href=\"https:\/\/www.fca.org.uk\/publication\/guidance-consultation\/gc23-2.pdf\" data-v-f87c67ca=\"\">proposed new guidelines<\/a> on Monday that contained a section on non-compliant crypto memes considered financial promotions.","The agency gave an example of a non-compliant crypto meme. It consisted of a split picture, showing a person having difficulty spending money in the supermarket, compared with a person buying crypto with ease.","<span data-v-f87c67ca=\"\">Example of a non-compliant crypto promotion meme. Image: FCA.<\/span>","“We have seen memes and other similar communications circulated on social media with users often not realizing they are subject to our rules,” the FCA stated. Memes seen as promoting crypto assets may need to add disclaimers in order to comply with advertising regulations.","The <a href=\"https:\/\/www.theblock.co\/post\/236313\/fcas-head-of-digital-assets-leaves-less-than-one-year-after-joining\" data-v-f87c67ca=\"\">FCA<\/a> observed many people are unaware that memes can be subject to its compliance rules. \"Firms are reminded that any type of communication is capable of being a financial promotion and subject to S21,\" the agency noted. A breach of section 21 of the Financial Services and Markets Act 2000 is a criminal offense that is punishable by up to two years imprisonment, the imposition of an unlimited fine, or both. \"S21 has a broad territorial application and it applies even where a communication originates outside the UK if it is capable of having an effect in the UK,\" the FCA added.","The updated compliance rules could be significant for meme coin projects, that base a large part of their value proposition on associated memes.","The <a href=\"https:\/\/www.fca.org.uk\/publication\/guidance-consultation\/gc23-2.pdf\" data-v-f87c67ca=\"\">consultation paper<\/a> also proposed guidance targeting social media financial influencers, or “finfluencers.”","“We have also seen a substantial increase in financial influencers, also known as ‘finfluencers,’ on social media promoting financial products, particularly investment and credit products,” the agency said.","The FCA added influencers operating on social media channels, like <a href=\"https:\/\/www.theblock.co\/post\/234567\/bitcoin-ethereum-reddit\" data-v-f87c67ca=\"\">Reddit<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/191054\/telegram-sells-usernames-worth-50-million-on-the-open-network-blockchain\" data-v-f87c67ca=\"\">Telegram<\/a>, could be inadvertently making financial promotions and not realizing they are subject to S21 restrictions. It gave examples where influencers thought there needed to be evidence of direct compensation or explicit underlying commercial interest for a breach. However, the FCA said this was not the case.&nbsp;","\"We have seen financial promotions be communicated on chatrooms such as Reddit and Telegram, often using memes to hype up specific investments. Users of chatrooms or forums should be aware that financial promotions on these channels will still be subject to the financial promotion restriction,\" the FCA said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"UK","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Reddit","content":"LOCATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2000","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"Financial Services","content":"ORGANIZATION"}],"hashtag":["FCA"],"authors":["Brian McGleenon","The Block"]}