{"summary":"The public letter comes on the heels of a class-action lawsuit against the bank alleging that it holds responsibility for FTX&#x27;s move of customer funds to hedge fund Alameda Research.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192308\/silvergate-reassures-investors-over-crypto-contagion","publishDate":"2022-12-05T17:34:33","id":7204,"type":null,"title":"Silvergate CEO seeks to reassure investors over crypto contagion","category":["COMPANIES"],"content":["Silvergate Bank, which specializes in service to fintech and crypto clients including failed crypto exchange FTX and its sister hedge fund Alameda Research, published a letter from its CEO to reassure shareholders about its due diligence practices, risk management and reserves.&nbsp;","“Silvergate conducted significant due diligence on FTX and its related entities including Alameda Research, both during the onboarding process and through ongoing monitoring, in accordance with our risk management policies and procedures and the requirements outlined above,” CEO Alan Lane wrote. “And, as I’ve noted previously, if we detect activity that is unexpected or potentially concerning in any account, we conduct an investigation and, when required, confidentially file a suspicious activity report in accordance with federal regulation.”","The letter to investors also included affirmations of risk management and anti-money laundering compliance, as Lane said he sought to combat “misinformation … spread by short sellers and other opportunists” following the FTX collapse. The bank CEO added that customers “continue to have access to their U.S. dollar deposits when they need them and that the Silvergate Exchange Network ('SEN') has continued to operate uninterrupted throughout this period.”","A class-action lawsuit filed against the bank last week claims that the bank and its corporate officers “were complicit in and responsible” for fraudulent losses in the FTX collapse because Silvergate “knowingly or negligently permitted FTX to direct customer deposits to Alameda Research.”","Lane also touted Silvergate’s assets.","“In addition to the cash we carry on our balance sheet, our entire investment securities portfolio can be pledged for borrowings at the Federal Home Loan Bank, other financial institutions, and the Federal Reserve Discount Window — and can ultimately be sold should we need to generate liquidity to satisfy customer withdrawal request,” Lane said. “We intentionally carry cash and securities in excess of our digital asset related deposit liabilities.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"Alan Lane","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Federal Home Loan Bank","content":"ORGANIZATION"},{"type":"Federal Reserve Discount Window","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Lane","content":"PERSON"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["CRYPTO BANKS AND LENDERS"],"authors":["Colin Wilhelm","The Block"]}