{"summary":"American CryptoFed DAO said it sought dialogue with the SEC over the stop order the regulator issued in November, but its questions were left unanswered.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203499\/american-cryptofed-argues-it-was-shut-out-from-dialogue-with-the-sec","publishDate":"2023-01-18T15:30:00","id":7209,"type":null,"title":"American CryptoFed argues it was shut out from dialogue with the SEC","category":["POLICY"],"content":["A decentralized autonomous organization that the Securities and Exchange Commission is attempting to stop from registering and selling tokens argued at a hearing that the regulator isn’t making officials available to work through its complaints.","American CryptoFed DAO LLC said it sought dialogue with the SEC over the stop order the regulator issued <span class=\"s1\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/post\/188464\/sec-moves-to-suspend-sale-of-american-cryptofed-dao-tokens\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">in November<\/span><\/a><\/span>, but its questions were left unanswered.","Zhou Xiaomeng, AmericanCryptoFed’s chief operating officer, said the organization had the right to talk with the chief accountant, among others at the SEC.","“The problem is we cannot talk even with the commission’s chief accountant,” Xiaomeng said on Wednesday during a hearing.","The SEC started the administrative proceedings against the Wyoming-based DAO over the offer and sale of its Ducat and Locke tokens. The agency’s enforcement arm said at the time that a Form S-1 registration statement filed by American CryptoFed failed to contain required information about its business management and financial condition. It also had materially misleading statements and omissions, including inconsistencies on whether the tokens are securities, the SEC said.","Xiaomeng also told the judge that the SEC won’t allow the registration of potential securities while at the same time not proving whether or not the tokens are securities.","American CryptoFed is representing itself in the hearing. During an appearance in early December, the DAO argued that the SEC treated it unfairly by choosing to accelerate enforcement without providing it an opportunity to work through its filings and resolve issues with the agency’s Division of Corporation Finance, according to a post about the hearing from law firm Baker McKenzie.","The hearing will continue into Thursday after recessing today over disagreements over what the DAO could present to the judge.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"American CryptoFed","content":"ORGANIZATION"},{"type":"Baker McKenzie","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"Wyoming","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"DAO LLC","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"’s Division of Corporation Finance","content":"ORGANIZATION"},{"type":"Locke","content":"LOCATION"},{"type":"Xiaomeng","content":"PERSON"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}