{"summary":"Anchorage Digital co-founder Diogo Mónica said the crypto bank had witnessed a fourfold surge in institutional ether staking this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251503\/ether-staking-fourfold-anchorage-digital","publishDate":"2023-09-18T11:54:46","id":7210,"type":null,"title":"Ether staking rose fourfold at Anchorage Digital in 2023, co-founder says","category":["FINANCE FIRMS"],"content":["Federally chartered digital asset bank Anchorage Digital saw a fourfold increase in the amount of ether staked on the platform this year, according to its co-founder and President Diogo Mónica.","The growth in institutional ether staking is one of the major changes Anchorage has witnessed in 2023, Mónica told The Block in a recent interview — with over 40% of institutional clients who hold ether at Anchorage now staking it on the platform.","“​​Many institutions no longer want to only hold digital assets. Increasingly, they want to actively participate in the wider crypto ecosystem, which means more actively trading, staking, governance etc.,” the Anchorage Digital President said.","While most crypto cycles have witnessed hype around the idea that institutions were coming into the space, many participants were left disappointed by the reality. However, Mónica argues very few institutions who entered the market in some way have fully exited the system. So, with financial giants like BlackRock and Fidelity taking a greater interest via spot bitcoin ETF applications and Anchorage client EDX Markets, backed by Citadel Securities and Charles Schwab, entering the crypto exchange scene, perhaps this time is different?","“While the FTX collapse last year pushed some institutional projects behind-the-scenes, very few institutions fully exited the digital asset ecosystem,” Mónica said. “Despite regulatory and market uncertainty, all of the major institutional players approach crypto with a long-term horizon. What we are seeing today is the fruit of using the bear market as an opportunity to build.”","Mónica added that such events underscored the critical importance of risk management, transparency and safer market structure — something Anchorage has benefitted from since FTX’s collapse.","“The flight to safety we saw following the collapse of FTX was all about control. Institutions wanted greater control of their assets and sought us as their third-party custodian, and our assets under custody rose by over 50% from Q4 2022 to Q1 2023 following that series of tumultuous market events,” he said.","Such market structure is something Anchorage is actively working on in the space, as demonstrated by the new institutional <a href=\"https:\/\/www.theblock.co\/post\/246772\/fidelity-citadel-securities-charles-schwab-edx-markets-anchorage-digital-clearinghouse-custody\" data-v-f87c67ca=\"\">crypto exchange EDX Market's selection of Anchorage<\/a> last month to provide custody solutions for its upcoming clearinghouse business.","\"Drawing from the blueprint of traditional finance will be critical to unlocking the next phase of institutional crypto,\" Mónica said at the time. \"Anchorage Digital has proven that separating custody and exchange functions for institutions isn’t just possible, it’s essential.\"","Reiterating this stance, Mónica noted you would never custody a security on a traditional exchange, and separating custodial and exchange functions has been part of foundational investor protection for decades — something not particularly seen in crypto.","\"A clear distinction between custody and exchange is an important check-and-balance missing in crypto today,” the Anchorage Digital President said. “The rapid growth of the industry has made vertical integration the standard, with many platforms playing the role of both exchange and custodian. This can create potential conflicts of interest and undermine the stability of the market. The FTX collapse is a case in point, demonstrating what can go wrong when billions in digital assets are stuck on a failed exchange.”","Mónica added that the firm was also advocating for other reforms in the crypto market to help prevent such conflicts and potential manipulation, including the segregation of company and client funds, disclosure of related party transactions and fundamental financial risk controls — like not borrowing short and lending long.","Being the sole federally chartered digital asset bank, Mónica said Anchorage Digital offers its institutional clients the regulatory clarity needed to safely participate in the crypto space.&nbsp;","The bank's charter mandates the segregation of all client assets in on-chain vaults to prevent the reported commingling of client and firm funds on platforms like FTX. Clients can transparently check where their assets are held, and the segregation protects them in the event of bankruptcy.","Furthermore, Mónica added that, as a qualified custodian, Anchorage Digital aligns with the <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-30\" data-v-f87c67ca=\"\">proposal from the Securities and Exchange Commission<\/a> in February, suggesting that investment advisers should use such custodians to securely store client assets in a compliant manner.","When asked about any impact following the collapse of other crypto banks like <a href=\"https:\/\/www.theblock.co\/post\/218223\/silvergate-will-liquidate-bank-wind-down-operations\" data-v-f87c67ca=\"\">Silvergate<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/219119\/state-regulator-takes-control-of-signature-bank-federal-regulators-guarantee-deposits\" data-v-f87c67ca=\"\">Signature<\/a> earlier this year, Mónica said Anchorage’s finances were not affected but crypto businesses deserve the same access to banking facilities as other industries.","“While our financial strength has not been affected by recent uncertainty in the fiat banking sector, we do believe crypto and blockchain businesses merit the same access to traditional fiat banks as other businesses,” the Anchorage Digital President said. “Broadening fiat banking access to crypto businesses would enable the industry to continue fostering innovation and creating jobs that benefit the U.S. economy.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Anchorage Digital","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Diogo Mónica","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Anchorage","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Charles Schwab","content":"PERSON"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"last month","content":"DATE"},{"type":"Mónica","content":"PERSON"},{"type":"Anchorage Digital President","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["James Hunt","The Block"]}