{"summary":"Pantera Capital&#x27;s CEO Dan Morehead sees a sluggish recovery for this financial crisis, and that will be a boon for bitcoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63969\/panteras-dan-morehead-expects-bitcoin-to-shine-amid-sluggish-economic-recovery","publishDate":"2020-05-05T13:03:47","id":7211,"type":null,"title":"Pantera&#x27;s Dan Morehead expects bitcoin to shine amid sluggish economic recovery","category":["MARKETS"],"content":["A V-shaped recovery for the economy is unlikely – and that could be a boon for bitcoin, according to one of the largest investors in the crypto space.&nbsp;","In an April 30 letter to investors, Pantera Capital's CEO and chief investment officer Dan Morehead examined the unprecedented, \"massively confusing time\" across markets.&nbsp;","Nevertheless, Morehead is bullish on crypto and short broader markets, at least in the short term, according to the letter.&nbsp;","\"It is clear that this recession won't be V-shaped,\" Morehead wrote, referring to a more rapid recovery in the economy. The former CFO and head of macro trading at Tiger Management went on to note unique dynamics at play that could result in a prolonged recovery – even relative to the Great Recession. For instance, Morehead said school closings could make it difficult for Americans with children to get back to work even if stores, restaurants, and retailers reopen. Many school districts – including New York City's, the largest in the country – are not slated to reopen their doors until September.&nbsp;","Morehead's conclusion is that the economy will not pick up until schools open back up.&nbsp;","He also notes other impediments to economic growth, such as a large number of restaurants closing permanently and behavioral changes tied to the pandemic, such as a decline in the number of folks traveling by sea or air.&nbsp;","","","<em data-v-f87c67ca=\"\">Source: Pantera Capital<\/em>","Still, up until this point, U.S. stocks specifically have recouped much of their losses with the S&amp;P500 trading up more than 27% since March 23. Indeed, that's despite some brutal data from first-quarter earnings. As noted by Goldman Sachs, 73% of the S&amp;P500's market cap has reported Q1 earnings \"with results that have generally disappointed relative to weak expectations.\"","\"Earnings are a horror show,\" said Tom Lee of Fundstrat. \"Worst in modern financial history. Yet stocks are flat to up.\"","In Lee's view, equity markets typically bottom prior to the nadir in negative economic data, which could mean that the stock market has already clocked in its lows.&nbsp;","Still, the question of whether the global recovery will take the form of a V, U, or L, has been debated across Wall Street. Recently, HBSC's head of global foreign exchange David Bloom told <a href=\"https:\/\/www.cnbc.com\/2020\/05\/04\/hsbc-expects-a-jagged-u-shaped-recovery-and-backs-these-currencies-to-thrive.html\" data-v-f87c67ca=\"\">CNBC<\/a> that the global economy is set for a U-shaped recovery with a \"jagged bottom.\"","As for bitcoin's outlook, a slow rebound in broader markets could push investors into the bitcoin market, according to Pantera's Paul Veradittakit. Already, bitcoin has outperformed other assets year-to-date, including real estate, stocks, and oil. In a phone call following the release of Morehead's letter, Veradittakit said that the firm's bitcoin fund has been doing \"very well\" on clinching new subscriptions as investors seek new opportunities.&nbsp;","\"People are thinking if the recovery takes an L shape, or we're still in the downward swing of a U, where do I go,\" Veradittakit told The Block. \"They're thinking bitcoin could potentially do much better than the stock market.&nbsp;","Still, a sluggish market is only one component that could play into its further appreciation, according to Morehead.","There's also the halving, which will result in the bitcoin reward per block being cut in half. According to Morehead, per the scant historical data available, the halving has been a bullish catalyst. Here's Morehead:","\"Bitcoin has historically bottomed 459 days prior to the halving, climbed leading into it, and then exploded to the upside afterwards.&nbsp;&nbsp;The post-halving rallies have averaged 446 days – from the halving to the peak of that bull cycle.&nbsp;In this cycle, the market did in fact trough 514 days before the halving.&nbsp;&nbsp;IF history were to repeat itself, bitcoin would peak in August 2021.\"","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Disclosure:<\/strong> Pantera Capital made a small equity investment in The Block's last fundraise.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"HBSC","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"August 2021","content":"DATE"},{"type":"Tiger Management","content":"ORGANIZATION"},{"type":"Veradittakit","content":"PERSON"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"Tom Lee","content":"PERSON"},{"type":"Morehead","content":"ORGANIZATION"},{"type":"March 23","content":"DATE"},{"type":"April 30","content":"DATE"},{"type":"73%","content":"PERCENT"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"Morehead","content":"LOCATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Dan Morehead","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"27%","content":"PERCENT"},{"type":"David Bloom","content":"PERSON"},{"type":"Pantera","content":"ORGANIZATION"},{"type":"Paul Veradittakit","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["Frank Chaparro","The Block"]}