{"summary":"In this episode of the Scoop, Andy discusses: Why Wealthfront has developed a laser focus on millennial investors, Why Wealthfront does not include cryptocurrencies in their investment services, Andy&#x27;s experience as a co-founder at Benchmark, including his biggest failure as an investor and more.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49059\/wealthfront-founder-andy-rachleff-explains-why-the-robo-advisor-is-betting-on-millenial-investors-but-not-offering-clients-exposure-to-bitocin","publishDate":"2019-12-03T16:15:50","id":7215,"type":null,"title":"Andy Rachleff explains why the robo-advisor is betting on millennial investors","category":["PODCASTS"],"content":["<em data-v-f87c67ca=\"\">Episode 30 of The Scoop was recorded on Skype with Frank Chaparro, Steven Zheng, and Andy Rachleff, Co-Founder of Wealthfront. Listen below, and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>,&nbsp;<a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>,&nbsp;<a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>,&nbsp;<a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback and revision requests to&nbsp;<a href=\"\/cdn-cgi\/l\/email-protection#9eeef1fafdffedeadeeaf6fbfcf2f1fdf5fdece7eeeaf1b0fdf1f3\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"a6d6c9c2c5c7d5d2e6d2cec3c4cac9c5cdc5d4dfd6d2c988c5c9cb\">[email&nbsp;protected]<\/span><\/a>.<\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK7480726974\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-mce-fragment=\"1\" data-v-f87c67ca=\"\"><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><\/iframe>","In this episode of the Scoop, Andy discusses several topics with Frank and Steven, including:","<em data-v-f87c67ca=\"\">The transcript is provided for your convenience, please excuse any errors or typos resulting from the transcription process:<\/em>","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Ladies and gentlemen, thank you all for joining us on what is a very special episode of The Scoop. Since we started this endeavor back in April of this year, something that I always thought would be a key component of this show for the cryptocurrency ecosystem was bringing on outside voices that touch the peripheral of this market in this space. What is cryptocurrency and bitcoin all about? Many folks see it as a disruptive force to mainstream financial services, to mainstream Wall Street banks, and obviously, at the same time, we're not operating in a vacuum. There are challenger banks, firms like--and that's what our guests here today asked is here to talk about--firms like Wealthfront, we have the CEO, Andy Radcliff on. They're also trying to do something similar, right? Disrupting mainstream financial services, disrupting Wall Street banks. We're very excited to have Andy on to talk about how Wealthfront has changed over the years since he founded it. Andy has a storied career in both venture capital and academic work, and, of course, at Wealthfront. Andy, thanks so much for joining us. We're happy to have you on the show.","<strong data-v-f87c67ca=\"\">Andy Rachleff&nbsp; <\/strong>Thank you very much, I'm happy to be here.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>So let's just dive into it and I think explore the story of Wealthfront. What started out as a very, I think it's fair to say, simple product of a robo advice platform has really transformed into something that I think your mission now is to touch all different aspects of a person's relationship with their finances from the day the paycheck gets into their account, to where that money is then allocated and then planning for different financial and personal experiences. Walk us through how that transition took place.","<strong data-v-f87c67ca=\"\">Andy Rachleff&nbsp; <\/strong>Sure. Well, we started with, as you said, a very simple proposition, and that was to automate your investments by using best in class and academically proven techniques. Computers are a lot better at doing that than people are, so we were able to offer a diversified portfolio of rebalanced low-cost index funds. We're able to do that at incredibly low minimums and really low fees, only a quarter of a percent, which is about a quarter of the industry average. Over time, we added more and more capabilities to that service to optimize it--to minimize your taxes is the way to think about it--and to handle more and more of the inconveniences of getting money into and out of the system. Then we added financial planning and, most recently, we've added banking services. So basically, what we're trying to do is deliver a next-generation banking service that helps you with both your short-term and long-term financial needs, on the short-term side with an FDIC insured high-yield cash account and the long-term side with investment products.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Was that always part of the vision, though? When you came in day one as a CEO, was the vision always to expand into broader banking-related services? What was the catalyst for you guys branching out from that original robo advice offering?","<strong data-v-f87c67ca=\"\">Andy Rachleff&nbsp; <\/strong>Well, we thought that by automating everything that you get from your financial adviser, we would over time become your financial hub. And what we learned through building more and more products was that the two areas where we really differentiated from everybody else was our investments in things that you might not see day-to-day. And that is our automation engine and our advice engine. And as we thought about those two great strengths, we came to realize that our vision was to automate and optimize all of your finances, and one of our engineers simplified that to self-driving money, which is a lot pickier and makes people smile. And by that we mean that by the first half of next year, you'll be able to direct deposit your paycheck with us, we'll automatically pay your bills and then route the remaining money to the most appropriate account depending on your particular situation and goals. And we can figure all of that out by virtue of you linking up all of your financial accounts to Wealthfront. We bring all that data in, of course with your permission, and then apply artificial intelligence techniques to figure out what's in your best interest.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Well, you're certainly known for--at least in the time that I've known you, and we've had quite a number of interviews together--for your pithy and witty remarks. I think it was at the Fortune Montauk event that you talked about how millennials were not all pot-smoking basement dwellers. Do you think at the heart or one of the advantages of Wealthfront is a better understanding--and you talk about product-market fit all the time--better understanding of a market that is largely based on millennials and understanding the millennial client in a way has helped Wealthfront get to where it is today?","<strong data-v-f87c67ca=\"\">Andy Rachleff&nbsp; <\/strong>Sure. Look, we're totally, we're not mainly focused on millennials, we're totally focused on millennials. And I'm a big believer that by trying to appeal to everyone, you appeal to no one. When you really have a narrow focus, you learn about your customer at a faster rate and you're able to better serve them. And that's what's allowed us to have insights into our clients that allows us to build them compelling products, products that might be compelling for them, but might not be compelling for someone who's 50 or 60 or 70 years old, the traditional targets for financial services companies.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I think that having that more focused approach to your business allows you to get offerings and products to market quicker, because first you're able to target those specific offerings and then roll them out more quickly. I was joking with, I've been talking to a lot of people about this, but I was at an event I won't name the specific bank, but they had a fintech robo advice asset management demo session, and they had rolled out a revamp of their app, and they were really excited to showcase the functionality of allowing users to incorporate future windfalls or financial events as part of their broader financial planning, right? And as you know, and as a lot of people who might be listening know, that's been a functionality that Wealthfront has had for, I think at least over a year, if not two years, right?","<strong data-v-f87c67ca=\"\">Andy Rachleff&nbsp; <\/strong>And actually three years, Frank.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>So three years, right? So this is something that they're all excited about today--and that's not to beat on them or pick on them--but I think it speaks to a broader point of when you have a more focused approach to your business, you can get the things that people want more quickly to market than otherwise.","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>Well, also, we are a product-driven company and an engineering-driven company, more than 50 percent of our employees are engineers. I don't think you can say that certainly about the incumbent financial services providers or even other startups. You know, the funny thing about fin is I think as I've told you before, most fintech companies are big fin, little tech. We're little fin, big tech. So that feature in particular, I think, might have taken us one engineer two weeks to build, and here this financial institution you're describing is bragging about its capability. That's a tiny, tiny part of what we deliver.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Totally. 100 percent. And yet, well, I think we've seen three phases of developments in asset management and robo advising. And you can definitely disagree or agree with this point. I think we started out with the question of, \"Are these robo advisors ever gonna get any traction?\" People are gonna want that hand to hold them. And then, that kind of was debunked, and we moved into a phase of the big banks then trying to get on board with some of these robo advice type offerings, partnering with them, rolling out mock offerings, and now I think we're getting to a point where some of these firms have attempted to do this, and we're seeing degrees of failure to an extent. If you look at JP Morgan's fin offering, they kind of rolled that out and then not too soon after kind of sunset the product. And there have been corners of success, right? Goldman's Marcus has done an incredible job at growing and reaching new markets, especially for a firm that has just gotten into the retail business. Do you see any chance of, despite some of those failures, and despite them maybe not having as focused of an approach, do you see a potentiality for a big Wall Street bank with big tech money successfully incorporating some of the offerings of a Wealthfront?","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>I think they're all going to try. You know, it's really funny that when we started in the automated financial advice business, automated investing business, we said that someday there's going to be a day where every single investment provider is going to offer an automated solution. And people laughed at us. Guess what? That's what's going to happen. And we think the same thing is going to happen in the banking space. Now, I think that banks have two challenges in delivering a service like what we do. Number one is they don't put their customers' interests first. And this is why people hate them. You know, it's one of only two industries with a negative net promoter score, the other one being cable. And the reason that they're so hated is, for example, banks have eight trillion dollars of consumer deposits, and they pay them nothing for those deposits. You know, the average rate that you get paid on your checking account is something like .01 or .02 percent. So customers are losing out on almost one hundred and fifty billion dollars of interest that they could have earned if they had deposited their money with people like us. Our high-yield cash account pays 1.82%. Jamie Dimon, the CEO of JP Morgan Chase, was recently asked after I think the second of the three latest FED interest rate cuts, \"What are you going to do if interest rates go down?\" And without missing a beat, he said \"Increase fees.\" Well, can you imagine Amazon saying something like that? They never would. It's a mentality issue about putting their own balance sheet first, not their customers' interests first. So that's number one. Number two, financial services companies are not good at building software. They spend a lot of money on it. I think that J.P. Morgan Chase spends 11 billion dollars a year on what they call I.T., but they're not going to attract the best and brightest engineers, that's not where a great engineer wants to work. It doesn't matter how much money they have to spend if you can't attract good ones and you don't know how to do it, you end up with products like Fin, which was an unmitigated disaster, which is why they wrote it off. Marcus has done very well, but there is nothing tech about it, they don't even have a mobile app. All they did was offer a higher interest rate and they're about to cut their rate again, they haven't cut since the latest FED cut, but they'll have a lower interest rate than we do, they offer less FDIC insurance than we do--250k vs we offer a million dollars of FDIC insurance--and they limit it to only six withdrawals a month, whereas we are unlimited. So just as a banking product, we're better and we offer all of the software that makes your life more convenient and optimized, none of which they do.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Well, I think if you were to stack the products up, there might be, there are those differences, but as far as from an engineering perspective is concerned, I mean, Goldman Sachs is still 33%--at least the last time I checked--engineers. So, I wouldn't necessarily sleep on them per se.&nbsp; I think they might be the the one standout giant in the room that could actually execute on something. But to your point about software, to what degree do you see their software falling short? What type of insights do you have there?","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>Well, they don't have any, Frank. I mean, they have a website, but they don't even have a mobile app.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Sure.","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>It's 2019. And by the way, they've been in business with Marcus for, what, four or five years?","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Sure. Who then do you view as potentially being able to execute quickly on a financial product that aims directly at the millennial market? Or is there none?","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>I think there are a number of people that would like to be in that place. I think that you have SoFi coming from the lending world, you have Robinhood coming from brokerage, you have maybe Chime coming from the very low end, serving the unbanked and people living paycheck-to-paycheck, and you have people like us all vying to be the financial hub among those companies. The one company that also has very much of a software and product focus is Robinhood.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Sure, but even a lot of the companies you've mentioned, right, recently have stumbled, right? Robinhood had that glitch where you had infinite leverage in the crypto world. We know about 100x leverage on Bitmex, but not quite infinite leverage. Chime went dark for millions of companies I think last month or the month before. And so, even with that software-based approach, that quick, move fast and break things mentality might be something that is in the corner of the big banks, maybe.","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>Well, you're right. We've spent a lot of time, you know, for the last four years, we've dedicated a lot of engineers to our banking and brokerage automation platform and we've dedicated a lot of engineers to our advice engine. And these infrastructure investments don't show up in the near-term in features. As a matter of fact, that puts you at a disadvantage in the near-term because you're not delivering more visible value. But we haven't had those kinds of issues, which is, I think, why we generate the delight among our clients, which leads to our organic growth and why we're really pulling away from everyone else in terms of assets.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>What are the latest numbers around that customer growth AUM?","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>Well, I think we're up almost 120. Our assets are now at just under twenty-two billion dollars, which is about 120% growth from where we were at the beginning of the year.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>And what numbers are you looking to get to? We've had this conversation before about the discipline that going public adds to a company, and how that's definitely on Wealthfront's roadmap. Is there a specific place that you need to be before you do that, and when will you feel comfortable enough to tap into the public markets?","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>Well, you know, it's really funny, having been in venture capital for many, many years, I'm actually a fan of being public. I think that there's a false narrative about being public is a bad thing. I think it lends to your credibility, especially in a trust oriented business like financial services. I think it gives you an acquisition currency and you don't have to worry about quarter-to-quarter earnings. You know, the great CEOs like Reed Hastings and Jeff Bezos don't worry about that. It might lead to a more volatile stock, but that's okay. I don't know why your stock has to not have much volatility if you're trying to build a long-term great business. So I think that as you start to approach 100 million in revenue, you're ready to go public, and mutual fund investors for sure can find enough high-growth public companies in which to invest, so there is a dearth of companies from their perspective. So I think we ought to be in a position in 2021 to be able to do that. You know, but we're serving a market not just among millennials, but among millennials like you, Frank, who are doing really well in their careers and they're saving money they're in the wealth accumulation phase of their lives, as you said before. They're not living in their parents' basement smoking dope all day. So we find that if there are 90 million millennials, so people born between 1980 and 1995, then we think at least 20 million of them are doing quite well. And according to Deloitte, the millennials in total today have about 4 trillion of assets going to about 12 trillion by 2030, so in about 10 years, and we think that the millennials who are doing quite well in their careers represent well more than 20 percent of those of the total population, but probably 80 to 90 percent of the assets. So we think that if we can become the preferred choice for these millennials who are doing really well and who want more for their money, that we have a market of 10 trillion dollars available to us.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>My colleague Steven is laughing at me because he knows I'm not the best saver. Maybe if I were a Wealthfront client or customer, that would possibly change things.","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>You know, it's funny, Frank. The people who use our planning tools save 5 percent more of their income than the people who don't.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>5 percent more.","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>And boy that adds up over time.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Does that have to do with like, are there alerts, you know? You know, it's kind of like I see a lot of these products where it's like we're gonna alert you if you're spending over X amount or not saving Y amount, and I always wonder if those type of functionalities contribute to, you know, financial anxiety or financial fear or whatever have you.","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>You know, I'd like to believe that it's all the wonderful automated planning tools that we build. You know, people come for the high interest rate. They open accounts for high interest rates. And then they're actually surprised when they see the automated planning tools. So when you link up all of your financial accounts, we tell you what you're likely to be worth over time, given the rate at which you're spending, the rate at which your saving, and how they perform, the likely performance of the accounts in which you placed that money. And we tell you whether or not you can afford to buy a home, and how much of a home can you afford to buy in a particular neighborhood, for example, can you afford to send your kids to college? Just seeing the numbers in front of you often makes you save more because you want to make the outcomes look better. It's almost analogous to if you drive a Prius, there's a little display that shows you how far you can get on a tank of gas, and it causes you to drive a little differently, which gets you more mileage. So it's not through alerts. It's just showing people how they're doing causes them to change their behavior.","<strong data-v-f87c67ca=\"\">Steven Zheng <\/strong>Andy this is Steven. On the topic of millennials, seems like Wealthfront has taken like active steps to avoid supporting cryptocurrencies in their app. Am I right about that?","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>Well, we link to Coinbase so that we can see how much you own and factor that into what we advise you to do, but it's not part of our investment recommendation. That's correct.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>And I think that speaks to--go ahead, Steven.","<strong data-v-f87c67ca=\"\">Steven Zheng <\/strong>No, I was just asking: is there like a reason why, during this bull run of cryptocurrency that you're seeing with your peers like Square or Robinhood getting into that crypto game? Was there a sense of fear of missing out from the Wealthfront team, like \"Hey, maybe we should look into this cryptocurrency thing and look at ways that we could support it?\"","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>Well, we actually wrote a long blog post explaining our position in a post called \"A bit about Bitcoin.\" And in it, we explain that we are focused on time-tested, academically proven investment methodologies, which is why we offer an investment service that's based on a diversified and rebalanced portfolio of low-cost index funds. The research is very, very clear that people, even professionals over the long-term, are not good at outperforming the market. They actually way underperform the market. People like Robinhood serve do-it-yourself-ers who are trying to beat the odds that the research clearly shows are against them. And I'll bet you that if you evaluated the performance of Robinhood customers, it would be really, really bad. So we're trying to do for you what's best in the long-term, and as a former professional investor, one of the things that I have been taught is that in order for something to be an investment, it has to have a cash flow. If it doesn't have a cash flow, it's a speculation. So precious metals, as an example, are speculations, they're not investments. You don't see sophisticated investment firms ever buy precious metals. That's a speculation. And that's the reason why cryptocurrencies aren't part of our investment service. We tell people, \"Look, if you want to do that with your play money, you're welcome to do it, but you should keep that to less than 10 percent of your net worth.\"","<strong data-v-f87c67ca=\"\">Steven Zheng <\/strong>So are precious metals or oil or ETF following precious metals and oil is it not part of the commodities section of Wealthfront's portfolio?","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>No, we don't do such a narrowly-focused ETFs. We do broad market ETFs, which the research shows is a much better way to invest.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I think speaks to a broader point of Wealthfront. It won't ever be a one stop shop for everything when it comes to the entire financial landscape.","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>We're boring! I gotta tell you, what we do is unbelievably boring. But in the eight years that we've offered our service our average account has compounded at approximately 8 percent, and that's before the benefits and tax loss harvesting, which for most people has been around another 2 percent. If you could, if somebody were offered in hindsight 8 or 10 percent on their portfolio over the last eight years, I would say the vast majority of people would take that.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Sure. Looking back, I kind of want to go back to the IPO market for a second just because I know you have, I mean, you founded a venture capital firm, I think in 1995 or 96, Benchmark Capital? Obviously, they invested in, I mean, a number of firms, Snapchat, Uber, eBay. I think you were involved in Juniper Networks. So you have, I mean, that's just incredible insight into the V.C. landscape, and I'm sure you're still relatively plugged into that world, even if you don't necessarily want to be at times. What, in looking at like the market, if you were an investor seeing some of these crazy valuations and firms that have nothing to do with technology, like when we think about WeWork marketing itself as a tech company and then having this crazy high 50 billion dollar valuation only to plummet, how would you navigate that market as a V.C. if you had to allocate capital? I mean, it doesn't seem like an easy feat.","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>How would I navigate which market, Frank?","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>How would you navigate a market like today's if you were still a V.C.? One in which you have companies that aren't necessarily tech companies trying to label themselves as such, one in which there are these insane valuations, one in which companies are waiting longer and longer to go public. What would--","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>Well remember, there are different stages of investing. So most venture firms specialize by stage. There are early firms that focus on the very beginning of a company, seed funds. There's people who focus on the first institutional round like a Benchmark. And then there are growth-stage investors like Softbank. Momentum investing has come to dominate the late-stage investing world, and that's where a lot of the issues that you've described have surfaced. If you focus on early-stage companies, as Benchmark does, those issues really aren't a big deal. So looking for companies that have found product-market fit, they've proven their value hypothesis, but not yet proven their growth hypothesis. Those kind of opportunities provide incredible upside. There's a lot more risk around the late stage where people are just jumping to anything with momentum.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I think that's a really great distinction to make. How would you, or rather, what advice would you give to a late-stage investor in this, with this market dynamic?","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>Well, you know, in this case, I'm sort of like an angry old man.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Shouting at the clouds!&nbsp;","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>I think, you know, most momentum investing has been popular on and off throughout the years in public investing. It never made any sense to me because the fundamental premise behind momentum investing is you're most attracted to stocks that are up the most. That's the opposite of what I was taught. You want to look for companies that are out of favor because they're non-consensus. So it's sort of doubling down on consensus. And then the challenge is getting out before the market cracks. Amazingly, that style of investing has come to the private company world, where if a company raises money at a billion dollars, that actually attracts money at five billion dollar valuations, just by virtue of the fact that its valuation went up a lot. So I don't get that, and I don't get wanting to only invest in the companies that everybody else wants to invest in. It makes more sense to me to look for companies where there's a little bit of a leap of faith, but one, based on your experience, you're willing to take because without risk, there's seldom return.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Sure. And it's kind of funny. Maybe you don't think it's as funny, but just someone who played such a big role in making these active big bets now is spearheading the move towards passive and advocating for sticking to boring investment opportunities and locking it up and keeping it safe. But there's a religious, and we've talked about this, too. There's a religious--","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>But that's because, that's because that's best practice. You know, passive investing doesn't work for venture. As a matter of fact, the average venture return is horrible. It's been a consistent fact in the venture industry that something on the order of 3 percent of the venture capital firms generally 95 percent of the realized returns of the industry. The average return of the asset class is horrible. Especially on a risk-adjusted basis. So I recommend against investing in the venture capital asset class unless you can get into one of those 20 premium firms.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>What was your come to Jesus moment?&nbsp;","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>What do you mean?","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Was there a moment where you realized, you know, if you were leading a V.C., at some point, I imagine you must have thought that it was an attractive asset class. Or was that just because you were at a good firm?","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>Oh, no. It had nothing to do with that. Sure he did. You see Benchmark has a unique structure, which is the key to its success, and that is it's an always equal partnership. In contrast, every investment partnership I know and almost every professional services partnership I know is hierarchical, meaning the senior people own more of the economics than the junior people. But one of the things that we came to realize, when the founders of Benchmark were younger in the venture business, was that most of the returns of venture firms are generated by their youngest partners, yet the oldest partners keep all the equity. So we decided to do something very, very different to build a firm that could last. And we were influenced by a book called Built to Last when we created this strategy. We decided to build an always equal partnership such that the young people would earn just as much as the older people, and the only way to have enough pie to go around is that when the older people got to the point that they weren't willing to kill themselves and work 110 percent on the business, they had to opt-out of some so as to make way and make room for the younger partners to earn their fair share. And the nice thing is that we've done that successfully where actually, all the founders have retired Benchmark after 25 years, and we're now actually on the third generation of Benchmark partners. So it's wonderful that we've been able to attract better people than other venture firms can to be our partners because it's an intelligence test. Would you rather join Benchmark as an equal partner, or would you rather join another firm as a junior partner? It allows them to get better people and that helps the returns persist.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I don't think I have the stones to join a V.C. firm or an investing firm of any nature. But in any case, what I'd love to know, Andy, what was the deal that got away or that you wish you were a part of back during the late 90s or just the halcyon days of tech investing? Is there any that comes to mind?","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>&nbsp;Sure. We turned down Google.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I'm sorry to hear that.","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>Well, we beat ourselves up over that over and over and over again.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>But what didn't you buy? Why didn't you buy into at the time, or what didn't the firm buy into when it came to Google?","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>Well, there were a number of issues, any of which could have been overcome, but it was the combination of all of them. Had it only been a portion of those issues, I think we would have taken the leap, but we just weren't willing to take on the three main issues that we faced that I'd rather not disclose. And that was a really, really, really stupid decision.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Yeah. Well, there's always a few--everyone has one decision that they regret or wish they could come back to.","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>Frank, that's a pretty bad one.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>So I kind of want to go back to--and we've talked about this before--just how religious the idea of passive is. And, you know, there are people out there who can be overzealous about different choices made by firms like Wealthfront or others. You know, when you guys rolled out tax loss, harvesting or risk parity, there are voices who say, well, now you're moving further and further away from what is true blue passive investing. And you guys have kind of been at the forefront of addressing some of those questions. I just think it might be interesting to explore the religious idea of passive and what Wealthfront's view on that is.","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>You know, what we have come to learn is that the three pillars of our value proposition in all of our services and our banking services and our investment services are price, simplicity and automation, that we always want to offer the best price. If it's an interest rate, it's the highest interest rate. If it's a fee, it's the lowest fee. We want to make things incredibly simple because that makes it easier to understand and easier to tell your friends about. And we don't want to deliver anything unless it can be automated. What we've learned is that people confuse something not being passive with being complex. So, for example, tax loss harvesting. There is nothing active about it. We are not applying any judgment to pick individual securities, we're just taking advantage of this amazing loophole in the tax code that you can, if a security is traded down, you can recognize that loss and use that loss against your income to lower your taxes. And if you replace the security that you sold with a similar but not identical one, you maintain the risk and return characteristics of the portfolio, but you've recognized the loss. So you're no worse off than you would have been, but you have this benefit of taxes. There's nothing active about that in the sense that you're not trying to either time the market or identify an individual security. So that's pretty simple and straightforward. There are more and more ways to eke out returns. Taking passive approaches where you don't try to time the market or choose individual securities, but as they get more arcane, people attribute activeness to them when they're not at all active. For example, risk parity is just a different way to allocate a portfolio. It doesn't take the whether or not the market is undervalued or overvalued into consideration, but because it was first popularized by a firm that's known as a hedge fund, people incorrectly think it's a hedge fund product, which is not.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>What about, thinking about some of the more frustrating parts of leading a financial services company, I had the former CEO of Nasdaq on the podcast. He noted regulators are, you know, when he stepped into the role from the technology world, it was not only frustrating, but it was just new and different because it wasn't necessarily something he had to think so much about before stepping into the role of leading a market, right? Which was highly regulated. I think from my perspective, covering a lot of cryptocurrency firms, there are two approaches CEOs like to take: either hide in the shadows for fear of reprisal from regulators about the way they're operating their business or kind of try to engage but battle vehemently on whether or not a certain thing would be defined within the context of a regulated financial product. And I think those are the two approaches from your seat over the past several years, were regulatory discussions, hiccups, headaches, one of your frustrations? And if it wasn't, what might have been?","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>You know, it's actually a minor inconvenience. We're really fortunate in that a year ago, a little over a year ago, we recruited a fellow who had been the Chief Compliance Officer at J.P. Morgan's broker-dealer, and who had two stints at the FCC to be our Chief Compliance Officer. And he's just marvelous. Everything that we do he runs by the regulators well in advance of when we ship them so we know what the issues are. So are we able to say everything that we would like to say? No. We're actually more frustrated by some of our competitors not living up to the rules than we are with the regulators imposing negative things on us. So it's not a cause of great frustration. It's not something I think about very often because our Chief Compliance Officer does such a good job. You know the thing that drives me crazy is the economic policy of our government, the idea of cutting interest rates to finance a trade war is just wacky. Most people don't realize that in 2018, there were more outflows from mutual funds than there were in the financial crisis. That there were two corrections in a bear market in 2018, which scared the bejesus out of people. And it doesn't need to be that way. Life can be a hell of a lot simpler if we don't do a bunch of the goofy things that we're trying to do. And when there's uncertainty, people pull back from investing, which is really bad, because academic research clearly shows that you should not let the state of the market impact the rate at which you invest. You should just keep on investing your money month in and month out, whether the market's up or the market's down. It has very little impact on your overall outcome. But the wackiness of our administration, that's what frustrates me, because of the impact that it has on the psyche of the individual investor, and causes them to behave badly. You know, behave badly for their own net worth.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>But does that have an impact, necessarily, on outflows from Wealthfront and other robo advisors? Whenever there is anxiety over, whether it's President Trump's trade war or whatever have you, you know, does the money stay put?&nbsp;","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>We are really lucky in that, and most people are surprised by the fact that our clients don't withdraw money in bad markets. We're really, really unusual in that regard. But what they do is they hit the brakes on adding more money. So our growth slowed last year on the investment side. As I said before, we're up, our assets are up 120 percent this year to almost 22 billion. But last year, we grew something, our investment assets, something on the order of 25 percent when the outflows from the mutual fund market were enormous. So we way, way outperformed financial, the investment industry in general. That being said, look, it would have been better for us if people kept on depositing, but it would have been better for our clients that they kept on depositing because guess what? They would have, their portfolios would be much higher had they done that.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I think there are skeptics, Andy, still out there who would say you haven't really seen a major, major--whenever there's a 50 percent drawdown, then they'll up the ante to 20 percent or 25 percent, but I think there is some credence to say we haven't had a financial crisis-like event while firms like Wealthfront have been on the line, so a 2008-type event. And that's where the guys at, you know, the bigger firms will say, well, let's just see what Andy and Co will do when something like that happens.","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>I always get a kick out of that because that was an event that was an 80 year event that nobody ever talks about. Other investment firms about how are you going to react to an 80 event? Since we started we've had something like seven corrections and one bear market, and it literally no impact on us. So that argument always cracks me up because we always do better in corrections and the one bear market that we faced than the traditional investment firm.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>And I think another argument that can be made is if that were to happen, everyone would be in a dire situation, potentially not just--","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>They would be far worse off with the others than they would have been with us.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I think a good way to wrap up the conversation is that wealth transfer. Do you anticipate some of your clients who are in a pretty good financial situation want some more of--once some of that wealth continues to pour in and they go maybe into a next higher bracket from maybe close to a millionaire to multi multi-millionaire net worth--once those millennials, this is another argument, I think, that floats around the asset management world. Once those millennials inherit some of that wealth from that big transfer that's somewhat under-way, do you anticipate those clients who go from being close to a millionaire to then having multi-, multi-millions of dollars leaving Wealthfront? I think once you said that that would make sense given that you have a very particular focus on more upper-middle than upper-upper-middle or high net worth.","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>You know, it's a function of how well we do with our self-driving money vision, which is our total focus. If you have put all of your finances on autopilot and money, your paycheck is direct deposited with us, and we're paying your bills, and we're sending the money to your savings accounts, not your savings account, but your cash account, your high-yield cash account if you're saving to buy a home, or sending the money to your kid's college account if you were married with kids, we're putting in the investment account. Are you really going to unplug all of that to have to deal with someone you have to talk to? For people in our target demographic, I just can't imagine they're going to do that because they go to unbelievable lengths to avoid having to meet with or talk to service providers. They want everything to be done automatically.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I was just going to say and here comes the classic Andy line, which you say almost every time you give an interview or are on a panel, that your clients pay you guys to not talk to them.","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>Exactly. Thank you for doing it for me, Frank. It's true. Our clients pay us not to talk to them. Now, we have we are phenomenal customer support. All of our customer support reps are licensed, many of them even have financial advisor licenses. But they're there to provide technical support, not financial advice. The software does a much better job of managing your finances than any person could.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>And we shall see. That's the million-dollar bet. And we appreciate you coming on and talking about your vision for Wealthfront, the journey of yourself as its CEO, and your time in venture capital land. Hope you enjoyed it and hope to talk to you soon.","<strong data-v-f87c67ca=\"\">Andy Rachleff <\/strong>I always enjoy it, Frank.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Thank you so much. And thank you, Steven, for the crypto questions, over in the peanut gallery. Well, we appreciate it. Thank you, Andy. We appreciate you coming on!","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reed Hastings","content":"PERSON"},{"type":".02 percent","content":"PERCENT"},{"type":"Marcus","content":"PERSON"},{"type":"FCC","content":"ORGANIZATION"},{"type":"Amazon","content":"LOCATION"},{"type":"1980","content":"DATE"},{"type":"Steven Zheng","content":"PERSON"},{"type":"million dollars","content":"MONEY"},{"type":"J.P. Morgan","content":"ORGANIZATION"},{"type":"Wealthfront","content":"PERSON"},{"type":"Benchmark","content":"ORGANIZATION"},{"type":"10 trillion dollars","content":"MONEY"},{"type":"Spotify","content":"LOCATION"},{"type":"Frank","content":"PERSON"},{"type":"I.T.","content":"LOCATION"},{"type":"5 percent","content":"PERCENT"},{"type":"fifty billion dollars","content":"MONEY"},{"type":"1.82%","content":"PERCENT"},{"type":"2030","content":"DATE"},{"type":"20 percent","content":"PERCENT"},{"type":"50 percent","content":"PERCENT"},{"type":"J.P. Morgan Chase","content":"ORGANIZATION"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"95 percent","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"2 percent","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Steven","content":"PERSON"},{"type":"33%","content":"PERCENT"},{"type":"two billion dollars","content":"MONEY"},{"type":"last year","content":"DATE"},{"type":"11 billion dollars","content":"MONEY"},{"type":"Uber","content":"ORGANIZATION"},{"type":"Trump","content":"PERSON"},{"type":"Wealthfront","content":"ORGANIZATION"},{"type":"Andy Rachleff <\/strong>Well","content":"PERSON"},{"type":"10 percent","content":"PERCENT"},{"type":"Andy Rachleff <\/strong>Frank","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"a billion dollars","content":"MONEY"},{"type":"last four years","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"8 percent","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"50 billion dollar","content":"MONEY"},{"type":"22 billion","content":"MONEY"},{"type":"Wealthfront","content":"LOCATION"},{"type":"Andy Rachleff&nbsp; <\/strong>Thank","content":"PERSON"},{"type":"120%","content":"PERCENT"},{"type":"Andy","content":"PERSON"},{"type":"Jeff Bezos","content":"PERSON"},{"type":"April of this year","content":"DATE"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"120 percent","content":"PERCENT"},{"type":"eight trillion dollars","content":"MONEY"},{"type":"JP Morgan Chase","content":"ORGANIZATION"},{"type":"Andy Radcliff","content":"PERSON"},{"type":"1995","content":"DATE"},{"type":"Steven Zheng <\/strong>Andy","content":"PERSON"},{"type":"Snapchat","content":"LOCATION"},{"type":"Frank Chaparro <\/strong>Totally","content":"ORGANIZATION"},{"type":"Chaparro <\/strong>Shouting","content":"PERSON"},{"type":"V.C.","content":"LOCATION"},{"type":"Jamie Dimon","content":"PERSON"},{"type":"Co","content":"ORGANIZATION"},{"type":"2008","content":"DATE"},{"type":"3 percent","content":"PERCENT"},{"type":"V.C.","content":"ORGANIZATION"},{"type":"Juniper Networks","content":"ORGANIZATION"},{"type":"110 percent","content":"PERCENT"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Andy Rachleff&nbsp; <\/strong>Well","content":"PERSON"},{"type":"Deloitte","content":"ORGANIZATION"},{"type":"Chaparro <\/strong>Thank","content":"PERSON"},{"type":"Skype","content":"ORGANIZATION"},{"type":"Chaparro <\/strong>Well","content":"PERSON"},{"type":"Andy Rachleff","content":"PERSON"},{"type":"90 percent","content":"PERCENT"},{"type":"Softbank","content":"ORGANIZATION"},{"type":"25 percent","content":"PERCENT"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}