{"summary":"Defi startup Dharma announced Wednesday that it will start to support peer-to-peer lending of USDC, in a push to engage mainstream investors. &quot;This will","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/24394\/dharma-now-supports-peer-to-peer-lending-in-usdc-to-attract-mainstream-investors-to-defi","publishDate":"2019-05-22T15:14:34","id":7217,"type":null,"title":"Dharma now supports peer-to-peer lending in USDC to attract mainstream investors to DeFi","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Defi startup Dharma announced Wednesday that it will start to support peer-to-peer lending of USDC, in a push to engage mainstream investors.<\/span>","<span data-v-f87c67ca=\"\">\"This will unlock a new set of users that would be comfortable using Dharma,\" Dharma Business Development Manager Max Bronstein told The Block. \"It actually allows the mainstream to enter DeFi.\" <\/span>","<span data-v-f87c67ca=\"\">Previously, the only stablecoin that Dharma supports was Dai, which is backed by ether and therefore is “more risky given its design,” according to Bronstein. In comparison, USDC is backed by US dollars held in traditional bank accounts, the risks of which are better understood by investors. <\/span>","<span data-v-f87c67ca=\"\">“Some customers like to be above board and regulated, so then USDC kind of fits that,\" Bronstein said.<\/span>","However, although Dharma may recruit some retail customers through listing a regulated stablecoin like USDC, it may do little to help attract institutional customers, which require know-your-counterparty procedures in place to participate in lending markets.","<span data-v-f87c67ca=\"\">The San Francisco-based company is also expecting the addition to bring more liquidity to its platform. With $123 million worth of d<\/span><span data-v-f87c67ca=\"\">aily trading volume, USDC is among the more popular stablecoins.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"People who need to get in and out of cryptocurrency easily without getting a lot of price slippage is where we see a lot of USDC demand,\" said Bronstein. <\/span>","<span data-v-f87c67ca=\"\">To be sure, there is a possibility that the firm may not win as much investor interest as it hopes. One market observer said that Dharma customers usually use their borrowed coins on decentralized exchanges, on which DAI is much more liquid than USDC. Therefore the addition of USDC may not spark much interest among investors who favor DeFi. <\/span>","<span data-v-f87c67ca=\"\">Nevertheless, Bronstein believes USDC would attract people who are more comfortable earning interest on dollars, bringing the liquidity the DeFi ecosystem “desperately needed.” <\/span>","<span data-v-f87c67ca=\"\">“You don't want to undersell the idea of people being able to earn interest in dollars. So it's almost like economic empowerment we think. I think that's pretty powerful,” said Bronstein. <\/span>","<span data-v-f87c67ca=\"\">Dharma users can borrow USDC by putting up a collateral of 1.5X their loan. Under the current Dharma loan model, they are expected to<\/span><a href=\"https:\/\/blog.dharma.io\/how-dharma-works-under-the-hood-3d7bb9042381\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">pay the coins back to the lenders within 90 days<\/span><\/a><span data-v-f87c67ca=\"\">. Meanwhile, lenders can<\/span><a href=\"https:\/\/www.dharma.io\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">earn an 8% interest<\/span><\/a><span data-v-f87c67ca=\"\"> by lending their USDC to others. For Dai, the interest rate is 14%. <\/span>","<span data-v-f87c67ca=\"\">So far, Dharma has facilitated<\/span><a href=\"https:\/\/dharmalytics.io\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">over $10.4 million<\/span><\/a><span data-v-f87c67ca=\"\"> worth of crypto loans with a total of over 3,000 loans issued. Moving forward, Bronstein said the firm is open to including other stablecoins such as PAX and TUSD to its platform as well.<\/span>","<span data-v-f87c67ca=\"\">\"It will come down to customer demand and assuming that, from a regulation standpoint, we are okay to list it. If those things work, we are happy to support whatever the market wants,\" said Bronstein.<\/span>","USDC is a stablecoin from the CENTRE Consortium, a partnership between Circle and Coinbase.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"8%","content":"PERCENT"},{"type":"Dai","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$123 million","content":"MONEY"},{"type":"PAX","content":"ORGANIZATION"},{"type":"Dharma","content":"ORGANIZATION"},{"type":"Dharma Business Development","content":"ORGANIZATION"},{"type":"CENTRE Consortium","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"14%","content":"PERCENT"},{"type":"USDC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Dharma","content":"LOCATION"},{"type":"Max Bronstein","content":"PERSON"},{"type":"Bronstein","content":"PERSON"},{"type":"$10.4 million","content":"MONEY"}],"hashtag":["USDC"],"authors":["Celia Wan","The Block"]}