{"summary":"Bitcoin&#x27;s surging prices with a relatively slow growth of mining difficulty are great news to incumbent miners – at least for now.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/93828\/bitcoin-mining-slow-difficulty-growth-2021","publishDate":"2021-02-05T14:27:00","id":722,"type":null,"title":"Bitcoin miners may love slow difficulty growth, but how long will it last?","category":["BITCOIN"],"content":["Up-and-running bitcoin miners may have enjoyed the relatively slow growth of the network's mining difficulty over the past few months, in comparison to bitcoin's eye-popping price increases.","After a small 1% growth on January 23, bitcoin's mining difficulty is set to adjust above 21 trillion before this weekend, an increase of about 3% compared to the current level of 20.8 trillion.&nbsp;Meanwhile, bitcoin's price is now&nbsp; $38,000, representing a significant increase from mid-October when the market started to move above $11,000.","During the same period, bitcoin's mining difficulty and hashing power have lagged behind the surging prices, leading bitcoin's mining revenue per terahash-second of computing power to highs not seen since August 2019.","<iframe title=\"Bitcoin Miner Revenue per TH\/s (7DMA)\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-miner-revenue-per-th-s-7dma\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","The difficulty, as the name implies, is a determining factor in how \"hard\" it is to mine a block, or specifically to find a hash below a given numerical target. The difficulty level shifts based on how much processing power is connected to the network and is adjusted roughly every two weeks.&nbsp;","Although bitcoin's mining difficulty did adjust to a new <a href=\"https:\/\/www.theblockcrypto.com\/linked\/90633\/bitcoin-mining-difficulty-new-high-20-trillion\" data-v-f87c67ca=\"\">all-time high<\/a> on January 9, it actually only increased by 3.5% compared to the previous high of 19.9 trillion, recorded on October 18.&nbsp;","As The Block reported at the time, bitcoin's mining difficulty adjusted a <a href=\"https:\/\/www.theblockcrypto.com\/post\/82404\/bitcoin-hashrate-miners-migrate\" data-v-f87c67ca=\"\">negative growth<\/a> of 16% in late October. This development was due to Chinese miner operators migrating from hydropower stations in Sichuan and Yunnan provinces to fossil-based power plants in the northern Chinese territories of Xinjiang and Inner Mongolia.","After these miners gradually came back online — while new shipments of machines hit the market around the same time — the network's hash rate began increasing again amid bitcoin's price jump throughout Q4.&nbsp;","A combination of factors appears to be behind the relatively slow growth of the mining difficulty so far, which – at least for now – may be welcome news for those with active mining operations.","The shortage of wafers from the world's biggest semiconductor firms such as Samsung Foundry and TSMC have led to limited supplies of the newest bitcoin mining equipment from Chinese manufacturers despite increasing demand from their customers.","Preorders for top-of-the-line mining hardware made by Bitmain and MicroBT are <a href=\"https:\/\/www.theblockcrypto.com\/post\/88151\/bitcoin-mining-hardware-bidding-war\" data-v-f87c67ca=\"\">already sold out<\/a> until the second half of 2021. Over the past several months, multiple mining farm operators, especially North America-based facilities, have <a href=\"https:\/\/www.theblockcrypto.com\/linked\/92848\/blockstream-bitcoin-mining-hardware-microbt\" data-v-f87c67ca=\"\">announced<\/a> news of procuring the newest hardware ranging from several thousand units to as many as 70,000 units in a single order.&nbsp;","Some large preorders since December include 58,000 units of Bitmain's AntMiner S19 and S19 Pro as well as 6,000 Canaan's Avalon 1246 purchased by Core Scientific, 15,000 AntMiner S19s from Riot Blockchain, 70,000 S19s from Marathon Patent Group, 14,000 units of MicroBT's WhatsMiner M30S from Compute North as well as $25 million worth of M30S purchased by Blockstream.","\"Some of the orders that have been lining up since December are massive. Some of these orders are expected to be fulfilled by Q2, so we might see a sizable increase in difficulty around that time,\" said Dmitrii Ushakov, the chief commercial officer for BitRiver, which provides mining colocation services in Russia and Central Asia.","So far, Argo and Riot have each said that about 1,000 units of their preorders are currently being shipped. Marathon said this week that the delivery of 4,000 units of its S19 Pros on-order has also <a href=\"https:\/\/www.globenewswire.com\/news-release\/2021\/02\/01\/2167298\/0\/en\/Bitmain-Ships-4-000-Antminer-S-19-Pro-ASIC-Miners-to-Marathon-Patent-Group.html\" data-v-f87c67ca=\"\">started.<\/a>","Meanwhile, China has been undergoing a period of energy rationing in the past few months amid a shortage of coal-based power. Affected regions, including Inner Mongolia, have curbed industrial utility to prioritize residential demand, according to December reports by <a href=\"https:\/\/www.spglobal.com\/platts\/en\/market-insights\/latest-news\/coal\/121720-four-chinese-regions-limit-power-usage-amid-shortages-industry-sources\" data-v-f87c67ca=\"\">S&amp;P Global<\/a> and <a href=\"https:\/\/www.nytimes.com\/2020\/12\/21\/world\/asia\/china-electricity-coal-shortage.html?_ga=2.251244161.664390705.1612505440-1739556375.1612505440\" data-v-f87c67ca=\"\">The New York Times<\/a>.","While it's hard to gauge the exact impact of this power shortage on mining farms, local industry players told The Block that some mining facilities have indeed been cut off from their power supply and are on a waiting list to get back online.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"October 18","content":"DATE"},{"type":"1246","content":"DATE"},{"type":"Mongolia","content":"LOCATION"},{"type":"Marathon Patent Group","content":"ORGANIZATION"},{"type":"Xinjiang","content":"LOCATION"},{"type":"$11,000","content":"MONEY"},{"type":"Samsung Foundry","content":"ORGANIZATION"},{"type":"Yunnan","content":"LOCATION"},{"type":"Riot Blockchain","content":"PERSON"},{"type":"Russia","content":"LOCATION"},{"type":"S&amp;P Global","content":"ORGANIZATION"},{"type":"$25 million","content":"MONEY"},{"type":"$38,000","content":"MONEY"},{"type":"second half of 2021","content":"DATE"},{"type":"this weekend","content":"DATE"},{"type":"Sichuan","content":"LOCATION"},{"type":"Compute North","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"Blockstream","content":"PERSON"},{"type":"North America","content":"LOCATION"},{"type":"3.5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"December","content":"DATE"},{"type":"January 23","content":"DATE"},{"type":"January 9","content":"DATE"},{"type":"The New York Times","content":"ORGANIZATION"},{"type":"16%","content":"PERCENT"},{"type":"Dmitrii Ushakov","content":"PERSON"},{"type":"Central Asia","content":"LOCATION"},{"type":"1%","content":"PERCENT"},{"type":"August 2019","content":"DATE"},{"type":"October","content":"DATE"},{"type":"TSMC","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Wolfie Zhao","The Block"]}