{"summary":"The crypto exchange also participates in Rocket Pool&#x27;s Oracle DAO and runs &quot;several hundred&quot; Rocket Pool nodes using corporate ETH. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244189\/coinbase-ventures-invests-in-rocket-pool-via-rpl-token-purchase","publishDate":"2023-08-10T11:11:57","id":7221,"type":null,"title":"Coinbase Ventures invests in Rocket Pool via RPL token purchase","category":["PRIVATE INVESTMENTS"],"content":["Coinbase Ventures, the investment arm of crypto exchange giant Coinbase, made a strategic investment in the liquid staking protocol Rocket Pool.&nbsp;","Rocket Pool lets individuals fund new validators and earn rewards, even if they hold less than the minimum amount needed to fund an Ethereum network validator node on their own.","Coinbase invested in Rocket Pool by buying an undisclosed sum of RPL, the protocol's native token that currently trades at $28.35 with a market capitalization of $556 million.","\"Rocket Pool is a leading liquid staking network on Ethereum, allowing users to stake ETH while retaining liquidity. With an emphasis on decentralization, the <a href=\"https:\/\/www.theblock.co\/post\/232862\/ethereum-liquid-staking-protocol-rocket-pool-deploys-on-zksync-era\" data-v-f87c67ca=\"\">Rocket Pool<\/a> network now consists of over 3,100 node operators with more than 780,000 ETH staked,\" the firm <a href=\"https:\/\/twitter.com\/cbventures\/status\/1689639108837249024\" data-v-f87c67ca=\"\">wrote<\/a> on social media.","Along with financially supporting Rocket Pool, Coinbase participates in Rocket Pool's Oracle DAO and uses \"ETH from our corporate balance sheet to operate several hundred nodes on the Rocket Pool network,\" the firm added.","\"In addition to our efforts this Onchain Summer with the <a href=\"https:\/\/www.theblock.co\/post\/243899\/base-mainnet-onchain-summer\" data-v-f87c67ca=\"\">launch<\/a> of Base mainnet, we believe scaling Ethereum’s infrastructure in a safe, decentralized manner is critical to bringing the next billion users on-chain.\"","Coinbase did not immediately respond a request for comment from The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Oracle DAO","content":"ORGANIZATION"},{"type":"Summer","content":"DATE"},{"type":"RPL","content":"ORGANIZATION"},{"type":"$556 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$28.35","content":"MONEY"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}