{"summary":"Paul Brody, the director of Ernst &amp;amp; Young’s global blockchain team, said he knew the 2018 crypto price plunge was coming, calling it &quot;the single most","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/8415\/ey-blockchain-chief-calls-2018-crypto-bear-market-the-most-predictable-in-years","publishDate":"2019-01-23T13:41:50","id":7226,"type":null,"title":"EY Blockchain chief calls 2018 crypto bear market &#x27;the most predictable in years&#x27;","category":["MARKETS"],"content":["Paul Brody, the director of Ernst &amp; Young’s global blockchain team, said he knew the 2018 crypto price plunge was coming, calling it \"the single most predictable bear market in years.\"","In an interview with The Block, Brody, who three years ago established the firm’s blockchain innovation sector, said the team's cautious approach to the ICO market and the atypical price-cycle of 2017 meant the bear cycle had “almost no impact” either internally or on clients.","EY reportedly has at least <a href=\"https:\/\/www.ey.com\/lu\/en\/newsroom\/pr-activities\/articles\/article_20180706-blockchain-invisible-infrastructure-and-nimble-networks\" data-v-f87c67ca=\"\">150 crypto related clients<\/a>, overwhelmingly made up of large financial institutions. They consult on blockchain innovation and the crypto market as well as providing auditing services for companies who hold digital assets in their treasuries.","“I’ve worked in Silicon Valley, I’ve done five startups. The idea that sensible venture capitalists would give you $50m for a white paper, would never happen…Their methodology actually makes a lot of sense,” said Brody on his rationale for guessing the crypto market would fall.","As for what’s next, Brody is again confident in his forecast.&nbsp;“The next couple of years is going to be super boring. Any idea of some kind of quick bounce back is ridiculous,\" he said.","Brody added that the EY Board is not “panicked” by the price, and that they remain committed to “the biggest advance in transaction software in 50 years.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ernst &amp; Young’s","content":"ORGANIZATION"},{"type":"Paul Brody","content":"PERSON"},{"type":"Brody","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"ICO","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"$50m","content":"MONEY"},{"type":"EY Board","content":"ORGANIZATION"},{"type":"2018","content":"DATE"}],"hashtag":["CRYPTO"],"authors":["Isabel Woodford","The Block"]}