{"summary":"Japanese gaming giant Sony Interactive Entertainment is trying to patent a system for tracking unique in-game digital assets using tokens on a distributed ledger.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187949\/sony-tries-to-patent-nft-and-blockchain-technology-usage-in-games","publishDate":"2022-11-17T05:40:17","id":7227,"type":null,"title":"Sony tries to patent NFT and blockchain technology usage in games","category":["GAMING"],"content":["Japanese gaming giant Sony Interactive Entertainment is trying to patent a system for tracking unique in-game digital assets using tokens on a distributed ledger.","Last week, the World Intellectual Property Organization published details of the <a href=\"https:\/\/patentscope.wipo.int\/search\/en\/detail.jsf?docId=US378324956\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">patent<\/a>, which was filed last year. It suggests Sony is looking at how to incorporate NFTs and blockchain into its games.","The patent outlines claims on techniques and technologies for creating, modifying, tracking, authenticating, and\/or transferring unique digital assets associated with a video game, including in-game items and characters. It describes in broad terms how new blocks can be generated to identify changes to the history of the digital asset, and how this would extend the functionality of in-game assets.","If that sounds like technology already used by every blockchain game in existence, the patent office appears to think so too. The patent in its present form has already been rejected for failing to \"integrate the abstract idea into a practical application.\" It will need an update if Sony wishes to continue the process.&nbsp;","“This can go back and forth for years before a (typically much narrower) patent is allowed or the application is abandoned. Other companies implementing blockchain-based game assets should monitor applications such as this, but there are not yet grounds to be worried,” said intellectual property attorney Paul Coble of law firm Harris Bricken Sliwoski.","Sony has previously explored using blockchain technology for music copyright management and education but this is the first hint that it’s interested in how it might be used in gaming.","Its latest move follows other gaming giants like Bandai Namco and Square Enix, which have also signalled interest in and support for integrating blockchain and NFTs.","Not everyone is as eager. Despite <a href=\"https:\/\/www.theblock.co\/post\/182099\/microsofts-latest-web3-investment-is-in-south-korean-gaming-firm-wemade\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">investments<\/a> in crypto companies, Microsoft has distanced itself from NFTs on several occasions. Its gaming arm in particular remains wary of the technology.","In July, Mojang Studios, which Microsoft acquired in 2014, <a href=\"https:\/\/www.theblock.co\/post\/158759\/minecraft-developer-mojang-to-restrict-use-of-nfts-blockchain-tech-with-guideline-update\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a> NFTs and other blockchain technology were \"generally not something we will support or allow” in Minecraft. It was opposed to NFTs on the grounds that their use would create a culture of unequal access within the game.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Sony Interactive Entertainment","content":"ORGANIZATION"},{"type":"Harris Bricken Sliwoski","content":"PERSON"},{"type":"Paul Coble","content":"PERSON"},{"type":"Minecraft","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Sony","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Square Enix","content":"ORGANIZATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Bandai Namco","content":"ORGANIZATION"},{"type":"the World Intellectual Property Organization","content":"ORGANIZATION"},{"type":"Mojang Studios","content":"ORGANIZATION"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}