{"summary":"Ethereum staking network SSV, which utilizes distributed validator technology, has launched its permissionless mainnet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267244\/ethereum-staking-ssv-network-permissionless-launch","publishDate":"2023-12-12T11:55:02","id":7230,"type":null,"title":"Ethereum staking network SSV launches permissionless mainnet","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\"><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/256951\/ssv-network-ssv-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ssv.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">SSV<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +1.65%\n    <\/span><\/a> <!----><\/span> Network, an Ethereum staking infrastructure provider, has released its permissionless mainnet, becoming the first project to achieve this milestone using \"distributed validator technology\" or DVT.<\/span>","DVT enables Ethereum validators to share responsibilities with multiple parties, preventing single points of failure and improving overall resilience. With SSV Network's permissionless launch, anyone will be able to stake and contribute to the overall health of Ethereum, the project said.","\"SSV is the first DVT network to go permissionless,\" Alon Muroch, core team founder of SSV Network, told The Block. \"DVT has the potential to make Ethereum much more secure and safe, solving major challenges like decentralization and censorship resistance.\"","The current Ethereum staking scenario raises centralization concerns, with a few major staking service providers holding substantial control over the process. Lido and Coinbase alone, for instance, <a href=\"https:\/\/dune.com\/hildobby\/eth2-staking\" data-v-f87c67ca=\"\">control 46% of Ethereum staking market share<\/a>. Ethereum co-founder <a href=\"https:\/\/www.theblock.co\/post\/253734\/vitalik-buterin-contemplates-ethereum-staking-changes-in-blog-post\" data-v-f87c67ca=\"\">Vitalik Buterin has also expressed concerns<\/a> about the concentration of Ethereum's staking providers and has listed distributed validators among the blockchain's top priorities since at least 2021.","Lido has been in talks with SSV Network to enhance the decentralization of its operations. \"We are in our third testing round with Lido and expect to hit mainnet with Lido in the first quarter of next year,\" Muroch said. When asked if SSV is also in talks with Coinbase and other centralized exchanges such as Binance and Kraken, Muroch said he can't comment on that, but SSV is discussing DVT \"with everyone.\"","SSV DAO aims to boost the adoption of its DVT network by offering token rewards. The DAO recently approved a year-long incentivization program, allocating 1 million SSV tokens (currently valued <a href=\"https:\/\/www.theblock.co\/price\/256951\/ssv-network-ssv-usd\" data-v-f87c67ca=\"\">at around $24 million<\/a>) to reward users for registering validators on the network. Users can stake directly on SSV Network or utilize staking services that have integrated SSV's infrastructure. \"This also means that node operators running on other protocols can double up on rewards by also operating on SSV.Network,\" the project said.","It took three years of development for SSV Network to launch its permissionless mainnet. SSV Network launched its <a href=\"https:\/\/www.theblock.co\/post\/251004\/ssv-network-mainnet\" data-v-f87c67ca=\"\">partner mainnet<\/a> in September, and since then, <a href=\"https:\/\/explorer.ssv.network\/\" data-v-f87c67ca=\"\">nearly $160 million<\/a> worth of ether has been staked through SSV.","Other Ethereum staking infrastructure projects that utilize the DVT approach are <a href=\"https:\/\/www.theblock.co\/post\/261439\/lido-finances-approves-proposal-to-enable-obol-decentralized-staking-module\" data-v-f87c67ca=\"\">Obol<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/202690\/diva-closes-3-5-million-seed-round-for-distributed-liquid-staking-protocol\" data-v-f87c67ca=\"\">Diva<\/a>. Earlier this month, Obol launched its mainnet open beta, while Diva released its operator testnet in September.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$160 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Alon Muroch","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"+1.65%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"first quarter","content":"DATE"},{"type":"Muroch","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"46%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"$24 million","content":"MONEY"},{"type":"SSV Network","content":"ORGANIZATION"},{"type":"SSV","content":"ORGANIZATION"}],"hashtag":["DEVELOPER TOOLS","ETHEREUM","STAKING FIRMS","VALIDATORS"],"authors":["Yogita Khatri","The Block"]}