{"summary":"While traditional hedge funds lagged equity benchmarks, crypto funds were able to deliver returns that topped bitcoin and the Bloomberg Galaxy Crypto Index.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129806\/crypto-funds-outperformed-traditional-hedge-funds-and-digital-asset-benchmarks","publishDate":"2022-01-11T17:33:39","id":7232,"type":null,"title":"Crypto funds outperformed traditional hedge funds and digital asset benchmarks","category":["MARKETS"],"content":["A big rally in stocks over the course of 2021 did not translate into outsized returns at some of the world's largest hedge funds. But their crypto counterparts were able to produce returns that beat both stock and digital asset indexes.&nbsp;","In aggregate, hedge funds eked out a return of just over 10% last year, underperforming the S&amp;P 500 index's return of 26.9% as well as the aggregate performance of hedge funds in 2020. The lagging results of hedge fund managers are tied to their underexposure to big tech names like Apple and car-maker Tesla, which clocked in eye-watering returns in 2021.&nbsp;","Even top hedge funds like Ken Griffin's Citadel performed on par with the broader market. Citadel delivered a 26% return for 2021, according to <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-01-06\/griffin-s-citadel-beats-multistrategy-rivals-gaining-26-in-2021\" data-v-f87c67ca=\"\">Bloomberg News<\/a>. &nbsp;","It's a different story for crypto funds, according to data provided by Hedge Fund Research. The firm's crypto index suggests crypto hedge funds returned, on average, 214% in 2021. Aside from the 2017 boom cycle, that represents the best performance for crypto hedge funds since the firm started tracking this particular subset in 2015.&nbsp;","Indeed, the performance is not only strong relative to their equity brethren, but is also strong relative to some accepted benchmarks. Bitcoin returned 48.5% over the course of 2021. The Bloomberg Galaxy Crypto Index, meanwhile, posted a return of 153.39%. TCAP — a cryptocurrency that leverages oracles to track the entire market — gained 185% in 2021.","Still, cryptos like ether outperformed funds, with the native asset of the second-largest network by market capitalization clocking in a return of more than 400% in 2021.&nbsp;","The solid performance of hedge funds in the crypto market might be a function of the lack of competition in the market relative to equities, according to Jeff Dorman, the chief investment officer at crypto investment management firm Arca.&nbsp;\"TradFi Hedge fund portfolios look very similar, and passive indexes largely outperform active management in today's picked over market. Contrast that to digital assets, and there really isn't much competition at all yet.\"","Dorman says most Wall Street institutions are focused entirely on bitcoin and ether, leaving opportunities among the mid-cap tokens available for crypto funds.&nbsp;","\"The sweet spot for active management is a growing and evolving investment opportunity set without growing competition, and that's where we stand today,\" he noted. \"Due to regulatory issues, size constraints, and lack of education, large TradFi funds have not penetrated digital assets in any meaningful way outside of buying a few private deals, and trading BTC and ETH.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Tesla","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"Jeff Dorman","content":"PERSON"},{"type":"153.39%","content":"PERCENT"},{"type":"214%","content":"PERCENT"},{"type":"400%","content":"PERCENT"},{"type":"26.9%","content":"PERCENT"},{"type":"185%","content":"PERCENT"},{"type":"Citadel","content":"ORGANIZATION"},{"type":"Bloomberg Galaxy Crypto Index","content":"ORGANIZATION"},{"type":"Hedge Fund Research","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"26%","content":"PERCENT"},{"type":"48.5%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"Bloomberg News","content":"ORGANIZATION"},{"type":"Ken Griffin","content":"PERSON"}],"hashtag":["HEDGE FUNDS"],"authors":["Frank Chaparro","The Block"]}