{"summary":"FTX founder Sam Bankman-Fried has offered an explanation of why the crypto exchange failed in a new letter.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189463\/bankman-fried-explains-why-ftx-collapsed-in-new-letter-to-employees","publishDate":"2022-11-23T05:34:53","id":7236,"type":null,"title":"Bankman-Fried explains why FTX collapsed in new letter to employees","category":["EXCHANGES"],"content":["FTX founder Sam Bankman-Fried apologized to his former colleagues and explained why the crypto exchange failed in a new letter.","The letter, sent Tuesday and reviewed by The Block, says that a series of events resulted in the collapse of FTX. It started with the market's crash in Spring, followed by credit \"drying up\" and ending with customers withdrawing their funds en masse, Bankman-Fried said. Adding to those issues, FTX's poor margin management and risk controls ultimately led the company to file for bankruptcy protection, according to the letter.","\"I never intended this to happen. I did not realize the full extent of the margin position, nor did I realize the magnitude of the risk posed by a hyper-correlated crash,\" Bankman-Fried said in the letter. \"The loans and secondary sales were generally used to reinvest in the business–including buying out Binance–and not for large amounts of personal consumption.\"","According to Bankman-Fried, FTX had around $60 billion in collateral and $2 billion in liabilities this spring, but a market crash meant the collateral's value was reduced to half. The drying up of credit in the industry meant FTX's collateral was worth around $25 billion, though liabilities jumped to $8 billion. Another crash in November \"led to another roughly 50% reduction in the value of collateral over a very short period of time,\" at $17 billion at the time. Then a bank run, caused by what Bankman-Fried called \"attacks\" in November, reduced the collateral to $9 billion, he said.","\"As we frantically put everything together, it became clear that the position was larger than its display on admin\/users, because of old fiat deposits before FTX had bank accounts,\" the letter stated. \"I did not realize the full extent of the margin position, nor did I realize the magnitude of the risk posed by a hyper-correlated crash.\"","Bankman-Fried did not address allegations that FTX loaned customer funds to its affiliated trading firm, Alameda Research, to cover its liabilities in the letter. Neither did he address why customer funds were seemingly backed by illiquid tokens rather than just held as they were.","He said he felt \"deeply sorry about what happened\" and was pressurized to file for <a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">bankruptcy protection<\/a> — something he appears to regret.","\"An extreme amount of coordinated pressure came, out of desperation, to file for bankruptcy for all of FTX–even entities that were solvent–and despite other jurisdictions' claims,\" the letter stated. \"We likely could have raised significant funding; potential interest in billions of dollars of funding came in roughly eight minutes after I signed the Chapter 11 docs. Between those funds, the billions of dollars of collateral the company still held, and the interest we'd received from other parties, I think that we probably could have returned large value to customers and saved the business.\"","Despite the bankruptcy proceedings, Bankman-Fried still reckons there is a chance to save FTX. \"I believe that there are billions of dollars of genuine interest from new investors that could go to making customers whole. But I can't promise you that anything will happen, because it's not my choice,\" he said in the letter.","Bankman-Fried stepped down as CEO of FTX on Nov. 11 and is not a current employee of the company. He reportedly doesn't have access to the company's Slack account, but shared the letter to remaining staff via a current employee.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$25 billion","content":"MONEY"},{"type":"billions of dollars","content":"MONEY"},{"type":"$17 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Fried","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"$60 billion","content":"MONEY"},{"type":"spring","content":"DATE"},{"type":"$9 billion","content":"MONEY"},{"type":"Nov. 11","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"},{"type":"$8 billion","content":"MONEY"},{"type":"Spring","content":"DATE"}],"hashtag":["FTX"],"authors":["Yogita Khatri","The Block"]}