{"summary":"The Lido community is strongly against any attempt to force the platform to limit its Ethereum staking market share.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155070\/lido-community-strongly-against-limiting-its-ethereum-staking-dominance","publishDate":"2022-06-30T09:06:37","id":7237,"type":null,"title":"Lido community strongly against limiting its Ethereum staking dominance","category":["GOVERNANCE"],"content":["Lido DAO members have signaled their intent to maintain the platform’s dominance of the Ethereum 2.0 (ETH2) staking market as the majority of the community are voting against imposing a self-limit on the liquid staking platform.","Lido Finance, a liquid staking platform, <a href=\"https:\/\/dune.com\/hildobby\/ETH2-Deposits\" data-v-f87c67ca=\"\">accounts<\/a> for almost a third of all ether (ETH) tokens staked on the Ethereum Beacon chain. This has caused fears about its level of centralization, concerns that led to a month-long <a href=\"https:\/\/www.theblockcrypto.com\/news+\/152516\/why-ethereums-dominant-liquid-staking-protocol-is-debating-whether-to-reduce-its-influence\" data-v-f87c67ca=\"\">debate in the Lido community forum<\/a>.","The vote, which began on June 24, still has about a day to go but the outcome seems set. Data from the <a href=\"https:\/\/snapshot.org\/#\/lido-snapshot.eth\/proposal\/0x10abedcc563b66b1adee60825e78c387105110fa4a1e7354ab57bc9cc1e675c2\" data-v-f87c67ca=\"\">voting page<\/a> shows over 99.8% of voters have chosen that Lido should not self-limit. If the vote fails, Lido will pursue other avenues of minimizing the risks posed by its staking dominance.","The platform is currently considering a <a href=\"https:\/\/research.lido.fi\/t\/ldo-steth-dual-governance\/2382\" data-v-f87c67ca=\"\">proposal<\/a> to introduce a dual governance structure for Lido. This dual governance architecture will involve including staked ETH (stETH) holders in the decision-making process for the DAO.","Staked ETH is the liquid staking derivative token given by Lido in exchange for ether staked by users on the platform. stETH is a tradable token and as such can be deployed on other DeFi protocols like Aave and MakerDAO.","Lido’s current governance is controlled by Lido DAO (LDO) token holders. Only LDO owners propose and vote on governance actions. The dual governance proposal, if passed, will grant veto powers to stETH holders over voting decisions made by LDO owners.","The proposal also includes a time-lock component that will freeze the implementation of a vote to allow for review and possible veto action by stETH holders.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"99.8%","content":"PERCENT"},{"type":"LDO","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Ethereum Beacon","content":"ORGANIZATION"},{"type":"June 24","content":"DATE"}],"hashtag":["LIDO FINANCE"],"authors":["Osato Avan-Nomayo","The Block"]}