{"summary":"The man at the center of an investigation by the U.S. Attorney&#x27;s Office has been described as a &quot;serious flight risk&quot; in a new court document obtained by","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/21797\/us-government-requests-detention-for-defendant-at-center-of-bitfinex-imbroglio-describes-master-us-workbook","publishDate":"2019-05-02T13:54:41","id":7239,"type":null,"title":"U.S. Government requests detention for defendant at center of Bitfinex imbroglio, describes &#x27;Master US Workbook&#x27;","category":["INSTITUTIONAL INVESTORS"],"content":["The man at the center of an investigation by the U.S. Attorney's Office has been described as a \"serious flight risk\" in <a href=\"https:\/\/www.scribd.com\/document\/408446505\/Crypto-Capital-Detention-Memorandum\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a new court document<\/a> obtained by The Block. Reginald Fowler was hit with charges of \"bank fraud and operating an unlicensed money transmitting business\" by the USAO <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/us-ag-charges-two-individuals-for-providing-shadow-banking-services-to-crypto-exchanges-including-bitfinex\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">in an April 30 filing<\/a>.","The bank fraud counts carry a maximum sentence of 30 years and are related to Fowler's alleged failure to return $851 million as part of the relationship between his \"shadow bank\" and Crypto Capital, which is alleged to have outstanding obligations to Bitfinex. According to prosecutors:","\"Detention is appropriate for the following reasons: (1) the nature of the instant offense and the strength of the evidence against Defendant; (2) Defendant’s financial resources and ties to other countries; (3) evidence that Defendant has already taken steps to impede this investigation; and (4) evidence of Defendant’s involvement in other criminal schemes. For these reasons, among others, Defendant is an atypical white collar defendant and poses a significant flight risk.\"","The government alleges that Fowler was central to the scheme that reportedly impacted Bitfinex and therefore has significant means to flee the country:","\"Defendant has access to millions of dollars in bank accounts around the world. The government, through email search warrants, has obtained a document entitled “Master US Workbook,” which details the financial operations of the scheme as of January 2019. This workbook indicates that the scheme had received over $740 million in 2018 alone. It lists approximately sixty different bank accounts, held at both domestic and international banks, with a combined account balance of over $345 million as of January 2019.\"","The USAO asserts that Fowler has all but unlimited means to exist indefinitely outside of the U.S. -- and is likely to face additional criminal and legal proceedings. As a result, they requested Fowler be detained.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$740 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Reginald Fowler","content":"PERSON"},{"type":"USAO","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"U.S. Attorney's Office","content":"ORGANIZATION"},{"type":"Crypto Capital","content":"ORGANIZATION"},{"type":"$851 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"January 2019","content":"DATE"},{"type":"April 30","content":"DATE"},{"type":"Defendant","content":"ORGANIZATION"},{"type":"Fowler","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"$345 million","content":"MONEY"}],"hashtag":[],"authors":["The Block","The Block"]}