{"summary":"Defi hedge fund Edge Capital Management has raised two funds totaling $66.8 million. \nThis includes one off-shore fund for $38.6 million located in the Cayman Islands and another Delaware-incorporated fund for $28.1 million. ","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178689\/crypto-hedge-fund-edge-capital-raises-66-million-for-two-defi-funds","publishDate":"2022-10-20T11:54:08","id":725,"type":null,"title":"Crypto hedge fund Edge Capital raises $66 million for two DeFi funds","category":["Institutional Investors"],"content":["Edge Capital Management, a DeFi-focused hedge fund, has raised two separate funds totaling $66.8 million.&nbsp;","The hedge fund has raised one offshore fund in the Cayman Islands from eight investors for $38.6 million and another Delaware-incorporated fund for $28.1 million from six investors, according to Securities and Exchange Commission filings dated Oct. 19.&nbsp;","While public information on the fund is scant, it <a href=\"https:\/\/edge-capital-fund.com\/about-us\" data-v-f87c67ca=\"\">describes<\/a> itself as \"an alternative investment manager focused on digital assets, blockchain and decentralized finance (DeFi) markets\" using macro-investing strategies.&nbsp;","Previously it advertised a role on <a href=\"https:\/\/www.linkedin.com\/jobs\/view\/2941511993\/?refId=z45K8Tt8QES32%2B1yMR%2BAWA%3D%3D\" data-v-f87c67ca=\"\">LinkedIn<\/a> seeking a DeFi analyst \"responsible for identifying and investing in various DeFi protocols that can deliver high returns in yield-farming and macro strategies\".&nbsp;","In both filings, capital raise limits were not set, meaning that it's possible Edge Capital is seeking to raise further. Founded by former Bank of America director Vadim Khramov in May 2020, the filings also show that the firm is based in Florida.&nbsp;","The raise follows previous endeavors by hedge funds in the crypto space. Blocktower, a firm that has a history as a hedge fund,<a href=\"https:\/\/www.theblock.co\/post\/176654\/blocktower-launches-150-million-fund-backed-by-bpi-france-and-mass-mutual\" data-v-f87c67ca=\"\"> launched<\/a> a $150 million fund backed by BPI France and Mass Mutual earlier this month. In August, Brevan Howard Asset Management’s digital assets-focused vehicle <a href=\"https:\/\/www.theblock.co\/post\/161633\/brevan-howard-raises-more-than-1-billion-for-crypto-fund-blockworks\" data-v-f87c67ca=\"\">raised<\/a> more than $1 billion from institutional investors.&nbsp;"],"hashtag":["HEDGE FUNDS"]}