{"summary":"Pantera Capital, the California-based cryptocurrency investing firm, has not completely succumbed to the grip of the cryptocurrency bear market, according","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/5192\/as-the-crypto-market-bleeds-red-panteras-venture-fund-is-up-60","publishDate":"2018-12-13T17:38:28","id":7253,"type":null,"title":"As the crypto market bleeds red, Pantera&#x27;s venture fund is up 60%","category":["INVESTMENTS"],"content":["<a href=\"https:\/\/www.panteracapital.com\" data-v-f87c67ca=\"\">Pantera Capital<\/a>, the California-based cryptocurrency investing firm, has not completely succumbed to the grip of the cryptocurrency bear market, according to an investor letter out December 13.&nbsp;","Pantera's venture fund, dubbed VFII, is up nearly 60% from Q1 to Q3, according to the note. Over the same period, bitcoin is down 53%. Passive fund Bitwise Index 10, which tracks ten cryptos, is down 59% over the same period.&nbsp;","The firm said volatility in liquid markets has made venture investments an oasis for investors in crypto.&nbsp;","\"Zooming out to Venture Fund II’s full lifespan—sure BTC is up 11.3x compared to VFII’s 3.3x gross TVPI, both of which are strong returns,\" the letter said. \"But venture did it without the roller coaster ride and additional grey hairs… not to mention the decreased likelihood of errant trades based on short-term emotions (we discuss human nature being pro-cyclical in our April letter).\"","It's a different story, however, for ICO investments. <a href=\"https:\/\/www.coindesk.com\/sec-jay-clayton-consensus-invest-video\" data-v-f87c67ca=\"\">The Securities and Exchange Commission has begun clamping down on initial coin offerings<\/a> that fit the definition of a security — despite whatever games of semantics token projects might play. Pantera said that 25% of its portfolio for its ICO could be impacted.&nbsp;","\"Approximately 25% of our fund’s capital is invested in projects with liquid tokens that sold to U.S. investors without using Regulation D or Regulation S,\" the firm said. \"If any of these projects are deemed to be securities, the SEC’s position could adversely affect them.\"","Elsewhere, the firm is getting closer to hitting its $175 million target for its so-called <a href=\"https:\/\/www.coindesk.com\/pantera-capital-raises-71-million-for-third-crypto-venture-fund\" data-v-f87c67ca=\"\">Pantera Venture Fund III<\/a>.&nbsp;","\"We raised two-thirds of the $175 million target in the first close, and plan to hold a final closing in Q1 of 2019,\" the letter said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"53%","content":"PERCENT"},{"type":"$175 million","content":"MONEY"},{"type":"60%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"Pantera Venture Fund III","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"59%","content":"PERCENT"},{"type":"December 13","content":"DATE"},{"type":"April","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}