{"summary":"Conflux Network added bitcoin payment gas fees, increased security for third-party smart contracts and other upgrades in the new addition.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273378\/conflux-adds-evm-compatible-solution-to-interact-with-bitcoin","publishDate":"2024-01-18T10:36:44","id":7256,"type":null,"title":"Conflux adds EVM-compatible solution to interact with Bitcoin","category":["LAYER 1S"],"content":["Layer 1 blockchain Conflux Network is developing an “EVM-compatible” solution focused on interoperability with Bitcoin.","This solution will allow the transfer of bitcoin and inscription-based tokens between the Conflux and Bitcoin networks. A testnet is expected to launch by the end of March, with the mainnet targeted for May.","Conflux is known for combining proof-of-work (PoW) and proof-of-stake (PoS) algorithms to achieve consensus on its network. The new solution will operate on top of its main chain, aiming to interact directly with Bitcoin. It will use bitcoin for gas fees as well as support Ethereum-based contracts, the team said.","“By leveraging Bitcoin’s strength and integrating it seamlessly into our network with forward-thinking features like PoS-based staking capabilities, our network is offering users more channels to interact with decentralized applications built on top of the platform,” Conflux <a href=\"https:\/\/confluxnetwork.medium.com\/unlocking-the-potential-of-bitcoin-introducing-conflux-networks-evm-compatible-bitcoin-layer-2-4d1a13c0bbd8\" data-v-f87c67ca=\"\">stated<\/a>.","The project aims to onboard inscription-based tokens. Inscriptions, which allow users to inscribe data onto individual satoshis, have become popular on Bitcoin over the last year.","“By implementing EVM compatibility, our network enables seamless management of Bitcoin-based assets like BTC and xRC20 tokens (such as BRC20 and ARC20) through smart contracts,” Conflux noted.","The <a href=\"https:\/\/www.theblock.co\/post\/211962\/conflux-token-jumps-over-40-following-partnership-with-china-telecom\" data-v-f87c67ca=\"\">Conflux token<\/a> (CFX) is up more than 10% today, trading at $0.22, according to <a href=\"https:\/\/www.theblock.co\/price\/248467\/conflux-cfx-usd\" data-v-f87c67ca=\"\">The Block’s price page<\/a>.","CFX has a market capitalization of $801.9 million with a 3.6 billion circulating supply.","","","<span data-v-f87c67ca=\"\">Price action for CFX in the past 24 hours. Images: The Block Prices for Conflux.<\/span>","&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Conflux Network","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"$801.9 million","content":"MONEY"},{"type":"CFX","content":"ORGANIZATION"},{"type":"$0.22","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["MK Manoylov","The Block"]}