{"summary":"SEBA Bank has partnered with HashKey to accelerate the institutional adoption of digital assets in Hong Kong.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192082\/seba-bank-hashkey-institutional-investors-hong-kong","publishDate":"2022-12-05T08:20:11","id":7259,"type":null,"title":"SEBA Bank and HashKey target institutional investors in Hong Kong","category":["INSTITUTIONAL INVESTORS"],"content":["Regulated crypto bank SEBA Bank and digital asset financial services group HashKey have formed a strategic partnership focused on accelerating the institutional adoption of digital assets in Switzerland and Hong Kong.","Specifically, HashKey will become SEBA Bank's preferred digital asset trading and market development partner in Hong Kong, according to a press release. SEBA Bank, meanwhile, will become HashKey's banking partner.&nbsp;The collaboration has been formalized through a Memorandum of Understanding.","The partnership between the two companies is firmly focused on providing institutional and professional investors with the ability to gain exposure to digital assets and their broader ecosystem in a regulated and compliant fashion.","\"With a supportive regulatory framework, Hong Kong is a leading jurisdiction globally in the licensing provision of crypto products and services,\" Franz Bergmueller, group CEO of SEBA Bank, said. \"It is important that the SEBA group becomes part of this ecosystem as a trusted, secure and transparent counterparty in this regulated crypto environment.\"","The Switzerland-headquartered SEBA Bank&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/190860\/crypto-bank-seba-opens-office-in-hong-kong-as-the-city-aims-to-reclaim-crypto-hub-status\" data-v-f87c67ca=\"\">expanded<\/a> into Hong Kong with a new office at the end of November. Earlier in November, HashKey <a href=\"https:\/\/www.theblock.co\/post\/185233\/hashkey-groups-blockchain-member-obtains-full-hong-kong-crypto-trading-license\" data-v-f87c67ca=\"\">obtained<\/a> full licensing to provide crypto asset trading services from Hong Kong's Securities and Futures Commission.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"SEBA","content":"ORGANIZATION"},{"type":"Securities and Futures Commission","content":"ORGANIZATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"Franz Bergmueller","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEBA Bank","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"November","content":"DATE"}],"hashtag":["ASSET MANAGERS","HASHKEY"],"authors":["Adam James","The Block"]}