{"summary":"JPMorgan has gone live with programmable payments via its blockchain-based payments system called JPM Coin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262595\/jpmorgan-jpm-coin-programmable-payments","publishDate":"2023-11-10T08:02:50","id":7275,"type":null,"title":"JPMorgan rolls out programmable payments via JPM Coin","category":["COMPANIES"],"content":["JPMorgan has gone live with programmable payments, or automatic execution of payments, via its permissioned blockchain-based payments system called JPM Coin.","Onyx, JPMorgan's blockchain business unit, launched the new feature for general availability today, <a href=\"https:\/\/www.linkedin.com\/feed\/update\/urn:li:activity:7128680428038750208\/\" data-v-f87c67ca=\"\">said<\/a> Naveen Mallela, head of Coin Systems at Onyx. \"This marks a significant milestone in the evolution of JPM Coin where programmability has always been the holy grail,\" Mallela said.","Programmable payments automate transactions based on preset rules, eliminating the need for manual checks. This speeds up transactions and resolves the challenge of setting aside extra funds during treasury downtime, like on weekends and holidays. (JPM Coin operates 24\/7.)","Programmable payments are available to JPMorgan's institutional clients and are aimed at improving their treasury functions. For example, this feature becomes more attractive when interest rates are higher, potentially allowing treasurers to earn more income on deposits. The feature also becomes helpful in handling overdue payments or meeting margin calls.","<a href=\"https:\/\/www.jpmorgan.com\/insights\/payments\/wallets\/programmable-payments-automation-becomes-reality\" data-v-f87c67ca=\"\">JPMorgan started testing programmable payments<\/a> in 2021 with its pioneering partner, Siemens AG. The German tech conglomerate this week utilized programmable payments to address potential shortfalls, marking the official launch of the JPMorgan feature. Two more companies, FedEx and Cargill, are expected to use the feature in the coming weeks.","JPMorgan introduced JPM Coin in 2019 to enable institutional clients to make blockchain-based payments. Last month, JPM Coin <a href=\"https:\/\/www.theblock.co\/post\/259580\/jpmorgan-jpm-coin-billion-daily-transactions\" data-v-f87c67ca=\"\">reached<\/a> a milestone, processing $1 billion in daily transactions. However, this amount is still tiny compared to the $10 trillion in payments JPMorgan handles daily through its traditional platforms. JPMorgan also plans to expand the JPM Coin payment system to retail consumers in the future.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$10 trillion","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Onyx","content":"ORGANIZATION"},{"type":"JPM Coin","content":"ORGANIZATION"},{"type":"Cargill","content":"ORGANIZATION"},{"type":"Coin Systems","content":"ORGANIZATION"},{"type":"Mallela","content":"PERSON"},{"type":"JPM Coin","content":"LOCATION"},{"type":"Siemens AG","content":"ORGANIZATION"},{"type":"Naveen Mallela","content":"PERSON"},{"type":"This marks","content":"MONEY"}],"hashtag":["INVESTMENT FIRMS","PAYMENTS","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}