{"summary":"Umami token holders are in limbo after chaos inside the decentralized finance product.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218867\/umami-labs-ceo-alex-odonnell-addresses-legal-battle","publishDate":"2023-03-15T16:04:43","id":7277,"type":null,"title":"Inside the chaos at Umami Labs: The challenge of breaking into the mainstream","category":["LEGAL"],"content":["Umami Labs was set to launch its new decentralized finance product this month, but employees of the DeFi project quit en masse, and now the CEO is embroiled in a bitter fight with former employees.","The internal battle at Umami Labs underscores the tension DeFi projects face as they try to break into the institutional mainstream while staying true to their decentralized ethos.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>The fight has also left Umami token holders caught in the middle. They are bracing for a legal battle, watching the Umami token price fall and tracking the drama on social platforms like Discord and Twitter.","“In a lot of ways, DAOs work great until there's a conflict and a dispute,” said Nelson Rosario, a partner at Rosario Tech Law who focuses on blockchain and crypto issues. “In situations when conflict arises, it can be problematic for participants in the DAO, because either an explicit or kind of natural hierarchy usually emerges in moments of conflict, and what the exact kind of boundaries are with respect to who does or doesn't have legal rights is not always clear.”","Umami Labs bills itself as a project that is “pioneering institutional DeFi” by creating “regulatory-compliant, non-custodial DeFi strategies for financial institutions in the U.S. and beyond.”","The company acts as the legal entity that runs operations and develops products for Umami DAO. It is helmed by CEO Alex O’Donnell, an early Umami DAO contributor and former Reuters News journalist.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Umami Labs had planned to launch its first DeFi product last week, a “non-custodial, institutional-grade strategy for generating competitive risk-adjusted returns on assets including $USDC, $ETH and $BTC.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The project never got that far.","Last month, nearly all of Umami Lab’s employees quit their jobs, accusing O’Donnell of trying to take control of Umami’s $5.9 million <a href=\"https:\/\/zapper.xyz\/daos\/umami-finance-dao\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">treasury<\/span><\/a>. O’Donnell, meanwhile, says the former Umami Labs employees are actually the ones who seized Umami’s treasury and intellectual property — and violated their employment contracts.","“I have an obligation to restore the assets to their legal entity home on behalf of token holders,” O’Donnell said in an exclusive interview with The Block. “We're going to get them back. There's no real question about that.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","O’Donnell retained the law firm Jenner &amp; Block to represent himself and Ievgeniia Vatrenko to represent Umami Labs. But the CEO and Umami’s former employees are hoping to come to an agreement outside of a courtroom instead.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Lawyers for O’Donnell and former Umami Labs executives had a two-hour meeting earlier this month to lay out how negotiations can proceed. They later initiated arbitration proceedings.","The parties “established a framework in principle within which the parties are hopeful they will be able to negotiate an amicable resolution to the ongoing dispute. The attorneys are still working out the details,” O’Donnell said in a statement.","A community manager for Umami DAO confirmed that some DAO contributors have hired lawyers, and that the individuals are paying for their own legal counsel.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The conflict at Umami Labs boiled over in January, weeks before Umami’s new product was set to launch. By mid-February, all of the project’s 11 employees had quit.","“The entire team gradually lost faith in his leadership and vision, including the community managers and developers. They felt that the token holders' wishes were not being considered and that Mr. O'Donnell's vision was far from being in their best interests,” Alex Golubitsky, the former chief legal officer at Umami Labs, said in an email to The Block. Golubitsky was suspended from his role in January and later terminated.","O’Donnell disputes accusations that he was trying to take control of the treasury. Instead, O’Donnell says the conflict at the heart of the Umami breakup were his and Golubitsky’s conflicting visions for the future structure of the project.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Internal Umami Labs Slack messages shared with The Block show O’Donnell and Golubitsky butted heads on whether to make changes to Umami’s offerings and whether to bring in outside counsel.","“I had these concerns about our overall legal entity structure and our strategy. I wanted to take a second look at things to see where we could have to improve. We had a product launch scheduled in March, so the clock was ticking to make any revisions before we launched our product. And it was in that context we had that conflict with the chief legal officer,” O’Donnell said, adding that Golubitsky tried to block him from bringing in an outside lawyer to review Umami’s legal structure.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","It would be legally impossible to seize the Umami treasury, O’Donnell says, because of multi-signature agreements needed to take action at the company. The multi-sig contracts, along with other employment contracts, have been reviewed by The Block.","“I couldn't have stolen the treasury assets even if I wanted to, because you need those three sign-offs,” O’Donnell said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Around the same time, the Umami Labs employees quit their jobs and O’Donnell sold his tokens, cashing them out for approximately half a million dollars and sending the token price down to $8.29. O’Donnell told The Block he sold the tokens to gear up for what might be a costly legal battle.","“I was told that there was going to be no coverage for legal fees, which of course, was going to be really important to try to remedy this,” O’Donnell said. “I took my personal allocation of tokens that had already been invested to my wallet … and I sold it, you know, ultimately at a pretty steep discount so that I could raise the funds as quickly as possible for the legal defense that was going to be needed for Umami.\"","Golubitsky called the move “an unforgivable betrayal.” The Umami token has since recovered to $12.52 as of Wednesday afternoon.","“Simply put, Mr. O’Donnell wished to take control over the Umami treasury for his personal ends. When it became clear to Mr. O’Donnell that he would be unable to use Umami Labs as a vehicle to gain control over the treasury of Umami DAO, he liquidated his large holdings of $Umami tokens,” Golubitsky said. “This was an unforgivable betrayal of the trust of the Umami community and of the policies of Umami Labs.”","In the weeks since the Umami Labs fiasco came to a head, the Umami DAO <a href=\"https:\/\/snapshot.org\/#\/umamidao.eth\/proposal\/0x97e2f9a9dfefc22fb63e759fcb67c4fd0275572476701731bdd178d261d425f7\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">voted<\/span><\/a> in nine former Umami Labs employees to continue the project. Developers are still working on bringing the new product to fruition, but some token holders say they are stuck in limbo.","“The token holders are kind of in the middle of this and they just want it to end in a way that benefits them. So that would mean that the product can still launch and the token holders are able to also have a say in, ‘Okay, what is the solution?’” said Stan Colenbrander, a cryptocurrency researcher and Umami token holder.","O’Donnell, who is still negotiating with his former employees, says he is doubtful that the project will meet its goal of attracting institutional users in the U.S. and other big markets, and may only appeal to DeFi-native users.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Without the legal structure put in place under Umami Labs, LLC, it's less likely to reach institutional users, as had been originally intended,” O’Donnell said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The conflict at Umami Labs also underscores the limits of decentralization and smart contracts when human beings are involved, noted Rosario, the crypto lawyer who is not involved in the conflict. It is hard for DAOs to “be flexible enough to deal with the infinite dispute universe.”","“Smart contracts are great for the things that you can code in that are regular and kind of expected. It's when you have to get into the flexibility of human insanity. Good luck,” Rosario said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$ETH","content":"MONEY"},{"type":"Rosario Tech Law","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Umami Labs","content":"ORGANIZATION"},{"type":"Umami DAO","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Golubitsky","content":"PERSON"},{"type":"Ievgeniia Vatrenko","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Alex Golubitsky","content":"PERSON"},{"type":"$BTC","content":"MONEY"},{"type":"O’Donnell","content":"PERSON"},{"type":"$12.52","content":"MONEY"},{"type":"afternoon","content":"TIME"},{"type":"Reuters News journalist","content":"ORGANIZATION"},{"type":"Rosario","content":"PERSON"},{"type":"$USDC","content":"MONEY"},{"type":"LLC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"$5.9 million","content":"MONEY"},{"type":"a million dollars","content":"MONEY"},{"type":"Alex O’Donnell","content":"PERSON"},{"type":"$Umami","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"O'Donnell","content":"PERSON"},{"type":"Jenner &amp; Block","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Stan Colenbrander","content":"PERSON"},{"type":"$8.29","content":"MONEY"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}