{"summary":"Hong Kong is planning to legalise retail trading of crypto assets, according to a report by Bloomberg News","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180363\/hong-kong-plans-to-legalize-retail-crypto-trading-bloomberg","publishDate":"2022-10-27T08:11:30","id":7278,"type":null,"title":"Hong Kong plans to legalize retail crypto trading: Bloomberg","category":["REGULATION"],"content":["Hong Kong's government plans to allow retail investors to trade crypto on locally licensed exchanges as part of a wider effort to position the city as a center for virtual asset service providers, according to Bloomberg.","A mandatory licensing regime for crypto trading platforms that is due to begin in March will allow retail trading, Bloomberg <a href=\"https:\/\/finance.yahoo.com\/news\/hong-kong-plans-legalize-retail-085216982.html\" data-v-f87c67ca=\"\">reported<\/a>, citing unnamed sources. Details of the new regime are expected to be announced on Monday at an annual fintech conference in the city where senior government and regulatory officials are scheduled to speak.","Currently, only two crypto exchanges are licensed to operate in Hong Kong and they are limited to offering a narrow range of services to sophisticated investors only. The city's regulator, the Securities and Futures Commission, is also looking at allowing licensed exchanges to offer a wider range of coins and tokens on their platforms, Bloomberg reported.","A SFC spokesperson declined to comment to Bloomberg.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Securities and Futures Commission","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":[],"authors":["Benjamin Robertson","The Block"]}