{"summary":"Oppenheimer has reiterated its buy rating for Coinbase stock and increased its price target to $276, up from a previous target of $200. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286496\/oppenheimer-raises-coinbase-share-price-target-to-276","publishDate":"2024-04-04T09:43:57","id":7285,"type":null,"title":"Oppenheimer raises Coinbase share price target to $276","category":["COMPANIES"],"content":["New York-based financial firm Oppenheimer increased Coinbase's share price target to $276, up from a previous target of $200, while reiterating its buy rating.","The increased price target to $276 from Oppenheimer is around 10% higher than Wednesday's closing share price of Coinbase, which was $251.58.","'The adoption of digital assets continued after the approval of spot bitcoin ETFs in January,\" said Oppenheimer Executive Director Owen Lau in a note. \"We estimate that COIN's 1Q24 trading volume would be up 95% quarter-on-quarter, and 107% year-on-year to $300 billion.","Lau added that liquidity in the space has continued to grow, with USDC's market cap increasing 12% between the first quarter of 2024 and the last quarter of 2023.","According to Oppenheimer, the continued adoption of digital assets and blockchain technology can help <a href=\"https:\/\/www.theblock.co\/post\/286428\/bitcoins-recent-all-time-high-could-mean-the-halving-is-priced-in-say-coinbase-analysts\" data-v-f87c67ca=\"\">Coinbase<\/a> remain a key beneficiary in the cryptocurrency sector over the long-term.","Lau told The Block that the latest price target increase for Coinbase shares comes as the company is experiencing better fundamentals and higher trading revenue. \"This is due to the strong inflows into spot bitcoin ETFs, and the halving also helps drive more interest, plus retail participation has also increased,\" he added. However, he said that Coinbase's Base Layer 2 wasn't a significant revenue driver taken into account when revising to an increased target price for the stock.","In pre-market trading on Thursday, Coinbase shares increased 3.29% to $259.85 at 8:56 a.m. ET. The cryptocurrency exchange's share price has risen by more than 44% since the beginning of the year.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$259.85","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Owen Lau","content":"PERSON"},{"type":"12%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"44%","content":"PERCENT"},{"type":"Oppenheimer","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"$300 billion","content":"MONEY"},{"type":"8:56 a.m. ET","content":"TIME"},{"type":"Oppenheimer Executive","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"$200","content":"MONEY"},{"type":"$251.58","content":"MONEY"},{"type":"last quarter of 2023","content":"DATE"},{"type":"first quarter of 2024","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"107%","content":"PERCENT"},{"type":"95%","content":"PERCENT"},{"type":"3.29%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$276","content":"MONEY"}],"hashtag":["ANALYST REPORTS","COINBASE","EQUITY MOVERS"],"authors":["Brian McGleenon","The Block"]}