{"summary":"Bitget, a leading cryptocurrency exchange and Web3 company, is launching the Blockchain4Her (B4H) Ambassador Program to address the gender gap in publicly secure funding opportunities for women. The initiative aims to empower women to become ambassadors and catalysts for change, encouraging more individuals to join the Web3 space.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280995\/280995","publishDate":"2024-03-08T09:01:05","id":7288,"type":null,"title":"Bitget unveils Blockchain4Her ambassador program on International Women’s Day","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Bitget, a leading cryptocurrency exchange and Web3 company, is launching the Blockchain4Her (B4H) Ambassador Program to address the gender gap in publicly secure funding opportunities for women. The initiative aims to empower women to become ambassadors and catalysts for change, encouraging more individuals to join the Web3 space.<\/span>","<span data-v-f87c67ca=\"\">The program, driven by Bitget's findings on the gender gap and limited opportunities for women in the industry, seeks to bridge this divide by welcoming exceptional women leaders. Three prominent female individuals, including Tess Hau, founder of Tess Ventures, Yevheniia Broshevan, Co-founder of Hacken, and Cecilia Hsueh, CEO of Layer 2 project Morph, have already joined as the first batch of ambassadors.<\/span>","<span data-v-f87c67ca=\"\">The B4H Ambassador Program will feature several initiatives aimed at fostering a supportive and inclusive environment for women in Web3:<\/span>","<b data-v-f87c67ca=\"\">Gracy Chen, Managing Director of Bitget<\/b><span data-v-f87c67ca=\"\">, emphasized the importance of promoting women's involvement in the blockchain space, stating, \"Women are the most underused resource of the global economy in practically every industry. We are determined to promote their involvement in the blockchain space by opening up opportunities for them to join the industry and develop.\"<\/span>","<span data-v-f87c67ca=\"\">The Ambassadors expressed their enthusiasm and high expectations for contributing to the Blockchain4Her initiative:<\/span>","<b data-v-f87c67ca=\"\">Tess Hau<\/b><span data-v-f87c67ca=\"\"> remarked, \"Blockchain4Her's mission resonates with Tess Ventures' commitment to supporting women developers and leaders in Web3. As an Ambassador, I advocate for blockchain's power in promoting financial literacy and inclusion for women, and I'm eager to contribute to this initiative for positive change.\"<\/span>","<b data-v-f87c67ca=\"\">Yevheniia Broshevan<\/b><span data-v-f87c67ca=\"\"> highlighted, \"Achieving widespread Web3 adoption requires equal opportunities and openness for all. I'm honored to support initiatives addressing these disparities, as they propel us toward a world free from barriers and judgments.\"<\/span>","<span data-v-f87c67ca=\"\">Cecilia Hsueh emphasized, \"The increasing presence of female leaders in the male-dominated blockchain industry marks progress towards acceptance and inclusivity. Their contribution not only adds diversity but also makes complex blockchain technologies more accessible.\"<\/span>","<span data-v-f87c67ca=\"\">Through the B4H Ambassador Program, Bitget aims to empower women to take on leadership roles and make meaningful contributions to the Web3 community, ultimately fostering a more inclusive and diverse industry landscape.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">This post is commissioned by Bitget and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em><br data-v-f87c67ca=\"\">\n<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tess Ventures","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Bitget","content":"ORGANIZATION"},{"type":"Gracy Chen","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Tess Hau","content":"PERSON"},{"type":"Yevheniia Broshevan","content":"PERSON"},{"type":"Cecilia Hsueh","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}