{"summary":"There were two large arbitrage trades made by MEV bots today that targeted large stablecoin swaps.\nOne bot earned 13 ETH while another secured 146 ETH.","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139155\/mev-bots-earn-476000-by-targeting-large-stablecoin-swaps","publishDate":"2022-03-24T13:37:06","id":729,"type":null,"title":"MEV bots earn $476,000 by targeting large stablecoin swaps","category":["DeFi"],"content":["Two MEV trading bots made considerable returns today, targeting large stablecoin trades, as <a href=\"https:\/\/twitter.com\/bertcmiller\/status\/1506983909715849216\" data-v-f87c67ca=\"\">pointed out<\/a> by Robert Miller, product lead at Flashbots.","MEV — which stands for maximum extractable value — is the term given to when value is extracted through the reordering and censoring of blocks. Typically those incentivizing the miners (or validators) are arbitrageur traders paying miners with high fees. The goal is often to frontrun a specified transaction in order to take advantage of an opportunity.","In these cases, the trading bots were used to exploit changes in price after large stablecoin trades. The bots also paid considerable sums to miners in order to make sure their transactions went through at the opportune moments.","The first bot targeted a $24 million stablecoin swap. It took advantage of the arbitrage opportunity that arose from the massive stablecoin trade to trade between ether and the stablecoins in question.&nbsp;","Data from Etherscan shows a trade was <a href=\"https:\/\/etherscan.io\/tx\/0x84bacda5a9e4bce25eaf1c47e78125ed4f16c88e3bf9452cda0102a09d700ab1\" data-v-f87c67ca=\"\">initiated<\/a> at 7:57 AM UTC on Thursday, at block 14447742, by a trader swapping 24.54 million USDC for 22.94 million USDT. This difference of approximately $1.5 million between what the trader started out with and what they received is known as slippage; the size of the trade dropped the price considerably as it went through.","The bot used this to their advantage and scheduled its transaction in the very next block. <a href=\"https:\/\/etherscan.io\/tx\/0x631a4941eb8d0903c1c0073784423f87019cddd7c3822c77258172bd8d1a862c\" data-v-f87c67ca=\"\">Data<\/a> from Etherscan shows the bot was able to earn 275 ETH ($832,000) by exchanging ether for USDC and then for USDT.","However, it paid most of the winnings to block producer Ethermine, ending up with a net profit of 10 ETH ($30,000).","The second bot enjoyed greater success, as it <a href=\"https:\/\/etherscan.io\/tx\/0x9e7581bec90c9ef03c7a937f14a0c88d2504a4b4a31816b91ef74c6bd35d8771\" data-v-f87c67ca=\"\">landed<\/a> a 164 ETH ($492,000) arbitrage opportunity. As was the case in the previous situation, the process involved swaps between the same trading pairs.","Of the 164 ETH scooped from the arbitrage opportunity, the bot only had to pay a 16.44 ETH ($49,000) bribe to F2Pool, the mining pool responsible for inserting its transaction in the appropriate block. This means this particular bot earned about 147 ETH ($446,000) profit."],"hashtag":["CRYPTO","MEV"]}