{"summary":"Major Ethereum liquid staking project Lido is currently discussing whether to sell or stake all of its treasury ether tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211663\/lido-dao-mulls-proposals-to-sell-or-stake-30-million-worth-of-ether","publishDate":"2023-02-14T14:00:24","id":7290,"type":null,"title":"Lido DAO mulls proposals to sell or stake $30 million worth of ether","category":["CRYPTO ECOSYSTEMS"],"content":["The Lido community is discussing a pair of governance proposals submitted by Steakhouse Financial, the financial unit of the Lido DAO, which call for the project to stake or sell the ether tokens held in its treasury.","Lido DAO holds 20,304 ether worth $30 million as part of its $350 million <a href=\"https:\/\/mainnet.lido.fi\/#\/lido-dao\/0xb9e5cbb9ca5b0d659238807e84d0176930753d86\/\" data-v-f87c67ca=\"\">treasury<\/a>. The funds are held in the project’s Aragon contract, as is the rest of the treasury, and Lido has maintained the ether balance since completing a treasury diversification process in April 2022.","Proposals <a href=\"https:\/\/research.lido.fi\/t\/should-lidodao-sell-treasury-eth\/3868\" data-v-f87c67ca=\"\">under consideration<\/a> include recommendations for a full or partial sale of the ether tokens which would see the DAO swap ETH for a stablecoin that could be used to extend the project’s runway. A partial sale could also see the remaining ether balance being staked.","The DAO could also stake all of its ether holdings, as <a href=\"https:\/\/research.lido.fi\/t\/should-lidodao-stake-treasury-eth\/3869\/2\" data-v-f87c67ca=\"\">suggested in one of the proposals<\/a>.","Selling or staking the ether are not the only options on the table, as there are also recommendations to use the tokens to provide liquidity on Curve or to purchase NFTs.","The deliberations on the DAO forum may lead to a <a href=\"https:\/\/www.theblock.co\/post\/159521\/lido-dao-votes-no-to-selling-14-5-million-in-ldo-tokens-to-dragonfly-capital\" data-v-f87c67ca=\"\">governance vote<\/a>. This process first involves a Snapshot vote to gauge delegate sentiments and a final on-chain vote to finalize the preferred option.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lido DAO","content":"LOCATION"},{"type":"$350 million","content":"MONEY"},{"type":"Lido","content":"LOCATION"},{"type":"April 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Steakhouse Financial","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Aragon","content":"LOCATION"},{"type":"$30 million","content":"MONEY"}],"hashtag":["DAOS","DERIVATIVES","ETHEREUM","LIDO FINANCE","STAKING"],"authors":["Osato Avan-Nomayo","The Block"]}