{"summary":"David Pan, founder of the major exchange in Taiwan, was accused of money laundering and fraud involving assets worth at least $10.7 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287501\/taiwans-ace-exchange-founder-among-seven-indicted-in-10-7-million-fraud-case","publishDate":"2024-04-10T03:57:47","id":73,"type":null,"title":"Taiwan’s ACE Exchange founder among seven indicted in $10.7 million fraud case","category":["ASIA"],"content":["Taiwanese prosecutors have indicted David Pan, founder of ACE Exchange, one of the major exchanges in Taiwan, along with six other suspects, on charges of money laundering and fraud involving assets worth at least $10.7 million.","The prosecutors <a href=\"https:\/\/www.tcc.moj.gov.tw\/media\/354574\/%E8%87%BA%E4%B8%AD%E5%9C%B0%E6%AA%A2%E7%BD%B2%E5%81%B5%E8%BE%A6%E7%8E%8B%E7%89%8C-ace-%E7%AD%89%E5%85%AC%E5%8F%B8%E6%B6%89%E5%AB%8C%E6%B4%97%E9%8C%A2%E7%AD%89%E6%A1%88%E4%BB%B6-%E7%B6%93%E6%AA%A2%E5%AF%9F%E5%AE%98%E5%81%B5%E6%9F%A5%E7%B5%82%E7%B5%90%E6%8F%90%E8%B5%B7%E5%85%AC%E8%A8%B4.pdf?mediaDL=true\" data-v-f87c67ca=\"\">stated<\/a> on Monday that ACE allegedly established an offshore entity to offer what it called the “Alfred Wallet” services to entice investors to deposit their stablecoin in the so-called wallets. The suspects then allegedly transferred and laundered the assets.","The victims realized they had been scammed when they failed to withdraw assets from their wallets, according to the statement. The group allegedly defrauded at least 162 individuals, involving over NT$342 million ($10.7 million), the prosecutors stated.","In response to the charges against its founder, ACE Exchange said in a <a href=\"https:\/\/ace.io\/news\/1466\" data-v-f87c67ca=\"\">statement<\/a> that Pan was a former executive and the wallet service involved in the case was not part of ACE and was solely developed by Pan and a third-party team he hired.","<span data-v-f87c67ca=\"\">“Please rest assured. The trading and operational status of ACE Exchange is completely normal,” ACE said. “We guarantee the security of user assets. All services for depositing and withdrawing cryptocurrencies and New Taiwan dollars are operating smoothly.”<\/span>","Pan has also been detained for <a href=\"https:\/\/www.theblock.co\/post\/270429\/founder-of-major-taiwanese-crypto-exchange-ace-arrested-for-alleged-fraud-report\" data-v-f87c67ca=\"\">another fraud case<\/a> he allegedly orchestrated. In January, Pan and a co-conspirator surnamed Lin were accused of collaborating for three years, using false advertisements on social media to entice investors into investing in certain cryptocurrencies.","When news of Pan’s arrest emerged in January, ACE clarified in a statement that Pan had ceased participation in daily operations in 2022.","<span data-v-f87c67ca=\"\">Established in 2018, ACE is one of the largest crypto exchanges in Taiwan, alongside BitoGroup and MaiCoin. ACE said at the time that its management team adheres to the rules of law and “will not tolerate any misconduct by anyone.”<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"NT$342 million ($10.7 million","content":"MONEY"},{"type":"David Pan","content":"PERSON"},{"type":"Pan’s","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Taiwan","content":"LOCATION"},{"type":"$10.7 million","content":"MONEY"},{"type":"MaiCoin","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"ACE Exchange","content":"ORGANIZATION"},{"type":"New Taiwan","content":"LOCATION"}],"hashtag":["CRIME"],"authors":["Timmy Shen","The Block"]}