{"summary":"SEC lawyers told a federal judge that portions of the Ripple Labs case that went against the agency were wrong and should be ignored.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241027\/sec-lawyers-preview-likely-ripple-appeal-in-case-against-do-kwon","publishDate":"2023-07-21T18:55:39","id":7302,"type":null,"title":"SEC lawyers preview likely Ripple appeal in case against Do Kwon","category":["POLICY"],"content":["On Friday, lawyers for the Securities and Exchange Commission used a separate ongoing enforcement case to preview a likely appeal of portions of the split decision last week in the agency’s case against Ripple Labs.","“Respectfully, those portions of Ripple were wrongly decided, and this Court should not follow them,” SEC lawyers argued in a Friday filing to Judge Jed Rakoff of the U.S. District Court for the Southern District of New York. The comments came in the agency’s case against Terraform Labs and its former CEO Do Kwon.","“SEC staff is considering the various available avenues for further review and intends to recommend that the SEC seek such review,” the lawyers continued.","The filing signals a likely appeal of the <a href=\"https:\/\/www.theblock.co\/post\/239559\/sec-faces-wake-up-call-after-ripple-ruling-though-appeal-likely\" data-v-f87c67ca=\"\">portion<\/a> of the <a href=\"https:\/\/www.theblock.co\/post\/235926\/sec-lawsuit-over-whether-xrp-is-a-security-will-go-to-trial\" data-v-f87c67ca=\"\">Ripple decision<\/a> that determined that “blind bid” or “programmatic” sales of XRP to third parties did not fit all the criteria of a securities offering. The lawyers would not ask the judge to ignore the ruling if they did not believe a decision to appeal would come from the commission, which has to vote on litigation.","A different judge in the same court as the Terraform and Do Kwon case issued the Ripple decision, which would be considered precedent relevant to the case unless the SEC appeals the decision.","The part of the Ripple decision that went against the SEC’s stance that XRP sales were illegal securities offerings was brought into the already-ongoing civil enforcement case by lawyers for Terraform and Kwon, who argued in a filing on Tuesday that the case against them should be dismissed as a result of the Ripple decision, which they describe as “fatal” to the SEC’s argument against them.","The SEC has made similar arguments that the sales of those tokens were illegal, though they also accuse Terraform and Kwon of $40 billion worth of outright fraud, an allegation not made in the Ripple case.","But SEC lawyers previewed their argument to overturn the portion of the Ripple decision that went against them, if the bipartisan commission approves an appeal, as it likely will.","The judge in the Ripple case “correctly concludes that defendants’ extensive public statements promoting XRP created in institutional buyers reasonable expectations of profits from Ripple’s efforts,” SEC lawyers wrote the court in their ongoing Terraform proceedings. But they argued that “the same result should have followed directly with respect to retail buyers too. Instead, Ripple creates an artificial distinction between the expectations of sophisticated institutional and retail investors, improperly transforms Howey’s reasonable investor inquiry into a subjective one, and turns on its head the reasoning underlying Howey and other cases.”","The lawyers added that the Ripple decision “appears to improperly add” a requirement that promise of return be made directly to an investor, and that each investor know that their money “was going directly to the promotor.” The decision takes an unusually narrow read on what normally defines a security investment, the lawyers argued.d&nbsp;&nbsp;","Finally, the lawyers argued that courts typically lean toward interpreting existing law in ways that accentuate protection of everyday investors, the ones who ultimately bought XRP in the process that last week’s split decision ruled was not a securities law violation. &nbsp;","“When distinguishing between classes of investors, courts construe the federal securities laws’ provisions to provide more — not less — protection to retail investors,” the SEC lawyers wrote.","If or when an appeal comes in the Ripple case, it would go to the Second Circuit Court of Appeals.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$40 billion","content":"MONEY"},{"type":"Kwon","content":"PERSON"},{"type":"Terraform Labs","content":"ORGANIZATION"},{"type":"Second Circuit Court of Appeals","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Howey","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"Jed Rakoff","content":"PERSON"}],"hashtag":["COURT HEARINGS","LAWSUITS","SEC"],"authors":["Colin Wilhelm","The Block"]}