{"summary":"Marty Chavez will provide Block.One counsel on business strategy and help develop a governance framework that will promote sustainable growth.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/79884\/goldman-sachs-former-top-technologist-is-joining-block-ones-board-as-chairman","publishDate":"2020-10-06T11:08:37","id":731,"type":null,"title":"Goldman Sachs&#x27;s former top technologist is joining Block.one&#x27;s advisory board as chairman","category":["CRYPTOCURRENCY"],"content":["Marty Chavez, one of Wall Street's most well-known technologists, has fallen deeper into the crypto rabbit hole.&nbsp;","The former chief financial officer and chief technology officer of banking behemoth Goldman Sachs is joining Block.one as chair of its advisory board, according to an announcement Tuesday. Block.one is the firm behind public blockchain EOS.io and its digital currency EOS.","Chavez, who as co-head of securities at Goldman played a role in overseeing the earliest cryptocurrency developments at the bank, will \"challenge leadership, provide counsel on business strategy, expand networks and help develop a governance framework\" as an advisor to the firm.","Chavez is already is an advisor to former Commodity Futures Trading Commission chair Chris Giancarlo's <a href=\"https:\/\/www.yahoo.com\/now\/ex-cftc-chief-digital-dollar-193936547.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAAtGelvMiaca4VXRyPxENk3FhFunEmSVTmj_TVi1HStElmqfdzDK7YPLDuirJDNU5j344NpObpKqCJy8vW7ftowpXx1yNkOkPY3X57cde-CmGXhK_6thdaX_RQZCm6zUBZ-9Z0ucJTV1QcLfHEsMECwS_G0WGugDAvvvue-_2dmv\" data-v-f87c67ca=\"\">Digital Dollar Project<\/a>.&nbsp;","The appointment is striking given Chavez's historical positions on digital currencies like bitcoin as well as stablecoins. In previous interviews, Chavez has cast doubt on the possibility that cryptocurrencies will usurp government back fiat currencies.&nbsp;","\"I&nbsp;think whether you look at some of the early days of bitcoin or whether you look at some more recent efforts that have been in the news I think to forget the sovereign and to forget Leviathan is a huge mistake,\" he said during an <a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\/e\/63191653\" data-v-f87c67ca=\"\">interview<\/a> with The Block in 2019.&nbsp;","Chavez hasn't necessarily wavered from that stance, nor does he think the EOS token itself is better positioned than bitcoin to rival U.S. dollar as a form of money.&nbsp;","\"There is a coin that is associated with Block.one and that is the EOS coin as you know. In all my discussions with the team, I have been focused elsewhere,\" he said in an exclusive interview with The Block. \"I don’t think any of these things are competing with US dollar.\"","Specifically, Chavez said that there are merits to the underlying public blockchain, which he thinks has the potential to serve as the foundation for an array of decentralized use-cases ranging from decentralized AWS to financial applications.","Chavez's appointment was announced in tandem with news that Block.one would welcome Google Cloud to its community. The firm is \"taking steps to become an EOS network block producer.\"","Speaking to financial-services use-cases, specifically, Chavez said blockchains can be leveraged to improve existing Wall Street products like equity swaps and credit default swaps.&nbsp;","\"Equity swaps have complex life cycles. There are complex questions like what happens to an equity swap in the event of some corporate action. What started as a bilateral swap could have many entities participating. So there's this natural notion of wouldn’t it be great to have this exist on a blockchain so we are all looking at the same data. With a CDS, the notion that there is a warehouse with the definition record of what this is and who are the counterparts, what are the terms. has been around of a long time. Thus, a decentralized warehouse makes a lot of sense.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chris Giancarlo","content":"PERSON"},{"type":"Marty Chavez","content":"PERSON"},{"type":"Digital Dollar Project","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Chavez","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Leviathan","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"AWS","content":"ORGANIZATION"}],"hashtag":["GOLDMAN SACHS"],"authors":["Frank Chaparro","The Block"]}