{"summary":"FTX founder Sam Bankman-Fried will no longer contest extradition to the United States, where he is facing criminal fraud charges, according to Reuters.\nThe former CEO is charged with committing or conspiring to commit fraud on FTX’s customers and lenders plus counts of money laundering.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195979\/sam-bankman-fried-wont-fight-u-s-extradition-reuters","publishDate":"2022-12-17T15:58:03","id":731,"type":null,"title":"Sam Bankman-Fried won’t fight US extradition: Reuters","category":["Crypto Ecosystems"],"content":["<span data-v-f87c67ca=\"\">Sam Bankman-Fried, the founder and former CEO of FTX, is expected to tell a court in the Bahamas on Monday he will no longer contest extradition to the United States, where he is facing criminal fraud charges, Reuters reports citing an unnamed source.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Earlier this week, Bankman-Fried was arrested in the Bahamas and slapped with fraud charges.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">A U.S. grand jury <a href=\"https:\/\/www.theblock.co\/post\/194667\/disgraced-former-ftx-ceo-sam-bankman-fried-criminally-indicted\" data-v-f87c67ca=\"\">charged him<\/a> with committing or conspiring to commit fraud on FTX’s customers and lenders plus counts of money laundering. The Securities and Exchange Commission <a href=\"https:\/\/www.theblock.co\/post\/194509\/sam-bankman-fried-charged-with-fraud-over-ftx-collapse\" data-v-f87c67ca=\"\">is charging<\/a> the disgraced crypto entrepreneur with defrauding investors. The SEC also alleges Bankman-Fried used customer funds for political donations and to fund an extravagant lifestyle.<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried resides in the Bahamas, where FTX is also based. He is currently behind bars at <\/span><span data-v-f87c67ca=\"\">Fox Hill prison after a judge denied a request to stay at home while awaiting a hearing on his extradition, according to Reuters. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">If <\/span><span data-v-f87c67ca=\"\">convicted of all the criminal charges Bankman-Fried <a href=\"https:\/\/www.theblock.co\/post\/195923\/out-of-his-league-riot-games-looks-to-distance-from-sam-bankman-fried\" data-v-f87c67ca=\"\">could face<\/a> up to 115 years in prison.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i><br data-v-f87c67ca=\"\">\n<\/span>"],"hashtag":[]}