{"summary":"TempleDAO suffered an exploit Tuesday morning for roughly $2.3 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176299\/hacker-steals-2-3-million-from-templedao","publishDate":"2022-10-11T14:09:25","id":7311,"type":null,"title":"Hacker steals $2.3 million from TempleDAO","category":["DEFI"],"content":["TempleDAO, a protocol that claims it provides sustainable income via staking, suffered a malicious exploit this morning on one of its staking vaults for 1,830 ETH, roughly $2.3 million at the time, <a href=\"https:\/\/twitter.com\/0xPaladinSec\/status\/1579842797775249408?s=20&amp;t=bICOLTExKunOhIERbEoGTw\" data-v-f87c67ca=\"\">according to data from Etherscan.<\/a>","A TempleDAO contributor said in the project's Discord channel that its CORE vaults, which hold over $100 million in stablecoins, are unaffected and “the exploiter can do no further harm.\"","\"Remediations will be made for all affected users,\" the contributor wrote.","Data from Etherscan shows a withdrawal from the project’s STAX staking vault took place at roughly 9:11 a.m. EST on Oct. 11. The withdrawal was “precisely 1,418,303 TEMPLE and 1,362,438 FRAX”, according to an announcement made in the TempleDAO <a href=\"https:\/\/discord.com\/channels\/847178511604252741\/847607462852952094\/1029413763788574790\" data-v-f87c67ca=\"\">Discord<\/a>.","The TEMPLE tokens were sold for the stablecoin FRAX. The address involved has been linked to a Binance account, which provided the initial funds to the exploiting wallet address. It received 1.1 ETH about an hour and a half before the exploit occurred.","Smart contract and cross-chain bridge vulnerabilities have been a source of significant concern in light of multiple code exploits over the past year. A hacker recently stole $2 million from the <a href=\"https:\/\/www.theblock.co\/post\/176118\/hacker-drains-1-million-from-qanplatform-bridge-token-slumps-94\" data-v-f87c67ca=\"\">WANplatform cross-chain bridge.<\/a>","The TempleDAO hack is related to a non-bridge related smart contract exploit, blockchain security firm Paladin <a href=\"https:\/\/twitter.com\/0xPaladinSec\/status\/1579843245483659265?s=20&amp;t=lhI2o6cox3x0btvsYdaHCg\" data-v-f87c67ca=\"\">tweeted.<\/a>","This exploit was due to “several malpractices” in one of the staking functions, which allowed users to migrate staked tokens from an older contract. The exploiter called this specific function with a fake address, giving them access to withdraw all the funds from the vault to themselves instead of the new contract.","The exploit is “one of the most trivial exploits at scale in awhile,” <a href=\"https:\/\/twitter.com\/0xPaladinSec\/status\/1579844811116670977?s=20&amp;t=dD7ycvMSgRWFj31bgL0H-A\" data-v-f87c67ca=\"\">Paladin wrote.<\/a> The exploited contract was deployed over 100 days ago, and the vulnerability has been present since its deployment.","The TempleDAO token briefly dropped 20% after the staking vault theft. This market drop occurred when the exploiter swapped TEMPLE for FRAX, which was the most liquid pool (lowest slippage), according to Dexscreener.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"this morning","content":"TIME"},{"type":"Oct. 11","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"$2.3 million","content":"MONEY"},{"type":"Paladin","content":"LOCATION"},{"type":"9:11 a.m. EST","content":"TIME"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}