{"summary":"As readers of CCM will recall, the CentraTech ICO raised $32 million in crypto and then in late 2017 the whole thing came crashing to a halt when the SEC","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/43091\/class-certification-denied-in-32-million-centratech-ico-lawsuit-and-defendants-ask-to-return-ether-in-parallel-criminal-case","publishDate":"2019-10-12T11:37:08","id":7312,"type":null,"title":"Class certification denied in $32 million CentraTech ICO lawsuit and defendants ask to return ether in parallel criminal case","category":["LEGAL"],"content":["As readers of CCM will recall, the CentraTech ICO raised $32 million in crypto and then in late 2017&nbsp;the whole thing came crashing to a halt when the <a href=\"https:\/\/www.sec.gov\/litigation\/complaints\/2018\/comp-pr2018-53.pdf\" data-v-f87c67ca=\"\">SEC sued the co-founders for orchestrating a fraudulent ICO<\/a>&nbsp;and they were picked up by criminal authorities and charged with, yes, crimes. &nbsp;This is also the ICO that had DJ Khaled, and Floyd Mayweather as celebrity promoters (<a href=\"https:\/\/www.theblockcrypto.com\/post\/4313\/sec-fines-boxer-and-dj-for-undisclosed-paid-promotion-of-icos\" data-v-f87c67ca=\"\">which got them into a little hot water themselves with the SEC<\/a>). &nbsp;There's also a class action pending in Florida federal court.","A lot has happened in these cases so this week we're gonna give you an updated in the form of a CentraTech twofer. &nbsp;First, Nelson &nbsp;covers a class certification motion in Florida federal court where the defendants seem to have caught a lucky break. &nbsp;Next, Palley writes about something called a Motion to Return Ether, which the defendants filed in their criminal cases. &nbsp;","<a class=\"bs cz mu mv mw mx\" href=\"https:\/\/www.scribd.com\/document\/429813635\/Centra-Tech-Order\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Link to order<\/a>","This is a court order denying a motion for class certification in the saga that has been the Centra Tech case in federal court in the Southern District of Florida (\"S.D. Fl.\")","We <a href=\"https:\/\/www.theblockcrypto.com\/post\/23788\/dj-khaled-floyd-mayweather-dismissed-from-lawsuit-against-32m-ico\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">previously wrote about the class action lawsuit<\/a> at issue in this case in <a class=\"bs cz mu mv mw mx\" href=\"https:\/\/medium.com\/crypto-caselaw-minute\/crypto-caselaw-minute-36-5-16-2019-2e6aae43eca6\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">CCM #36<\/a>, and the <a href=\"https:\/\/www.theblockcrypto.com\/post\/28344\/centra-tech-co-founders-may-claim-advice-of-counsel-defense-in-ongoing-criminal-case\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">pending criminal investigation underway<\/a> in the S.D.N.Y. in <a class=\"bs cz mu mv mw mx\" href=\"https:\/\/medium.com\/crypto-caselaw-minute\/crypto-caselaw-minute-41-6-20-19-3b3fb093e0b\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">CCM #41<\/a>. For good measure there is an SEC enforcement action. &nbsp;Given the fact that criminal and SEC cases have been brought, you'd think the fact that this is all a bit of a mess would lead to an easy path for a class action. &nbsp;Apparently not so much.","Certain requirements need to be satisfied for a class action to be certified. For example, the putative class action plaintiff needs to show, among other things:","(1) the class is so numerous that joinder of all members is impracticable;","(2) there are questions of law or fact common to the class;","(3) the claims or defenses of the representative parties are typical of the claims or defenses of the class; and","(4) the representative parties will fairly and adequately protect the interests of the class.","If these hurdles are cleared the plaintiff has to fit into one of three buckets for why class action is in everybody’s best interest (yes, class action lawyers, I am oversimplifying). But two key points the Court considers when determining if a class is proper are if the class is ascertainable, as in can they even figure out who the members of the class are based on the plaintiff's assertions, and the timeliness of the filing for class certification. Here, the Court determined that the plaintiff failed on both counts.","Federal courts generally have their own local rules, in addition to the federal rules of civil procedure. The S.D. Fla. does not have a local rule pertaining to the timeliness of the filing of a class certification, but the Court noted that two other Florida federal courts, along with others around the country DO have rules related to timeliness of certification filings. Here, the certification motion was filed 18 months after the initial lawsuit was filed, and 6 months after the first amended complaint. Also, the Court seems to suggest the delay was deliberately done after defendants were dismissed and default judgment done to them. &nbsp;And the Court didn't like that.&nbsp;","Anyway. &nbsp;This would have been enough to deny the motion for class certification, but then the Court took the extra step to lay out why even if the motion was timely it was woefully deficient. In particular, upon reviewing the facts of the case at the time and the plaintiffs' three proposed classes the Court found that there was essentially no way that they would be able to identify members of the class. The plaintiff made reference to a supposed spreadsheet that the Federal government has of Centra Token purchasers in the criminal case, but there was no guarantee they could even get the spreadsheet. Another argument they asserted that you could definitely ascertain their proposed classes was a hand-wavy “you can look at the crypto exchanges, they know,” which the Court in essence said “Dude. Come on.”","<strong class=\"mh nt\" data-v-f87c67ca=\"\">United States v. Sharma et al., 18 Cr. 340(LGS), S.D.N.Y. 10\/4\/2019 (“Motion to Return Ether”) [SDP]<\/strong>","<a href=\"https:\/\/www.scribd.com\/document\/429814853\/Motion-to-Return-Ether\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Link to case<\/a>","Whether or not you agree with Ecclesiastes 1:9 that there is nothing new under the sun, this is absolutely the first time ever in any court anywhere ever that anyone has ever filed a motion called “Motion to Return Ether.” I’m just saying. <strong class=\"mh nt\" data-v-f87c67ca=\"\">This has never happened before. <\/strong>And, I was going to write about something other than the Centra case, because Nelson covered the class action denial but the siren song of a never before filed motion caught my eye, so here we are.","This motion is filed in the criminal case against Sam Sharma and Robert Farkas. It says that the government has in its possession 100,000 Ether taken from the defendants by the government and asks that the Court order the government to “anyone who purchased Centra Tokens from Centra Tech during its token sale and suffered a loss as a result of its purchase (‘Purchasers’).”","The government has refused to return the Ether, the Motion says, if there is a pro rata return but will maybe agree to do so if there is no pro rata return and purchasers agree to receive ether in return.","The Motion claims that “Centra Tech’s business model focused on creating a technological system that would allow persons having all types of cryptocurrency to spend it in a more familiar way by using a functional platform like a traditional debit card.” You can see the defense argument developing here, as the brief explains that “During the summer of 2017, Centra Tech began Beta testing its card program and system. By the end of December of 2017, Centra Tech began shipping its full-scale product operating on the Mastercard network.” Presumably the SEC will argue that the business model was a fiction and the real goal was to fleece money from investors.","Defendants say that they have been trying to return the Ether they got in the sale since late 2017, and the government has consistently refused — and meanwhile the value of Ether has dropped considerably, damaging investors. But the SEC says that the return that the defendants propose would be an illegal rescission. They ask in this motion for the court to order the government to return the Ether to “the same people and entities the government views as alleged victims in this case.”","Defendants recognize a difference between people who suffered a loss and those who made a profit on their sale of Centra tokens, and propose that the government address the issue thus:","this Court should order the government to identify the Purchasers it contends have suffered a loss and promptly return the proper amount of Ether to them through a claims process. Again, the Defendants have no objection to the Ether being used to refund the Purchasers who sold their Centra Tokens purchased during the token sale period from Centra Tech for a loss or have owned and held their Centra Tokens the entire time since there purchase from Centra Tech. Those who purchased from Centra Tech but sold for a gain and those who purchased from third parties are ineligible. Thus, the Purchasers will all receive what they purportedly lost before trial begin.","While there are some admittedly complicated issues relating to the return of this substantial amount of crypto, there are some pretty compelling arguments here. I mean, why sit on a 100,000 ether — given its inherent volatility — if you can refund it to people who are the alleged victims. Surely there’s a way to sort this out.","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Disclaimer: Crypto Caselaw Minute is provided for educational purposes only by Stephen Palley (@stephendpalley) and Nelson Rosario (@nelsonmrosario). These summaries are not legal advice. They are our opinions only, aren’t authorized by any past, present or future client or employer. Also, we might change our minds. We contain multitudes. &nbsp;<\/em><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">As always, Rosario summaries are “NMR” and Palley summaries are “SDP”. &nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the Court","content":"ORGANIZATION"},{"type":"Nelson Rosario (","content":"PERSON"},{"type":"#36","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Centra","content":"ORGANIZATION"},{"type":"CCM","content":"ORGANIZATION"},{"type":"Sam Sharma","content":"PERSON"},{"type":"Centra Tokens","content":"ORGANIZATION"},{"type":"Centra Token","content":"ORGANIZATION"},{"type":"United States v. Sharma","content":"LOCATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"summer of 2017","content":"DATE"},{"type":"Southern District of Florida (\"S.D. Fl","content":"ORGANIZATION"},{"type":"Nelson","content":"ORGANIZATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"Florida","content":"LOCATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"late 2017","content":"DATE"},{"type":"Floyd Mayweather","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"CentraTech ICO","content":"ORGANIZATION"},{"type":"December of 2017","content":"DATE"},{"type":"S.D. Fla.","content":"LOCATION"},{"type":"Robert Farkas","content":"PERSON"},{"type":"$32 million","content":"MONEY"},{"type":"Palley","content":"PERSON"},{"type":"Ecclesiastes","content":"LOCATION"},{"type":"Centra Tech","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nelson Rosario","Stephen Palley","The Block"]}