{"summary":"BlockFi is offering its employees buyout options as a way to stealthily reduce its workforce, according to a Decrypt report.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158416\/blockfi-offers-employees-buyouts-to-further-reduce-headcount-decrypt","publishDate":"2022-07-19T04:42:43","id":7316,"type":null,"title":"BlockFi offers employees buyouts to further reduce headcount: Decrypt","category":["HIRING"],"content":["Cryptocurrency lender BlockFi is reportedly offering its employees a buyout scheme in order to further whittle down its workforce, only one month after cutting <a href=\"https:\/\/www.theblock.co\/search?query=blockfi&amp;start=10\" data-v-f87c67ca=\"\">a fifth of staff<\/a>.&nbsp;","Through a \"voluntary separation program\" the company is offering employees 10 weeks of paid leave and 10 weeks of health insurance to resign, according to a <a href=\"https:\/\/decrypt.co\/105379\/blockfi-employee-buyouts-one-month-after-cutting-staff\" data-v-f87c67ca=\"\">Decrypt report<\/a> that cited an unidentified employee and a BlockFi spokesperson.&nbsp;","\"BlockFi initiated a voluntary separation program to right-size our organization for the current market environment,\" a company spokesperson told&nbsp;Decrypt. \"This is not an action we took lightly and want to ensure that employees have resources to consider the decision that is right for them.\"","The Block also reached BlockFi for comment but did not hear back by the the time of publication.&nbsp;","This comes as the crypto lender announced a deal at the beginning of the month with FTX.US that would see it given <a href=\"https:\/\/www.theblock.co\/post\/155516\/blockfi-strikes-680-million-credit-deal-with-ftx-us-outlines-acquisition-path\" data-v-f87c67ca=\"\">a $400 million credit line<\/a>, outlining a path to acquisition by the crypto exchange.&nbsp;","BlockFi is joining other firms in the crypto space in cutting costs. The entire market has been hit hard by the collapse of the Terra ecosystem and the bankruptcies of hedge fund Three Arrows Capital and rival lending firm Celsius.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"$400 million","content":"MONEY"}],"hashtag":["BLOCKFI","LAYOFFS","LENDING"],"authors":["Tom Matsuda","The Block"]}