{"summary":"SEC Chair Gensler declined to comment on a potential appeal to a high profile Grayscale ruling as the deadline for that filing approaches.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256382\/sec-chair-gensler-is-mum-on-possible-grayscale-appeal-ahead-of-midnight-deadline","publishDate":"2023-10-13T13:16:07","id":7319,"type":null,"title":"SEC Chair Gensler is mum on possible Grayscale appeal ahead of midnight deadline","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Securities and Exchange Commission Chair Gary Gensler was mum about a potential appeal to a high profile ruling involving Grayscale Investments' attempt to convert its flagship fund into a spot bitcoin ETF, declining to comment on the matter when asked by journalists at a press conference on Friday.<br data-v-f87c67ca=\"\">\n<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC has until midnight to file an appeal over the August <a href=\"https:\/\/www.theblock.co\/post\/246115\/court-hands-grayscale-win-in-long-running-suit-against-sec\" data-v-f87c67ca=\"\">decision<\/a> that directed the regulator<\/span><span class=\"s2\" data-v-f87c67ca=\"\"> to re-review Grayscale's bid for a spot fund, with the court s<\/span>pecifically addressing the SEC's differential treatment of spot bitcoin ETFs and similar funds based on futures contracts, which the regulator has approved.&nbsp;","<span class=\"s2\" data-v-f87c67ca=\"\">The asset management firm sued the agency last year following its rejection of the plan for the conversion of its GBTC fund.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">If the SEC does not appeal in the coming hours before midnight, meaning asking for an en banc hearing, which is a a rehearing with all three judges who participated in the initial ruling, then that could lead to continued optimism in the industry that a spot bitcoin ETF is incoming.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I think if the SEC doesn't seek a rehearing here, it's another positive sign towards a final approval for an ETF,\" said <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Jennifer Schulp, director of financial regulation studies at the libertarian think tank Cato Institu<\/span><span class=\"s2\" data-v-f87c67ca=\"\">te.&nbsp;<\/span>","But that won't happen quickly, Schulp warned.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">\"It doesn't mean that that approval is coming quickly and it's still not a certainty given that the SEC could re-review and deny on different grounds and basically start this legal fight all over again,\" Schulp said.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Grayscale first brought the case against the SEC last year for the rejection of its proposal to convert its flagship fund, GBTC, into a spot bitcoin ETF. Don Verrilli, lead counsel for Grayscale, said during oral arguments in March that the SEC is contradicting itself by allowing bitcoin <a href=\"https:\/\/www.theblock.co\/post\/255560\/gold-etfs-could-shed-light-on-the-secs-thinking-about-proposals-for-spot-bitcoin-funds\" data-v-f87c67ca=\"\">futures ETFs<\/a>, but not a spot bitcoin ETF.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Grayscale sent a letter to the SEC last month asking to meet with regulators to discuss converting its Grayscale Bitcoin Trust into a spot bitcoin ETF.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">&nbsp;\"We hope you will agree that the best use of resources now is for the Commission to issue an order approving NYSE Arca’s Rule 19b-4 filing and authorize the staff to work with Grayscale and NYSE Arca to finalize the prompt listing of the Trust’s shares,\" <a href=\"https:\/\/www.theblock.co\/post\/249334\/grayscale-lawyers-ask-sec-to-discuss-greenlighting-spot-bitcoin-etf\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">lawyers<\/span><\/a> for Grayscale said at the time.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC has not yet greenlit a spot bitcoin ETF, though the Grayscale ruling was seen as a positive for the slew of firms that have applied for spot bitcoin ETFs over the past few months including big names such as <a href=\"https:\/\/www.theblock.co\/post\/235056\/blackrock-takes-giant-leap-toward-spot-bitcoin-etf-with-sec-filing\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">BlackRock<\/span><\/a> and<a href=\"https:\/\/www.theblock.co\/post\/236588\/fidelity-preparing-to-submit-spot-bitcoin-etf-filing-source\" data-v-f87c67ca=\"\"> <span class=\"s4\" data-v-f87c67ca=\"\">Fidelity<\/span><\/a>.<\/span>","The SEC could decide to not ask for an en banc hearing and instead re-review Grayscale's application and perhaps find a different reason to not approve of it, Schulp said.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">\"They've considered it several times in the past and have given consistent reasoning on the denial so to go back now, re review it, and come up with a new reason, leaves that pretty vulnerable to challenge again and I would think would make it difficult for the D.C. Circuit to agree with them that any new reason was also not arbitrary and capricious,\" Schulp said. \"That said, we've seen stranger things out of the SEC. And if there is appetite for not wanting to approve this, that's a path that the SEC could take.\"<\/span>","However, the most likely outcome is that the SEC delays making a decision, but ultimately approves all the spot bitcoin ETF applications together at the \"last possible minute.\"","The SEC could also decide not to file for a rehearing on Friday, and instead file for a U.S. Supreme Court review, which Schulp said was not expected, but is possible.&nbsp;","<em data-v-f87c67ca=\"\">Updated at 3:45 p.m. ET with comments from Jennifer Schulp&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Commission","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"Jennifer Schulp","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"U.S. Supreme Court","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"Schulp","content":"PERSON"},{"type":"midnight","content":"TIME"},{"type":"Gary Gensler","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"last year","content":"DATE"},{"type":"Don Verrilli","content":"PERSON"},{"type":"3:45 p.m.","content":"TIME"},{"type":"Exchange Commission","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"D.C.","content":"LOCATION"},{"type":"August","content":"DATE"},{"type":"NYSE Arca","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}