{"summary":"Traders are hedging short-term on the lead up to The Merge.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170060\/traders-hedge-their-bets-heading-into-ethereums-merge","publishDate":"2022-09-14T15:05:54","id":7326,"type":null,"title":"Traders hedge their bets heading into Ethereum&#x27;s Merge","category":["THE MERGE"],"content":["Ether derivatives soared over the past six weeks as The Merge became top of mind — and now, traders are focused on hedging their bets.&nbsp;","Ethereum's transition to proof of stake is expected to occur early Thursday. The Block canvassed the crypto market ecosystem to assess how traders are acting and reacting ahead of the event, which catapulted ether derivatives to <a href=\"https:\/\/www.theblock.co\/post\/167454\/ether-derivatives-smash-milestones-left-and-right-as-the-merge-looms\" data-v-f87c67ca=\"\">new records in August<\/a>.&nbsp;","LedgerPrime, a digital asset trading firm and a subsidiary arm of crypto exchange FTX, shared in its biweekly market update noted that The Merge is on every trader’s mind, and this week’s option profile was dominated by year-end and close-to-money call trading.&nbsp;","The report showed how both the bull put spread and the bear call spread were the most traded structures leading into the upgrade. The bull put is traded in anticipation of a moderate rise in price, while the bear call spread is typically used when there is a chance of a moderate downside movement, high volatility, or in order to mitigate risk.","LedgerPrime's Laura Vidiella told The Block on Wednesday that options traders have mostly been placing \"costless or low-cost hedges,\" and \"selling calls and using premium to buy puts.\"&nbsp;","Vidiella noted that funding for ether perpetuals is negative, with lots of short-term hedging taking place. According to Vidiella, traders are willing to accept the negative funding rates over the next few days in order to profit from any potential ether crashes — having most likely covered themselves during the surge in trading during August.&nbsp;","Vidiella also highlighted that macro factors will continue to affect the market in the short run, as evidenced by yesterday's crash following the U.S. CPI release.&nbsp;","In August, ether derivatives set new milestones.","O<span data-contrast=\"auto\" data-v-f87c67ca=\"\">pen interest in ether options initially surpassed bitcoin open interest, and then the volume of ether futures eclipsed bitcoin for the first time.<\/span>","Most metrics continued to surge heading into&nbsp; September and on Tuesday, ether open interest on the Chicago Mercantile Exchange (CME) hit its highest point since May.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/average-daily-volume-of-cme-ethereum-futures-monthly\/embed\" title=\"Volume and OI of CME Ethereum futures\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The price of ether whipsawed throughout August, gaining as much as 18% one week before surrendering those advances a week later.","However, ether wasn't alone as most major cryptocurrencies fluctuated throughout the month, broadly in line with wider financial markets.&nbsp;","<em data-v-f87c67ca=\"\">Follow The Block's live coverage of The Merge <a href=\"https:\/\/www.theblock.co\/post\/169846\/the-merge-live-coverage-of-ethereums-major-upgrade\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">here<\/a>.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Laura Vidiella","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Vidiella","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"18%","content":"PERCENT"},{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"August","content":"DATE"}],"hashtag":["DERIVATIVES"],"authors":["Adam Morgan McCarthy","The Block"]}