{"summary":"Bitcoin miner Iris Energy doubled its hash rate to 2.3 EH\/s and expects to add an additional 1.4 EH\/s by the end of the month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162178\/iris-energy-doubles-hash-rate-after-reaching-50-megawatts-at-mackenzie-site","publishDate":"2022-08-08T13:37:30","id":7327,"type":null,"title":"Iris Energy doubles hash rate after reaching 50 megawatts at Mackenzie site","category":["MINING"],"content":["Bitcoin miner Iris Energy doubled its hash rate to 2.3 exahash per second (EH\/s) after completing phase two of its Mackenzie site, in Canada, last Friday.","The company expects to add an additional 1.4 EH\/s (or 50 megawatts in energy capacity) by the end of the month at its site in Prince George, Canada, according to a statement on Monday. This will bring its total hash rate up to 3.7 EH\/s.","\"We are particularly pleased to continue our track record of delivering projects on schedule, despite the current market backdrop and ongoing international supply chain challenges,\" co-founder and co-CEO Daniel Roberts said.","Iris Energy announced recently that it was increasing its expected total operating capacity from 4.3 EH\/s to 6.0 EH\/s by the end of the year.","The second phase of the Mackenzie site was initially expected to be completed by the end of the third quarter of this year. The facility should be operating at full capacity (80 megawatts) by the end of the fourth quarter.","The company has a series of sites under development, two in Canada and one in Texas.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Prince George","content":"LOCATION"},{"type":"Daniel Roberts","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Mackenzie","content":"PERSON"},{"type":"last Friday","content":"DATE"},{"type":"Bitcoin miner Iris Energy","content":"ORGANIZATION"},{"type":"third quarter","content":"DATE"},{"type":"Iris Energy","content":"ORGANIZATION"},{"type":"end of the fourth quarter","content":"DATE"},{"type":"Texas","content":"LOCATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}