{"summary":"Google Cloud, the cloud division of the search engine giant Google, will serve as a validator on the proof-of-stake blockchain Tezos.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213851\/tezos-signs-up-google-cloud-as-a-validator-on-its-blockchain","publishDate":"2023-02-22T04:05:16","id":7328,"type":null,"title":"Tezos signs up Google Cloud as a validator on its blockchain","category":["CRYPTO ECOSYSTEMS"],"content":["Tezos Foundation teamed up with Google Cloud to accelerate the development of web3 applications on the Tezos blockchain. Under this partnership, Google Cloud, the cloud division of the search engine giant Google, has agreed to serve as a validator on the proof-of-stake blockchain Tezos.","The deals aims to to allow Google Cloud's corporate clients to develop and deploy web3 applications on the Tezos blockchain using Google's cloud infrastructure, according to a statement.","By acting as a validator or \"baker\" on the Tezos network, Google Cloud will allow its corporate customers to support blockchain development. Furthermore, select startups incubated by Tezos will also be eligible for Google Cloud credits and mentorship.","James Tromans, engineering director of web3 at Google Cloud, said, \"At Google Cloud, we're providing secure and reliable infrastructure for Web3 founders and developers to innovate and scale their applications. We look forward to bringing the dependability and scalability of Google Cloud to power Web3 applications on Tezos.\"&nbsp;","This is not Google Cloud's first foray into the blockchain space. Last September, it agreed to run a <a href=\"https:\/\/roninblockchain.substack.com\/p\/sky-mavis-adds-google-cloud-as-ronin\" data-v-f87c67ca=\"\">validator node<\/a> on the Ronin network, which is a gaming-centric Ethereum sidechain. Then, a month later, it <a href=\"https:\/\/www.theblock.co\/post\/180458\/google-cloud-announces-blockchain-node-service-starting-with-ethereum\" data-v-f87c67ca=\"\">launched<\/a> a blockchain node-hosting engine for Ethereum developers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"James Tromans","content":"PERSON"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Tezos","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}