{"summary":"Masayoshi Son, the billionaire founder and CEO of Japanese conglomerate SoftBank, says he doesn&#x27;t understand bitcoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/85273\/softbank-ceo-bitcoin-i-dont-understand","publishDate":"2020-11-20T06:00:06","id":733,"type":null,"title":"&#x27;I don&#x27;t understand&#x27; bitcoin, says billionaire SoftBank CEO Masayoshi Son","category":["BITCOIN"],"content":["Masayoshi Son, the billionaire founder and CEO of Japanese conglomerate SoftBank, says he doesn't understand bitcoin as it is too volatile.","Speaking virtually at The New York Times' Dealbook Conference on Tuesday, Son <a href=\"https:\/\/www.youtube.com\/watch?v=4KZrOf0lyUA&amp;feature=youtu.be\" data-v-f87c67ca=\"\">said<\/a> he once invested in bitcoin as one of his friends \"strongly recommended\" it.","The friend suggested Son putting at least 1% of his personal net worth into bitcoin. As a result, Son ended up investing around $200 million or so in bitcoin at the time, he said. But the bitcoin market's high volatility became so much of a distraction for Son that he ended up selling bitcoin at a loss of around $50 million or so.","\"I was looking at the price every day...up and down. I said, this is no good. This is something I don't understand. My mindshare is somewhat affected...this was distracting my focus on my own business,\" said Son. \"So I said okay I would sell whatever the price and I sold with some loss, maybe I lost [$] 50 million, I don't know...I forgot.\"","Last year, there were <a href=\"https:\/\/www.wsj.com\/articles\/softbank-founder-masayoshi-son-lost-130-million-on-bitcoin-11556017200\" data-v-f87c67ca=\"\">reports that said<\/a> Son invested in bitcoin at peak prices in 2017 and sold it in early 2018 at a loss of more than $130 million.","The price of bitcoin has been rallying recently, having crossed $18,000, but it still doesn't attract Son's attention. At the conference, Son said bitcoin today \"maybe more than the price I sold, but I feel so much better because at least I don't have to put my mind in something I don't understand.\"","Son still believes that digital currency is the future, but his focus is on artificial intelligence (AI) now.&nbsp;","\"I think digital currency is definitely going to be useful with the security and so on...but I don't know what digital currency, what structure...I would rather focus my 300 years for something that I feel passionate [about], which is the AI focus right now,\" said Son.","Son, 63, recorded a personal net worth of <a href=\"https:\/\/en.wikipedia.org\/wiki\/Masayoshi_Son\" data-v-f87c67ca=\"\">around $30 billion<\/a> as of August 2020.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"August 2020","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"SoftBank","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"$130 million","content":"MONEY"},{"type":"The New York Times","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$] 50 million","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"$200 million","content":"MONEY"},{"type":"$18,000","content":"MONEY"},{"type":"$50 million","content":"MONEY"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["BITCOIN"],"authors":["Yogita Khatri","The Block"]}