{"summary":"Bitcoin miner CleanSpark increased its mining production by about 10% in June and sold most of the bitcoin mined last month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156056\/cleanspark-sold-nearly-all-339-bitcoin-it-mined-in-june","publishDate":"2022-07-06T10:46:03","id":7330,"type":null,"title":"CleanSpark sold nearly all 339 bitcoin it mined in June","category":["THE BLOCK"],"content":["Bitcoin miner CleanSpark increased its production in June by almost 9% compared with the previous month, mining a total of 339 BTC.","The company also sold nearly all bitcoin mined in June, according to a production update published on Wednesday.","CleanSpark brought in roughly $8.4 million from the sale of 328 bitcoin (at an average of $25,644 per BTC). Bitcoin lost about a third of its value over the month of June, going from around the $30,000 mark at the beginning of June to close to $20,000 now.","CleanSpark has been less rigorous about holding on to its mined bitcoin than others in the industry, instead choosing to sell some each month. It held a total of 561 BTC as of June 30. \"We won't blindly accumulate bitcoin at the cost of diluting our shareholders and taking on unnecessary debt,\" CEO Zach Bradford said during the first-quarter 2022 earnings call in early May.","Still, even the miners who have historically maintained a policy of holding onto their coins have been selling recently. Last month, <a href=\"https:\/\/www.theblock.co\/post\/155853\/core-scientific-sold-7202-bitcoin-in-june-generating-167-million\" data-v-f87c67ca=\"\">Core Scientific sold 7,202 BTC<\/a> — about 89% of the bitcoin holdings it had at the end of May. Bitfarms also <a href=\"https:\/\/www.theblock.co\/post\/153294\/bitfarms-gives-up-3000-btc-to-pay-down-100-million-loan-from-galaxy-digital\" data-v-f87c67ca=\"\">gave up 3,000 BTC to pay down part of a $100 million loan<\/a>.","Earlier this month, CleanSpark announced that it <a href=\"https:\/\/www.theblock.co\/post\/152216\/capitalizing-on-buyers-market-cleanspark-acquires-1800-bitcoin-miners\" data-v-f87c67ca=\"\">acquired 1,800 mining rigs<\/a>, adding over 0.252 exahash per second (EH\/s) to its bitcoin mining capacity. Currently, it operates a fleet of roughly 28,500 bitcoin miners with a hash rate exceeding 2.8 EH\/s.","“We were able to secure the contract at an exceptional price because of our strategic relationships and the unique circumstances that current market conditions have created,” said Bradford.","The company also said in the statement Wednesday that it is closer to becoming exclusively a bitcoin miner, having exited the switchgear business it was involved in last month. Per that agreement, CleanSpark was released from all liabilities while still maintaining the right to certain receivable rights and prepaid deposits.&nbsp;","“This move strengthens our balance sheet and frees up working and human capital for our high-value, bitcoin mining business,” said Bradford.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"9%","content":"PERCENT"},{"type":"June 30","content":"DATE"},{"type":"$30,000","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$25,644","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$20,000","content":"MONEY"},{"type":"89%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"Zach Bradford","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"last month","content":"DATE"},{"type":"$8.4 million","content":"MONEY"},{"type":"Bradford","content":"PERSON"},{"type":"quarter 2022","content":"DATE"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}