{"summary":"The firm&#x27;s CEO Pascal Gauthier says &quot;macroeconomic headwinds&quot; drove the decision to reduce employee headcount by 12%.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255074\/ledger-cuts-12-of-staff-due-to-macroeconomic-headwinds","publishDate":"2023-10-05T14:01:05","id":7331,"type":null,"title":"Ledger cuts 12% of staff due to &#x27;macroeconomic headwinds&#x27;","category":["COMPANIES"],"content":["Crypto hardware wallet developer Ledger cut 12% of its employee workforce Thursday.&nbsp;","\"We must continue to make decisions for the longevity of the business,\" Ledger CEO Pascal Gauthier wrote in a <a href=\"https:\/\/www.ledger.com\/blog\/a-message-from-pascal-gauthier-chairman-ceo-at-ledger\" data-v-f87c67ca=\"\">letter<\/a> to employees. \"Macroeconomic headwinds are limiting our ability to generate revenue, and in response to the current market conditions and business realities, we must reduce roles across the global business. Sadly, this means we are making the difficult decision to reduce 12% of the roles at Ledger.\"","The French firm noted that affected employees will have resources to smoothly transition out of their role.&nbsp;","\"For the next part of our journey, know this: we will come out of this period stronger, and I’m counting on everyone at Ledger to step up as a leader. We are in an important part of the development of our industry and it’s our duty to act responsibly and seriously to push through these difficult times,\" Gauthier added.&nbsp;","Ledger offers three hardware wallets, including one called <a href=\"https:\/\/www.theblock.co\/post\/192420\/ledger-device-ipod-inventor-tony-fadell\" data-v-f87c67ca=\"\">Stax<\/a> that was created by iPod inventor Tony Fadell.","Just days before announcing employee reduction, Ledger partnered with the high-profile art auction house <a href=\"https:\/\/www.theblock.co\/post\/254074\/ledger-sothebys-crypto-wallets\" data-v-f87c67ca=\"\">Sotheby's<\/a> to provide its hardware wallet to top NFT collectors.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Sotheby","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Gauthier","content":"PERSON"},{"type":"Tony Fadell","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Pascal Gauthier","content":"PERSON"},{"type":"12%","content":"PERCENT"}],"hashtag":["LAYOFFS","WALLET MAKERS"],"authors":["MK Manoylov","The Block"]}