{"summary":"Terraform Labs CEO Do Kwon said he edited a few distribution parameters of his proposal “to accommodate community feedback.”","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147976\/do-kwon-amends-terra-2-0-proposal-during-the-vote-on-it","publishDate":"2022-05-20T08:00:27","id":7335,"type":null,"title":"Do Kwon amends Terra 2.0 proposal during the vote on it","category":["GOVERNANCE"],"content":["<span data-v-f87c67ca=\"\">Terraform Labs CEO Do Kwon has amended his proposal to revive the Terra blockchain — in the middle of a vote on whether it should be implemented.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">After the implosion of the TerraUSD (UST) stablecoin, Terraform Labs CEO Do Kwon suggested a <\/span><a href=\"https:\/\/station.terra.money\/proposal\/1623\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“rebirth” plan<\/span><\/a><span data-v-f87c67ca=\"\"> in which he <a href=\"https:\/\/www.theblockcrypto.com\/post\/147289\/terra-community-seems-dead-set-against-do-kwons-fork-proposal\" data-v-f87c67ca=\"\">proposed<\/a> creating Luna (LUNA) 2.0 tokens on a new blockchain.<\/span>","<span data-v-f87c67ca=\"\">Today he amended the proposal despite the fact the original plan is currently going through an <a href=\"https:\/\/station.terra.money\/proposal\/1623\" data-v-f87c67ca=\"\">on-chain vote<\/a>. While this so-called “rebirth” proposal still stands, Kwon <\/span><a href=\"https:\/\/agora.terra.money\/t\/terra-ecosystem-revival-plan-2-amended\/18498\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">stated<\/span><\/a><span data-v-f87c67ca=\"\"> he edited a few distribution parameters “to accommodate community feedback.”<\/span>","<span data-v-f87c67ca=\"\">The first change reduces the distribution of LUNA 2.0 tokens to UST holders who had their tokens staked on Anchor when the depeg occurred. Their distribution share was reduced from 20% to 15%.<\/span>","Second, Kwon altered the vesting schedule for two of the stakeholder categories that have been proposed to receive a share of the new tokens. Here, Kwon increased the initial token unlocks of allocations of LUNA 2.0 tokens from 15% to 30% — with the remaining 70% locked for a two-year vesting period.","<span data-v-f87c67ca=\"\">It’s unusual for a proposal to be amended amid an on-chain vote. This is why today’s changes from Kwon have led some to question its validity. Usually, whenever there is a change made to a proposal, it's done beforehand and not during the vote. FatMan, an anonymous Terra analyst and commentator, highlighted the fact that a new proposal should come with a fresh vote.<\/span>","“How can you make significant amendments to a proposal *mid-vote* when most people have already voted (for the original document)?,” FatMan <a href=\"https:\/\/twitter.com\/FatManTerra\/status\/1527541220553146368\" data-v-f87c67ca=\"\">said<\/a>. He added that “significant changes should be posted as a brand new proposal.”","<span data-v-f87c67ca=\"\">Kwon’s original proposal went to a validator vote on Wednesday. At the time of writing, a large majority of votes (80%) are in favor of it, with only 15% that are opposed to it with a veto. It's too early to say if the vote for Kwon’s proposal will pass given there are five more days to go. If the ‘no with veto’ percentage crosses the 33.4% level, the entire proposal would be scrapped despite the fact it has majority support from validators.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"80%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"Kwon","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"33.4%","content":"PERCENT"},{"type":"UST","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}