{"summary":"As we enter the dawn of a new decade, the genesis of which will be marked by too many end of year posts containing pithy ‘hindsight is 2020’ jokes, I want","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51618\/sci-finance-crypto-trading-in-the-next-decade","publishDate":"2019-12-27T14:30:09","id":7338,"type":null,"title":"Sci-Finance: Crypto trading in the next decade","category":["THE BLOCK"],"content":["As we enter the dawn of a new decade, the genesis of which will be marked by too many end of year posts containing pithy ‘hindsight is 2020’ jokes, I want to instead look to the future evolution of crypto trading. But we’re not going to be able to do this without first peering into finance’s past!","Historically, every epochal change in trading has been accompanied by a combination of both business model innovation and technical improvements. These innovations included quantitative improvements to valuations, such as the use of the Black-Scholes equation for options pricing, and infrastructure for electronic markets that let new competitors (such as BATS) enter the marketplace.","The past 40 years of development have warped market structure and valuation models and the next 40 years look to be no different. In the 1980s and 1990s, electronic markets and novel valuation models helped propel options and futures trading to new heights. Cumulatively, this led to new forms of algorithmic trading and market making that made it easier for passive investing — and overall market participation — to increase in the 2000s and 2010s.","In crypto, we have slowly begun to see a similar combination of business model and technical improvements that are portents of the future — namely, exchange tokens and on-chain trading and lending. These portholes to the financial systems of the future are the bellwether for a new quantitative era of crypto trading.","","","The crypto trading boom of 2017 led to exchanges and financially-savvy entrepreneurs realizing that futures and other derivatives products were the most profitable way to package crypto's inherent volatility for customers. This led to a flood of new crypto futures exchanges, all of which are competing for BitMEX's first-mover and liquidity advantages. What came out of this race to dethrone BitMEX was an amazing business model innovation that seems innocuous enough: the exchange token. Given that most other tokens lack utility and value accrual, it is natural to wonder why these tokens are special and accrue value. For this, it helps to get some context from how revenue is shared at traditional equities venues.","In these markets, exchanges such as the New York Stock Exchange (NYSE) or the Chicago Mercantile Exchange (CME) share revenue with market makers as a function of their pro-rata share of exchange volume. Why do they do this? Exchanges don't want to hold risk themselves — they want to collect a toll yet don’t want to do any maintenance — but they need to ensure that they have tight spreads (e.g. good prices) and meet regulatory requirements (e.g. <a href=\"https:\/\/en.wikipedia.org\/wiki\/Regulation_NMS\" data-v-f87c67ca=\"\">Regulation Neutral Market Service<\/a>, or RegNMS). These exchanges, do this via fee rebates — if you trade more than 10,000 shares per day and you normally pay 0.01% per share traded, then the venue gives you a discount to 0.005% — which are paid quarterly and\/or infrequently.","On the other hand, exchange tokens, such as Binance’s BNB, FTX's FTT, CoinFLEX's FLEX, or Huobi's HT, are designed to provide more instantaneous rebates. How does this work?","While the CME or NYSE could certainly provide this, they are reticent to do this as these tokens could easily be deemed securities by regulators. Subsequently, this is also why you're seeing these tokens boom in Asia and not the west — and they're successfully encouraging new market making participants to add liquidity to these exchanges in a way that existing exchanges cannot. Moreover, there's a feedback loop for these tokens, which is why you've seen the most successful competitors to BitMEX — Binance, FTX, Huobi, CoinFLEX — utilizing these tokens as tools to gain market share.","","","This unbridled competition from exchanges resembles the heady early times of the equities markets in the late 1990s to early 2000s, when people were starting exchanges that were competitive with NYSE and NASDAQ out of their basements. At this time, the US equities market had extremely fragmented liquidity and poor data, with large data providers such as Yahoo! Finance and S&amp;P sourcing from 100s of exchanges of varying quality, akin to CoinMarketCap. Regulators decided to improve liquidity and transparency by forcing the decentralized nature of equities exchanges to become more centralized via RegNMS.","The implementation of RegNMS in 2005 forced consolidation by requiring any stock exchange to provide the national best bid and offer (NBBO) over <i data-v-f87c67ca=\"\">all<\/i> other exchanges. This meant that exchanges that had very little volume would have to listen to exchanges with lots of volume and provide prices that match those high volume exchanges. Inevitably, this led to the shuttering of a number of smaller exchanges as they lost money while being forced to provide prices that deviated from their liquidity [0].","This boom and bust era of startup US equities exchanges ended with some of the biggest startup equities exchanges being acquired by existing exchanges and banks for billions of dollars [1]. A natural question to ask about exchange tokens is: what will the RegNMS moment of this world look like?","","","Speaking of RegNMS, the decentralized yet almost synchronous nature of US equities markets is starting to rear its head in crypto via decentralized exchanges and on-chain trading.","In this world, traders are able to non-custodially trade with smart contracts instead of centralized entities, like Coinbase, Binance, or BitMEX. Until 2019, these exchanges were historically plagued by terrible UX, expensive fees (relative to centralized competitors), costly security bugs, and riddled with valueless fee tokens. The introduction of Uniswap and constant product market making led to a dramatic shift in usability, UX, and inevitably, fees, for users of these protocols. Uniswap, which was created with a $100,000 grant from the EF, has fared much better than competitors such as Bancor (<a href=\"https:\/\/www.coindesk.com\/bancor-raised-153-million-and-found-actual-users-why-did-its-token-tank\" data-v-f87c67ca=\"\">which raised $153m in 2017<\/a>) because it avoided historical mistakes with automated market makers and optimized for simplicity (which leads to smaller and less complicated fees).","Let’s step back for a second: What are automated market makers? These are methods for valuing assets without needing market makers and have <a href=\"http:\/\/www.cs.cmu.edu\/~.\/sandholm\/liquidity-sensitive%20automated%20market%20maker.teac.pdf\" data-v-f87c67ca=\"\">existed<\/a> in the academic literature since the early 2000s. They were often used in early prediction markets and tended to have poor usage due to complex UX or challenges (think: Lightning\/L2 game theoretic challenges).","How do AMMs work? They incentivize participants to:","The simplicity of AMMs, which starts with the absence of an order book and incentives for those who contribute tokens to the pool to keep the prices tethered to Coinbase\/Binance\/etc., has led to a significant amount of liquidity in on-chain vehicles. Moreover, it is easy for those working on UIs for decentralized trading protocols to integrate with Uniswap. This is how, for instance, Synthetix, a decentralized margin trading contract (which is one of many attempts at making a decentralized BitMEX) was able to bootstrap liquidity for traders of synthetic tokens. Synthetix, whose native token increased in value to be one of the largest Uniswap assets, is exemplar of how the interconnected nature of on-chain trading venues allows for new use cases to bootstrap off of existing liquidity. What is driving this increase in trading activity on-chain? It is likely a combination of the following:","","","Given the 2019 emergence of these two financial tools in crypto, it is natural to ask, what’s next and how will these tools change trading in the next decade? I’ve decided to break this up into four sections: Bitcoin, Ethereum, Other Layer 1, and Valuation Models of the Future.","If there is nothing else that you take away from this article, just remember this: the next decade of crypto trading will look far different from the previous decade as business models and technology collectively advance. Happy New Year!","<em data-v-f87c67ca=\"\">Thanks to Tony Salvatore, Matteo Leibowitz, Michael Jordan, Haseeb Qureshi, Ivan Bogatyy, Leland Lee, Joyce Yang, Rei Chiang, John Morrow, and Hasu for helpful feedback, comments, and insights.<\/em>","<em data-v-f87c67ca=\"\">[0] The story is a bit more complicated, however: smaller exchanges do have an advantage with RegNMS in that they can compete with larger exchanges by incentivizing market-makers with rebates to provide tight spreads, forcing broker-dealers to route to them because of RegNMS. Ironically, RegNMS ended up fragmenting the market structure, leading to the <a href=\"https:\/\/www.sec.gov\/news\/statement\/shedding-light-on-dark-pools.html#_edn2\" data-v-f87c67ca=\"\">formation of dark pools<\/a>, each with slight twists on matching rules, order types, allowed participants, etc. Thanks to Rei Chiang and Leland Lee for further discussion about this point.<\/em>","<em data-v-f87c67ca=\"\">[1] <a href=\"https:\/\/www.reuters.com\/article\/us-citigroup-automatedtradingdesk-idUSN0233485120070702\" data-v-f87c67ca=\"\">Citi bought Automated Trading Desk in 2007 for $680 million<\/a>, <a href=\"https:\/\/www.marketwatch.com\/story\/nyse-to-buy-archipelago-go-public\" data-v-f87c67ca=\"\">NYSE merged with Arcahttps:\/\/www.marketwatch.com\/story\/nyse-to-buy-archipelago-go-public(née Archipelago) in 2006 for $10 billion<\/a>, <a href=\"https:\/\/www.nytimes.com\/2005\/04\/22\/business\/nasdaq-to-acquire-instinet-in-19-billion-deal.html\" data-v-f87c67ca=\"\">NASDAQ bought Instinethttps:\/\/www.nytimes.com\/2005\/04\/22\/business\/nasdaq-to-acquire-instinet-in-19-billion-deal.html(née Island) for $1.5 billion in 2005.<\/a><\/em>","<em data-v-f87c67ca=\"\">[2] <a href=\"https:\/\/arxiv.org\/abs\/1911.03380\" data-v-f87c67ca=\"\">We wrote a paper that mathematically proves that Uniswap acts as an oraclehttps:\/\/arxiv.org\/abs\/1911.03380(up to an error dependent on the fees) if the external market is more liquid than Uniswap and there is at least one rational arbitrageur present.<\/a><\/em>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$680 million","content":"MONEY"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"1980s","content":"DATE"},{"type":"Matteo Leibowitz","content":"PERSON"},{"type":"Uniswap","content":"PERSON"},{"type":"Scholes","content":"PERSON"},{"type":"Michael Jordan","content":"PERSON"},{"type":"0.01%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"$1.5 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"Hasu","content":"PERSON"},{"type":"Huobi","content":"LOCATION"},{"type":"2010s","content":"DATE"},{"type":"CoinMarketCap","content":"ORGANIZATION"},{"type":"Ivan Bogatyy","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"billions of dollars","content":"MONEY"},{"type":"Synthetix","content":"LOCATION"},{"type":"Joyce Yang","content":"PERSON"},{"type":"Rei Chiang","content":"LOCATION"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"1990s","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"2019","content":"DATE"},{"type":"John Morrow","content":"PERSON"},{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"Yahoo! Finance","content":"ORGANIZATION"},{"type":"Huobi","content":"ORGANIZATION"},{"type":"NBBO","content":"ORGANIZATION"},{"type":"Citi","content":"ORGANIZATION"},{"type":"late 1990s","content":"DATE"},{"type":"Haseeb Qureshi","content":"PERSON"},{"type":"2005","content":"DATE"},{"type":"Binance","content":"LOCATION"},{"type":"2006","content":"DATE"},{"type":"Coinbase\/Binance\/etc.","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"e.g. <a href=\"https:\/\/en.wikipedia.org\/wiki\/Regulation_NMS\" data-v-f87c67ca=\"\">Regulation Neutral Market Service","content":"ORGANIZATION"},{"type":"2007","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"NYSE","content":"ORGANIZATION"},{"type":"Tony Salvatore","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$153m","content":"MONEY"},{"type":"Leland Lee","content":"PERSON"},{"type":"0.005%","content":"PERCENT"},{"type":"2000s","content":"DATE"}],"hashtag":[],"authors":["Tarun Chitra","The Block"]}