{"summary":"The cryptocurrency community loves a good narrative: “Fat Protocols Thesis;” “Bitcoin as a Store of Value;” “Miner Death-Spiral” — the list goes on.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/9559\/bitcoin-doesnt-incentivize-green-energy","publishDate":"2019-01-30T13:10:28","id":7343,"type":null,"title":"Bitcoin doesn’t incentivize green energy","category":["BITCOIN"],"content":["The cryptocurrency community loves a good narrative: “Fat Protocols Thesis;” “Bitcoin as a Store of Value;” “Miner Death-Spiral” — the list goes on. Spurred on by a recent <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/coinshares.co.uk\/bitcoin-mining-cost\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/coinshares.co.uk\/bitcoin-mining-cost\/\" data-v-f87c67ca=\"\">CoinShares report<\/a> on mining trends, Bitcoiners have taken to arguing that the network’s energy demand has a net-positive environmental impact. Their reasoning is that, as energy buyers of last resort, miners have been drawn to cheap renewables in otherwise hopelessly remote locations: “stranded assets.”","<em data-v-f87c67ca=\"\">… further studies may yet prove that, at least in terms of the environment, not only does cryptocurrency do no harm, it could actually be doing good… Bitcoin mining may in fact be acting as an electricity buyer of last&nbsp;resort.<\/em>","<em data-v-f87c67ca=\"\">— Pg. 10, The Bitcoin Mining&nbsp;Network<\/em>","This reasoning incorrectly assumes <strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">a) that renewable energy implies carbon-free <\/strong>and <strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">b) that energy markets operate as free markets. <\/strong>Miners cannot chase after curtailed energy for free, nor do they have any market incentive to pursue environmentally-friendly operations. This post will demonstrate how the evidence presented in the CoinShares report lends itself to a far different conclusion under more scrutiny.","For a tl;dr summary of this post:","For disclosure purposes, I do volunteer as a community ambassador for Enigma and have invested in Ethereum, both of which intend on implementing Proof-of-Stake. Some have taken offense to this in the past.","","Christopher Bendiksen of CoinShares followed up on their report with a post entitled, “Beware of Lazy Research.” He reiterated that hydropower:","","Unfortunately, Bendiksen appears to have forgone his own advice in making the leap from the first point to the second. For if he had conducted any research at all, he would have noticed that his own team’s analysis contradicts his line of thinking. How so?","&nbsp;","Page 8 of the report attributes the Chinese provinces of Sichuan and Yunnan with contributing renewable energy for some ~45% of the network’s hashrate. It then provides the reader with the table on the left, stressing that miners have sought out Europe and North America specifically for low hydropower utilization rates.","The recurring trend across these regions? Aside from Iceland and Sweden, they all claim ownership of some of the world’s largest mega dams. And for most of them, there’s an associated story about an influx of miner interest.","Now, you might consider it obvious that miners would hone in on the largest sources of untapped electricity — the bigger, the better. <strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">This phenomenon matters because the environmental impact of hydropower at scale differs vastly from solar and wind.<\/strong> Not only does the construction of mega-dams have significant ecological implications, total lifecycle greenhouse gas emissions can rival those of fossil fuel-based generation. Look to US federal policy on <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.nrel.gov\/docs\/fy18osti\/70174.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.nrel.gov\/docs\/fy18osti\/70174.pdf\" data-v-f87c67ca=\"\">renewable energy credits<\/a> or the UN’s 2016 renewable energy <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/waterkeeper.org\/un-excludes-large-dams-from-renewables\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/waterkeeper.org\/un-excludes-large-dams-from-renewables\/\" data-v-f87c67ca=\"\">investment report<\/a>, and a political unwillingness to categorize large-scale hydropower as “clean” energy becomes apparent.","The graphic below showcases how the <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.sciencemag.org\/news\/2016\/09\/hundreds-new-dams-could-mean-trouble-our-climate\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.sciencemag.org\/news\/2016\/09\/hundreds-new-dams-could-mean-trouble-our-climate\" data-v-f87c67ca=\"\">cycle<\/a> of biomass decay, anaerobic digestion, and return growth associated with damming results in greenhouse gas emissions. It’s important to note that the global warming potential (GWP) of methane ranges from <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.scientificamerican.com\/article\/how-bad-of-a-greenhouse-gas-is-methane\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.scientificamerican.com\/article\/how-bad-of-a-greenhouse-gas-is-methane\/\" data-v-f87c67ca=\"\">34x to 86x<\/a> that of carbon dioxide.","Bendiksen’s claim, that Bitcoin is one of the world’s cleanest industries, falters once the global warming potential of large-scale hydropower gets charted alongside low-impact renewables and traditional fossil fuels. <strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">With miners concentrating around the world’s largest mega dams (i.e. right tail outliers), Bitcoin mining could possibly be one of the world’s <em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">dirtiest <\/em>industries.<\/strong>","Chances are that if you’re reading this, you have no qualms with the energy consumption of Proof-of-Work. You consider it to be a fitting cost for personal monetary sovereignty, and wouldn’t mind if it ran purely on brown coal or the suffering of tortured bureaucrats. What should concern you about the CoinShares report is its intellectual inconsistency. In taking a free market approach to approximating the energy mix of Bitcoin’s hashrate, its claim that miners will foster renewable energy development implies that exchanges price in mining’s environmental impact. As miners have no other incentive than to mine the cheapest bitcoins, this narrative fails to hold water.","Today, the cheapest form of electricity comes from large-scale hydropower. <strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Tomorrow, it might come from <\/strong><a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-01-02\/venezuela-oil-exports-slump-to-28-year-low-on-falling-output\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-01-02\/venezuela-oil-exports-slump-to-28-year-low-on-falling-output\" data-v-f87c67ca=\"\"><strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Venezuelan oil<\/strong><\/a><strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"> as a way to subvert sanctions, or <\/strong><a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.iol.co.za\/business-report\/opinion\/opinion-indonesia-wants-to-export-more-coal-but-buyers-ignore-the-call-17437926\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.iol.co.za\/business-report\/opinion\/opinion-indonesia-wants-to-export-more-coal-but-buyers-ignore-the-call-17437926\" data-v-f87c67ca=\"\"><strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Indonesian coal<\/strong><\/a><strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"> as its export market shrinks. <\/strong>Simply increasing energy demand in a few parts of the world is not going to lead to a renaissance in clean energy R&amp;D or policy development — miners have no skin in that game. If we allow this narrative to become Bitcoiner dogma, we become complicit in giving miners a free pass on their hyper-regional energy parasitism.","The report’s discussion of curtailment similarly attributes free market participants with more agency than they have in practice. Claiming that mining consumes excess grid capacity, it paints the picture of miners timing their operations to capitalize on near-free renewable energy generation peaks. Little incentive actually exists for private miners to do so.","For example, let’s take an average spring day in California:","Notice that curtailment rates align most closely with spikes in solar power generation — this is a result of the <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.vox.com\/2018\/5\/9\/17336330\/duck-curve-solar-energy-supply-demand-problem-caiso-nrel\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.vox.com\/2018\/5\/9\/17336330\/duck-curve-solar-energy-supply-demand-problem-caiso-nrel\" data-v-f87c67ca=\"\">duck curve phenomenon<\/a> documented in solar-biased grids. On average, 8.5% of the energy generated between 10 AM and 4 PM will simply get grounded by utilities at a net-loss to the California Independent System Operator (CAISO). It would stand to reason that the marginal price for electricity during this period would dip due to oversupply. Within the context of Bitcoin mining, we’d expect opportunistic miners to pile into the market until the rate of curtailment approaches 0%.","And yet, because energy markets depend on public infrastructure and utility monopolies, demand dictates consumer pricing more so than does supply. <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.sce.com\/regulatory\/tariff-books\/rates-pricing-choices\/business-rates\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.sce.com\/regulatory\/tariff-books\/rates-pricing-choices\/business-rates\" data-v-f87c67ca=\"\">California’s<\/a> <a class=\"markup--anchor markup--p-anchor\" href=\"http:\/\/San%20Diego%20Gas%20and%20Electric\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"http:\/\/San Diego Gas and Electric\" data-v-f87c67ca=\"\">five<\/a> <a class=\"markup--anchor markup--p-anchor\" href=\"http:\/\/Pacific%20Gas%20and%20Electric\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"http:\/\/Pacific Gas and Electric\" data-v-f87c67ca=\"\">utilities<\/a> <a class=\"markup--anchor markup--p-anchor\" href=\"http:\/\/Liberty%20Utilities\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"http:\/\/Liberty Utilities\" data-v-f87c67ca=\"\">all<\/a> <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.pacificpower.net\/ya\/po\/otou\/ooh.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.pacificpower.net\/ya\/po\/otou\/ooh.html\" data-v-f87c67ca=\"\">price<\/a> electricity with flat rates and tier systems that incentivize consumption outside of peak-demand times, most often in the dead of the night. This issue persists across different grids as well:","This reality challenges the assumption presented in the CoinShares report, that Bitcoin miners directly consume excess grid generation. <strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">While they clearly benefit from lower prices in regions with an oversupply of renewable energy, consumer tariffs predominantly incentivize consumption patterns that do not align with peaks in renewable generation<\/strong>. Moreover, as miners enjoy lower cooling costs <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.reddit.com\/r\/Bitcoin\/comments\/5pe53k\/i_started_mining_bitcoin_in_the_desert_heres_some\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.reddit.com\/r\/Bitcoin\/comments\/5pe53k\/i_started_mining_bitcoin_in_the_desert_heres_some\/\" data-v-f87c67ca=\"\">during the night<\/a>, they become further discouraged from running their operations in sync with these rhythms. Even in the case of hydropower, miners have no reason to care that coal power acts as a crutch during <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/phys.org\/news\/2018-12-droughts-boost-emissions-hydropower-dries.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/phys.org\/news\/2018-12-droughts-boost-emissions-hydropower-dries.html\" data-v-f87c67ca=\"\">dry seasons or drought<\/a> if they pay normalized rates across the year.","While we’re at it, we can nip the two inevitable counterarguments to this conclusion in the bud:","CoinShares allowed its political biases to cloud its analysis of miners’ energy market considerations. Its report’s implication that miners have price incentives to align their operations with excess renewable generation incorrectly characterized Bitcoin mining as a marginal consumer of curtailed energy. As long as monopolistic, political grids remain the dominant option for industrial-scale mining, cryptocurrency analysts will have to suspend their free market assumptions when wading into issues surrounding the <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.mitpressjournals.org\/doi\/pdf\/10.1162\/INOV_a_00075\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.mitpressjournals.org\/doi\/pdf\/10.1162\/INOV_a_00075\" data-v-f87c67ca=\"\">legacy<\/a> energy sector.","","CoinShares ends its report on a strong note with support for the stranded assets hypothesis originally proposed by Nic Carter of Castle Island Ventures and Dan Held of Picks and Shovels. You can read an in-depth explanation in <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/blog.picks.co\/pow-is-efficient-aa3d442754d3\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/blog.picks.co\/pow-is-efficient-aa3d442754d3\" data-v-f87c67ca=\"\">Dan’s post<\/a>. Its premise is sound: as long as mining rewards provide a marginal benefit greater than just curtailing a kWh of energy, Proof of Work presents an efficient use. With grid-scale storage solutions still a future fancy, Bitcoin mining will prove to be a niche solution to monetizing otherwise stranded energy assets.","","Suggesting that the liberated revenue streams offered by stranded energy assets would lead to an expansion of renewable generation, however, warrants criticism. The corollary represents an extrapolation of an otherwise sound conclusion; it ignores the relevant stakeholder priorities and risk tolerances that render the claim a nonstarter in practice. Consider the following:","Energy financiers, Bitcoin miners, and municipalities lack the common ground necessary for mutually-beneficial infrastructure development. The corollary put forward in the CoinShares report faces a dilemma, as it becomes difficult to match preferences on asset volatility and time horizon across all three stakeholder communities.<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"> Miners are effectively energy nomads<\/strong>, and the incentive structure simply isn’t there to assume that they’ll play a significant role in the expansion of new energy generation, let alone the renewable kind.","That should not distract from the fact that Bitcoin mining represents a clear value proposition for existing, underperforming energy assets. It’s already occurring de facto with miners seeking out inefficient hydropower, and curtailment at the utility level represents the next logical step. The barrier to entry for a utility to contract a third-party ASIC operator only shrinks as mobile mining solutions mature and OTC crypto desks enter the mainstream. This is already happening in real-time, as Paraguay’s <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/cryptoiq.co\/largest-cryptocurrency-mining-operation-and-exchange-planned-in-paraguay\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/cryptoiq.co\/largest-cryptocurrency-mining-operation-and-exchange-planned-in-paraguay\/\" data-v-f87c67ca=\"\">Golden Goose<\/a> project shows.","A number of points within the CoinShares report need addressing but don’t fit in with the three main channels laid out here. These points are:","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">CoinShares and the 78% Renewable Figure<\/strong>","You can find the tweetstorm detailing my disbelief at CryptoShares claiming that 78% of Bitcoin hashrate comes from renewable energy *as a lower bound* below. Because of intermittent power generation, you cannot assume that renewable energy penetration serves as a proxy for renewable energy generation. This remains true even for hydropower, due to the seasonal fluctuations alluded to earlier in the post. At the very least, outliers like the coal-powered mining hub of <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/qz.com\/1054805\/what-its-like-working-at-a-sprawling-bitcoin-mine-in-inner-mongolia\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/qz.com\/1054805\/what-its-like-working-at-a-sprawling-bitcoin-mine-in-inner-mongolia\/\" data-v-f87c67ca=\"\">Ordos<\/a> in Inner Mongolia alone contributing 4% of network hashrate suggest that, if anything, the 78% figure should be considered an <em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">upper <\/em>bound.","","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Geographic Realities of Energy Consumption Comparisons<\/strong>","CoinShares went out of its way to include (zero knowledge) snark at the end of its report by comparing the energy consumption of Bitcoin with that of console video games. Globally, the latter outpaces the former, 4.9 GW to 4.7 GW annually. This riff alludes to Dan Held’s popular “energy police” meme.","","Now, let’s see what CoinShares wrote on Page 5 of that very same report:","Bitcoin mining is hyper-localized.<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"> Its energy consumption impacts a handful of grids the world over, loading them with the burden of sustaining a global phenomenon. <\/strong>Global video game usage spans hundreds of grids and utilities. As Bendiksen himself pointed out, you cannot analyze energy issues without accounting for geographical constraints. Saying 4.7 GW is a cheap price to pay for an internet of money, and understanding that 4.7 GW of consumption on a low-double digits number of grids is unsustainable, are not mutually exclusive.","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Upcoming Trends in Energy Consumption and Grid Management<\/strong>","High curtailment rates are to renewable energy as price volatility is to Bitcoin: they’re both the product of nascent market formation. A number of factors support the idea that energy curtailment rates will decline in the future:","&nbsp;","&nbsp;","These solutions to energy curtailment will not take hold over night, and leased Bitcoin mining presents a compelling stopgap for utilities. The question remains, will Bitcoin derisk to the point utilities are willing to engage with it before curtailment becomes a problem of the past?","Proof-of-Work has enabled the internet of money in a borderless, stateless, and ownerless fashion. The energy it consumes in securing the Bitcoin network does not represent a waste. And frankly, until either Ethereum switches over to <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/docs.ethhub.io\/ethereum-roadmap\/serenity-phases\/proof-of-stake\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/docs.ethhub.io\/ethereum-roadmap\/serenity-phases\/proof-of-stake\" data-v-f87c67ca=\"\">Proof-of-Stake<\/a> or an <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/ipfs.io\/ipfs\/QmUy4jh5mGNZvLkjies1RWM4YuvJh5o2FYopNPVYwrRVGV\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/ipfs.io\/ipfs\/QmUy4jh5mGNZvLkjies1RWM4YuvJh5o2FYopNPVYwrRVGV\" data-v-f87c67ca=\"\">Avalanche<\/a> implementation successfully takes hold, we have no other alternative to enabling decentralized cryptocurrencies.","This does not mean that the Bitcoin community is free to pass off biased analysis as dogma. The claims levied in the CoinShares report do not hold water, and yet online forums and media outlets have simply accepted them as truth for the past month and a half. Bitcoiners have taken to comparing the phenomenon to a <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/bh2018.hodlhodl.com\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/bh2018.hodlhodl.com\/\" data-v-f87c67ca=\"\">honey badger<\/a> in the past, and frankly that air of disinterested arrogance is a better alternative to this feigned intellectualism.","Bitcoin incentivizes cheap electricity. The free market price does not reflect whether this cheap electricity was generated in an low-carbon or low-impact manner. Bitcoin miners have honed in on large-scale hydropower and coal to gain an edge over one another, and have done so through the retail markets with no direct role in energy curtailment. Claiming that they will facilitate an expansion of renewables infrastructure when neither miners nor traditional energy stakeholders share any common skin in the game is the wrong conclusion.","I’ll leave you with the following reflection. Brandon Quittem began a series late in 2018 comparing <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/@BrandonQuittem\/bitcoin-is-a-decentralized-organism-mycelium-part-1-3-6ec58cdcfaa6\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/medium.com\/@BrandonQuittem\/bitcoin-is-a-decentralized-organism-mycelium-part-1-3-6ec58cdcfaa6\" data-v-f87c67ca=\"\">Bitcoin’s adoption<\/a> to the growth of a mushroom. I considered it one of the best crypto thoughtpieces in some time, and the Bitcoin community rallied around it. The analogy is apt, but once you realize that the <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.mushroom-appreciation.com\/honey-fungus.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.mushroom-appreciation.com\/honey-fungus.html\" data-v-f87c67ca=\"\">honey mushroom<\/a> referenced by Brandon is considered a parasite, you need to understand that Bitcoin will behave similarly. <strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Bitcoin hashrate feeds off of the cheapest electricity in a hyper-localized fashion, sucking markets dry until miners drive prices back up with their demand.<\/strong> The combination of miner mobility and their disinterest in reinvestment results in a destructive, not constructive force.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"Dan Held of Picks and Shovels","content":"ORGANIZATION"},{"type":"Bitcoiner dogma","content":"ORGANIZATION"},{"type":"8.5%","content":"PERCENT"},{"type":"4%","content":"PERCENT"},{"type":"GW","content":"ORGANIZATION"},{"type":"78%","content":"PERCENT"},{"type":"Christopher Bendiksen","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"Yunnan","content":"LOCATION"},{"type":"Nic Carter of Castle Island Ventures","content":"ORGANIZATION"},{"type":"Iceland","content":"LOCATION"},{"type":"spring","content":"DATE"},{"type":"0%","content":"PERCENT"},{"type":"Brandon Quittem","content":"PERSON"},{"type":"Brandon","content":"PERSON"},{"type":"“Beware of Lazy Research","content":"ORGANIZATION"},{"type":"Sichuan","content":"LOCATION"},{"type":"Sweden","content":"LOCATION"},{"type":"North America","content":"LOCATION"},{"type":"Bitcoiners","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"45%","content":"PERCENT"},{"type":"night","content":"TIME"},{"type":"Bendiksen","content":"PERSON"},{"type":"The Bitcoin Mining&nbsp;Network","content":"ORGANIZATION"},{"type":"Dan Held","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"Paraguay","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"Inner Mongolia","content":"LOCATION"},{"type":"Geographic Realities of Energy Consumption Comparisons","content":"ORGANIZATION"},{"type":"Upcoming Trends in Energy Consumption","content":"ORGANIZATION"},{"type":"over night","content":"TIME"},{"type":"Grid Management","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Contributor Network","The Block"]}