{"summary":"Indonesia-based cryptocurrency exchange Pintu has raised $113 million in a Series B funding round despite difficult market conditions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150365\/pintu-raises-series-b-funding-indonesian-crypto-exchange","publishDate":"2022-06-06T22:00:01","id":7349,"type":null,"title":"Indonesian crypto exchange Pintu raises $113 million in Series B funding","category":["VENTURE CAPITAL"],"content":["Indonesia-based cryptocurrency exchange Pintu has raised $113 million in a Series B funding round.","Investors in the round include Pantera Capital, Lightspeed India Partners, Intudo Ventures and Northstar Group. There was a lead investor in this round, Pintu's founder and CEO Jeth Soetoyo told The Block in an interview, <span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">but he declined to name it because the investor prefers to remain undisclosed. But that investor is a global venture capital firm, he said.&nbsp;<\/span>","Pintu's raise comes at a time when crypto trading volumes are falling and exchanges are slashing jobs, given the current bearish market sentiment. When asked how Pintu could close the round successfully, Soetoyo said the firm started raising earlier this year and closed the round last month after Terra's collapse because Pintu's product \"speaks for itself.\"","Soetoyo went on to say that some of the investors already knew about Pintu's position in the market and were comfortable backing it. Soetoyo, however, agreed that the fundraising environment has become more difficult now, especially for new ideas and startups.","Pintu was launched in April 2020 and is one of the top three Indonesian crypto exchanges, according to Soetoyo. The firm doesn't publicly disclose its trading volumes. Its local rivals include Indodax and Tokocrypto.","With fresh capital in hand, Pintu plans to keep growing in Indonesia, the world's fourth most populous nation, and offer access to new products and services such as DeFi and NFTs. \"We need to cement our position in the market. I think pretty much that's where our focus is going into,\" said Soetoyo.","To that end, Pintu also plans to double its current headcount of around 200 people in the next two years across various functions, said Soetoyo. This is contrary to recent job slashes and hiring freezes in the market by exchanges such as <a href=\"https:\/\/www.theblockcrypto.com\/linked\/149965\/coinbase-extends-hiring-freeze-will-rescind-some-accepted-offers\" data-v-f87c67ca=\"\">Coinbase<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/post\/149813\/crypto-exchange-gemini-slashes-about-10-of-its-work-force\" data-v-f87c67ca=\"\">Gemini.<\/a> Pintu hasn't laid off any staff and doesn’t have a plan to do so, said Soetoyo.","As one of the leading Indonesian exchanges, Pintu claims to have more than four million users. There are a total of more than 12 million crypto traders in Indonesia compared to 7 million equity traders, according to data from the Indonesian Commodity Futures Trading Regulatory Agency (Bappepti).","Soetoyo said Pintu, which is registered and licensed by Bappepti, plans to onboard more users to its platform. The current bearish market conditions wouldn't impact the firm's plans because long-term investors ignore short-term market movements, according to Soetoyo.","The Series B round brings Pintu's total funding to date to over $150 million. Last August, the firm raised $35 million in an extended Series A funding round.","Soetoyo declined to comment on the firm's valuation with the latest round, but according to Dealroom <a href=\"https:\/\/app.dealroom.co\/companies\/pintu\" data-v-f87c67ca=\"\">estimates<\/a>, Pintu was valued at up to $210 million at the time of its extended Series A round.","Given its young age, Pintu currently doesn't have an exit plan, said Soetoyo. The firm, in fact, may invest in some startups that would be a strategic fit.","\"We are talking with different types of companies in Indonesia and globally, but not necessarily as an acquisition target,\" said Soetoyo.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gemini","content":"ORGANIZATION"},{"type":"April 2020","content":"DATE"},{"type":"$35 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Indonesia","content":"LOCATION"},{"type":"Lightspeed India Partners","content":"ORGANIZATION"},{"type":"Northstar Group","content":"ORGANIZATION"},{"type":"Pintu","content":"ORGANIZATION"},{"type":"Jeth Soetoyo","content":"PERSON"},{"type":"$113 million","content":"MONEY"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"$210 million","content":"MONEY"},{"type":"Indonesian Commodity Futures Trading Regulatory Agency (Bappepti)","content":"ORGANIZATION"},{"type":"Intudo Ventures","content":"ORGANIZATION"},{"type":"Bappepti","content":"LOCATION"},{"type":"Soetoyo","content":"PERSON"},{"type":"Pintu","content":"PERSON"},{"type":"earlier this year","content":"DATE"},{"type":"Terra","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":["SERIES B"],"authors":["Yogita Khatri","The Block"]}