{"summary":"A sale of shares of the British fintech bank OakNorth has more than doubled its valuation.\nGoldman Sachs advised on the $34 million transaction, according to sources.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/118727\/share-sale-values-british-fintech-firm-oaknorth-5-billion","publishDate":"2021-09-27T08:14:43","id":735,"type":null,"title":"Share sale values British fintech firm OakNorth at $5 billion","category":["Fintech"],"content":["Shares in OakNorth have changed hands in a deal that values the British fintech bank at $5 billion — more than double its last reported valuation.","Indiabulls Housing Finance Limited, which took a 40% stake in OakNorth in 2015, has sold a portion of its stake for 251 crores (roughly $34 million), according to <a href=\"https:\/\/www.moneycontrol.com\/stocks\/stock_market\/corp_notices.php?autono=27983321\" data-v-f87c67ca=\"\">a regulatory filing<\/a> on September 24. It is not clear which investors bought the shares.","Three people familiar with the matter said the secondary transaction valued OakNorth at $5 billion. They added that Goldman Sachs, the investment bank, had acted as an advisor on the deal.","Late last year, Indiabulls <a href=\"https:\/\/sifted.eu\/articles\/oaknorth-downround\/\" data-v-f87c67ca=\"\">sold roughly 7.7% of its stake<\/a> in OakNorth in two transactions for approximately $145 million. The sales took place at a valuation of around $2 billion, representing a discount to OakNorth’s previous valuation of $2.8 billion — negotiated when it <a href=\"https:\/\/www.cnbc.com\/2019\/02\/08\/softbanks-vision-fund-pumps-390-million-into-uk-fintech-oaknorth-valuing-it-at-2point8-billion.html\" data-v-f87c67ca=\"\">raised $440 million<\/a> from SoftBank Vision Fund and Clermont in February 2019.","A spokesperson for OakNorth declined to comment. Goldman Sachs was contacted for comment but did not respond by press time.","Founded in 2013 by Rishi Khosla and Joel Perlman, OakNorth is a challenger bank that lends primarily to small and medium-sized businesses in the United Kingdom. It is advised by former chancellor of the exchequer Lord Philip Hammond and Lord Adair Turner, former chairman of the Financial Services Authority.","From an early stage, the company has proven an outlier within the fintech sector by consistently turning a profit. Earlier this year, it <a href=\"https:\/\/www.altfi.com\/article\/7727_oaknorth-sees-profits-soar-as-it-continues-to-weather-covid-19-storm\" data-v-f87c67ca=\"\">reported pre-tax profits<\/a> for 2020 of £77.6 million.","Khosla has often spoken of how OakNorth’s use of artificial intelligence — a system it also licenses to other lenders including NIBC and Sumitomo Mitsui Banking Corporation — gives it an edge underwriting loans. Khosla used to tell conference audiences that OakNorth had never suffered a default, but the Financial Times reported a rash of <a href=\"https:\/\/www.ft.com\/content\/d6645c7f-bb4e-4275-9a7e-9b1fa3a1317b\" data-v-f87c67ca=\"\">some £97 million in defaults<\/a> in February 2021 (<a href=\"https:\/\/www.fintechfutures.com\/2021\/02\/uk-challenger-oaknorth-faces-97m-in-defaults-from-ten-borrowers\/\" data-v-f87c67ca=\"\">roughly 2% of the bank’s loan book at the time<\/a>).","Khosla has history with Indiabulls. More than two decades ago, he managed the venture capital and private equity activities of Indian steel magnate Lakshmi N. Mittal’s family office. In this role, he <a href=\"https:\/\/economictimes.indiatimes.com\/news\/company\/corporate-trends\/learning-on-the-job-with-ln-mittal\/articleshow\/2225475.cms?from=mdr\" data-v-f87c67ca=\"\">oversaw an investment in Indiabulls<\/a>, where he then served as a director. &nbsp;"],"hashtag":["GOLDMAN SACHS"]}