{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/32621\/telegram-and-lantah-llc-both-want-to-issue-grams-but-only-one-can-have-the-name","publishDate":"2019-07-21T09:45:38","id":7352,"type":null,"title":"Telegram and Lantah LLC both want to issue GRAMs, but only one can have the name","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1] <\/strong><strong data-v-f87c67ca=\"\">Telegram Messenger v. Lantah, 2019 U.S. App. LEXIS 21158 (9th Cir., filed July 17, 2019) [NMR]<\/strong><\/em>","This case is a decision from the Ninth Circuit Court of Appeals involving messaging giant Telegram and a trademark dispute. To understand the issues on appeal here we need to take a look back to the initial lawsuit to see how we got here. This case is all about the Grams.","For those that don’t remember Telegram is a secure messaging company. Awhile ago Telegram did an ICO that raised something like a quadrazillion dollars in private sales for the purpose of building out a 3rd Generation blockchain network for their secure messaging platform. Telegram planned to call their tokens “Grams.” Around the same time Lantah, LLC was a startup aiming to build a blockchain network and filed for an intent to use trademark application on the mark “Grams.” As the Court put it “[e]ach plans to call its cryptocurrency “GRAM.” Telegram sought to enjoin Lantah from using the GRAM mark, and the district court issued a preliminary injunction.”","Now that we are current on what the dispute was why did the Ninth Circuit get involved? Well, Lantah’s attorneys appealed the district court’s order granting Telegram’s preliminary injunction. This type of appeal is called an interlocutory appeal, and it allows a party to have a higher court review a decision of the lower court before the trial is concluded. In this case, the lower court stayed the case (meaning put the case on hold) until they received a ruling from the court of appeals. Here, Lantah argued that the district court abused its discretion by issuing the preliminary injunction. The appeals court disagrees. Why?","The appeals court looks at the lower courts decision and determines if they applied the correct rule of law, and then if the application was illogical, implausible, or without support from the facts in the record. Here, the parties in the case disagreed about whether Telegram could succeed in the case on the merits, because Lantah disputed whether Telegram had used the mark in commerce. The Court ruled that the district court’s preliminary injunction was fine, because the district court’s determination that Telegram had used the mark in commerce was a-okay for a couple of reasons.","When Telegram was fundraising for an ICO the size of the Hercules-Corona Borealis Great Wall they provided would be purchasers with documents, such as “Purchase Agreement for Grams,” which “required the buyers to pay Telegram by a specified payment date in exchange for the right to receive the agreed-upon number of GRAMs in the future.” Additionally, “ [t]he district court also pointed to several publications that reported on Telegram’s efforts to offer the GRAM cryptocurrency.” In the opinion of the Court this sort of evidence shows that the district court did not abuse its discretion in determining that Telegram was using the mark in commerce.","It’s also worth mentioning that the appeals court pointed out that the district court never should have stayed the case pending this appeal. Essentially, staying the case may prevent the appeals court from having all the necessary information to rule on an interlocutory appeal. That wasn’t the case here, but it’s interesting to see nonetheless, especially this gem of a line “[w]e have repeatedly admonished district courts not to delay trial preparation to await an interim ruling on a preliminary injunction.” Yikes.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the Court","content":"ORGANIZATION"},{"type":"LLC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ninth Circuit Court of Appeals","content":"ORGANIZATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"U.S. App","content":"ORGANIZATION"},{"type":"Corona Borealis Great Wall","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"July 17, 2019","content":"DATE"},{"type":"Lantah","content":"PERSON"},{"type":"Palley","content":"PERSON"},{"type":"Ninth Circuit","content":"ORGANIZATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"quadrazillion dollars","content":"MONEY"}],"hashtag":["CRYPTO"],"authors":["Nelson Rosario","The Block"]}