{"summary":"David Mercer has been building up LMAX Digital, a UK-based institutional spot cryptocurrency exchange, that recently clocked in $1 billion in one day trading volumes. Mercer joins The Scoop with Frank Chaparro and Ryan Todd at the Crypto Evolved event in New York City to talk about LMAX&#x27;s growth, the 3 things keeping institutions from diving into the nascent market, and what it is like playing Rugby on the North Pole.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/30551\/david-mercer-lmax-digital","publishDate":"2019-07-09T16:00:59","id":7355,"type":null,"title":"A conversation with David Mercer, CEO of LMAX Exchange Group that operates LMAX Digital","category":["PODCASTS"],"content":["\n<style data-v-f87c67ca=\"\">\n\t.transcript {}\n\t.transcript .speaker {font-weight: bold;}\n<\/style>\n","<em data-v-f87c67ca=\"\">The following transcript is taken from The Scoop, The Block's new podcast. Listen below and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>, <a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>, <a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>, <a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback to <a href=\"\/cdn-cgi\/l\/email-protection#a4d4cbc0c7c5d7d0e4d0ccc1c6c8cbc7cfc7d6ddd4d0cb8ac7cbc9\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"33435c575052404773475b56515f5c505850414a43475c1d505c5e\">[email&nbsp;protected]<\/span><\/a>. This transcript has been edited for clarity and length. <\/em>","<a href=\"https:\/\/twitter.com\/mercerdavid?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">David Mercer<\/a> has been building up <a href=\"https:\/\/www.theblockcrypto.com\/linked\/40332\/lmax-digital-propelled-to-1-bitcoin-spot-exchange-by-vol-by-delivering-a-robust-and-trusted-crypto-trading-platform-for-institutions-worldwide\" data-v-f87c67ca=\"\">LMAX<\/a> Digital, a UK-based institutional spot cryptocurrency exchange, that recently clocked in $1 billion in one day trading volumes. The firm counts dozens of banks and trading firms as its clients. Mercer joins The Scoop with Frank Chaparro and Ryan Todd at the Crypto Evolved event in New York City to talk about LMAX's growth, the 3 things keeping institutions from diving into the nascent market, and what it is like playing Rugby on the North Pole. Show transcript and notes available on The Block.","<iframe frameborder=\"0\" height=\"200\" src=\"https:\/\/playlist.megaphone.fm?e=BLOCK1475678239\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">[related id=\"1\"]Frank Chaparro<\/span><\/strong> Exchanges such as Bakkt and ErisX have gotten a lot of attention and coverage in the United States as they build out their respective crypto venues aimed at Wall Street. But there's also LMAX Digital in Europe. Good morning everyone. Thanks for tuning into The Scoop. The Block's podcast for decision makers and thrill seekers we are live, actually no we're not live but we're in New York and we're in studio with David Mercer he's the CEO of LMAX and LMAX Digital which is a cryptocurrency exchange operated out of the United Kingdom. And I'm joined by my beautiful colleague Ryan Todd and we're about to dive into a crypto market structure regulations trading and of course David's favorite topic, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/48036\/lmax-digital-reports-solid-performance-with-average-daily-volumes-of-250m\" data-v-f87c67ca=\"\">LMAX<\/a>. David thanks so much for joining us.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> Good morning. Good to be here.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Yeah great. So we're at the Crypto Evolved Conference in New York which is hosted by Viable Markets the consulting firm. And the point of the conference is to explore a lot of the topics that David when you're out on stage you're a common feature in the New York, U.K. crypto conference circuit. What do you think from your seat as CEO of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/48051\/lmax-digital-the-1-institutional-bitcoin-spot-exchange\" data-v-f87c67ca=\"\">LMAX<\/a> which runs LMAX Digital which is doing I think $400 million sometimes...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> $640 million on Saturday.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> On Saturday $640 million worth of trading volumes. What is the biggest issue from a market structure perspective that's hanging over the cryptocurrency market from your seat?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> Very simple one word credit. But I would say let's go ABC: Acceptance of crypto currencies. That means you know you need to have a better use case of these assets. You're seeing that a little bit coming from Asia and then you have all these people rebelling against it and regulators clamping down on it. For example in New York State, you have the acceptance of it and the B would be banks and banking. You need an efficient bank and the major banks are not even banking crypto currency exchanges or crypto funds yet. Why not? I know why not. It's concerns around AML but we can get into that at a later date. And then the C would be credit. Very simply, if you want the Fidelity's of the world. For the bigger asset managers to come in and the pension funds to come in you need some access to credit. Because, quite simply, they're not going to send their funds to some Silicon Valley backed retail platform. That's just not going to happen. You need disintermediation you need quality of credit. So far, the industry hasn't solved that. Various people are looking at it but that's the biggest barrier to a third wave of this cryptocurrency revolution which is institutional.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So when you're talking about credit explain to our listeners what you mean by that? What is missing exactly?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> So in, for example the FX world or simply look at the equities world, if you want to buy a stock you have a trusted counterparty. Those trusted counterparties are normally regulated and quite often they're banks so you're pretty secure in the knowledge that your funds are safe. At the moment if an asset manager, for example, wants to buy $100 billion worth of Bitcoin, what are they going to do? Send those dollars to some random exchange in the Bahamas or would they rather send it to a bank? A trusted counterparty where they know their $100 million is safe. I mean the \"major banks\" at the moment that are involved in crypto have very small balance sheets. You're talking about hundreds of millions of dollars rather than billions of dollars. So that's the credit you need the wheels of capital markets are oiled by credit.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> You're basically saying we need someone to sit between the exchanges and the person who's allocating from their funds?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> For institutional money yes. At the moment the LMAX Exchange Group is seen to be the trusted counterparty. But I wouldn't expect to be that trusted counterparty in the fiat world. We trade $20 billion a day in fiat. You don't have Barclays Bank, BNP, J.P. Morgan, Goldman Sachs saying: \"Hey David, here's $100 million, send me back the equivalent in euros please.\" Absolutely not, they they themselves would use their own prime brokers or if you're a fund or you're an asset manager...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And you are going to want to bring in multiple prime brokers.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> So you're saying subprime services like traditional sell side function that type of...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> In my opinion yes.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> OK.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> So there is another way around it. We can talk to the crypto evangelists out there. Let's go forward 10 years, let's get to the atomic swap. Let's get to instantaneous settlement but it's not here today. Someone has to go first. This is a bit boring and doom and gloom but in 1974 something arose called banker stat risk which basically meant in the fiat world one bank went pop and all of a sudden you lost your funds. So then what happened - and the FX world is very quick - a whole 28 years later in 2002 they established CLS which, if you like, is the lender of last resort. That was the big credit shop at the end of the street, you don't have that in crypto today","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Kind of like a DTCC.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> Correct. So you need something...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> We could have a shock like that in crypto.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> We could! You need a huge balance sheet for it and I'm all for that. If there's somebody with a huge balance sheet that can offer credit to all the participants, then humble exchanges like LMAX Digital can work and everyone's sure that the credit is elsewhere. All we do is match buyers and sellers but at the moment it's not there. You're asking people to send money to exchanges and OTC providers as principal.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How would you relate the risk between LMAX and LMAX Digital with regards to the lack of a credit function in the market or someone providing rather that credit?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Credit of last resort.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> Yes. Look at...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And how is that priced in? I mean is that why our fees are so high?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> That's the reality of the crypto market today. If credit performs, it's the most lucrative capital market for liquidity providers, traders and exchanges, because you're talking about fees in tens of basis points. Sometimes the retail exchanges are charging 1%. Now that's ludicrous! Put that into perspective, in the institutional market and foreign exchange trades at about $2 to $3 per million it's 0.3 of a basis point. I think we're the most efficient in the crypto world: we started six basis points down to two basis points for regressing. So in $\/million terms you're talking about $60 per million down to $20 per million but that's still 10 to 30 times x the FX rate, all because of credit. If you ease credit then all of a sudden the fees will compress as well and you end up with a much more efficient market.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What about slippage? What does slippage look like for you guys because fees are one thing but once you kind of put the two together?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> That's slippage in markets right...? That's kind of my job. You know we run five exchanges globally - the fifth exchange we launched was LMAX Digital. What I have to do is go and get the best liquidity out there, we think we do. We have probably the top 4 liquidity providers in crypto today, all bar one of them are also some of the biggest liquidity providers in FX and equities. We've just got to keep increasing the depth, the reality is you're not seeing huge tickets in the crypto market today so there's the point...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Even with the run-up?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> Not depth. You see a lot of people buying a coin - the average trade size is still a coin. It’s okay it’s gone up from $5,000 to $11,000 the last week but it’s still very small. You know the average ticket size in foreign exchange is $750,000. Now if you think about the way a central limit order book works, whether it be any of the LMAX exchanges or LMAX Digital, or any of the equity exchanges out there. You stream firm limit orders into the exchange, which means they’re tradable on, as a liquidity provider you need to. You’re only putting out there what you know might actually trade. There’s no point in me for example having $200 million aside on the book because the liquidity provider’s exposing himself. And you have this very fragmented market at the moment where something could happen elsewhere which they haven’t seen and all of a sudden they get picked off on a stale price. I would say at the moment, we have at any given time $10 to $20 million liquidity both sides of the book. What does slippage look like? Top of the book for one coin you’re going to pay a $3 to $5 spread which is pretty good - the tightest in the market I hasten to add. But if you want to buy 100 coins that’s going to cost you $100 to $200 in spread. I’ll give you one example of a customer of mine: on Saturday in the run up their timing was unfortunate. They started buying at $10,200, they finished buying at $10,900.Their VWAP price was $10,600 on a $2 million ticket. It just so happened that they were buying when the rest of the market was buying.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Now that’s fascinating but what I’m interested in is also about the prematurity of how we can engage with this market. We think about ways that folks can sort of reduce risk or limit slippage. It could be things like different order types like an iceberg order type where you slice things up a lot of that stuff doesn’t exist just because one, the matching engines are so premature, and two, we’re just not there from a technical perspective. In a lot of the funds that are out there.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> Is that a lay-up trade for me again? I’d say on LMAX Digital they’re all available right. So if you think about…","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How many order types?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> You name it. So you mentioned icebergs - we have icebergs right now. In most cases that’s not effective for people. If you want to VWAP an order, you VWAP it or do you want to TWAP it, you TWAP it. You say matching engines are premature. I have the same technology now on LMAX Digital as I have in my fiat exchanges. On those fiat exchanges we process four billion orders a day. The cancel and replace times are 80 microseconds. You have the same players who are trading on the biggest futures exchanges in the world in fiat, in equities, trading on LMAX Digital today. Now most of their order execution is low latency, over 80 microseconds. Sounds very low latency to me. Well, so what you talk about and this is what I want to pick up in a little bit: You talk about the immaturity of technology that’s on retail platforms and you’re very US-centric here. You talk a lot about the US retail platforms, you shouldn’t call them exchanges. They’re very good sales and marketing engines. They’re very good at it. They’re very good at onboarding clients who want to buy $500 worth of coin or a $1,000 worth of coin.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Let’s talk about one of the elephant in the room: Coinbase. They had a project in Chicago that they were building out and that was going to be a low latency, high frequency trading matching engine where they’d have higher capabilities more robust platform and to have traders engage with the market in the way you’re describing LMAX Digital. They scrapped that project after spending millions of dollars - the idea was this isn’t where the market is, retail might be more valuable. Is there a market right now for crypto for institutional and what do you make of their pivot?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> I don’t like talking about competitors that much - what I would say is building an institutional exchange is difficult. We have a track record of 10 years of doing it. In all my exchanges I have 23 of the world’s largest banks connected to LMAX Exchange and most of the world’s largest non-banks, so the prop trading firms you know in Chicago and New York City. They’re connected to us. They use the same technology to connect to LMAX Digital their bar is very high they need to cancel and replace orders in microseconds not milliseconds, not seconds. Because what they can’t have is stale prices out there and then they need an acknowledgement for every single one of those orders. Has that order been received? Has that order been cancelled? And, is there a trade acknowledgment? So when you do that, for example, it’s not as simple as the orders. Then there’s backup called drop copy if something goes down, the internet goes down, the datacenter goes pop - internally that hasn’t happened in four years just so you know - then they have immediate backup of where they were in the stack. Remember they’re processing - any one of these guys is processing millions of orders a day. We process or can process from one liquidity provider up to 30,000 orders per second. So when someone who’s very good at building a retail platform moves into institutional space it’s a whole new tech stack. It’s a whole new requirement of those people if you like it’s vertical rather than horizontal. What I couldn’t do is have 20 million individual customers trading at the same time. But what I’m very good at doing is pumping millions of orders down one pipe to a discrete number of participants. It’s just a different organization.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So you think that you’re going to stick to what you know?Maybe Coinbase sets to having that consumer facing brokerage entity that’s successful at marketing and getting people on the platform and they can just pull liquidity from LMAX the same way that an E-Trade or a Robin Hood engages with…","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> They could. And many of their competitors do. As I say: I’m not about to tell them how to run their business because they’ve done a very good job and they’re a very valuable company. So they could move into the space you must ask yourself though…","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> David’s always thinking about potential customers.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> But you’ve got to ask yourself: Where is the value there? As I say the value, their value proposition is market access to retail customers. Retail customers pay a wider spread and higher fees than institutional. Institutional customers are already racing to zero, they race to zero in equities, they race to zero in FX and they’re going to do the same in crypto. This is all about a volume game. You said is the market there today? I believe the institutional market has only just started but if I traded $6billion this month and around 50% of some of the futures exchanges, I think we rank at least top 3 if not top 1 spot exchanges. Not against whatever to tether coins but I mean fiat to coin. So I think there’s a market today but that market is driven by agile HFT prop shops and the banks aren’t there yet but they will come and they will come because you guys will insist on it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Are you guys at a point where - I was talking to an exchange executive over the weekend about some due diligence they were doing or rather due diligence a very large $40 billion fund was doing on the exchange. They opened up an account and they were onboarded and they kind of were just sitting there, they haven’t made a trade yet. Are there any examples where listeners need to understand that these are six months to a year cycles of onboarding these types of clients? Do you have a lot of banks or large asset managers, $5 billion plus, who are doing due diligence with you, onboarding but not touching it but just getting ready and putting the feelers out?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> Yes. So the first thing you do there if you think about it - if you think about my ecosystem and fiat it’s the same API, the same FIX API to get my price feed for digital. It’s the same software just different hardware. So for price discovery they take it and I give it to them for a while for free. They then build up their trading engines, they build up their algos, they build up their portfolio strategies. I should imagine they’re back testing a lot. I think when the major banks trade - when you see the first bank trade crypto currency I’d be amazed if it wasn’t on LMAX Digital because they’re already connected to me. So yes, most of them are connected or connecting and I have some very large funds connected. Probably of more interest though is the interest you’re seeing from Asia.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> The wheels were turning he’s reading my mind. Is there any… you have a ton of major corporations, the biggest tech companies moving into the space line launching a, I think they launched an exchange or their own cryptocurrency, but there’s different folks moving into the space over there is there any plans to expand LMAX Digital into Asia?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> There are already, I mean that’s probably our biggest region today. Go back to the ABC: the biggest acceptance of cryptocurrency as a as an asset class as a capital market is in Asia. If you, let’s face facts, if you go to Tokyo - I’ll be there for the Rugby World Cup in October - and there you can buy a cup of coffee with bitcoin. So there’s been acceptance - there is no acceptance really in New York City for example. We see a lot of interest for Asia and remember that region is the most disparate in terms of people, countries and currencies. So you have the most problem with cross-border payments. Someone asked me yesterday - someone you’ll know well – David, would you be accelerated if we give you access to 50 licenses in 50 states? Would it rapidly increase your traction? I said no. I’d rather have 20 countries in Asia because they’re using it now. The United States is difficult because of the federal state system, it’s difficult because you have six states with licenses and then a whole number of states without licenses - in Asia you just go. They’ll need it. People working for example in Singapore, sending money home to the Philippines to Thailand to Indonesia. They’re adopting crypto currency, they’re accepting it today and there’s a real use case for it today, It’s not just gambling.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So what do you make of the way the US is approaching regulations? We had a panel on this not too long ago where we talked about the great state of Wyoming. In the US there are two sides of the coin, no pun intended. One, you can have states specifically drive innovation and really you know set up parameters around this space that can drive adoption in their respective jurisdictions. But at the same time the other side of the coin is if you have all these different places doing different things it’s cumbersome on the business, you can’t get things done. Is that just a weird American states rights thing or is it squashing innovation?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> If you pushed me I’d elect for the latter. I think it is stunting innovation - I mean let’s face it: most companies you ever establish, if you’re a foreigner when you come to United States, you set up in Delaware. Who would have thought that? But then they have the most established legal system so we all use that. Now, New York state elected this bit license and everyone else just goes and operates in Jersey. But I have something to say there, which is, the United States has their own method of regulation. You have this battle between SEC and CFTC and very much they protect consumers. That’s a good thing. I’m all in favor of protecting consumers. This current minority state license isn’t protecting consumers that much. I think you know to this day you can’t buy equities on leverage in the United States unless you are an accredited investor. So if you’re rich it’s okay and you can understand that but if you’re not rich but you’re smart you know to trade on leverage. So I have my own views on that on the UK. We just regulate it, we have suitability tests, we have financial promotion rules that say look, do you understand where you’re getting into? I think very much that there should be some global, not just in the United States, consumer protection because on the last big run up everybody from Nonna to your taxi driver was saying hey, should I get myself some bitcoin? Do you know what you’re buying? Have we told them all about the risks? In the United Kingdom the maximum leverage you have in crypto is two to one. But you write a lot about these exchanges in Hong Kong doing 100 to 1. That’s ludicrous.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> I can’t even fathom 100 x.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And Bitfinex is announcing or they laid it down in their white paper for Leo token#Leotoken that they will also be following in Bitfinex’s footsteps and offering 100 x leverage.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Which is also marketed as a hedging tool.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Yes. Is that something that’s. Is that a hedging tool or is that…?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> It’s gambling. Yeah it’s a casino. And again, look…","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> No seriously is there any use case for an institution or a large trading firm to have 100 x leverage?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> Two different questions. For a large institution, for a bank, that’s absolutely fine. I guarantee they wouldn’t use it. I come from a fiat world where there was a100 to 1 leverage in FX for a long time. But remember, the biggest gap in a major currency apart from the S&amp;P in 2015 is 3% over the last 25 years. So what does that mean?A 3% gap. If you’re going against the edge case the maximum leverage there in fiat should be 30 to 1. Now, what’s the extreme move in crypto currency? You could say 50% but let’s be reasonable and say it’s 20% - well then the max leverage should be 5 to 1. So in the institutional space, in the wholesale market, don’t overregulate. If they want to use leverage, let them use leverage. In the retail space, come on, we have to protect the individual. Do a, understand the asset the asset class? Do you understand the asset you’re purchasing? Do you understand the effects of leverage? You have to go back to basics and say the thing that everyone accesses on leverage in their life is a house on their mortgage. You think about the amount of disclosures you have to read when you get your first mortgage. Or when you get a lease agreement for your first car. Now that’s the level of disclosure you must have for private investors and for consumers, you must protect them from themselves. I don’t go along with the United States approach which is just ban it like you do to equities on leverage because you should offer that aspiration, if you like, to everyone or protect them make sure it’s suitable product for them and make sure they understand it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Another thing. Another issue in the market structure that a lot of people point out and a lot of these are random exchanges, some of which are in Asia, but this is a trend that’s going on even for some of the US based exchanges and there’s a lot of confusion around the legitimacy. Not even legitimacy but the justification for having exchanges also operate over the counter trading desks that make markets on their own exchanges.Some people believe some are doing on agency or rather a proprietary basis while others are doing it on an agency basis to provide that liquidity for their clients. Do you think it’s an appropriate function for an exchange to have, would LMAX ever?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> I have to say yes. If you do it properly I’d take you out of crypto for a minute. I’m regulaed as an MTF (multilateral trading facility), which is like a CEF in the US, and a broker. The broker trades on the MTF so the broker acts as an agent for customers who want to open with the broker because not everyone can be an institution and trade directly on the exchange. So this is well-established you have these exchange seats whether it be an equity exchange or futures exchange, you have that. And then you have brokers accessing it. So if you have the biggest banks in the world for example - they might run a venue, they might run an STP, they might engage in exchanges but they also offer broker dealerships. So it’s OK. But it should be disclosed, end consumers should be very clear about who you’re trading with and how your order will be executed. It can’t be that the agency desk steps in whenever it’s a good trade for them and maybe bad for the customer. You’ve seen enough of the scandals in all the broadsheets in FX and equity markets over the last ten years.It’s that disclosure to the customer. So it’s entirely possible that large entities that happen to want exchange kind of agency desks but you’ve got to have clarification of where the Chinese walls are and whether the communication starts and ends.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Something interesting I want to walk back on your thoughts on the race to zero fees from an institutional standpoint. Are there parallels to the rise in electronic trading and efficiencies that we’ve seen from that in your prior experience and what just kind of some thoughts on those developments happening right now in crypto trading.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> It’s going to happen - it’s too expensive right now. Market access is too expensive for the end user. I mean everyone likes to go around bashing the banks for the cost of doing foreign currency when they go abroad. But if you want to buy a $1,000 worth of bitcoin the chances are someone is going to charge you $10for that, that’s 1%. In the FX market that would be a dollar10 basis points, is still quite high. So look, it has to become more efficient, it will become more efficient. And the question, the challenge I have for all these retail exchanges, sorry retail platforms, is, can they exist when spreads compress? Exactly that. So I can but I have a very simple exchange model.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Because you’ve already started there, correct?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> They’re using stuff that they already built?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> I mean that’s the next question is, are we going to see a wave of consolidation among some of these platforms?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> Sure. Well let me let me just say one thing regarding the ticket. Building institutional exchanges or even a cost-effective exchange is difficult and expensive. So the first ticket I ever printed on LMAX Exchange Group cost me $100 million, the next ticket cost me zero. That’s the nature of exchanges: it has to be robust, you have to be able to manage this massive throughput of orders and this massive low latency requirement of liquidity providers and customers. But once you’ve got it, then the marginal cost is next to nothing. So I know I can exist at six, five, four, three, two, one basis point, .1 of a basis point, .01 of a basis point because all exchanges on the planet operate high volume business models. So that’s the trick. And there will be a push and a pull where the highly profitable platforms out there at the moment actually don’t want prices to compress but naturally it’s no different than Amazon or eBay. Naturally there’s efficient price discovery and you’ll all look at the most efficient place to trade. To your second point, Frank, on consolidation: I think it’s inevitable. And again I’m not going to criticize the guys who caught the first wave. The guys are opening a million customers a week. They’re big enough to not fail. They’re big enough to acquire smaller players with an edge in a different segment. And guess what - here’s one for you: They’re big enough to buy established brokerage houses, established exchanges in the traditional markets so there’s nothing to say that the winners in crypto today can’t move laterally back into capital markets and then all of a sudden it could be really interesting because you can have tokenization and you can have the, if you like, crypto world embracing and penetrating deep into the couple of markets we’re used to today.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What do you think? I mean What player do you think would do that? I’m trying to think about who out there. I don’t know if people are thinking about capital markets that…","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Almost sounds like an eToro or like a…","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> eToro could do something like that but they just launched an exchange. I don’t see a Binance or Coinbase or any or any of those guys doing something. They don’t want to disrupt and improve capital markets. They want to create a new ecosystem for the crypto utopia.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> But you can do it from within. Imagine every equity on the New York Stock Exchange or the Nasdaq, other exchanges are available being tradable against Bitcoin or Ether. Imagine that. Imagine that interoperability and imagine the efficiencies there across asset classes and…","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> The stocks being you know on ERC 20 tokens it’s like wrapped Facebook and wrapped Tesla.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> I mean there’s a lot more likely. Yeah. I’m meeting a few bankers later...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Are you going to short them?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> Probably. But they’ll naturally look at it and say hey you know we’ll go and acquire one of the platforms you’ve talked about. That’s what you’d expect and probably the most likely what I think turned on its head. Imagine if you have a smart growth equity, private equity investor buying into one of those shops so creating some liquidity for the founders. Well the stakeholders what are they going to do? They might be the ones who are ambitious enough to take it into other capital markets and if you like to make crypto currencies, crypto assets pervade throughout the whole capital market ecosystem then you might see these large buildings in Manhattan and the City of London being empty frankly. That is possible but that’s why I am certain the biggest banks will come because there’s a lot of smart people there and they know there’s a threat to their core business, to their ecosystem. And they know their end customers will be trading this asset class in years to come.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Do you have any interest in starting up a retail arm to LMAX Digital?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> No.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Why not? I mean there’s all this talk about having a good balance of retail and institutional liquidity and operating an exchange.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> So I would say I already access that liquidity but simply you know you’ve got to know and got to play to your strengths. I’m very good at running low latency high throughput exchanges. We’re very far from the best at sales and marketing and onboarding, automatically onboarding millions of retail customers that’s a whole different tech stack. We don’t have that capability. What I’d much rather do is build out the ecosystem, if you like, to be the institutional matching engine for crypto assets.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Who do you see being your biggest competitor on that front?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> I can’t see any. I can’t tell you any names, I’m not going to give them the credit by naming them myself but there’s big names that have been talking about launching for a year. They haven’t printed a ticket yet. I don’t see it. I think we’re so far ahead that they’re going to be wondering how we did it because remember, I already have a distribution.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Do you think it was less about and we know we talked about regulation but we think about some of the exchanges that haven’t or have just launched or have a launch yet ErisX just started their spot market don’t know what the volumes look like on that. And TX acts also recently launched their spot markets still waiting on derivatives to play out. BakkT hasn’t launched. And then the institutional ambitions and a lot of the native crypto firms have sort of fallen by the wayside.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> So where do they go? Here’s my key right.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Very much the question to ask is do you think it’s regulations here in the US that’s holding them back?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> No, it’s distribution. Remember, no one just goes “hey, we launched, onboard! Everyone beta tests. I beta tested for three months. Now what’s my advantage when I beta tested? I have an ecosystem of 5,000 customers already connected including the biggest banks and funds in the world, even accessing real money algo desks. So I start there and you talk about I want to service that retail broker community, what they’re good at is not what I’m good at. So they’re good at sales and marketing and onboarding. So guess what? Go and get your institutional liquidity and match on LMAX Exchange. Why not even tell the customers that hey we give you bells and whistles? We give you pretty graphs, we give you access, we give you someone to speak to for customer services. David at LMAX Digital isn’t going to do that, but you know what? We match on LMAX Digital because of the best price and the deepest institutional liquidity out there. So I start with distribution. What’s stopping these guys is they don’t have distribution, it’s the hardest thing to build. It’s taken me 10 years to build it. So I just layered another exchange on the top the fifth exchange we launched being LAMX Digital.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> What about...So we’ve talked a lot about regulation sofar, specifically in the US. Any thoughts on that. FATF?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Let me put on my FATF hat for a second. Basically it’s going to require at least, and David can probably speak to a better than I can, but require exchanges to, when funds are transferred between different venues, they also have to transfer the information behind that trade which is something that they’re not required to do.Targeting anti money laundering. But is this something that’s going to make business more complicated for you more cumbersome?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> I do it today. OK. It’s the fifth money laundering directive that actually comes in in July. Guess what. It was a prerequisite of my regulation in Gibraltar already implemented the fifth money laundering directive. Now this is the biggest single risk to this industry and everyone who plays in it needs to wake up and smell the coffee. You need to abide by the best in breed AML and KYC policies that exist today. They’re not doing that, some of them. Now if you want to open it’s not just like capital markets if you will open the account with your lawyer, with your accountant you have to go through the same AML guidelines. We adhere to, there’s five different sets of them, FATF is one of the key ones. But you have to abide by all of them and it’s essential for the legitimacy of the world and the legitimacy of crypto currency. So we’re just going to have to do what makes it so hard. I can tell you where the coin goes next, I can tell you where it came from. Why is it so hard? Why? Because you’ve got something to hide. Right now it’s not much of a problem, it doesn’t say you have to know forever. And by the way, remember, the blockchain is immutable - you can if you can be bothered you can go and check it yourself. It’s just not that hard. It’s the lowest level of professionalism that every participant should be asked to adhere to. If your platform provider, your broker is not adhering to that then you shouldn’t open an account with them.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Let’s face it I agree.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Now I’m trying to figure out remember what the argument it’s all about.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> It’s complaining over costs and being cumbersome to adhere to but it’s I find ironic because you have all these talking heads attacking banks for...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> I think the rule against it is that you’re going to see a lot of the activity move off to two wallets which will make things less regulated.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> I feel like I’ll stop.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> You have a wallet now. I just don’t get it. I mean it’s not that expensive. The whole world adheres to those rules today. This is a little bit more onerous but not so much. Look, if you want to play in this game very simply if you want to deal with other people’s money. And you don’t want to fund criminal activity and you don’t want to fund terrorism then guess what, apply to these minimum standards and you should all expect them. I expect them. I don’t understand the pushback. It’s not expensive. And guess what. There are many many ways that the smart guys have worked out to flip between separate coins okay. They’re only saying where does it go to say well okay. Frank’s coins now go into this wallet which I believe belongs to Ryan. That’s it. Doesn’t say that Ryan can’t then changes Bitcoin via EOS into Monero. And guess what you mentioned one of the companies do it now. The trail is lost, it’s very possible. So the fear that the regulators, the large institutions have at the moment is AML. I couldn’t tell you the AML adherence and the tracking and the provenance of coins is much better in crypto than it is in fiat. Every dollar bill you have in your pocket has been on a race track. It’s probably been in a suitcase and is probably been used for something else. That’s it. But because you get it from an institution down the street in an ATM you think it’s good. A coin - I know where it’s been and I know where it’s going so I’m simply not having this. People say it’s too onerous. Basically means they’re not doing it correctly now and they should. Otherwise you fund coming out criminality in this world and that’s not where we want to be.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Let’s pivot to talk about you which is something I’m sure you won’t be opposed to obviously because LMAX Digital isn’t a consumer brand. You know, people especially in the U.S. might not be familiar with your story. Most my listeners I imagine are U.S. based. Tell us a little bit about how you. There’s tons of stories we can dive into like rugby at the North Pole and other things growing up in Belfast during the troubles. Talk a little bit about your journey to finding LMAX and how you sort of wound up where you are.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> I’ll give you that. I’ll give you the quick version right. So you know man and boy join capital markets age 18, couldn’t afford university so went to work and worked at Ernst &amp; Young, then worked at an investment bank, Credit Suisse First Boston, at one stage for 10 years. Then went through the brokerage world and wound up at LMAX Exchange Group. Actually, I was just a hired gun initially, a highly paid interim chief executive on a flawed startup. And as you’d imagine that was that was no stress. And then a year later I just bought all the stress by doing an MBO. So we bought two thirds of the company then and we completed the MBO via a leveraged buyout at the start of 2017. So again, that makes us agile, that makes us unique in the marketplace in that when you’re dealing with anyone at LMAX Exchange you’re probably dealing with an owner or you’re certainly only one step away from the owner and decision maker. So 25 percent of my staff are shareholders. So we all care, we all have skin in the game. Why did we end up in the crypto space, why am I talking to you? Well, we tried to if you like move the fiat world from OTC to exchange. So we launched what is still the only the third central limit order book for spot foreign exchange. And we built it up over the last eight years – in the year I joined we lost $25 million and last year we made the same so hopefully you’ve had a decent turnaround in seven or eight years and we’re connected to all the top counterparts in the street. We’ve got customers in 100 countries, I’ve got eleven offices in nine different countries. Distribution is key. And then those institutions in 2017 said David, we need an exchange like yours to transfer risk between like minor participants in cryptocurrency. Frankly we haven’t looked at it. But within three months we had a beta test up and then we launched in May last year. So it’s the fastest growing exchange we’ve ever developed. We’ve done 6 million trades to date, this month’ll be our best month at $6 billion. We had a record day on Saturday at $650 million. Long may the bull run continue! But more importantly, you know, we’re big believers in blockchain technology and we’re we believe this could be the second great industrial revolution of our time. The internet being the first one. So we’re not quite at the start but we’re in because we’re believers for the long term.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Rugby at the North Pole. Let’s hear the story.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> Look we give, we give a little bit back most years. So actually this year we just played the highest game of rugby ever earn it on Everest at 6,400m, two years ago or three years ago now I trekked with a lot of ex rugby internationals to the North Pole and played the most northern game of rugby ever. There’s a picture of me just in my boxer shorts, how crazy is that, at minus 30 doing star jumps at the North Pole. The main reason was to raise we raise half a million for underprivileged kids in the United Kingdom and Ireland.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How do you stay warm?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> There’s no such thing as bad weather, just bad clothes. Yeah, we looked like I guess if you imagine ice hockey players and with everything on the knees being you’re five layers from base layers to two down jackets. I guess we looked like that. So look, the rugby wasn’t the great stand that it was all about. It was all about the trek, setting the world record so we’re officially in the Guinness Book of World Records. And as I say we raise half a million. We did the same again this year so pleased with that.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> How do you top that location space.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> We did the most northern game. Then we did the highest game.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> You do the low, you go underwater.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> Personally I want to go to the South Pole. I’ve been to the North Pole the most northern game let’s play the most southern game. South Pole slightly more dangerous than the North Pole. You can die there through no fault of your own which is a North Pole it’s quite difficult and because you have crevices and things like that in the South Pole. So personally I’d love to do that whether I’d do that with an LMAX hat on or a later stage of my life. I don’t know but certainly I’d like to take off the North Pole and South Pole.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Sort of cheat and go to like those islands off the coast of Argentina which would probably be out there playing rugby down there.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> That’s one of the starting point I see is your hopes are a hop off from Chile. I think it is but yeah look that would be fun. It’s all about we did it for the Wooden Spoon which is the Children charity of rugby and it’s all about raising their profile, raising money for the kids and I’d like to do more and as other people do similar things. It’s also good PR for the brand. But yeah we keep doing every two or three years will do something huge like that. And in fact we do another fundraiser much less aggressive. We’re doing the three peaks in Yorkshire on Independence Day because it’s the quietest day of the year for us and there’s 25 of us again going to try and walk up and down these three peaks in 24 hours and again raise some money for charity.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> David thank you so much for joining us. We really appreciate your insights and hopefully we’ll have you on in a future season. Ryan thank you so much.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">David Mercer<\/span><\/strong> Been a pleasure. Thanks for being on time for once. Don’t forget Europe when you’re writing stuff on The Block."," 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CEF","content":"ORGANIZATION"},{"type":"Amazon","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"J.P. Morgan","content":"ORGANIZATION"},{"type":"Ryan Todd<\/span><\/strong> Which","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"New York State","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"Monero","content":"PERSON"},{"type":"$3 per million","content":"MONEY"},{"type":"Manhattan","content":"LOCATION"},{"type":"$60","content":"MONEY"},{"type":"North Pole","content":"LOCATION"},{"type":"LMAX Digital","content":"ORGANIZATION"},{"type":"United Kingdom","content":"LOCATION"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Saturday","content":"DATE"},{"type":"Silicon Valley","content":"ORGANIZATION"},{"type":"Chaparro<\/span><\/strong> David","content":"PERSON"},{"type":"Barclays Bank","content":"ORGANIZATION"},{"type":"Frank Chaparro<\/span><\/strong> Kind","content":"PERSON"},{"type":"Bitfinex","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"David","content":"PERSON"},{"type":"$40 billion","content":"MONEY"},{"type":"ABC","content":"ORGANIZATION"},{"type":"Tesla","content":"LOCATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"1974","content":"DATE"},{"type":"Ryan Todd<\/span><\/strong> OK","content":"PERSON"},{"type":"last year","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Chile","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"$100 billion","content":"MONEY"},{"type":"$750,000","content":"MONEY"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"2015","content":"DATE"},{"type":"billions of dollars","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"Crypto Evolved","content":"ORGANIZATION"},{"type":"Indonesia","content":"LOCATION"},{"type":"Asia","content":"LOCATION"},{"type":"$2","content":"MONEY"},{"type":"$11,000","content":"MONEY"},{"type":"Europe","content":"LOCATION"},{"type":"$5","content":"MONEY"},{"type":"$3","content":"MONEY"},{"type":"millions of dollars","content":"MONEY"},{"type":"London","content":"LOCATION"},{"type":"May last year","content":"DATE"},{"type":"MBO","content":"ORGANIZATION"},{"type":"$20","content":"MONEY"},{"type":"fiat","content":"ORGANIZATION"},{"type":"Tokyo","content":"LOCATION"},{"type":"Ryan","content":"PERSON"},{"type":"Belfast","content":"LOCATION"},{"type":"LMAX Exchange","content":"ORGANIZATION"},{"type":"BNP","content":"ORGANIZATION"},{"type":"2002","content":"DATE"},{"type":"today","content":"DATE"},{"type":"E-Trade","content":"ORGANIZATION"},{"type":"FATF","content":"ORGANIZATION"},{"type":"the Philippines","content":"LOCATION"},{"type":"$10,200","content":"MONEY"},{"type":"$6 billion","content":"MONEY"},{"type":"MTF","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"$10,600","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"Ireland","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"LAMX Digital","content":"ORGANIZATION"},{"type":"New York City","content":"LOCATION"},{"type":"$500","content":"MONEY"},{"type":"$6billion","content":"MONEY"},{"type":"$10","content":"MONEY"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"Crypto Evolved Conference","content":"ORGANIZATION"},{"type":"$\/million","content":"MONEY"},{"type":"UK","content":"ORGANIZATION"},{"type":"Ryan Todd<\/span><\/strong> Let","content":"PERSON"},{"type":"Spotify","content":"LOCATION"},{"type":"KYC","content":"ORGANIZATION"},{"type":"$400 million","content":"MONEY"},{"type":"AML","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"Chicago","content":"LOCATION"},{"type":"Ryan Todd<\/span><\/strong> Credit","content":"PERSON"},{"type":"Ryan Todd","content":"PERSON"},{"type":"$640 million","content":"MONEY"},{"type":"3%","content":"PERCENT"},{"type":"Ryan Todd<\/span><\/strong> How","content":"PERSON"},{"type":"LMAX Exchange Group","content":"ORGANIZATION"},{"type":"$10,900","content":"MONEY"},{"type":"David Mercer<\/span><\/strong> Correct","content":"ORGANIZATION"},{"type":"$1,000","content":"MONEY"},{"type":"David Mercer","content":"PERSON"},{"type":"Ryan Todd<\/span><\/strong> Almost","content":"PERSON"},{"type":"Guinness Book of World Records","content":"ORGANIZATION"},{"type":"Chaparro<\/span><\/strong> David’s","content":"PERSON"},{"type":"Credit Suisse First Boston","content":"ORGANIZATION"},{"type":"$650 million","content":"MONEY"},{"type":"Good morning","content":"TIME"},{"type":"South Pole","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Delaware","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"weekend","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"last 25 years","content":"DATE"},{"type":"Yorkshire","content":"LOCATION"},{"type":"Argentina","content":"LOCATION"},{"type":"$20 billion","content":"MONEY"},{"type":"Robin Hood","content":"PERSON"},{"type":"Chaparro<\/span><\/strong> Very","content":"PERSON"},{"type":"$25 million","content":"MONEY"},{"type":"$200 million","content":"MONEY"},{"type":"$200","content":"MONEY"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$10for","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"STP","content":"ORGANIZATION"},{"type":"$5,000","content":"MONEY"},{"type":"Ernst &amp; Young","content":"ORGANIZATION"},{"type":"DTCC","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"Wyoming","content":"LOCATION"},{"type":"Gibraltar","content":"LOCATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"OTC","content":"ORGANIZATION"},{"type":"Thailand","content":"LOCATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Nonna","content":"LOCATION"},{"type":"Chaparro<\/span><\/strong> Rugby","content":"PERSON"},{"type":"Jersey","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"25 percent","content":"PERCENT"}],"hashtag":[],"authors":["Frank Chaparro","Ryan Todd","The Block"]}