{"summary":"The collection contains 19 pieces, including rare satoshis and work from the early Bitcoin Ordinals adopter Shroomtoshi. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272357\/sothebys-bitcoin-ordinals-auction","publishDate":"2024-01-12T11:29:25","id":7356,"type":null,"title":"Sotheby&#x27;s opens bidding for curated Bitcoin Ordinals auction","category":["ART AND COLLECTIBLES"],"content":["Art auction house Sotheby's has opened bidding for its curated collection of Bitcoin Ordinals.","Called \"Natively Digital: An Ordinals Curated Sale,\" the auction contains 19 pieces — including rare Satoshis, work from the pioneering Bitcoin Ordinals artist Shroomtoshi, generative art and an item connected to the Bitcoin Ordinals brand <a href=\"https:\/\/www.theblock.co\/post\/263343\/bitcoin-ordinals-startup-taproot-wizards-raises-7-5-million-in-seed-round\" data-v-f87c67ca=\"\">Taproot Wizards<\/a>. The <a href=\"https:\/\/www.sothebys.com\/en\/buy\/auction\/2024\/natively-digital-an-ordinals-curated-sale\" data-v-f87c67ca=\"\">auction<\/a> closes on Jan. 22 at 2:00 p.m. ET.&nbsp;","\"This sale puts a spotlight on the incredible range of creative diversity found within the Bitcoin ecosystem, as Ordinals have seen explosive growth over the past year,\" Sotheby's wrote in a release.&nbsp;","Sotheby's concluded its first auction of Bitcoin Ordinals on Dec. 13, The Block previously <a href=\"https:\/\/www.theblock.co\/post\/266544\/sothebys-bitcoin-ordinals-nft-auction-bitcoinshrooms\" data-v-f87c67ca=\"\">reported<\/a>. The auction contained three pieces from the collection BitcoinShrooms, considered one of the first Bitcoin Ordinals projects ever created by Shroomtoshi. The auction fetched $450,850 upon close — five times higher than the combined estimate for the three pieces, Sotheby's noted in a statement.&nbsp;","\"Last month’s sale of three BitcoinShrooms was a test case to introduce Ordinals to the auction market,\" said Sotheby's head of digital art Michael Bouhanna in a release. \"The resounding success of that sale was proof of the explosive growth of Ordinals as a new arena for artists and creators to expand the reach of digital art and collectibles and make a lasting imprint on the Bitcoin blockchain. As Ordinals continue to attract attention from collectors, this new avenue will expand the boundaries of how we conceptualize digital collectibles, as well as place a spotlight on the unique convergence of digital art and crypto culture.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Sotheby","content":"ORGANIZATION"},{"type":"Bitcoin Ordinals brand <a href=\"https:\/\/www.theblock.co\/post\/263343\/bitcoin-ordinals-startup-taproot-wizards-raises-7-5-million-in-seed-round\" data-v-f87c67ca=\"\">Taproot Wizards","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Shroomtoshi","content":"PERSON"},{"type":"$450,850","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Jan. 22","content":"DATE"},{"type":"Dec. 13","content":"DATE"},{"type":"Sotheby's","content":"ORGANIZATION"},{"type":"Michael Bouhanna","content":"PERSON"},{"type":"2:00 p.m. ET","content":"TIME"}],"hashtag":["BITCOIN","NFT ARTISTS"],"authors":["MK Manoylov","The Block"]}