{"summary":"Foundry, which runs a marketplace for buying and selling crypto mining machines, released data showing the current price gap between buyers and sellers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178819\/foundry-data-shows-price-gap-between-asic-buyers-and-sellers","publishDate":"2022-10-20T18:30:14","id":7357,"type":null,"title":"Foundry data shows price gap between ASIC buyers and sellers","category":["COMPANIES"],"content":["With the ASIC market \"stuck in a deflationary spiral,\" there's a clear gap between the prices sellers are offering and what bitcoin miners are willing to pay, newly released data from Foundry shows.","While numbers vary significantly from model to model, for a newer-generation machine such as Bitmain's S19J Pro buyers are looking to pay $15\/TH or less and most sellers are asking for $20\/TH.","\"The market is somewhat locked as most miners face cash constraints and hosting options remain limited,\" the company said. \"However, there are deals getting done in the middle around $18\/TH.\"","Bitcoin miners have seen their profit margins squeezed in the past few months, as bitcoin's value dropped and energy prices went up, along with global hash rate and mining difficulty.","ASIC prices are down 80% from their peak and sellers now have to choose between letting go of inventory at lower prices or hiding on to it until Bitcoin rallies, the company said.","The industry has already seen Bitcoin mining hosting provider Compute North <a href=\"https:\/\/www.theblock.co\/post\/172246\/compute-north-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">file for bankruptcy<\/a> in September, while other companies like <a href=\"https:\/\/www.theblock.co\/post\/168711\/bitcoin-miner-cleanspark-announces-second-acquisition-in-a-month\" data-v-f87c67ca=\"\">CleanSpark<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/176598\/bitcoin-miner-crusoe-acquires-great-american-mining\" data-v-f87c67ca=\"\">Crusoe<\/a> have been buying up assets in the bear market.","\"We are fielding several calls a week from institutional investors looking to buy distressed mining assets,\" Foundry said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitmain","content":"ORGANIZATION"},{"type":"$20","content":"MONEY"},{"type":"Compute North","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$15","content":"MONEY"},{"type":"Foundry","content":"ORGANIZATION"},{"type":"$18","content":"MONEY"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}