{"summary":"The two firms expect demand for crypto-focused tax solutions to rise in the U.S. as the buying and selling of digital assets increases.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273092\/zenledger-taxes-partnership","publishDate":"2024-01-17T08:03:11","id":7360,"type":null,"title":"ZenLedger partners with AI-powered April to simplify crypto taxes","category":["TAX"],"content":["<span data-v-f87c67ca=\"\">Crypto tax startup ZenLedger is attempting to improve its ability to service its U.S. customers, who might be anxious when it comes time to file their taxes this year, by forging a new partnership with <\/span><span data-v-f87c67ca=\"\">AI-powered tax software startup April.<\/span>","<span data-v-f87c67ca=\"\">With the growing interest in digital assets investing and trading, simultaneously, \"<\/span><span data-v-f87c67ca=\"\">cryptocurrency taxation has become increasingly complex, with individuals and businesses often juggling multiple tools and platforms to meet their tax compliance needs,\" the two companies said in a statement.<\/span>","<span data-v-f87c67ca=\"\">Navigating tax liability with regard to the buying and selling of crypto continues to evolve in the U.S. as the Internal Revenue Service wrestles with how exactly it will treat the use of cryptocurrencies by both individuals and businesses. The IRS <a href=\"https:\/\/www.theblock.co\/post\/270058\/questions-remain-over-rule-requiring-large-crypto-payments-to-be-reported-to-the-irs\" data-v-f87c67ca=\"\">recently said<\/a> p<\/span><span data-v-f87c67ca=\"\">eople engaged in trade or business must now report any crypto transactions made of $10,000 and more, however, it was not crystal clear how exactly the new requirement will function.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">By forging this integration with April — like TurboTax an IRS authorized e-file provider — ZenLedger aspires to create a simplified filing process on a single platform, the company said. \"ZenLedger users will import their aggregated trade data into April’s platform with a single tap,\" it also said.<\/span>","<span data-v-f87c67ca=\"\">\"As of January 11, there were approximately 400,000 bitcoin transactions per day. By consolidating the entire tax experience into a single filing platform, traders can import their transaction data through a seamless user experience that reduces the risk of potential errors and inaccuracies,\" said Ben Borodach, CEO and co-founder of April.<\/span>","<span data-v-f87c67ca=\"\">In light of spot bitcoin ETFs being approved and maturing of the cryptocurrency market, Borodach expects demand for comprehensive, crypto-specific tax solutions to \"accelerate in the U.S. market\" with crypto traders becoming increasingly eager to feel confident when reporting their activity.<\/span>","<span data-v-f87c67ca=\"\">\"The Treasury Dept is working to ensure all crypto exchanges and wallets report activity,\" said <\/span><span data-v-f87c67ca=\"\">&nbsp;ZenLedger co-founder and CEO Pat Larsen.<\/span><span data-v-f87c67ca=\"\"> \"The IRS is going to increase audits in the future and the best way to protect yourself is to correctly file your taxes now, because audits can go back several years.\"<\/span>","<span data-v-f87c67ca=\"\">The IRS has had its eye on crypto for a while now. In 2020, the <a href=\"https:\/\/www.theblock.co\/linked\/87559\/irs-form-1040-crypto-taxes\" data-v-f87c67ca=\"\">agency decided<\/a> to place a question about whether or not people owned digital currency at the top of its 1040 form.<\/span>","<span data-v-f87c67ca=\"\">ZenLedger’s investors have included<\/span><span data-v-f87c67ca=\"\"> Mark Cuban’s Radical Ventures, Bloccelerate VC and Three Point Capital. April launched a <\/span><a href=\"https:\/\/www.axios.com\/2023\/04\/03\/april-ai-tax-startup-launch\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">complete version<\/span><\/a><span data-v-f87c67ca=\"\"> of its solutions earlier this year.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pat Larsen","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"TurboTax","content":"ORGANIZATION"},{"type":"Mark Cuban’s Radical Ventures","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"January 11","content":"DATE"},{"type":"IRS","content":"ORGANIZATION"},{"type":"The IRS","content":"ORGANIZATION"},{"type":"$10,000","content":"MONEY"},{"type":"Treasury Dept","content":"ORGANIZATION"},{"type":"1040","content":"DATE"},{"type":"Three Point Capital","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Ben Borodach","content":"PERSON"}],"hashtag":["IRS"],"authors":["RT Watson","The Block"]}