{"summary":"For the second time this week, an Asian crypto exchange finds itself explaining an abnormal and seemingly suspicious spike in trading volume.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266222\/gateio-trading-spike-quant-strategies","publishDate":"2023-12-06T01:58:53","id":7364,"type":null,"title":"Gate.io blames volume spike on issues with clients’ quant trading strategies","category":["EXCHANGES"],"content":["For the second time this week, an Asian crypto exchange finds itself explaining an abnormal spike in trading volume. Gate.io saw daily trading volumes swell to a high of $4 billion on the evening of Dec. 4 — many times larger than what the Asian crypto exchange fields on a typical day.","The spike has already caused a spat with the community behind a so-called “animal token” named RATS, created on the Bitcoin blockchain using the BRC-20 protocol. Yesterday, the project publicly <a href=\"https:\/\/x.com\/BTC_Rats\/status\/1731822470703763919?s=20\" data-v-f87c67ca=\"\">accused Gate of fake transactions<\/a> and called for a boycott of the exchange.","Gate, however, attributes the outlandish volume to market fluctuations, which disrupted some of its clients trading strategies. “We have confirmed that this is a result of substantial market fluctuations during that evening which caused issues with the trading strategies of some quant institution users.&nbsp;Changes in the strategies of institutional users during market volatility are common and do not impact the overall functionality of our platform,” a Gate spokesperson said.","The news comes in the same week that HashKey Exchange, a month-old exchange licensed in Hong Kong, <a href=\"https:\/\/www.theblock.co\/post\/265837\/hashkey-token-spike?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">saw daily volumes surge to $4.5 billion<\/a> — far more than normal levels on the venue. HashKey attributed the spike to its campaigns promoting trading incentives, which take the form of its HSK tokens.","There is no suggestion that the two events are linked.","Introduced by developer Casey Rodarmor in early 2023, the Ordinals protocol set the stage for the emergence of Bitcoin-based BRC-20 tokens, like RATS, and nonfungible tokens. Such assets have been a focus for Gate. The company <a href=\"https:\/\/www.theblock.co\/post\/262136\/kucoin-and-gate-exchanges-to-list-brc-20-memecoin-sats\" data-v-f87c67ca=\"\">recently listed a BRC-20 memecoin named SATS<\/a> —&nbsp;and describes itself as a leader in BRC-20 assets.","“Regarding RATS trading and the ecosystem, we want to reassure that Gate.io has consistently been devoted to providing maximum support for RATS and its community.&nbsp;As the premier trading platform for RATS, we have contributed 90% of the trading volume and currently manage 22% of the total asset volume,” Gate’s spokesperson said.","They also pointed to <a href=\"https:\/\/www.gate.io\/article\/33295?__cf_chl_tk=nqCCcZZhkSW9D7lmbS2jXKIaRH2Dv.qJ8K.aiq4xU7A-1701770381-0-gaNycGzNHDs\" data-v-f87c67ca=\"\">a proof of a reserve snapshot<\/a>, which Gate appears to have produced itself, for the BRC-20 projects trading on its platform, published Dec. 5. The report suggests reserve ratios for ORDI, SATS, RATS and other related tokens all exceed 100%.","ORDI, another Bitcoin-based BRC-20 token, <a href=\"https:\/\/www.theblock.co\/post\/266146\/bitcoin-ordinals-token-ordi-jumps-35-over-past-24-hours\" data-v-f87c67ca=\"\">shot up by 35% yesterday<\/a> — seemingly buoyed by the resurgence of bitcoin itself, which today topped $44,000.","<em data-v-f87c67ca=\"\">Gate.io volume spiked on Dec. 5. Source: BitDegree<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"$4 billion","content":"MONEY"},{"type":"Casey Rodarmor","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"evening","content":"TIME"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"22%","content":"PERCENT"},{"type":"20","content":"DATE"},{"type":"Dec. 4","content":"DATE"},{"type":"$4.5 billion","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"35%","content":"PERCENT"},{"type":"BRC","content":"ORGANIZATION"},{"type":"Dec. 5","content":"DATE"},{"type":"HSK","content":"ORGANIZATION"},{"type":"$44,000","content":"MONEY"},{"type":"HashKey Exchange","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}