{"summary":"CoinDesk to maintain editorial independence, with former WSJ Editor-in-Chief Matt Murray at the helm of its editorial committee.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263788\/ex-nyse-president-tom-farleys-bullish-buys-coindesk-in-all-cash-deal","publishDate":"2023-11-20T09:12:15","id":7365,"type":null,"title":"Ex-NYSE President Tom Farley’s Bullish buys CoinDesk in all-cash deal","category":["DEALS"],"content":["Bullish, a crypto exchange led by former New York Stock Exchange President Tom Farley, has acquired the crypto-focused media company CoinDesk in a 100% all-in cash deal, according to a statement and its own reporting.","The terms of the deal were not disclosed. However, CoinDesk’s parent company Digital Currency Group acquired the media outlet for $500,000 in 2016. CoinDesk has lines of business in media, events and indices, generating $50 million in revenue last year.","Under the new ownership, Kevin Worth, the current CEO of CoinDesk, will continue leading the team, with CoinDesk operating as a subsidiary within Bullish. An editorial committee chaired by Matt Murray, the former Editor-in-Chief of The Wall Street Journal, will also be established to ensure editorial independence.","“Bullish will immediately inject capital into several of CoinDesk’s most exciting growth initiatives which will power the launch of new services, events and products. We also want to express our unwavering support for CoinDesk’s commitment to journalistic independence,\" said Bullish CEO Tom Farley.","Bullish was launched in November 2021 by Block.one as an independent entity under the Block.one parent company. Block.one has been historically tied closely to the EOS cryptocurrency project and raised $4 billion for it in a token sale. Yet more recently, the EOS community has tried to part ways with it, <a href=\"https:\/\/www.theblock.co\/post\/243852\/eos-network-foundation-calls-on-community-to-reject-block-ones-22-million-settlement\" data-v-f87c67ca=\"\">claiming that the funds raised<\/a> weren't used for the development of the EOS project.","Block.one also <a href=\"https:\/\/www.theblock.co\/post\/59702\/block-one-invests-150m-in-its-social-media-app-voice-to-fund-independent-operations\" data-v-f87c67ca=\"\">invested $150 million<\/a> into a project called Voice. It was initially supposed to be a social media app before it pivoted to NFTs. It wound down after two years.","Backed by high-profile investors, including Peter Thiel’s Founders Fund, Bullish is a regulated crypto exchange, enabling users to buy, sell, and trade digital assets like bitcoin and ether. It currently uses a private version of the EOS blockchain and posts hashes of its data to the public EOS blockchain.","Bullish is also <a href=\"https:\/\/www.theblock.co\/post\/250492\/crypto-exchange-bullish-among-bidders-for-bankrupt-ftx\" data-v-f87c67ca=\"\">among the bidders<\/a> for the bankrupt FTX crypto exchange.","At the end of July, The Wall Street Journal <a href=\"https:\/\/www.wsj.com\/articles\/investor-group-nears-125-million-deal-for-coindesk-146a6faa\" data-v-f87c67ca=\"\">reported<\/a> that CoinDesk was nearing a <a href=\"https:\/\/www.theblock.co\/post\/244665\/coindesk-lays-off-45-of-editorial-staff-as-it-eyes-deal-to-sell-company\" data-v-f87c67ca=\"\">$125 million deal<\/a> with a syndicate led by crypto investor Matthew Roszak of Tally Capital, which subsequently fell through.","CoinDesk <a href=\"https:\/\/www.theblock.co\/post\/244665\/coindesk-lays-off-45-of-editorial-staff-as-it-eyes-deal-to-sell-company\" data-v-f87c67ca=\"\">laid off 45%<\/a> of its editorial staff in August as it continued to eye a deal to sell the company.","Neither Bullish nor CoinDesk immediately responded to a request for comment from The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"EOS","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"Peter Thiel","content":"PERSON"},{"type":"Tom Farley","content":"PERSON"},{"type":"$4 billion","content":"MONEY"},{"type":"Voice","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"45%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"Matthew Roszak","content":"PERSON"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Matt Murray","content":"PERSON"},{"type":"$500,000","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"$125 million","content":"MONEY"},{"type":"Kevin Worth","content":"PERSON"},{"type":"November 2021","content":"DATE"},{"type":"$150 million","content":"MONEY"},{"type":"$50 million","content":"MONEY"},{"type":"Tally Capital","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["James Hunt","The Block"]}