{"summary":"CNHC Group, the issuer of the CNHC stablecoin that is pegged to the offshore Chinese yuan, raised $10 million in funding.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219979\/stablecoin-issuer-cnhc-raises-10-million-kucoin-ventures","publishDate":"2023-03-15T06:00:28","id":7367,"type":null,"title":"Stablecoin issuer CNHC raises $10 million in funding led by KuCoin Ventures","category":["DEALS"],"content":["CNHC Group, the issuer of the CNHC stablecoin that is pegged 1:1 to the offshore Chinese yuan, raised $10 million in funding.","KuCoin Ventures led the deal, the crypto investment firm said Wednesday. Other investors included Circle Ventures and IDG Capital.","This was a Series A+ equity funding round, CNHC co-founder Joy Cham told The Block. CNHC began raising the round last March and closed it in August, Cham said, adding that the company has previously raised \"tens of millions dollars in the time span of last two years,\" without disclosing an amount.","The CNHC stablecoin was launched in 2021 for use cases including money transfers and cross-border trade settlements. It is currently issued on the Ethereum and Conflux blockchains, and its total supply is around 15 million tokens (worth roughly $2 million), according to Cham. <a href=\"https:\/\/tether.to\/en\/transparency\/\" data-v-f87c67ca=\"\">Tether's CNHT's<\/a> current total supply is about 20 million tokens.","With the fresh funding, CNHC aims to grow the adoption of its stablecoin, especially in the Asia Pacific region. To that end, the company is moving its headquarters to Hong Kong from the Cayman Islands, Cham said.","Hong Kong recently <a href=\"https:\/\/www.theblock.co\/post\/213218\/hong-kong-lift-ban-retail-crypto-trading\" data-v-f87c67ca=\"\">announced<\/a> its ambition to become a crypto hub by unveiling a plan to lift a ban on retail crypto trading. Last month, Hong Kong's financial secretary Paul Chan <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-02-22\/hong-kong-to-establish-task-force-to-help-develop-crypto-hub\" data-v-f87c67ca=\"\">reportedly said<\/a> he will establish and lead a task force on \"virtual-asset development, with members from relevant policy bureaux, financial regulators and market participants, to provide recommendations on the sustainable and responsible development of the sector.\"","Cham said CNHC wants to become \"part of the foundation and infrastructure in Hong Kong web3 ecosystem\" and will look to list the stablecoin on more centralized and decentralized exchanges and expand its on- and off-ramp services.","To that end, CNHC also plans to increase its team of around 60 people by hiring across functions, including operations, compliance and business development, said Cham.","Along with its investment in CNHC, <a href=\"https:\/\/www.theblock.co\/linked\/146001\/crypto-exchange-kucoin-reaches-decacorn-status-in-latest-funding-round\" data-v-f87c67ca=\"\">KuCoin<\/a> Ventures today also disclosed its $10 million investment in Conflux made early last year. Conflux, a Layer 1 blockchain developer, recently <a href=\"https:\/\/www.theblock.co\/post\/215934\/conflux-raises-10-million-dwf-labs-token-round\" data-v-f87c67ca=\"\">raised<\/a> $10 million from DWF Labs.","Last week, New York State Attorney General Letitia James <a href=\"https:\/\/www.theblock.co\/post\/218600\/new-york-sues-kucoin-claims-ether-is-an-unregistered-security\" data-v-f87c67ca=\"\">sued<\/a> the KuCoin crypto exchange, saying it is an unregistered commodities and securities broker or dealer in the state.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cayman Islands","content":"LOCATION"},{"type":"Paul Chan","content":"PERSON"},{"type":"Letitia James","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Cham","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"CNHC Group","content":"ORGANIZATION"},{"type":"KuCoin<\/a> Ventures","content":"ORGANIZATION"},{"type":"Circle Ventures","content":"ORGANIZATION"},{"type":"last two years","content":"DATE"},{"type":"New York State","content":"ORGANIZATION"},{"type":"IDG Capital","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"millions dollars","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Asia Pacific","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$10 million","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":["SERIES A"],"authors":["Yogita Khatri","The Block"]}