{"summary":"The former OpenSea product manager accused of front-running is making three new moves in his defense against wire fraud charges.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174566\/opensea-employee-accused-of-fraud-wants-to-subpoena-the-nft-marketplace","publishDate":"2022-10-03T18:23:30","id":7368,"type":null,"title":"OpenSea employee accused of fraud wants to subpoena the NFT marketplace","category":["LEGAL"],"content":["Nathaniel Chastain, the former OpenSea product manager accused of fraud through front-running the posting of different non-fungible tokens to prominent positions in the marketplace, is making three new moves in his defense, according to recent court filings.","Chastain wants to subpoena OpenSea, his former employer, and claims the Federal Bureau of Investigation violated his fourth and fifth amendment rights in their search of Chastain’s home, and is trying to strike the term \"insider trading\" from the case.","<strong data-v-f87c67ca=\"\">A subpoena for OpenSea<\/strong>","Chastain wants the court to subpoena OpenSea for documents on whether the information Chastain allegedly used to turn a profit is considered \"property\" of OpenSea. The wire fraud charge contends that Chastain defrauded his employer when he allegedly used the private information of which NFTs would be listed on the homepage.","The subpoena Chastain wants would include documents into whether OpenSea executives were aware of Chastain's alleged activities. Chastain's defense team hopes to receive&nbsp;Slack messages between Chastain and other employees, documents or communications mentioning OpenSea's employee and confidentiality policies, documents or communications the company shared with the government, and any documents or communications in which OpenSea CEO Devin Finzer and co-founder Alex Atallah referenced Chastain.&nbsp;","<strong data-v-f87c67ca=\"\">The right terms<\/strong>","The Justice Department <a href=\"https:\/\/www.theblock.co\/linked\/149685\/former-head-of-product-for-opensea-indicted-after-insider-trading-scandal\" data-v-f87c67ca=\"\">charged Chastain<\/a> with wire fraud in June of this year, alleging Chastain traded NFTs he knew would be listed on OpenSea's home page, driving up the price and turning a profit based on private information. But because insider trading is a violation directly related to securities and commodities, and NFTs are not currently classified as such, the DOJ did not technically pursue insider trading charges, though it argues that Chastain's actions were effectively insider trading and uses that language filings.","In a Sept. 30 filing, Chastain asked to strike the term \"insider trading\" from the indictment against him, calling usage of the term, \"inflammatory, unduly prejudicial, and irrelevant to the crimes charged,” on the grounds that it isn’t the charge against him.","Chastain has asked the court to prohibit prosecutors from continuing to use the term and barring it from employing the language at trial.","\"The term’s presence in the Indictment—and any reference to it at a trial—serves no legitimate prosecutorial purpose and is simply a means for the government to increase media attention and inflame the jury in this first-of-its-kind case in the digital asset space,\" Chastain’s filing reads.","<strong data-v-f87c67ca=\"\">Searched and seized<\/strong>","Chastain hopes to throw out any evidence seized by the FBI in a search of his home, arguing that authorities violated his Fourth Amendment right against unreasonable search and seizure and Fifth Amendment right against self-incrimination.","He claims that when the FBI executed a search warrant at his home in September of 2021, agents seized some of his electronic devices. During that time, Chastain claims FBI agents questioned him and asked for the password to his cellphone – an incident his lawyer now calls an \"illegal interrogation.\" He also argues that the FBI misrepresented whether it had authority to access his cell phone and failed to inform him of his rights. For that reason, he's requesting any statements he made during the event and any evidence collected from his cell phone be suppressed, which would effectively exclude that evidence from the case.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sept. 30","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Chastain","content":"PERSON"},{"type":"Devin Finzer","content":"PERSON"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Alex Atallah","content":"PERSON"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"September of 2021","content":"DATE"},{"type":"Nathaniel Chastain","content":"PERSON"},{"type":"FBI","content":"ORGANIZATION"},{"type":"Federal Bureau of Investigation","content":"ORGANIZATION"}],"hashtag":["OPENSEA"],"authors":["Aislinn Keely","The Block"]}