{"summary":"Binance, Sam Bankman-Fried, Gary Gensler and CBDCs were all brought up during Wednesday evening&#x27;s Republican presidential debate. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266601\/republican-presidential-debate-sees-candidates-discuss-sbf-binance-cbdcs-and-gary-gensler","publishDate":"2023-12-07T12:59:09","id":7374,"type":null,"title":"Republican presidential debate sees candidates discuss SBF, Binance, CBDCs and Gary Gensler","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The world's largest crypto exchange Binance, former FTX CEO Sam Bankman-Fried, Securities and Exchange Commission Chair Gary Gensler and central bank digital currencies were all brought up during Wednesday evening's Republican presidential debate.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Republican presidential candidate Vivek Ramaswamy, who unveiled his own crypto <a href=\"https:\/\/www.youtube.com\/watch?v=yAVWyTmgc5E\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">plan<\/span><\/a> in front of the Texas Blockchain Council last month, was asked about his thoughts on recent developments.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The head of the largest international crypto exchange just pleaded guilty to allowing his platform to launder money for terrorists, including Hamas,\" the moderator asked. \"You say your cryptocurrency plan will quote, ensure economic freedom for Americans, end quote. Won't it also ensure economic freedom for fraudsters, criminals and terrorists?\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Ramaswamy responded by saying that bad actors have been defrauding people for a long time.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Our regulations need to catch up with the current moment,\" Ramaswamy said. \"The fact that SBF was able to do what he did at FTX shows that whatever they have in the current framework isn't working.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Ramaswamy's comments come weeks after former <\/span>Binance CEO Changpeng Zhao pleaded guilty to anti-money laundering and sanctions violations and months after former FTX CEO Sam Bankman-Fried was found guilty of criminal charges after a jury ruled he defrauded investors.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">Crypto has been brought up a few times by presidential candidates over the past year. Ramaswamy said last month that his plan in part would block regulation of self-hosted wallets and allows for the \"freedom to innovate without regulatory overreach.\" Meanwhile, Republican presidential candidate Ron DeSantis, in his capacity as the governor of Florida, blocked the use of CBDCs in his state in May.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Ramaswamy criticized Gensler during the debate. The SEC chair has been consistent in his stance that many cryptocurrencies are securities and need to follow securities laws, while urging crypto exchanges to register with his agency.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Gensler has also been grilled by lawmakers about whether ether specifically should be considered a security. House Financial Services Committee Chair Patrick McHenry tried a few times during a House Financial Services Committee to get details from Gensler. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Ramaswamy criticized the back and forth during Wednesday's debate.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I think it's nothing short of embarrassing that Gary Gensler, the current leader of the SEC, in front of Congress could not even say whether Ethereum counted as a regulated security or not,\" Ramaswamy said. \"This is just another example of the administrative state gone too far.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">DeSantis brought up CBDCs on Wednesday, arguing that President Joe Biden wants to take away people's privacy.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"They will absolutely regulate your purchases,\" DeSantis said. \"On day one as president, we take the idea of a central bank digital currency and we throw it in the trash can. It will be dead on arrival.\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ramaswamy","content":"PERSON"},{"type":"Ron DeSantis","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"House Financial Services Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Texas Blockchain Council","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"last month","content":"DATE"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"SBF","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Vivek Ramaswamy","content":"PERSON"},{"type":"Florida","content":"LOCATION"},{"type":"DeSantis","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"evening","content":"TIME"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Hamas","content":"ORGANIZATION"}],"hashtag":["SENATE AGRICULTURE COMMITTEE","SENATE BANKING COMMITTEE","SENATE FINANCE COMMITTEE"],"authors":["Sarah Wynn","The Block"]}