{"summary":"Layer 1 blockchain operator ZetaChain raised $27 million in a round featuring several crypto and trading heavyweights.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/245597\/zetachain-a-new-layer-1-focused-on-interoperability-raises-27-million","publishDate":"2023-08-16T09:04:05","id":7379,"type":null,"title":"ZetaChain, a new Layer 1 focused on interoperability, raises $27 million","category":["DEALS"],"content":["Layer 1 blockchain operator ZetaChain raised $27 million in a round featuring several crypto and trading heavyweights.","Investors in the round include Blockchain.com, Human Capital, VY Capital, Sky9 Capital, Jane Street Capital, VistaLabs, CMT Digital, Foundation Capital, Lingfeng Capital, GSR, Kudasai and Krust, according to an announcement today. This is the first raise for the business. No valuation was disclosed.","Founded in 2021, ZetaChain, which will soon stage its mainnet launch, aims to unite multiple blockchains — including Ethereum, Polygon, BSC and even non-smart contract chains like Bitcoin and Dogecoin —&nbsp;on a single platform.","In today’s announcement, the company said it aims to establish “a new standard for blockchain interoperability,” giving users the means to manage all their assets and data more easily. &nbsp;","“ZetaChain’s purpose is to simplify managing assets and data across multiple blockchains, which remains a complicated and fragmented process that’s hindering hundreds of millions of new users joining the web3 ecosystem,” said Ankur Nandwani, a ZetaChain core contributor. “Our EVM-compatible cross-chain smart contracts alleviate these issues by allowing decentralized app developers to build services that are faster, more secure, and easy to use.”","The project currently has more than 27,000 decentralized app contracts deployed on its network, spanning Defi, NFT, social, identity and gaming protocols. More than 1.7 million users participated in ZetaChain’s testnet, according to today’s announcement.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$27 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"GSR","content":"ORGANIZATION"},{"type":"CMT Digital","content":"ORGANIZATION"},{"type":"Kudasai","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Foundation Capital","content":"ORGANIZATION"},{"type":"Ankur Nandwani","content":"PERSON"},{"type":"Krust","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}