{"summary":"Ledger plans to roll out its private-key recovery service before year&#x27;s end after a first look at the product got a frosty reception in May.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251954\/ledger-ceo-privacy-on-demand","publishDate":"2023-09-20T05:09:51","id":7381,"type":null,"title":"Ledger CEO says Recover service expected to go live by end of year","category":["PEOPLE"],"content":["Serving cypherpunks can be a thankless task. Ledger’s CEO Pascal Gauthier, a flash Frenchman with more rings than fingers, got a stark reminder of that earlier this year. &nbsp;","The Paris-based hardware wallet maker <a href=\"https:\/\/www.theblock.co\/post\/230992\/ledger-defends-crypto-wallet-recovery-tool\" data-v-f87c67ca=\"\">drew a sharp backlash<\/a> in May over a service it hopes will help users recover their private keys by splitting seed phrases into three shards shared between Ledger and two other security companies, CoinCover and EscrowTech.","But for Ledger’s customers, many of whom fancy themselves self-sovereign, the product set off alarm bells. A significant concern was whether private keys could be reassembled and served up in the event of a government subpoena.","In damage control mode, Ledger delayed the initial launch date. Its CTO Charles Guillemet <a href=\"https:\/\/www.theblock.co\/post\/231350\/ledger-cto-on-recover-softwares-access-to-private-keys-the-tradeoff-i-think-is-acceptable\" data-v-f87c67ca=\"\">said at the time that the perceived security trade-off of the product was acceptable,<\/a>&nbsp;while Gauthier&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/231794\/ledger-ceo-concedes-subpoena-to-access-user-funds-is-the-only-concern\" data-v-f87c67ca=\"\">said<\/a> that government subpoenas are not a prospect that should trouble the average user. The company also stressed that the recovery service would be entirely optional, adding that it would accelerate plans to <a href=\"https:\/\/www.theblock.co\/post\/231857\/ledger-plans-to-accelerate-open-source-work-in-wake-of-recover-backlash\" data-v-f87c67ca=\"\">open source its product roadmap, as well as the Ledger Recover protocol<\/a>.","Were the cypherpunks satisfied?","“I’ve been booed at Bitcoin Miami,” Gauthier said in an interview with The Block last week. “It was the day after the Ledger Recover thing, and I was sure that he was booing me for this.” In fact, the audience member in question — a long-time Ledger customer — was angry about Ledger not offering a Bitcoin-only wallet. This entirely separate issue, Gauthier said, has irked some users since 2017.","“In six years, you will have the guy who’s going to boo me in a conference because of Ledger Recover. It’s ok. It’s part of our life when we do crypto,” he added. “To be honest, I’ve got thick skin.”","Despite the drama, Gauthier said he still expects Ledger Recover to go live before the end of the year —&nbsp;with some of the open-source features disgruntled users called for. The code behind the product can already be reviewed <a href=\"https:\/\/github.com\/LedgerHQ\/recover-whitepaper\/tree\/main\" data-v-f87c67ca=\"\">on Ledger’s GitHub page<\/a>.","The popularity of self-custody — which refers to people storing their own crypto rather than delegating storage to a third party, such as an exchange — has grown considerably after the sector’s annus horribilis in 2022, which saw multiple marquee startups in the space collapse into bankruptcy, tying up the funds of millions of users. Sam Bankman-Fried’s failed exchange, FTX, alone, <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-01-11\/ftx-advisers-have-found-5-billion-of-cash-or-sellable-crypto\" data-v-f87c67ca=\"\">had more than nine million customer accounts<\/a>.","In March, analytics provider Santiment said that the percentage of ether held on crypto exchanges <a href=\"https:\/\/x.com\/santimentfeed\/status\/1640454653900124166?s=20\" data-v-f87c67ca=\"\">had effectively hit an all-time low of 10.31%<\/a>, suggesting a surge in self-custody.","Yet, despite its appeal, self-custody is a tricky business. Stories abound of <a href=\"https:\/\/decrypt.co\/154522\/youtuber-loses-60k-worth-crypto-after-showing-seed-phrase-stream\" data-v-f87c67ca=\"\">crypto holders losing or mismanaging their seed phrases<\/a>, often with disastrous consequences. For Gauthier, the model is simply too much trouble for the vast majority of users.","“The 24 words is the big pain of self-custody. Self-custody will never scale if the next 100 million users that go into self-custody have to save their 24 words somewhere,” he said. “So we need to have mechanisms à la Ledger Recover to do it. Otherwise, it just doesn’t scale.”","The challenge for Ledger is that, while on the one hand, its hardware is relied on by what Gauthier calls “super-geeks,” it is simultaneously a fast-growing consumer business that had <a href=\"https:\/\/techcrunch.com\/\" data-v-f87c67ca=\"\">sold more than 6 million devices as of March this year<\/a>. Venture capitalists have poured over half a billion dollars into the startup since it launched in 2014, including a $108 million top-up in March — cash that comes with certain growth expectations.","“Most people say, ‘Well, I would never trust myself with those 24 words.’ It’s as simple as that,” Gauthier said. “If you give them a solution that is acceptable to 99.9% of populations living in countries like Europe, U.S., etc., then we think it’s a great product and it’s very needed in the market.”","He continued: “I’ll use it personally. So, if anyone has a doubt, I will be the first user of that product because I think it’s a better way to store my 24 words.”","Ledger Recover isn’t the only thorny privacy issue with which Gauthier must contend.","At a time when privacy coins —&nbsp;which grant crypto users more anonymity than, say, bitcoin —&nbsp;<a href=\"https:\/\/cointelegraph.com\/news\/binance-to-delist-privacy-tokens-in-france-italy-spain-and-poland\" data-v-f87c67ca=\"\">are being removed from major exchanges in Europe<\/a>, Ledger remains committed to supporting them.","CoinDesk <a href=\"https:\/\/www.theblock.co\/post\/187078\/european-aml-rules-could-ban-privacy-coins-coindesk\" data-v-f87c67ca=\"\">reported last year<\/a> that the European Union was considering a ban preventing banks and licensed crypto firms from dealing in privacy coins. When Binance <a href=\"https:\/\/www.theblock.co\/post\/249473\/binance-privacy-coins-belgium\" data-v-f87c67ca=\"\">halted the trading of privacy coins in Belgium a few weeks ago<\/a>, it said in a statement that it is “required to follow local laws and regulations regarding the trading of privacy coins.”","Yet, Ledger users can store Monero, a popular privacy coin with a market capitalization of $2.7 billion, on their devices. Gauthier said Ledger lobbied hard to ensure that the Markets in Crypto-Assets Regulation (MiCA) rules, which came into effect this year, wouldn’t capture self-custody — and succeeded. “Self-custody is outside of regulation, and self-custody is a fundamental human right,” he said. &nbsp;","Privacy coins are controversial. Some see them as freedom-preserving, others as an ideal tool for obscuring illicit transactions. “You can feel that there is a lot of pressure on privacy,” Gauthier said. “Our business is to secure our users and give them the ability to be free and do whatever they want, and so there are certain situations where a user will want to remain absolutely private.”","As with the recovery service, optionality is at the heart of Ledger’s privacy plans. The firm is wrestling with how to support both entirely private transactions and the means to provide identifying information where needed —&nbsp;Gauthier gave the example of using a bitcoin or ether-based product offered by a bank — without one compromising the other. The crux of the issue, as Gauthier put it, is that “if you have an ETH address, I know everything you own.”","Identity and privacy are, therefore, two standout themes on Ledger’s roadmap for 2024 and 2025. One initiative that’s already live is named “Freedom Tools,” which gives users a way to run Ledger and Ledger Live, its crypto wallet app, with total privacy.","“We’re going to try and build as much as privacy as possible when you want it, if you want it, as well as security,” Gauthier said. “We feel it’s important because we don’t all live in democracies. Sometimes, you have a need for absolute privacy for very valid reasons.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"a billion dollars","content":"MONEY"},{"type":"2014","content":"DATE"},{"type":"Charles Guillemet","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Paris","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"Pascal Gauthier","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"EscrowTech","content":"ORGANIZATION"},{"type":"Monero","content":"PERSON"},{"type":"Gauthier","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Belgium","content":"LOCATION"},{"type":"Crypto","content":"LOCATION"},{"type":"2025","content":"DATE"},{"type":"$108 million","content":"MONEY"},{"type":"European Union","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Santiment","content":"PERSON"},{"type":"Bitcoin Miami","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$2.7 billion","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"99.9%","content":"PERCENT"},{"type":"10.31%","content":"PERCENT"},{"type":"March this year","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["HARDWARE","WALLET MAKERS"],"authors":["Ryan Weeks","The Block"]}