{"summary":"Paradex will leverage Paradigm’s network to bolster derivatives liquidity at its inception, making use of the software stack from Ethereum Layer 2 project Starknet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240941\/liquidity-network-paradigm-incubates-new-appchain-paradex-on-starknet","publishDate":"2023-07-21T11:14:07","id":7384,"type":null,"title":"Liquidity network Paradigm incubates new appchain &#x27;Paradex&#x27; on Starknet","category":["CRYPTO ECOSYSTEMS"],"content":["Paradigm, an institutional liquidity platform for cryptocurrency not to be confused with the venture capital firm of the same name, has incubated a decentralized perpetual derivatives Layer 2 appchain named “Paradex.”&nbsp;","Described as a hybrid derivatives exchange, the project will integrate liquidity from Paradigm with the transparency and self-custody typical of DeFi. It will operate as its own chain based on Starknet’s developer stack and is the result of a collaboration between Starnet contributor StarkWare and Paradigm that lasted six months, according to a statement.&nbsp;","Paradigm operates as a liquidity network for crypto derivatives traders, catering to both the centralized finance and decentralized finance sectors. With the debut of Paradex, Paradigm aims to broaden its presence in the Layer 2 domain.","“As we began evaluating blockchain scaling technologies that would enable Paradex’s ambitious vision, it became clear that we needed a solution that would not only deliver scalability, but also control and customization,” said Nafaa Hendaoui, head of product at Paradex.&nbsp;","Earlier this week, Starknet <a href=\"https:\/\/www.theblock.co\/post\/240480\/starknet-appchains-framework\" data-v-f87c67ca=\"\">introduced<\/a> an appchains framework, facilitating the creation of multiple application-specific blockchains within its ecosystem.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Starnet","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Paradex","content":"LOCATION"},{"type":"Nafaa Hendaoui","content":"PERSON"}],"hashtag":["STARKNET"],"authors":["Vishal Chawla","The Block"]}