{"summary":"Zcash founder Zooko Wilcox sets forth his case that privacy coin Zcash should switch over to proof of stake.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113393\/zooko-wilcox-advocates-that-zcash-should-move-to-proof-of-stake","publishDate":"2021-08-03T11:47:35","id":7389,"type":null,"title":"Zooko Wilcox advocates that Zcash should move to proof of stake","category":["CRYPTOCURRENCY"],"content":["Electric Coin Company CEO and Zcash founder Zooko Wilcox proposed in a <a href=\"https:\/\/electriccoin.co\/blog\/should-zcash-switch-from-proof-of-work-to-proof-of-stake\/\" data-v-f87c67ca=\"\">blog post<\/a> today that the privacy coin Zcash should ditch its proof-of-work (PoW) blockchain and move to proof of stake (PoS).","\"While there are many who prefer PoW, I believe that PoS would make ZEC more valuable to more people! The benefits are great, and they far outweigh the drawbacks and risks,\" he said in the post.","Proof of work is a method that requires miners to use intensive calculations to solve tricky math problems. It works on the basis that the energy consumed by the network helps to keep it secure — since an attacker would need to expend a similar or greater amount of work to attack it.","Instead, proof of stake requires validators (the equivalent of miners) to put up collateral and take turns adding blocks to the blockchain. If they act maliciously, they can lose their staked funds. It has been a hot topic recently since it has a lower impact on the environment.","Wilcox noted that it's down to the Zcash community if it wants to make such this change, but he put forward his reasons why it should happen.","Wilcox presented a range of arguments for his thinking. First, he claimed that doing so would reduce selling pressure since miners would no longer need to sell newly miner coins to pay for costs of production (electricity and hardware costs, for example). The idea here being that stakers would instead be able to hold onto their coins for longer, rather than selling them.","Second, he said it would be good for the acceptance of Zcash if it was more energy efficient. While he disagreed that proof-of-work mining is amplifying global warming and helping to destroy the world, he acknowledged that public perception is more important for wider adoption.","Third, Wilcox said proof of stake providers greater security at a lower cost, claiming that proof-of-work systems overpay for network security. \"In PoS, the community can get better security — including economic finality in which you can be sure that a payment you’ve received won’t be forked away — and performance at much lower cost,\" he said.","Beyond those reasons, he also suggested it would be more decentralized and increase demand for ZEC, its native coin. Plus staking would let anyone take part, which would hark back to Zcash's early days when many community members were mining it on their computer GPUs.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zcash","content":"ORGANIZATION"},{"type":"Zooko Wilcox","content":"PERSON"},{"type":"Wilcox","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Electric Coin Company CEO","content":"ORGANIZATION"},{"type":"ZEC","content":"ORGANIZATION"}],"hashtag":["BITCOIN","ETHEREUM","MINING"],"authors":["Tim Copeland","The Block"]}