{"summary":"The conflict displaced the entire local crypto industry. Some firms have left, while others have relocated within Ukraine. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/146928\/dispersed-and-displaced-ukraines-crypto-industry-adapts-to-war","publishDate":"2022-05-15T11:22:39","id":7392,"type":null,"title":"Dispersed and displaced, Ukraine’s crypto industry adapts to war","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">At the outset of the Russian invasion, Ukraine’s use of crypto donations to fund its war effort drew mass attention from the global crypto industry.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">At the same time, the conflict displaced the entire local crypto industry. Some firms have left, while others have relocated within Ukraine.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Now, many are returning to work, with varying success. And the nation, which recently passed a law aimed at cultivating the local crypto industry, is hoping crypto entrepreneurs will help it recover once peace is restored.<\/span>","<span data-v-f87c67ca=\"\">“Nothing can happen as long as the war hasn’t ended,” says Mikhail Chobanian, CEO of Ukrainian exchange Kuna.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ukraine’s native ecosystem of crypto firms is already remarkably well developed. Besides exchanges like Kuna, major local crypto projects include NFT URL provider Unstoppable Domains, cross-chain platform Allbridge, decentralized staking service Everstake and the Near protocol.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Chobanian fled Kyiv at the start of the war. Using the exchange, he set up the wallet that the Ukrainian government took on for its fundraising. His account of doing so while a refugee <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/138238\/what-you-need-to-know-about-todays-senate-hearing-on-russias-illicit-crypto-use\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">captivated the Senate Banking Committee<\/span><\/a><span data-v-f87c67ca=\"\"> as it weighed crypto’s role in sanctions evasion in March.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Chobanian has since left Ukraine, he told The Block. In fact, the firm had already begun evacuating much of its staff back in January. The crypto industry lends itself to mobility, which means that much of that ecosystem has, like KUNA, relocated, both internationally and abroad.<\/span>","<span data-v-f87c67ca=\"\">Alexander Momot, a Kyivian, is the founder of <\/span><span data-v-f87c67ca=\"\">Remme, a public key protocol, and Peanut, a decentralized exchange servicer. Momot told The Block that in the month before the invasion many of the firm’s executives left for the US and UK, while they moved the rest of the team to Lviv in Ukraine’s West.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Currently we are not suffering from the economic situation because crypto, even for Ukrainian teams, is not affected by sanctions, and Russia’s part in the global economy is so small, including the crypto economy. So we can’t see any impact on our activities so far,” Momot said. “We have a special policy to avoid any decrease in salaries.”<\/span>","<span data-v-f87c67ca=\"\">Those firms are part of a mass migration. The UN <\/span><a href=\"https:\/\/data2.unhcr.org\/en\/situations\/ukraine\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">estimates<\/span><\/a><span data-v-f87c67ca=\"\"> that over 6 million people have left Ukraine since the end of February. <\/span><span data-v-f87c67ca=\"\">The World Bank recently <\/span><a href=\"https:\/\/www.worldbank.org\/en\/news\/press-release\/2022\/04\/10\/russian-invasion-to-shrink-ukraine-economy-by-45-percent-this-year\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">calculated<\/span><\/a><span data-v-f87c67ca=\"\"> that the Russian invasion would cut Ukraine’s economy by 45% over the course of 2022.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While the country’s economy has long suffered from stagnation — as well as long-term population decline — its workforce is highly educated. It produces many of the best programmers and tech workers, locally termed “ITshniki,” in the world.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ukraine’s IT service exports <\/span><a href=\"https:\/\/reports.itukraine.org.ua\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">grew<\/span><\/a><span data-v-f87c67ca=\"\"> by 20% in 2020 and 36% in 2021, making it one of the most dynamic areas of the economy.<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, the nation’s Ministry of Digital Transformation has been outwardly supportive of the local crypto industry, and has <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/140277\/inside-ukraines-digital-ministry-and-crypto-efforts-during-wartime\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">expressed high hopes<\/span><\/a><span data-v-f87c67ca=\"\"> that it will be able to lead the country’s economic recovery, especially if peacetime comes sooner rather than later.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The commitment of the Ukrainian government to crypto is very strong,” Alexander Bornyakov, deputy minister of digital transformation, told The Block. “Of course we realize the potential of crypto because this is the industry that has shown five-times growth for the past couple of years, and there’s no other industry that has been growing so fast.”<\/span>","<span data-v-f87c67ca=\"\">Even prior to the invasion, however, many Ukrainians in crypto chose to leave the country to set up shop. Those include leaders of crypto lender Celsius, mining operator Bitfury, and Estonia-based WhiteBIT, which bills itself as Europe’s largest crypto exchange.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Andrey Shevchenko, co-founder and CEO of decentralized exchange developer Zircon Finance, is one Ukrainian living abroad. Born and raised in Donetsk, which became a warzone back in 2014, Shevchenko’s family moved to Italy in 2005, when the country was deeply impoverished.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I was definitely impressed by how vibrant Kiev had become”, Shevchenko recently wrote to The Block, describing the country pre-war.&nbsp; “It has an energy that no place in Italy has. At the same time it still has many issues in terms of infrastructure, bureaucracy and mentality that were part of the reason we left. There are things you can’t buy no matter how much money you have personally — straight roads, for one.”<\/span>","<span data-v-f87c67ca=\"\">In the same way that crypto’s mobility has allowed many to flee Ukraine, it also means the crypto industry can potentially set up shop again quickly. For Ukraine, this is part of the ambition behind the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/138074\/ukraine-president-zelensky-signs-crypto-regulation-law\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">crypto law that President Zelensky signed<\/span><\/a><span data-v-f87c67ca=\"\"> in March: to attract talent as soon as possible after war ends.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">And it seems possible.<\/span>","<span data-v-f87c67ca=\"\">“Reestablishing the rule of law and combining it with an open regulatory sandbox could do wonders for attracting crypto startups, especially those from Russia,” said Shevchenko. “The combination of those things would definitely make us consider at least partially relocating there, if nothing else for the raw IT talent in the country.”<\/span>","<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\">Ultimately, however, all is contingent upon peace, which remains <\/span><a href=\"https:\/\/www.rbc.ru\/politics\/06\/05\/2022\/62751e3f9a794784f97ad95a?from=from_main_3\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">elusive<\/span><\/a><span data-v-f87c67ca=\"\">. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Everstake","content":"PERSON"},{"type":"Kuna","content":"LOCATION"},{"type":"20%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"Remme","content":"PERSON"},{"type":"Momot","content":"PERSON"},{"type":"’s Ministry of Digital Transformation","content":"ORGANIZATION"},{"type":"Kuna","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Alexander Bornyakov","content":"PERSON"},{"type":"Mikhail Chobanian","content":"PERSON"},{"type":"Russia","content":"LOCATION"},{"type":"Estonia","content":"LOCATION"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Italy","content":"LOCATION"},{"type":"Andrey Shevchenko","content":"PERSON"},{"type":"Donetsk","content":"LOCATION"},{"type":"2005","content":"DATE"},{"type":"Lviv","content":"LOCATION"},{"type":"Shevchenko","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"45%","content":"PERCENT"},{"type":"Zelensky","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Ukraine’s West","content":"LOCATION"},{"type":"36%","content":"PERCENT"},{"type":"Alexander Momot","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Zircon Finance","content":"ORGANIZATION"},{"type":"Kiev","content":"LOCATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":[],"authors":["Kollen Post","The Block"]}