{"summary":"Hive Blockchain reported mining 278.5 bitcoin and 2,542 ethereum in June.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156367\/hive-blockchain-reports-278-5-btc-mined-in-june","publishDate":"2022-07-07T13:16:14","id":7394,"type":null,"title":"Hive Blockchain reports 278.5 BTC mined in June","category":["MINING"],"content":["Crypto mining firm Hive Blockchain produced 278.5 BTC and 2,542 ETH in June.","The company currently holds&nbsp; 3,239 bitcoin and 7,667 ether, according to a statement on Thursday.","Hive increased its bitcoin mining hash rate from 2.17 exahash per second (EH\/s) to 2.24 EH\/s.&nbsp;Ethereum mining capacity went from 6.26 (TH\/s) at the beginning of the month to 6.0 TH\/s, as some miners were taken offline temporarily for layout optimization due to higher summer temperatures, per the statement.","Hive CEO Frank Holmes said that has been able to manage the market volatility recently, as it has weathered \"crypto winters\" before. Per Holmes, the company has strived to \"maintain a strong balance sheet of Bitcoin and Ethereum which is completely unlevered.\"","The CEO also said that the business remains cash flow positive and has no \"significant debt,\" aside from a long-term real estate mortgage from Canadian bank with less than 4% interest.","\"We are cautious, seeking out opportunities and remain firm in our belief that Bitcoin and Ethereum will survive to thrive again after all the over-leveraged players are forced out of business,\" Holmes said.","The company plans to fund its expansion going forward by selling the current production of bitcoin and ether while \"striving to maintain\" bitcoin inventory levels.","\"We are able to undertake this strategy and maintain coin inventory levels as a result of keeping a strong balance sheet position and never having entered into any agreements whereby our coin holdings have been staked, put up as collateral, or otherwise put at risk of being called by another party to cover a position due to the current decline in the price of crypto currency,\" said Hive CFO Darcy Daubaras.","Last month, some of the miners who typically hold on to their mined bitcoin reported having sold a large portion of their holdings, including <a href=\"https:\/\/www.theblock.co\/post\/153294\/bitfarms-gives-up-3000-btc-to-pay-down-100-million-loan-from-galaxy-digital\" data-v-f87c67ca=\"\">Bitfarms<\/a>,&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/155853\/core-scientific-sold-7202-bitcoin-in-june-generating-167-million\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Core Scientific<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/156304\/argo-sold-637-bitcoin-in-june-in-an-effort-to-strenghen-its-balance-sheet\" data-v-f87c67ca=\"\">Argo<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Frank Holmes","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"Holmes","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Darcy Daubaras","content":"PERSON"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}