{"summary":"A nine-day “priority migration” period begins today for existing stakers, with early access and general access stages to follow.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264976\/chainlink-upgrades-staking-mechanism-45-million-link-pool","publishDate":"2023-11-28T12:00:03","id":7395,"type":null,"title":"Chainlink upgrades staking mechanism with 45 million LINK pool","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Decentralized computing protocol Chainlink has upgraded its native staking mechanism, launching Chainlink Staking v0.2 with an expanded pool size of 45 million <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248371\/chainlink-link-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/chainlink-new-logo.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">LINK<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.97%\n    <\/span><\/a> <!----><\/span>.<\/span>","A nine-day \"priority migration\" period begins today for existing v0.1 stakers to transition their staked LINK and rewards to the new version. Access will then expand to other participants via early access and general access stages from Dec. 7 and Dec. 11, respectively, enabling users to stake up to 15,000 LINK, according to a statement.","By increasing the staking pool size to 45 million LINK, 8% of the current circulating supply, Chainlink hopes to open the door to a more diverse array of LINK token holders. The expansion is part of Chainlink's Economics 2.0 plan, aiming to add an extra layer of security to the network.","Chainlink is the most widely used oracle network in crypto, providing external real-world data to blockchain applications. Chainlink staking first <a href=\"https:\/\/www.theblock.co\/post\/192357\/chainlink-staking-is-now-live-a-major-step-in-its-new-economics-2-0-plan\" data-v-f87c67ca=\"\">went live<\/a> in December, increasing utility for the token and enabling LINK holders to back the performance of oracle services and earn rewards for helping to secure the network. It was initially solely accessible for staking to secure the Ethereum ETH\/USD price feed, with a pool capped at 25 million LINK tokens.&nbsp;","\"Because we are seeing a consistent increase in the amount of value secured by and paid for over the Chainlink Network, it's increasingly important to improve cryptoeconomic security,\" Chainlink co-founder Sergey Nazarov said. \"Staking v0.2 introduces important new security features and sets the system up for even further growth in the year to come.\"","The new version is designed to provide a more flexible unbonding mechanism — allowing stakers to withdraw their staked tokens more efficiently — and improved security guarantees. Its modular architecture aims to facilitate greater adaptability, making it easier to incorporate future upgrades and improvements.","Chainlink Staking v0.2 also incorporates \"dynamic rewards mechanisms that can seamlessly support new sources of rewards in the future,\" the team said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dec. 11","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"8%","content":"PERCENT"},{"type":"Dec. 7","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Chainlink Network","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Sergey Nazarov","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"+0.97%","content":"PERCENT"}],"hashtag":["DECENTRALIZED INFRASTRUCTURE"],"authors":["James Hunt","The Block"]}