{"summary":"The unrestricted donation will be used to further the Internet Archive&#x27;s mission to digitize and provide access to humanity&#x27;s information. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/100169\/filecoin-foundation-internet-archive-donation","publishDate":"2021-04-01T04:00:38","id":7398,"type":null,"title":"Filecoin Foundation just donated 50,000 FIL tokens to the Internet Archive","category":["DEFI"],"content":["Non-profit digital library Internet Archive has just received a 50,000 FIL donation from the Filecoin Foundation.","According to the group, the unrestricted donation will be used to further the Internet Archive's mission to digitize and provide access to information. The total value of the FIL donation is nearly $10 million, according to current market prices.&nbsp;","<span data-v-f87c67ca=\"\">“Libraries have always used the technology of the day, whether it's cuneiform back in Sumerian Babylonian times, or papyrus paper, or microfilm,\" said Internet Archive founder Brewster Kahle. \"Our hope is that new technologies like Filecoin will revolutionize the storage market and decentralize it.\"<\/span>","According to <span data-v-f87c67ca=\"\">board chair Marta Belcher, who also serves as outside general counsel to Protocol Labs, which developed Filecoin,<\/span> the Internet Archive can use the Filecoin tokens on the Filecoin network to store files or can exchange them to USD. Kahle told The Block the donation will be used to continue the organization's work in developing collections and building upon decentralized web technologies.&nbsp;","\"<span data-v-f87c67ca=\"\">Even though decentralized technologies are better in terms of privacy enhancement, reliability, exploration. It has to be snappy, it has to work really well, which takes time and effort,\" Kahle told The Block. \"<\/span><span data-v-f87c67ca=\"\">We have to do something that is not a step backward.\"<\/span>","According to Kahle, one of the biggest priorities for the Internet Archive is to smoothen the transition from the existing World Wide Web to the new decentralized web.&nbsp;","\"The question is, can you have the decentralized technology work in your browser without using a plugin or a new browser?\" Kahle said.","This isn't the Internet Archive's first step into the world of blockchain and cryptocurrencies.","Since 2015, the organization has hosted the Decentralized Web Summit, a series of conferences and gatherings that advocate for a decentralized web. According to Kahle, the organization has started paying its employees in bitcoin, and has used IPFS, WebTorrent, and other decentralized platforms to build an archive of books, music, and video.","In June 2020, the Internet Archive also partnered up with decentralized data storage platform Arweave, archiving over <a href=\"https:\/\/www.theblockcrypto.com\/post\/71398\/arweave-internet-archive-data\" data-v-f87c67ca=\"\">700,000 torrent files of information<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"FIL","content":"ORGANIZATION"},{"type":"2015","content":"DATE"},{"type":"June 2020","content":"DATE"},{"type":"Filecoin Foundation","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Brewster Kahle","content":"PERSON"},{"type":"Marta Belcher","content":"PERSON"},{"type":"Filecoin","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"Kahle","content":"PERSON"}],"hashtag":[],"authors":["Saniya More","The Block"]}