{"summary":"Claims for those who lost money with FTX are rising in value as the recovery outlook continues to improve.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263592\/ftx-creditor-claims-increase-to-as-high-as-65-cents-on-the-dollar","publishDate":"2023-11-17T15:49:50","id":7402,"type":null,"title":"FTX creditor claims increase to as high as 65 cents on the dollar","category":["BANKRUPTCY"],"content":["Some larger FTX creditors are being offered as much as $0.60 to $0.65 on the dollar, marking an increase of as much as 30% when compared to about a month ago.&nbsp;","In <a href=\"https:\/\/www.theblock.co\/post\/258853\/some-ftx-creditor-claims-rise-above-50%C2%A2-in-over-the-counter-deals\" data-v-f87c67ca=\"\">late October<\/a>, some over-the-counter (OTC) trades of FTX creditor claims closed at over $0.50 on the dollar.&nbsp;","FTX debt claim specialist Thomas Braziel said he thinks the outlook could continue to improve. \"The claims should approach the horizon of the recovery which is probably somewhere in the 80% to 90% plus range,\" he said.","But while Baziel, who is a partner at 117 Partners, confirmed some claims are currently being offered for as much as $0.60 to $0.65 on the dollar, securing the high end of that range will be difficult for some. \"Multiple big distressed firms are heading into the 60s now,\" he said while highlighting the fact that only clean, multi-million dollar claims are likely to get close to $0.65.","In January, in an <a class=\"c-link\" href=\"https:\/\/x.com\/loomdart\/status\/1616869813862686722?s=20\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/x.com\/loomdart\/status\/1616869813862686722?s=20\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">X poll<\/a>, a majority of respondents said they expected to recover a mere 25% of the money they lost with FTX.","Enthusiasm around the value of FTX claims grew after Anthropic, an AI company FTX purchased a large stake in, announced multiple large investments. Creditors hope that selling FTX's Anthropic stake will help return funds to creditors.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"80%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"$0.60","content":"MONEY"},{"type":"$0.50","content":"MONEY"},{"type":"Baziel","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"25%","content":"PERCENT"},{"type":"$0.65","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Thomas Braziel","content":"PERSON"},{"type":"October","content":"DATE"}],"hashtag":["FTX"],"authors":["RT Watson","The Block"]}