{"summary":"zkLink Nova, the industry&#x27;s pioneering Aggregated Layer 3 zkEVM rollup network based on zkSync’s ZK Stack &amp; zkLink Nexus, is launching the first season of its rewards campaign titled, ’Aggregation Parade’.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282313\/zklink-nova-launches-aggregation-parade-with-zkl-incentives","publishDate":"2024-03-14T09:04:17","id":7405,"type":null,"title":"zkLink Nova Launches Aggregation Parade with $ZKL Incentives","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">zkLink Nova, the industry’s pioneering Aggregated Layer 3 zkEVM rollup network based on zkSync’s ZK Stack &amp; zkLink Nexus, is launching the first season of its rewards campaign titled, ’Aggregation Parade’.<\/span>","<span data-v-f87c67ca=\"\">The campaign aims to encourage participants to migrate to the Layer 3 Nova mainnet by offering unparalleled reward-bearing opportunities for various crypto tokens such as ETH, L2 Natives, Stables, LSTs &amp; LRTs. The campaign, which began on March 14, 2024, will run until April 14, 2024, providing a month-long window for users to capitalize on these offerings.<\/span>","<span data-v-f87c67ca=\"\">The Aggregation Parade features the exclusive Nova Lynks NFT collection, specially created to celebrate the launch of zkLink’s Layer 3, Nova. These unique NFTs play a central role in the campaign, offering holders of the NFTs a share of a prize pool of 10,000,000 $ZKL tokens. Additionally, <\/span><span data-v-f87c67ca=\"\">the campaign promises to offer seven other different chances to earn rewards, making it one of the most ambitious rewards campaigns in the cryptocurrency domain.<\/span>","<span data-v-f87c67ca=\"\">During the first season of the campaign, users who participate in the campaign will be rewarded with Nova Points, which can be converted into zkLink merchandise and ZKL tokens at a later date.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Nova Points can be earned from 3 different sources;<\/span>","<b data-v-f87c67ca=\"\">Bridging:<\/b><span data-v-f87c67ca=\"\"> Users are required to bridge through the canonical bridge to participate in the campaign. Deposits into the Nova network will instantly receive a 10x bonus boost on the value of their tokens.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Staking:<\/b><span data-v-f87c67ca=\"\"> Users will be able to receive staked rewards on multiple token classes including stablecoins, native L2 tokens, and derivatives such as Liquid staked tokens (LST) and Liquid restaking tokens (LRT).<\/span>","<b data-v-f87c67ca=\"\">NFT Referral Program: <\/b><span data-v-f87c67ca=\"\">For every three referrals made by the user, users will receive a tradeable NFT for users to upgrade their Nova Soulbound Token into Nova Lynks. Only Nova Lynks holders will be qualified for their share of the 10,000,000 $ZKL prize pool. Referrers will also be able to gain an additional 10% of the total Nova points earned by their referrals throughout the Aggregation Parade.<\/span>","<span data-v-f87c67ca=\"\">For more information on the Aggregation Parade and full list of partners, visit the <\/span><a href=\"https:\/\/app.zklink.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">official Aggregation Parade website<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">–<\/span>","<b data-v-f87c67ca=\"\">About zkLink Nova<\/b>","<span data-v-f87c67ca=\"\">zkLink Nova is the pioneering Aggregated Layer 3 Rollup zkEVM network that brings unprecedented liquidity and asset aggregation to Ethereum and its Layer 2 Rollups. Built with ZK Stack and zkLink Nexus, it leverages ZK Proofs to enhance scalability and security. Developers enjoy an open platform for deploying Solidity smart contracts and instantly tapping into integrated networks like Arbitrum and zkSync. Nova simplifies DeFi by presenting a unified ecosystem for users and DApps, promoting a seamless blockchain experience.<\/span>","<span data-v-f87c67ca=\"\">zkLink is funded by notable backers including Coinbase Ventures, Solana Ventures, SIG DTI, Huobi Ventures, Efficient Frontier, and others.<\/span>","<span data-v-f87c67ca=\"\">For more information on zkLink, visit: <\/span><a href=\"http:\/\/zklink.io\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Website<\/span><\/a><span data-v-f87c67ca=\"\"> | <\/span><a href=\"https:\/\/twitter.com\/zkLink_Official\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Twitter<\/span><\/a><span data-v-f87c67ca=\"\"> | <\/span><a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=4111025-1&amp;h=3537202068&amp;u=https%3A%2F%2Ft.me%2FzkLinkorg&amp;a=Telegram\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Telegram<\/span><\/a><span data-v-f87c67ca=\"\"> | <\/span><a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=4111025-1&amp;h=1149299822&amp;u=https%3A%2F%2Fdiscord.com%2Finvite%2Fzklink&amp;a=Discord\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Discord<\/span><\/a>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by zkLink<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Ventures","content":"ORGANIZATION"},{"type":"Nova","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Huobi Ventures","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"LRT","content":"ORGANIZATION"},{"type":"$ZKL","content":"MONEY"},{"type":"March 14, 2024","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Efficient Frontier","content":"ORGANIZATION"},{"type":"ZK Stack &amp; zkLink Nexus","content":"ORGANIZATION"},{"type":"Nova Points","content":"ORGANIZATION"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Nova","content":"LOCATION"},{"type":"April 14, 2024","content":"DATE"},{"type":"Stables","content":"LOCATION"},{"type":"SIG DTI","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}