{"summary":"Vega Protocol, a blockchain for decentralized derivatives trading, has released the initial markets following its alpha mainnet launch earlier this month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231875\/vega-protocol-blockchain-markets","publishDate":"2023-05-23T12:56:24","id":7406,"type":null,"title":"Vega Protocol activates on-chain derivatives after mainnet launch","category":["CRYPTO ECOSYSTEMS"],"content":["Vega Protocol, a Layer 1 blockchain focused on derivatives trading, has launched its first on-chain markets following the release of its <a href=\"https:\/\/twitter.com\/vegaprotocol\/status\/1657002883722911747\" data-v-f87c67ca=\"\">alpha mainnet<\/a> earlier this month.","The project's community members approved an on-chain governance vote to kickstart trading and take its markets live. This community vote also greenlit the use of the USDC and USDT stablecoins for deposit and withdrawal operations through an interoperability bridge with Ethereum.","From today, Vega Protocol will offer users the ability to create decentralized and permissionless markets. To start with, the network will only support cash-settled futures markets but it has plans to add spot, perpetual, and other types of markets in future stages.","Beyond its trading capabilities, the core team plans to introduce a browser wallet, allowing users direct in-browser access to the full Vega ecosystem. Additionally, the team plans to incorporate a software feature named Wendy, designed to provide Miner Extractable Value (<a href=\"https:\/\/www.theblock.co\/post\/224482\/ethereum-mev-bots-lose-over-25-million-in-sophisticated-attack\" data-v-f87c67ca=\"\">MEV<\/a>) protection to on-chain traders.","After an extensive research and development phase spanning nearly five years, Vega launched on mainnet on May 10. The core team published the <a href=\"https:\/\/vega.xyz\/papers\/vega-protocol-whitepaper.pdf\" data-v-f87c67ca=\"\">whitepaper<\/a> for Vega in 2018 outlining a performance-optimized, application-specific blockchain built on the Tendermint proof-of-stake consensus mechanism.","In 2019, the team <a href=\"https:\/\/www.theblock.co\/post\/41820\/vega-raises-5m-to-develop-decentralized-derivative-markets\" data-v-f87c67ca=\"\">raised<\/a> a $5 million seed round led by Pantera Capital. Then in 2021, the team conducted a community token sale on CoinList, <a href=\"https:\/\/blog.coinlist.co\/announcing-the-vega-token-sale-on-coinlist\/\" data-v-f87c67ca=\"\">raising $43 million<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"Miner Extractable Value","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Vega Protocol","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"$43 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Wendy","content":"PERSON"},{"type":"Vega","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"May 10","content":"DATE"},{"type":"$5 million","content":"MONEY"}],"hashtag":["ASSETS","DERIVATIVES","DEXS","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}