{"summary":"Bitget&#x27;s $100 million EmpowerX Fund will invest in regional exchanges, data analytics firms, media organizations and other entities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250146\/bitget-fund-invest-exchanges-analytics-media","publishDate":"2023-09-11T21:40:03","id":7408,"type":null,"title":"Bitget unveils $100 million fund to invest in exchanges, analytics and media","category":["DEALS"],"content":["Crypto derivatives and copy-trading exchange Bitget has unveiled its EmpowerX Fund, a $100 million initiative designed to expand the platform's ecosystem.","Bitget’s new fund will seek to invest in regional exchanges, data analytics firms, media organizations and other entities, according to a statement coinciding with Bitget's fifth-anniversary summit in Singapore today.","Bitget said the key to expanding its ecosystem was diversifying its services to cater to the varying needs of its 20 million global customers. It also said it aimed to create “a comprehensive trading ecosystem encompassing trading, investment, research, DeFi, media and other functions.”","“The CEX landscape is continually evolving amid influences of tightened regulations, rapid growth of Layer 2 and DeFi technologies, and we are expecting that more investment, mergers and acquisitions will happen in the following months,” Bitget Managing Director Gracy Chen said in the statement.","Bitget has set aside $100 million for the fund, but that figure may increase depending on market conditions and future business strategy, a spokesperson told The Block. The $100 million is sourced from Bitget's strategic reserves, which are seperate from the company's core budget, and has already been allocated to the fund ready for investment, the spokesperson added.","\"We prefer investing in the company's future without relying on external funding at this moment,\" Chen told The Block.","The EmpowerX Fund follows the launch of <a href=\"https:\/\/www.theblock.co\/post\/225504\/bitget-venture-fund\" data-v-f87c67ca=\"\">Bitget’s $100 million Web3 Fund<\/a> in April, which prioritized Asia-based projects and invested with global VCs — including Foresight Ventures, SevenX Ventures and Gitcoin Fund.","The Seychelles-based exchange also <a href=\"https:\/\/www.theblock.co\/post\/221903\/bitget-bitkeep-acquisition-investment\" data-v-f87c67ca=\"\">invested $30 million in the decentralized BitKeep multi-chain wallet<\/a> in March. With Bitget taking a controlling stake, it was subsequently rebranded to Bitget Wallet as part of the company's “go beyond derivatives\" strategy.","Bitget also took a <a href=\"https:\/\/www.theblock.co\/post\/224702\/dragonfly-invests-bitget\" data-v-f87c67ca=\"\">$10 million strategic investment<\/a> from crypto venture capital firm Dragonfly Capital in April to continue expanding into spot trading and yield-generating products and to grow its launchpad initiative.","Furthermore, the platform <a href=\"https:\/\/www.theblock.co\/post\/237669\/bitget-crypto-loans\" data-v-f87c67ca=\"\">launched a crypto loans product<\/a> in July, despite 2022 troubles in the sector — a year that saw the collapse into bankruptcy of firms like <a href=\"https:\/\/www.theblock.co\/post\/157483\/crypto-lender-celsius-to-declare-chapter-11-bankruptcy-cnbc?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">Celsius<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/188915\/crypto-firm-blockfi-files-for-bankruptcy\" data-v-f87c67ca=\"\">BlockFi<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">Voyager Digital<\/a>.","Last month, <a href=\"https:\/\/www.theblock.co\/post\/246462\/bitget-kyc\" data-v-f87c67ca=\"\">Bitget announced mandatory know-your-customer verification<\/a> for new users from Sept. 1 and all existing users from Oct. 1 to be able to deposit and trade. The move is designed to “comply with regulatory requirements in the global cryptocurrency sector and create a secure cryptocurrency trading environment,” Bitget said at the time.","Crypto <a href=\"https:\/\/www.theblock.co\/post\/250121\/crypto-kyc-increasingly-stringent-bitget-gracy-chen\" data-v-f87c67ca=\"\">KYC measures are expected to become increasingly stringent<\/a>, Chen told The Block in a recent interview, with users required to undergo verification multiple times a year and the incorporation of more biometric data.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chen","content":"PERSON"},{"type":"Bitget","content":"ORGANIZATION"},{"type":"Gracy Chen","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Oct. 1","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Sept. 1","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Bitget","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"Seychelles","content":"LOCATION"},{"type":"$30 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"Dragonfly Capital","content":"ORGANIZATION"}],"hashtag":["DRAGONFLY CAPITAL","NEW VC FUNDS"],"authors":["James Hunt","The Block"]}