{"summary":"Vauld CEO Darshan Bathija yesterday told the firm&#x27;s creditors that the potential deal with Nexo had been called off.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197947\/nexo-writes-open-letter-to-vaulds-creditors-presents-final-proposal","publishDate":"2022-12-27T03:43:50","id":7409,"type":null,"title":"Nexo writes open letter to Vauld&#x27;s creditors, presents final proposal","category":["FINANCE FIRMS"],"content":["Shortly after Vauld founder and CEO Darshan Bathija sent an email to the firm's creditors yesterday saying that the potential Nexo deal has been called off, Nexo sent an open letter to Vauld's creditors that it is not over yet.","The open letter, dated Monday and obtained by The Block, includes Nexo's final proposal to Vauld with some changes to its previous proposal from earlier this month. The open letter also alleges that Vauld's financial advisor, Kroll, misrepresented and manipulated Nexo's previous proposal when presented to Vauld's creditors.","\"The 'Nexo Deal Terms' contained in the presentation delivered at the CoC [committee of creditors] meeting on October 10, 2022 were not provided by Nexo, rather they were pieced together by Kroll without Nexo's prior knowledge,\" the letter reads. \"Kroll Singapore's conduct raises multiple questions about the administrator's objective and independent approach to presenting the possible restructuring scenarios as opposed to actively pushing a self-serving agenda towards the involvement of a fund manager.\"","Bathija's email yesterday <a href=\"https:\/\/www.theblock.co\/post\/197894\/nexo-vauld-deal-terminated\" data-v-f87c67ca=\"\">noted<\/a> that Vauld plans to go for the fund management option for its restructuring, given that the potential Nexo deal had fallen through. Bathija said that Vauld has identified six potential candidates as fund managers and is finalizing one.","In its open letter, Nexo claims that the fund management option isn't good for creditors. The letter reads:","\"Vauld's Creditors, please read this carefully — while Nexo is proposing a fixed-income arrangement between Nexo and Vauld's Creditors, in which it is Nexo's responsibility to generate the loan revenue in order to pay the fixed interest it owes to the creditors, on the other hand, the creditors will assume the full risk of assigning their remaining assets to a fund manager to pursue returns and charge fund management fees in the process. We cannot help but wonder why there is such an aggressive push toward the fund management option and what kind of ulterior motives could justify taking an alternative direction to the detriment of Vauld's Creditors.\"","Nexo's final proposal is slightly different from its previous proposal presented earlier this month, which the Vauld CoC rejected, per Bathija's email. Nexo now believes that the final proposal will be accepted by the CoC.","A fundamental change in the final proposal pertains to withdrawals. Specifically, it pertains to key performance indicators, or KPIs, related to withdrawals. Previously, there was a requirement of a turnover of at least 2х the account balance or a minimum trading turnover of $10,000 to withdraw funds. Now those KPIs have been changed to a turnover of at least 5х the account balance and no minimum turnover in absolute terms.","\"We made a few changes to the KPIs so that we ensure a greater probability for Vauld's customers to achieve the KPIs,\" Nexo co-founder Antoni Trenchev told The Block. \"For example, we removed the minimum volume in absolute terms to be traded on Nexo's platform. The withdrawal fee is assumed to be reduced by 50% in the event that Vauld's customers in any jurisdiction are not able to achieve even one of the KPIs due to regulatory restrictions and\/or are mandated to be offboarded from the Nexo platform for the same reasons.\"","Further, Vauld creditors were previously required to swap at least 20% of the total account balance into Nexo tokens and lock it into a fixed-term deposit of a minimum of $1,000 for at least 12 months. Now, there is no minimum size of the deposit in absolute terms per the final proposal. Most other terms of the two proposals remain the same.","\"Nexo has not given up on its attempt to save Vauld and help its creditors recover the maximum possible platform funds,\" Nexo co-founder Kalin Metodiev told The Block.","It remains to be seen whether Vauld creditors accept Nexo's final proposal. Vauld and Kroll did not respond to The Block's request for comment.","Vauld <a href=\"https:\/\/www.theblock.co\/post\/185858\/vauld-creditor-protection-exntension-january\" data-v-f87c67ca=\"\">has until<\/a> Jan. 20 to sort out its financial issues, having received another credit protection extension last month. The firm, however, has applied for yet another extension, as The Block reported yesterday. The hearing for the moratorium extension is scheduled for Jan. 17.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Darshan Bathija","content":"PERSON"},{"type":"Kroll","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nexo","content":"ORGANIZATION"},{"type":"Vauld","content":"LOCATION"},{"type":"20%","content":"PERCENT"},{"type":"Jan. 20","content":"DATE"},{"type":"$1,000","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"Kroll Singapore","content":"ORGANIZATION"},{"type":"Vauld","content":"ORGANIZATION"},{"type":"Bathija","content":"ORGANIZATION"},{"type":"$10,000","content":"MONEY"},{"type":"Jan. 17","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"CoC","content":"ORGANIZATION"},{"type":"Antoni Trenchev","content":"PERSON"},{"type":"October 10, 2022","content":"DATE"},{"type":"Kalin Metodiev","content":"PERSON"},{"type":"Nexo","content":"PERSON"},{"type":"Kroll","content":"ORGANIZATION"},{"type":"Vauld CoC","content":"ORGANIZATION"}],"hashtag":["CRYPTO BANKS AND LENDERS"],"authors":["Yogita Khatri","The Block"]}