{"summary":"The HTX DAO 2024 and People&#x27;s Exchange Launch Ceremony took place in Singapore on February 2. The event marked the beginning of the HTX exchange&#x27;s journey","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276025\/justin-sun-attends-htx-dao-2024-and-peoples-exchange-launch-ceremony-building-htx-as-the-peoples-exchange","publishDate":"2024-02-07T09:02:01","id":7410,"type":null,"title":"Justin Sun Attends HTX DAO 2024 and People&#x27;s Exchange Launch Ceremony: Building HTX as the People&#x27;s Exchange","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">The HTX DAO 2024 and People's Exchange Launch Ceremony took place in Singapore on February 2.<\/span><span data-v-f87c67ca=\"\"> The event marked the beginning of the HTX exchange's journey on decentralization and signaled the People's Exchange as its core ethos.<\/span>","<span data-v-f87c67ca=\"\">At the event, Justin Sun, a core supporter of HTX DAO and member of HTX's Global Advisory Board, delivered a keynote speech, unmasking the first People's Exchange in the cryptocurrency space and highlighting the need for decentralization. He also shared his vision for HTX DAO and the exchange, along with the HTX DAO Governance Committee, ecosystem participants, and media outlets.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\">HTX DAO: Empowering the Community<\/b>","<span data-v-f87c67ca=\"\">Justin Sun pointed out that only a decentralized governance model can prevent tragedies like FTX and Mt. Gox from happening again and ensure the long-term security of users' assets while raising the asset ceiling, under the continuous growth of the industry. Moreover, only through decentralization can the blockchain and exchange industries reach a trillion-dollar level of asset scale. HTX DAO will lead the industry's evolution and create a new paradigm for protecting user assets in the exchange industry.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It is reported that HTX DAO was officially established on January 18, with the aim of being a leading decentralized autonomous organization in the blockchain ecosystem and focusing on open finance and tokenized economy.<\/span>","<span data-v-f87c67ca=\"\">Sun stated that HTX aims to transform into a decentralized, democratic, and autonomous exchange, which will be achieved through HTX DAO. This unique approach will empower $HTX holders to vote on listings, raise questions, and participate in decision-making and governance, propelling HTX towards decentralization. Ultimately, they will become the true owners of the platform.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\">HTX DAO Gives the HTX Exchange a Second Life<\/b>","<span data-v-f87c67ca=\"\">During the ceremony, Sun expressed that HTX DAO has given the HTX exchange a new lease of life. With a decentralized governance approach leading the next decade of development, HTX can operate sustainably for generations to come.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As per Sun, with the support of HTX DAO and the HTX token, HTX will retain its centralized operational structure while embracing decentralized governance, branding, and decision-making, showcasing vitality and competitiveness as a democratic community.<\/span>","<span data-v-f87c67ca=\"\">It is worth noting that besides HTX, HTX DAO has attracted more builders for its ecosystem, including projects and institutions such as Ankr, Spark Digital Capital, Double Peak Capital, Zebec, Merkle 3s Capital, TRON, BitTorrent, JustLend DAO, Poloniex, Sun.io, Spark, Stratified Capital, stUSDT, APENFT, etc. At the same time, as co-builders, HTX, TRON, BitTorrent, and APENFT will contribute funds to support HTX DAO's liquidity, jointly promoting the development of HTX DAO.<\/span>","<span data-v-f87c67ca=\"\">Summing up, Sun stated that HTX has gone through a decade as a centralized entity and hopes to accomplish its transformation to decentralization over the next decade, reaching long-term stability with a mechanism of complete democracy and transparency as a true People's Exchange.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">This post is commissioned by TRON and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em><br data-v-f87c67ca=\"\">\n<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BitTorrent","content":"ORGANIZATION"},{"type":"People's Exchange","content":"ORGANIZATION"},{"type":"Zebec","content":"LOCATION"},{"type":"next decade","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"HTX","content":"ORGANIZATION"},{"type":"HTX DAO Governance Committee","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"JustLend DAO","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Merkle","content":"PERSON"},{"type":"January 18","content":"DATE"},{"type":"Poloniex","content":"LOCATION"},{"type":"People's Exchange Launch Ceremony","content":"ORGANIZATION"},{"type":"February 2","content":"DATE"},{"type":"Community","content":"ORGANIZATION"},{"type":"Global Advisory Board","content":"ORGANIZATION"},{"type":"$HTX","content":"MONEY"}],"hashtag":[],"authors":["Sponsored","The Block"]}