{"summary":"Since Day One, The Block has been fearless, seeking to bring vital journalism, research, and analysis to readers and the crypto community. In five months,","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/12215\/introducing-the-block-genesis","publishDate":"2019-02-18T16:00:26","id":7411,"type":null,"title":"Introducing The Block Genesis","category":["BITCOIN"],"content":["<span data-v-f87c67ca=\"\">Since <\/span><a href=\"https:\/\/www.theblockcrypto.com\/2018\/12\/31\/day-one-2019\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Day One<\/span><\/a><span data-v-f87c67ca=\"\">, The Block has been fearless, seeking to bring vital journalism, research, and analysis to readers and the crypto community. In five months, we have grown from one brave researcher to a team of tenacious global crypto natives who are always-on, expert communicators. We have broken market moving news stories, created numerous industry maps, released novel data-driven analysis, and conducted significant deep dives on projects, protocols, people, companies and more.<\/span>","<span data-v-f87c67ca=\"\">The Block is the first and final word on the digital asset ecosystem. We create significant value that sets our community apart from the rest. Our readers may choose to invest in (or avoid) a project, discover the right company to work or partner with, learn why a certain cryptocurrency may be more interesting than they previously thought or be first to learn about a breaking story. The value that The Block creates flows through to our readers’ businesses and career decisions<span class=\"ILfuVd\" data-v-f87c67ca=\"\">—<\/span>and now we’re doing even more.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">This week, we are proud to introduce our premium brand: Genesis. The Block Genesis doubles down on what we do better than anyone else. That means more in-depth research, analysis, investigative journalism and commentary from our all-star team. Genesis provides the ultimate edge through unique information, as well as the community to form and test great ideas. Genesis enables you to make decisions with an insider’s view of the constantly evolving digital asset space.<\/span>","<span data-v-f87c67ca=\"\">We created The Block to provide true signal in an industry full of noise and to help you make the right decisions in real time. Genesis is the ultimate realization of The Block’s mission. We are growing our editorial team through 2019 to expand coverage on The Block and Genesis. In addition to Genesis-only content, members will have exclusive access to our team and the Genesis community via chat. Members will also receive discounted pricing on The Block events and other industry products.<\/span>","<span data-v-f87c67ca=\"\">Genesis is available for $1,000 per year or $125 per month. The product is tailored for any professional seeking the edge in digital assets. The entire team at The Block will be pouring our hearts and souls into a steady stream of Genesis-exclusive pieces weekly that will help separate you from the pack.<\/span>","<span data-v-f87c67ca=\"\">We can’t wait for you to join us as part of this new community. Thank you for your continued loyalty and trust. It is our pleasure to share The Block Genesis with you,&nbsp;<\/span><a href=\"https:\/\/www.theblockcrypto.com\/genesis-purchase\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">available for sign up today!<\/span><\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$125","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Genesis","content":"PERSON"},{"type":"$1,000","content":"MONEY"},{"type":"2019","content":"DATE"}],"hashtag":[],"authors":["Mike Dudas","The Block"]}