{"summary":"Federal Reserve Chair Jerome Powell sees the crypto market downturn as a benefit giving regulators more time to pass “appropriate” regulation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173034\/powell-crypto-market-downturn-gives-regulators-more-time","publishDate":"2022-09-27T09:13:51","id":7413,"type":null,"title":"Powell: Crypto market downturn gives regulators &#x27;more time&#x27;","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">The ongoing downturn in cryptocurrency markets is giving global regulators “more time” to identify the weaknesses and work that needs to be done, says Jerome Powell, Chair of the U.S. Federal Reserve.<\/span>","<span data-v-f87c67ca=\"\">“Crypto winter did not have a significant effect on the broader banking system and financial stability,” Powell said while addressing global financial leaders and crypto regulation experts in a conference focused on central banks and digital currencies held in Paris.<\/span>","<span data-v-f87c67ca=\"\">The overlap between traditional finance and banking systems and decentralized finance (DeFi) is limited, which Powell argued is good news for regulators.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“This demonstrates the weaknesses and work that needs to be done,” Powell said, referring to the “significant” structural and transparency issues in DeFi. “Crypto winter gives us a little bit of time. That situation will not persist indefinitely.”<\/span>","<span data-v-f87c67ca=\"\">There are several pressure points that need more work, according to Powell, regarding novelties like the need to regulate unhosted wallets or algorithms.<\/span>","<span data-v-f87c67ca=\"\">As DeFi attracts more retail investors, Powell reiterated the need for “appropriate” regulation to be put in place.<\/span>","<span data-v-f87c67ca=\"\">Powell previously <\/span><a href=\"https:\/\/www.theblock.co\/post\/168615\/powell-we-need-legislation-on-stablecoins\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">called<\/span><\/a><span data-v-f87c67ca=\"\"> for legislation to “appropriately” regulate stablecoins. While lawmakers in the U.S. were unsuccessful in adopting legislation on stablecoins this summer, a more stringent piece of legislation has begun taking shape. <\/span><span data-v-f87c67ca=\"\">The bill, however, will not include a central bank digital currency (CBDC) issuance.<\/span>","<span data-v-f87c67ca=\"\">During his remarks, Powell said the U.S. decided “not to proceed” with the issuance of a central bank digital currency, thereby giving policymakers a few more years to evaluate policy issues and technology issues as well as increase public confidence. Such work would involve different branches of the U.S. government as well.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jerome Powell","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"Paris","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Powell","content":"PERSON"},{"type":"summer","content":"DATE"}],"hashtag":["JEROME POWELL"],"authors":["Inbar Preiss","The Block"]}