{"summary":"Eclipse Labs is developing an Ethereum Layer-2 solution using the Solana Virtual Machine (SVM), aiming for scalability and composability.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281566\/eclipse-labs-raises-50-million-in-series-a-funding-ahead-of-expected-q2-mainnet","publishDate":"2024-03-11T10:59:03","id":7415,"type":null,"title":"Eclipse Labs raises $50 million in Series A funding ahead of Q2 mainnet","category":["CRYPTO ECOSYSTEMS"],"content":["Layer 2 developer Eclipse Labs has raised a $50 million Series A funding round co-led by Placeholder and Hack VC, bringing the total capital raised to $65 million.","The funding round saw participation from other investors including Polychain Capital, Delphi Digital, Maven 11, DBA, and Fenbushi Capital. Additional strategic contributions came from Flow Traders, GSR, Apollo Global Management, and OKX Ventures. The firm did not disclose its latest valuation.","This freshly raised capital will be used by the project to develop an Ethereum Layer-2 solution using the Solana Virtual Machine (SVM). By integrating the high performance of the SVM with Ethereum’s liquidity, Eclipse aims to offer a differentiated Layer 2 solution.","“Eclipse integrates the high-performance SVM with the deep pools of liquidity on Ethereum, while maintaining the hard constraint of verifiability,” said Neel Somani, founder of Eclipse Labs, in a statement.","<a href=\"https:\/\/www.theblock.co\/post\/214709\/eclipse-to-release-a-solana-compatible-layer-2-blockchain-built-for-polygon-network\" data-v-f87c67ca=\"\">Eclipse Labs<\/a> said that the focus with its network will be to create a highly composable Ethereum Layer 2 chain. “Ethereum needs a single, scalable, composable layer-2 capable of handling 99% of use cases,” Somani added.","The team is targeting to launch its final mainnet release in the second quarter of this year. It has already rolled out a devnet and testnet versions of its protocol, with plans to deploy prominent dapps with the mainnet launch, including collaborations with Rarible, Pyth Network, and Solend.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Apollo Global Management","content":"ORGANIZATION"},{"type":"Neel Somani","content":"PERSON"},{"type":"second quarter of this year","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"$65 million","content":"MONEY"},{"type":"GSR","content":"ORGANIZATION"},{"type":"Solana Virtual Machine (SVM","content":"ORGANIZATION"},{"type":"DBA","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Eclipse Labs","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"99%","content":"PERCENT"},{"type":"OKX Ventures","content":"ORGANIZATION"},{"type":"Fenbushi Capital","content":"ORGANIZATION"},{"type":"Delphi Digital","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"},{"type":"Pyth Network","content":"ORGANIZATION"}],"hashtag":["ROLLUPS","SERIES A","SIDECHAINS"],"authors":["Vishal Chawla","The Block"]}