{"summary":"From backdating transactions to &quot;excessive&quot; spending, Nishad Singh saw problems throughout SBF&#x27;s empire — even before he knew the full story.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/257840\/inside-sbfs-trial-nishad-singh-said-no-but-not-often-enough","publishDate":"2023-10-16T21:20:10","id":7416,"type":null,"title":"Inside SBF&#x27;s Trial: Nishad Singh said no, but not often enough","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">For the third and final time in the <a href=\"https:\/\/www.theblock.co\/tag\/sbf-trial\" data-v-f87c67ca=\"\">criminal trial<\/a> of Sam Bankman-Fried, a former member of his inner circle admitted guilt to several crimes and testified that Bankman-Fried committed them too.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Today, that person was Nishad Singh, an early employee of Alameda Research who eventually became FTX's Head of Engineering. Singh's testimony that he committed crimes alongside Bankman-Fried follows similar admissions by Gary Wang and Caroline Ellison, the other members of Bankman-Fried's inner circle who have pleaded guilty and are cooperating with prosecutors.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Unlike Wang and Ellison, who answered the prosecutors' questions competently but cooly, Singh's more emotional testimony underscored the tragic narrative presented by the government — that Singh was yet another idealistic youngster who minded his morals, until falling under the corrupting influence of Bankman-Fried.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yet Singh also exhibited a seemingly rare ability among FTX employees: he was willing to tell Bankman-Fried 'no.' Unfortunately, in his telling, it made little difference in the end. Singh's cross-examination by the defense will commence tomorrow.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Even before Singh knew about the <a href=\"https:\/\/www.theblock.co\/post\/255326\/inside-sbfs-trial-ftx-numbers-checked-out-except-for-an-8-billion-mystery-friend\" data-v-f87c67ca=\"\">hole<\/a> at FTX, he testified, he had issues with Bankman-Fried's \"excessive\" approach to spending. Singh called the penthouse he and others shared with Bankman-Fried \"super ostentatious\" and described how they nearly bought a more affordable place, but \"Sam’s a fan of views.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Singh also took specific issue with Bankman-Fried's relationship with Michael Kives, a well-connected former aide to Hillary Clinton who impressed Bankman-Fried by introducing him to, among others, Katy Perry, Orlando Bloom, Jeff Bezos, and Kris and Kendall Jenner. (Of the last two, \"I honestly could not tell you what they do,\" Singh testified, leading to laughter in the courtroom.)&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Singh, FTX was about to give K5 founders Michael Kives and Bryan Baum \"hundreds of millions of dollars of bonuses\" and \"up to a billion dollars long term of capital to give to their VC firm.\"<\/span>","<span data-v-f87c67ca=\"\">When Bankman-Fried expressed interest in giving millions to Kives, Singh requested that Bankman-Fried invest his own money into K5 instead, and restrict FTX employees from interacting with K5's staff. Yet records show that Bankman-Fried invested hundreds of millions of dollars into K5 through Alameda Research Ventures LLC.<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried continued to spend heavily as late as September 2022, according to a spreadsheet showing FTX's venture deals: on Sept. 7, $45 million was invested in SkyBridge Capital, a hedge fund led by former Trump administration official Anthony Scaramucci, and on Sept. 26, $250 million was given to Modulo Capital, another hedge fund co-founded by a former romantic associate of Bankman-Fried.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried also directed political donations that were routed through Singh's account, he testified, due to the \"advantageous optics.\" At one point, Singh signed a series of blank checks and handed them off to an assistant of Gabriel Bankman-Fried, Sam's brother, who routed the funds to various Democratic causes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">At some point, the search for additional liquidity led to an idea of collaboration with Telegram, crypto's favorite message app, Singh said. In a conversation with Singh after a Middle East trip with Anthony Scaramucci in search of new investors, Bankman-Fried told the head of engineering that FTX would build an in-app payment system for <a href=\"https:\/\/www.theblock.co\/post\/251486\/toncoin-leads-bitcoin-in-crypto-market-rally-after-telegram-endorsement\" data-v-f87c67ca=\"\">Telegram<\/a>.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For helping Telegram build a payment mechanism, FTX would get a portion of TON tokens – cryptocurrency once <\/span><a href=\"https:\/\/techcrunch.com\/2018\/01\/08\/telegram-open-network\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">started<\/span><\/a><span data-v-f87c67ca=\"\"> by Telegram itself, then <\/span><a href=\"https:\/\/telegra.ph\/What-Was-TON-And-Why-It-Is-Over-05-12\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">abandoned<\/span><\/a><span data-v-f87c67ca=\"\">, picked up by enthusiast developers and then <\/span><a href=\"https:\/\/t.me\/durov\/175\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">adopted<\/span><\/a><span data-v-f87c67ca=\"\"> by the company for in-app payments.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, for Singh, \"getting a lot of <\/span><a href=\"https:\/\/www.coingecko.com\/en\/coins\/toncoin\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">illiquid<\/span><\/a><span data-v-f87c67ca=\"\"> tokens\" was not a particularly good idea, he told the court while questioned by the U.S. attorney Nicolas Roos, especially once Singh learned that the deal had a financial element as well — FTX would have to pay Telegram $120 million. Despite Singh’s and Ellison’s objections, Bankman-Fried said he intended to go forward with the deal, Singh testified.<\/span>","<span data-v-f87c67ca=\"\">Telegram did not immediately respond to a request for comment from The Block about Singh's testimony.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Despite the spending, Bankman-Fried sought ways to make FTX's financials appear better on paper, Singh testified. At the end of December 2021, Bankman-Fried was frustrated that FTX's revenue figures had come in about $50 million short of $1 billion. Yet he had come up with an idea to juice the numbers, backdating transactions related to Serum staking that would bring them over the line. When he directed Singh to make the changes, Singh agreed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Later the following year, Bankman-Fried made a similar request and asked Singh to transfer the Serum tokens that he and Singh held, along with the holdings of Ellison and Wang, to Alameda's account and backdate the transaction, \"to make it appear that Alameda always had more collateral than it did,\" Singh testified.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yet the Serum was locked, and shouldn't have been included, Singh argued. What's more, Singh testified that the eventual recipient of this data would be the CFTC. \"But I understood the purpose of this exercise to be, you know, to fool a U.S. regulator and to fool employees of the company, and I wasn't comfortable with that,\" Singh testified. And so, against the wishes of Bankman-Fried, Singh didn't make the transaction.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One night in September 2022, during a one-on-one conversation with Bankman-Fried on the balcony of the Bahamas penthouse they shared, Singh testified that he asked Bankman-Fried about Alameda's financial situation and the $13 billion of borrowed funds that he learned Alameda couldn't repay.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Right. That,\" Bankman-Fried responded, according to Singh. \"We are a little short on deliverables.\" Bankman-Fried told Singh that worrying about the shortfall had taxed his productivity around \"five to ten percent.\" Singh knew immediately that the revelation was going to affect him much more.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"I was blindsided and horrified. I felt really betrayed,\" Singh testified, describing FTX's betrayal of its users' trust as \"so evil.\" Yet he remained at FTX, despite considering leaving \"every day,\" worrying his departure could lead to a preventable collapse. When the disaster he feared finally came to pass, Singh testified that he \"had been suicidal for some days.\"<\/span>","<span data-v-f87c67ca=\"\">It was under this state of mind, Singh testified, that he considered falsifying transactions that would give the appearance that personal loans taken out in his name using company funds had been paid off. Yet while Bankman-Fried was allegedly comfortable with that type of manipulation, Singh eventually decided against it. \"It felt wrong,\" he testified. Singh also recused himself from helping other FTX executives draft the tweet that would declare, from Bankman-Fried’s account: \"FTX is fine. Assets are fine.\"<\/span>","<span data-v-f87c67ca=\"\">As the collapse continued, Singh had one \"wildly selfish\" request for Bankman-Fried: to take responsibility for his actions and explain \"it wasn’t a ton of people orchestrating [the fraud],\" as Singh wrote in a Signal message to Bankman-Fried, arguing it would help FTX employees resolve the \"blame game\" and move forward.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Yup, for what it's worth, I don't think that's super selfish,\" Bankman-Fried responded. \"I think that's probably correct.\"<\/span>","The Block will be back in the courtroom tomorrow for Nishad Singh's cross-examination by the defense.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kris","content":"PERSON"},{"type":"Trump","content":"ORGANIZATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"$250 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"Alameda","content":"ORGANIZATION"},{"type":"Sam’s","content":"PERSON"},{"type":"Michael Kives","content":"PERSON"},{"type":"ten percent","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Bryan Baum","content":"PERSON"},{"type":"\"hundreds of millions of dollars","content":"MONEY"},{"type":"Wang","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"$45 million","content":"MONEY"},{"type":"Alameda","content":"PERSON"},{"type":"Head of Engineering","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"$120 million","content":"MONEY"},{"type":"September 2022","content":"DATE"},{"type":"Gary Wang","content":"PERSON"},{"type":"Singh","content":"LOCATION"},{"type":"Singh","content":"PERSON"},{"type":"$13 billion","content":"MONEY"},{"type":"$50 million","content":"MONEY"},{"type":"a billion dollars","content":"MONEY"},{"type":"Gabriel Bankman","content":"PERSON"},{"type":"Ellison","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Orlando Bloom","content":"LOCATION"},{"type":"Anthony Scaramucci","content":"PERSON"},{"type":"Jeff Bezos","content":"PERSON"},{"type":"Nishad Singh","content":"ORGANIZATION"},{"type":"Kendall Jenner","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"Alameda Research Ventures LLC","content":"ORGANIZATION"},{"type":"Sept. 7","content":"DATE"},{"type":"Hillary Clinton","content":"PERSON"},{"type":"Modulo Capital","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Singh","content":"ORGANIZATION"},{"type":"Kives","content":"PERSON"},{"type":"Middle East","content":"LOCATION"},{"type":"SkyBridge Capital","content":"ORGANIZATION"},{"type":"Nicolas Roos","content":"PERSON"},{"type":"Nishad Singh","content":"PERSON"},{"type":"Fried","content":"ORGANIZATION"},{"type":"December 2021","content":"DATE"},{"type":"Katy Perry","content":"PERSON"},{"type":"Sept. 26","content":"DATE"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Zack Abrams","Anna Baydakova","The Block"]}