{"summary":"As Russia&#x27;s crypto mining industry takes off, oil producers want to get in on the action by mining using wasted flare gas.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/121487\/russian-oil-industry-asks-regulators-to-let-them-mine-crypto-using-wasted-flare-gas","publishDate":"2021-10-20T11:05:17","id":7419,"type":null,"title":"Russian oil industry asks regulators to allow crypto mining using flare gas","category":["REGULATION"],"content":["Russian regulators are considering a push from oil and gas firms, seeking authorization to mine cryptocurrencies using natural gas that is otherwise wasted in oil drilling.","Per an October 20 <a href=\"https:\/\/www.kommersant.ru\/doc\/5040338\" data-v-f87c67ca=\"\">report<\/a> from business outlet Kommersant, the Russian Central Bank, Ministry of Industry and Trade and Ministry of Digital Development are discussing authorization for oil industry players who want to use wasted natural gas to power data centers for crypto mining.","\"Associated petroleum gas\" is natural gas that lies on top of oil reserves. That gas is often not profitable to extract and ship, meaning that oil drilling often burns it off — a process known as gas flaring that results in the continuously burning flames that accompany oil rigs. Those flares produce greenhouse gases without any productive energy output.&nbsp;","In its reporting, Kommersant refers to a September 7 letter from Deputy Minister of Industry and Trade Vasily Shpak to colleagues at the other two agencies.","The problem is that cryptocurrency mining is unregulated in Russia, and not fully legal. Similarly, cryptocurrency by and large has been awaiting legislation. The recent expulsion of miners from China, however, has resulted in neighboring Kazakhstan and Russia occupying the <a href=\"https:\/\/www.theblockcrypto.com\/post\/120372\/us-lead-bitcoin-hash-rate-cambridge\" data-v-f87c67ca=\"\">second and third places<\/a>, respectively, in global hashrate, behind the United States. That wave puts new pressure on authorities to come to terms with the mining industry.","The interest of the Russian oil industry compounds that political pressure. The bulk of Russia's national budget comes from the export of fossil fuels. Oftentimes the barriers between the major oil firms and the government are porous.&nbsp;","Jurica Bulovic, an executive at US-based miner Foundry Digital, told The Block: \"Because bitcoin mining operations are mobile and can be deployed anywhere in the world where there is cheap energy and an internet connection, a growing trend is mining bitcoin on oil and gas wells using excess natural gas which cannot otherwise monetized and is typically flared or vented. In those situations, bitcoin mining can be viewed as flare mitigation technology.\"","While the redirection of gas from flaring to crypto mining does not eliminate emissions, it at least finds a use for open flames that otherwise produce nothing. Indeed the mobility of miners and their willingness to relocate to sources of energy that cannot be transported is a commonly cited defense against <a href=\"https:\/\/www.theblockcrypto.com\/post\/102621\/bitcoin-carbon-footprint-academic-paper\" data-v-f87c67ca=\"\">frequent attacks on the Bitcoin network's energy use<\/a>.&nbsp;","Nonetheless, cryptocurrency miners relocating to unused sources of electricity is a controversial practice, especially for environmentalists. In the U.S., upstate New York has seen old power plants restarted and crypto miners setting up shop in the shadow of nuclear facilities, provoking significant blowback from <a href=\"https:\/\/www.theblockcrypto.com\/news+\/108098\/energy-politics-are-shaping-americas-growing-bitcoin-mining-sector-heres-how\" data-v-f87c67ca=\"\">lawmakers at the state and federal levels<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"September 7","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"October 20","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Vasily Shpak","content":"PERSON"},{"type":"Kazakhstan","content":"LOCATION"},{"type":"Russian Central Bank, Ministry of Industry and Trade and Ministry of Digital Development","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Kommersant","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"Deputy Minister of Industry","content":"ORGANIZATION"},{"type":"miner Foundry Digital","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Kollen Post","The Block"]}