{"summary":"A developer accidentally locking up $9,000 of ether for 100 years caused their test token to pump in price. Observers are skeptical.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242923\/developer-accidentally-locks-up-ether","publishDate":"2023-08-03T07:23:06","id":742,"type":null,"title":"Developer ‘accidentally’ locks up $9,000 of ether for 100 years. Critics say it was deliberate","category":["CRYPTO ECOSYSTEMS"],"content":["A developer workshopping their first test token on forum 4chan accidentally locked up five ether (currently worth around $9,000) for 100 years thinking they were using testing funds on the Ethereum testnet, according to their messages.&nbsp;","As this bizarre story <a href=\"https:\/\/twitter.com\/RyuSSX\/status\/1686481433022631936\" data-v-f87c67ca=\"\">spread<\/a> across the crypto space, the test token <a href=\"https:\/\/www.geckoterminal.com\/eth\/pools\/0x4763784c16adbccb8fe42a8a7bae43f3bd848eee?utm_source=coingecko&amp;utm_medium=referral&amp;utm_campaign=searchresults\" data-v-f87c67ca=\"\">shot up<\/a> to a $6 million market cap, before falling by 70%.&nbsp;","Critics, however, say the whole thing seems a bit suspicious.","“It's 4chan. The whole damn thing is probably a larp,” <a href=\"https:\/\/twitter.com\/TheWeb3_Guy\/status\/1686694494341636097\" data-v-f87c67ca=\"\">said<\/a> one commentator on Twitter.","It started when the developer created a <a href=\"https:\/\/warosu.org\/biz\/thread\/55721303#p55722213\" data-v-f87c67ca=\"\">post<\/a> asking for help with creating their first test ERC-20 token and locking it up. Shortly after this post, they created a <a href=\"https:\/\/etherscan.io\/address\/0x807534B396919783B7e30383Fe57D857BC084338\" data-v-f87c67ca=\"\">token<\/a> called test (TEST) on the Ethereum mainnet.","One 4chan user replied on the latter point, suggesting the use of UNCX Network, a protocol for locking up liquidity tokens.&nbsp;","Following the suggestion, the developer <a href=\"https:\/\/etherscan.io\/tx\/0xb16ac7acb7d14fd5c2199d6e9ebd2d7dcdad562a1714e24b0ceceebcabd73fcb\" data-v-f87c67ca=\"\">added<\/a> five ether and 1 billion test tokens as liquidity on the decentralized exchange protocol Uniswap, receiving 70,700 liquidity provider or LP tokens in return. These LP tokens can be redeemed for the underlying liquidity.&nbsp;","The developer then <a href=\"https:\/\/etherscan.io\/tx\/0xd023499b7dddbcdbfcfc904ecfccb523797eac50763de9ef75f46027903cb323\" data-v-f87c67ca=\"\">locked up<\/a> these LP tokens using the UNCX Network protocol. They set the lock up period to last until December 31, 2123. As a result, the tokens can no longer be accessed until that date, and therefore can't be used to redeem the original ether and test tokens locked in liquidity on Uniswap.","After making the transactions — judging by timestamps on the blockchain transactions and on 4chan — the developer then replied that they “will get uncx.” Three minutes after this reply, they followed up saying that they had done so (without doing anything new), before asking how to unlock the tokens. They clarified that they had locked up the ether for 100 years, claiming it was on the Ethereum testnet with a link to the token.","This led another user to reply, “That’s not testnet ser” — meaning the developer had locked up real funds for a decade.","Following this engagement, screenshots of the conversation were spread across Twitter. Some users argued that the lockup meant the developer couldn’t rug the project —&nbsp;as happens regularly and as recently as the <a href=\"https:\/\/www.theblock.co\/post\/242503\/bald-memecoin-has-potential-ties-with-alameda-research-wintermute-researcher-finds\" data-v-f87c67ca=\"\">Bald token<\/a> on Base —&nbsp;and was a bullish sign. Others simply jumped on the meme.&nbsp;","In response, the test token jumped in price. Data from GeckoTerminal shows that it had an initial pump before rising as high as $0.006 in price, with a $6 million market cap. Its price has slid since then, falling to just $0.0014 with a $1.5 million market cap.&nbsp;","There has been widespread skepticism that the whole thing was forced. Multiple commentators on Twitter suggested that it was all a deliberate ploy to get attention. Even on the 4chan post itself, two people weighed in proclaiming it was a “manufactured shill by crypto personalities, just like $bald” and that this was a larp.","Others asked Twitter to remind them of this&nbsp;— in 100 years’ time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"70%","content":"PERCENT"},{"type":"LP","content":"ORGANIZATION"},{"type":"1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"December 31, 2123","content":"DATE"},{"type":"20","content":"DATE"},{"type":"$0.0014","content":"MONEY"},{"type":"$bald","content":"MONEY"},{"type":"$9,000","content":"MONEY"},{"type":"UNCX Network","content":"ORGANIZATION"},{"type":"$6 million","content":"MONEY"},{"type":"$0.006","content":"MONEY"}],"hashtag":["ETHEREUM","SMART CONTRACTS"],"authors":["Tim Copeland","The Block"]}