{"summary":"Bitcoin node software provider Umbrel is expanding the type of apps on its platform — plus fixing two of its biggest issues.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113763\/node-software-startup-umbrel-plots-ambitious-offerings-beyond-bitcoin","publishDate":"2021-08-06T11:41:25","id":7420,"type":null,"title":"Node software startup Umbrel plots ambitious offerings beyond bitcoin","category":["BITCOIN"],"content":["Bitcoin software node provider Umbrel has released a new version of its app to expand it beyond bitcoin and even blockchain services in general.","With Version 4, Umbrel's app store has added 10 apps that provide various services, such as storing passwords, blocking ads and streaming torrents.","Umbrel is a commonly used software for <a href=\"https:\/\/www.theblockcrypto.com\/post\/108770\/how-to-run-a-bitcoin-lightning-node-on-a-raspberry-pi-and-connect-it-to-your-phone\" data-v-f87c67ca=\"\">running a bitcoin lightning node<\/a> on a Raspberry Pi. It means users can run their own node without using up space on their main computer while leaving the Pi on permanently if they so wish. Until the latest upgrade it offered a few bitcoin-related apps, including support for running a block explorer using data from the node and lightning-dedicated apps.","The types of non-bitcoin apps now available on Umbrel are not new to Raspberry Pis; they have typically been apps that developers would install directly on their Pis if they wanted it to perform a certain task, such as blocking ads.","What's different is that once installed, Umbrel provides a much more user-friendly way for anyone to download these services and access them through the Umbrel interface. This makes them more accessible to a wider audience.","The apps include Pi-hole, for blocking ads, SimpleTorrent, for streaming torrents and Matrix, if you want to run your own messaging server.","Someone can also access their own Umbrel node through the Tor browser. This provides a secure link from their phone or another computer wherever they are. This can currently be used for making bitcoin lightning payments (with bitcoin stored on the Umbrel) when someone is out and about — instant payments, in a non-custodial fashion.","But this service will also work for the new apps. For example, the new apps include PhotoPrism, an app for storing photos and videos. Using Tor means the user can access this media from their phone.","There have been a few criticisms of Umbrel since it started gaining popularity.","One is that Umbrel had a restrictive license that didn't allow developers to modify its code and resell it for commercial reasons. The company is now adopting a new license, PolyForm Noncommercial License 1.0.0, which allows for modifications as long as the software is not then sold commercially.","Umbrel said: \"TL;DR — if you don’t intend to sell Umbrel, our new license grants you the same freedoms that come with an open source license.\"","The second is that Umbrel gets to dictate the bitcoin software that the service supports, meaning there's less choice for users. In the <a href=\"https:\/\/blog.getumbrel.com\/introducing-umbrel-v0-4-e5b67d02c43a\" data-v-f87c67ca=\"\">blog post<\/a> announcing the new upgrade, Umbrel said that it plans to turn the current bitcoin offering into its own app so that users opt into using it.","It also wants to let other developers create alternative bitcoin apps, so that Umbrel users can choose from a range of options.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"PolyForm Noncommercial License","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Umbrel","content":"ORGANIZATION"},{"type":"Umbrel","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["Tim Copeland","The Block"]}