{"summary":"This article was written by Dan Held of The Picks &amp;amp; Shovels, Co. and originally appeared on the company&#x27;s Medium blog. It is republished in its","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/1535\/proof-of-work-is-efficient","publishDate":"2018-10-10T12:16:35","id":7426,"type":null,"title":"Proof-of-work is efficient","category":["MINING"],"content":["<em data-v-f87c67ca=\"\">This article was written by Dan Held of The Picks &amp; Shovels, Co. and originally appeared on the company's <a href=\"https:\/\/blog.picks.co\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Medium blog<\/a>. It is republished in its entirety by The Block with Dan's permission. For more of Dan's thoughts, you can follow him on Twitter at <a href=\"https:\/\/twitter.com\/danheld?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@danheld<\/a>.<\/em>","Most people think #Bitcoin’s PoW is “wasteful.” In this article, I explore how everything is energy, money is energy, energy usage is subjective, and PoW’s energy costs relative to existing governance systems.* This article is a collection of direct thoughts from many individuals in the space — my value add was in the aggregation, distillation, and combination of narratives.","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">*I’d like to caveat that I’m not saying the current implementation of PoW is perfect, nor that it won’t be replaced by a more optimal PoW\/PoS<\/em>","The idea of “work” being energy started when the French Mathematician&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/en.wikipedia.org\/wiki\/Gaspard-Gustave_de_Coriolis\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/en.wikipedia.org\/wiki\/Gaspard-Gustave_de_Coriolis\" data-v-f87c67ca=\"\">Gaspard-Gustave de Coriolis<\/a>&nbsp;introduced the idea of energy being “work done.” A long time ago, the work done in the economy was entirely human. That work was powered by food.","About a million years ago, humans stumbled across fire. As a result, the energy available to us increased because now we could keep warm not just from what we ate but also from burning. So this added energy usage improved our standard of living.","Some thousands of years ago, our energy usage increased still further when we domesticated animals. Animals could labor in our place. Those new laborers also had to be fed. Large amounts of food were required to meet the energy demand, and our prosperity increased alongside.","In the last few hundred years, we built great machines. Those mechanized machines produced work, first from sources like water &amp; wind, and then the cheaper sources like coal and gas, and now from nuclear sources (fission\/fusion). Both machines and nature produce work through the utilization of energy. We have an economy based not on money, but on work and energy.","All things in our lives are closely linked to the price of energy. Purifying water requires energy. Transporting products requires energy. Manufacturing products requires energy. Cooking requires energy. Refrigerators and freezers require energy. In a free market, the cost of any good largely reflects the energy used in producing that good. Because free markets encourage the lowest priced goods, the energy used in producing any good is minimized. Money, which is the representation of the work required to generate goods and services, can also be viewed as stored energy.","&nbsp;","In the early 20th century, industry leaders like Henry Ford and Thomas Edison were interested in replacing gold or the dollar with “the energy dollar” or “units of energy” (commodity\/energy currency). The concept was popular due to its sound money characteristics, including: a well-defined unit of account, easy measurement\/not easily counterfeited, divisibility into smaller units, and fungibility (that these units would be equivalent to any other unit). However, energy money was flawed — it could not be transmitted or stored easily.","Fast forward to October 31, 2008 — Satoshi publishes the Bitcoin whitepaper. Bitcoin’s Proof of Work (PoW) was originally invented as a&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/en.m.wikipedia.org\/wiki\/Proof-of-work_system\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/en.m.wikipedia.org\/wiki\/Proof-of-work_system\" data-v-f87c67ca=\"\">measure against email spam<\/a>. Only later did Satoshi adapt it to be used in digital cash. What PoW mining does under the hood, is use dedicated machines (ASICs) to convert electricity into Bitcoins (via block reward). The machine repeatedly performs hash operations (guesses\/votes) until it solves a cryptographic puzzle and receives Bitcoins (block reward). The solution to the puzzle proves that the miner spent energy in the form of ASICs and electricity, a proof that a miner put in work. Bitcoin has a&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"http:\/\/www.truthcoin.info\/blog\/pow-cheapest\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"http:\/\/www.truthcoin.info\/blog\/pow-cheapest\/\" data-v-f87c67ca=\"\">capitalistic<\/a>&nbsp;voting mechanism, “money risked, votes gained” through the energy\/ASICs used to generate hashes (votes). — <a class=\"markup--user markup--p-user\" href=\"https:\/\/medium.com\/@hugonguyen\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/medium.com\/@hugonguyen\" data-anchor-type=\"2\" data-user-id=\"3efc6d31e61c\" data-action-value=\"3efc6d31e61c\" data-action=\"show-user-card\" data-action-type=\"hover\" data-v-f87c67ca=\"\">Hugo Nguyen<\/a>","When Satoshi designed PoW, he was fundamentally changing how consensus between humans is formed from political votes to apolitical votes (hashes) via the conversion of energy. PoW is proof of burn, or the validation that energy was burnt. Why is that important? It’s the most simplistic and fair way for the physical world to validate something in the digital world. PoW is about physics, not code. Bitcoin is a super commodity, minted from energy, the fundamental&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/mitpress.mit.edu\/books\/energy-and-civilization\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/mitpress.mit.edu\/books\/energy-and-civilization\" data-v-f87c67ca=\"\">commodity<\/a>&nbsp;of the universe. PoW transmutes electricity into digital gold.","The Bitcoin ledger can only be immutable if and only if it is costly to produce. The fact that Proof of Work (PoW) is “costly” is a feature, not a bug. Until very recently, securing something meant building a thick physical wall around whatever is deemed valuable. The new world of cryptocurrency is unintuitive and weird — there are no physical walls to protect our money, no doors to access our vaults. Bitcoin’s public ledger is secured by its collective hashing power: the sum of all energy&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/@dergigi\/bitcoins-energy-consumption-6dd7d7a2e463\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/medium.com\/@dergigi\/bitcoins-energy-consumption-6dd7d7a2e463\" data-v-f87c67ca=\"\">expended<\/a>&nbsp;to build the wall. And through its transparent costly design, it would take an equivalent amount of energy to tear it down (<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/unenumerated.blogspot.com\/2008\/08\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"http:\/\/unenumerated.blogspot.com\/2008\/08\/\" data-v-f87c67ca=\"\">unforgeable costliness<\/a>).","The cryptopocalypse is coming — Bitcoin’s (PoW) is so bad that it’s going to destroy the world in 2020! You may have noticed that most of the “doomsday” articles were based on the results of an analysis provided by Alex De Vries, a “financial economist and blockchain specialist” working for PWC Netherlands and author of the site&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/digiconomist.net\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/digiconomist.net\/\" data-v-f87c67ca=\"\">Digiconomist<\/a>. His estimation has already received a fair share of criticism due to its poor energy consumption calculation. But the KPI of his choosing was intentionally misleading: “the electricity consumption per transaction” for several reasons:","Now that we know what the right KPI is for ROI on energy consumption, let’s take a look at how energy costs are trending for Bitcoin’s PoW.","The rate of ASIC efficiency improvement is slowing. As efficiency gains slow we can expect an increase in manufacturer competition as margins narrow.","All-in mining cost will shift from the upfront accessibility cost of ASIC hardware (capex) to the ongoing energy costs to operate (opex). Since the physical location of mining centers is not important to the Bitcoin network (they are movable), miners flock to areas generating surplus electricity for the lowest marginal costs. In the long-run, this has the potential to produce more efficient worldwide energy markets with Bitcoin miners performing an arbitrage of electricity between global centers. The cost of Bitcoin mining becomes the lowest (excess) value of electricity. This may solve a problem with renewable energy sources that have predictable capacity that is otherwise wasted, like hydro and&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/nodeblockchain\/bitcoin-energy-b230a9d7dd5d\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/medium.com\/nodeblockchain\/bitcoin-energy-b230a9d7dd5d\" data-v-f87c67ca=\"\">flared methane<\/a>.&nbsp;<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"f5c4fc7774a0\" data-v-f87c67ca=\"\">In the future, Bitcoin mining could help with renewable energy sources that have variable output — energy producers can plug in miners, and store the excess power as bitcoin.<\/span>","Aluminum was a popular means of “<a class=\"markup--anchor markup--p-anchor\" href=\"http:\/\/articles.latimes.com\/2011\/mar\/26\/business\/la-fi-iceland-economy-20110326\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"http:\/\/articles.latimes.com\/2011\/mar\/26\/business\/la-fi-iceland-economy-20110326\" data-v-f87c67ca=\"\">exporting<\/a>” electricity from a country with abundant renewable energy resources that are stranded (ex: Iceland). Smelting bauxite (aka aluminum ore) has huge energy requirements, and converting that into aluminum is a one way function (just like a hash). The same concerns around “unfair” energy consumption existed for aluminum nearly 40 years ago — <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.washingtonpost.com\/archive\/politics\/1979\/10\/29\/aluminum-industry-at-center-of-northwests-energy-fight\/62fdb02f-ad72-4685-a450-490e12a58059\/?noredirect=on&amp;utm_term=.126a3788a2a4\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.washingtonpost.com\/archive\/politics\/1979\/10\/29\/aluminum-industry-at-center-of-northwests-energy-fight\/62fdb02f-ad72-4685-a450-490e12a58059\/?noredirect=on&amp;utm_term=.126a3788a2a4\" data-v-f87c67ca=\"\">1979<\/a>&nbsp;(including concerns of centralization). All of these companies constantly scoured the planet for cheap power and other concessions. As aluminum manufacturing matured over the decades, the kWh per Kg of aluminum produced became more efficient.","<span class=\"markup--quote markup--p-quote is-me is-other\" data-creator-ids=\"anon 56f89f949263\" data-v-f87c67ca=\"\">Bitcoin’s PoW is the buyer of last resort for all electricity, creating a floor that incentivizes the building of new energy producing plants around disparate energy sources that would have otherwise been left untapped.<\/span>","Some complain that Bitcoin mining doesn’t accomplish “anything useful” like finding&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/en.wikipedia.org\/wiki\/Primecoin\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/en.wikipedia.org\/wiki\/Primecoin\" data-v-f87c67ca=\"\">prime numbers<\/a>.<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">&nbsp;<\/em>While introducing a secondary reward for doing the work might seem like a virtuous idea, it actually&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/youtu.be\/ZDGliHwstM8?t=490\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/youtu.be\/ZDGliHwstM8?t=490\" data-v-f87c67ca=\"\">introduces a security risk<\/a>. Splitting the reward can lead to a situation where “it’s more worthwhile to do the secondary function than it is to do the primary function.” Even if the secondary function was innocuous (a heater), instead of an expected $100 per x hashes, we’d move to $100 + $5 of heat per x hashes. The “Mining Heater” is just another increase in hardware-efficiency, resulting in a higher difficulty and an increase in (energy used\/block). Luckily, Bitcoin will never have this problem as its security is guaranteed by the purity of its proof-of-work algorithm.","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Note: Bitcoin is already doing something immensely useful for society (mining wouldn’t be profitable if it wasn’t), and it isn’t rational to ask miners to perform a function that is altruistic without incentives.<\/em>","Everything requires energy (first law of thermodynamics). Claiming that one usage of energy is more or less wasteful than another is completely subjective since all users have paid market rate to utilize that electricity.","In thermodynamics, the universe is the ultimate closed system. Bitcoin’s utilization of the excess electrical capacity consumes magnitudes less electricity than existing fiat systems which not only have power requirements banking infrastructure, but the military and political machina. The energy tradeoff for the utilization of that electricity to secure the financial system backbone is a “net positive” outcome. Below I make a rough comparison to the existing financial, military, and political systems (notes are at the bottom of the article)","In the hunt for cheap energy sources, we will unlock greater economic abundance in the real world. Bitcoin, through the harnessing of these new or disparate energy sources, not only moves us forward to a Kardeshev Type I economy but may bring us closer to a Kardeshev Type I energy civilization (We’re ~0.72 on the Kardashev Scale). With Bitcoin mining as an incentive, it may shrink the time we get to T1 from 200 years to less than a few decades. After reaching Type I status, there is less of a need to restrict the growth of energy consumption, which increases the standard of living for everyone.","&nbsp;","The pressure to find cheap electricity sources will accelerate the effort to build fusion reactors. Nature is showing the way, powering the whole universe with nuclear fusion (stars). Humans are in the process of emulating nature by building fusion reactors. It is estimated that it will take ~$80B in research over decades to finally unlock nuclear fusion. The fuel for fusion (primarily deuterium) exists abundantly in the Earth’s ocean which could potentially supply the world’s energy needs for millions of years. Fusion power has many of the benefits of renewable energy sources, such as being a long-term energy supply and emitting no greenhouse gases or air pollution. Fusion could provide very high power-generation density and uninterrupted power delivery. Another aspect of fusion energy is that the cost of production does not suffer from&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/en.wikipedia.org\/wiki\/Diseconomies_of_scale\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/en.wikipedia.org\/wiki\/Diseconomies_of_scale\" data-v-f87c67ca=\"\">diseconomies of scale<\/a>. The cost of water and wind energy, for example, goes up as the optimal locations are developed first, while further generators must be sited in less ideal conditions. With fusion energy, the production cost will not increase much even if large numbers of stations are built, because the raw resource (seawater) is abundant and widespread.","Fusion power and other cheaper energy sources will solve major problems for humanity like&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/en.wikipedia.org\/wiki\/Water_resources\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/en.wikipedia.org\/wiki\/Water_resources\" data-v-f87c67ca=\"\">fresh water shortages<\/a>. We are surrounded by seawater, but desalination stations, which remove salt from the seawater, require large amounts of energy. Costs of desalinating seawater are currently higher than freshwater, groundwater, water recycling, and water conservation.","Humankind’s will to explore, up the mountains, down to the sea floors, to the heart of the atom, to the very fabric of space-time; to grow, not be stifled by a limit to energy. We will reach for the stars.","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Is the trustless&nbsp;<\/strong><a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/twitter.com\/nic__carter\/status\/1028698889153593344\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/twitter.com\/nic__carter\/status\/1028698889153593344\" data-v-f87c67ca=\"\"><strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">settlement<\/strong><\/a><strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">&nbsp;of $1.34T between counterparties annually with the added benefit of cheaper energy for all, worth the $4.5B in current mining costs? I think the answer is a resounding yes.<\/strong>","Notes:","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Earth","content":"LOCATION"},{"type":"Dan","content":"PERSON"},{"type":"early 20th century","content":"DATE"},{"type":"KPI","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"1979","content":"DATE"},{"type":"Satoshi","content":"PERSON"},{"type":"Dan Held of The Picks &amp; Shovels, Co.","content":"ORGANIZATION"},{"type":"Gaspard","content":"PERSON"},{"type":"$4.5","content":"MONEY"},{"type":"Gustave de Coriolis","content":"PERSON"},{"type":"October 31, 2008","content":"DATE"},{"type":"Hugo Nguyen","content":"PERSON"},{"type":"Thomas Edison","content":"PERSON"},{"type":"Alex De Vries","content":"PERSON"},{"type":"PWC Netherlands","content":"ORGANIZATION"},{"type":"$80B","content":"MONEY"},{"type":"Henry Ford","content":"ORGANIZATION"},{"type":"Iceland","content":"LOCATION"},{"type":"$1.34","content":"MONEY"},{"type":"$100","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"$100 + $5","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Contributor Network","The Block"]}