{"summary":"Crypto bank SEBA has partnered with Tokensoft International AG to offer asset tokenization solutions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64685\/crypto-bank-seba-teams-up-with-tokensoft-to-offer-asset-tokenization-solutions","publishDate":"2020-05-11T08:20:34","id":7435,"type":null,"title":"Crypto bank SEBA teams up with Tokensoft to offer asset tokenization solutions","category":["CRYPTOCURRENCY"],"content":["Crypto bank SEBA is set to offer asset tokenization solutions later this year.","The bank has partnered with Tokensoft International AG, a distributor of U.S.-based Tokensoft Inc., for the initiative.","“Our core solutions are ready and in the final testing phase. We plan to be fully live from the second half of this year,” Matthew Alexander, head of asset tokenization at SEBA, told The Block.","Once live, SEBA's tokenization solutions would help its clients to issue and manage financial assets on multiple blockchain protocols, per the bank's website.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Today, only piecemeal solutions are available on the market. We will provide clients end-to-end solutions that cover the entire tokenization value chain, from issuance to asset management and digital custody with the highest possible regulatory standards,\" Alexander told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSEBA currently offers crypto trading, custody, and structured products.","Giving details of these divisions, Alexander said, \"We are ramping up very nicely and serve clients in over 10 markets,\" adding that clients range from small and medium enterprises to large-scale international institutions with \"very significant and scalable tokenization ideas.\"","SEBA plans to help its clients tokenize fiat, precious metals and alternative assets such as real estate and art, as well as help conduct security token offerings (debt or equity), per the website.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe bank also plans to expand its services into Asia and the UAE next year, said Alexander.&nbsp;","Switzerland-based SEBA was launched last November after raising over $100 million in 2018. Earlier this year, the bank was looking to raise an additional $100 million but now appears to be in no rush.","\"An additional raise was and still is planned from inception to fuel our balance sheet for our client business and capital-intensive products and to grow into new markets. The interest of new potential investors is still high, but we are in no hurry.\" Alexander told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSEBA currently employs 90 people and is looking to hire more people, said Alexander.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"SEBA","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"second half of this year","content":"DATE"},{"type":"Today","content":"DATE"},{"type":"Switzerland","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"Alexander","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"Matthew Alexander","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Tokensoft Inc.","content":"ORGANIZATION"},{"type":"Tokensoft International AG","content":"ORGANIZATION"},{"type":"UAE","content":"ORGANIZATION"}],"hashtag":["TOKENIZATION"],"authors":["Yogita Khatri","The Block"]}