{"summary":"After a chaotic year for crypto, BNB Chain is looking to be competitive in 2023.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208772\/bnb-chain-looking-to-grow-remain-competitive-in-2023-messari","publishDate":"2023-02-05T15:17:42","id":7438,"type":null,"title":"BNB Chain looking to grow, remain competitive in 2023: Messari","category":["CRYPTO ECOSYSTEMS"],"content":["BNB Chain is aiming to be competitive in 2023, following a tumultuous year for crypto markets, Messari said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The blockchain network will focus on growth strategies and new tech developments, including scaling solutions and boosting throughput, along with implementing Ethereum Virtual Machine execution, according to a <a href=\"https:\/\/messari.io\/report\/state-of-bnb-chain-q4-2022?utm_source=twitter_messaricrypto&amp;utm_medium=organic_social&amp;utm_campaign=state_of_bnb_q4_2022\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">Messari report<\/span><\/a>.","“The team plans to expand the network with L2-like solutions, such as ZK-rollups and sidechains, and to increase decentralization by open-sourcing the validator set,” the report said. “Despite several challenges along the way, BNB Chain successfully executed its 2022 roadmap ... After a dramatic year with many challenges, BNB Chain looks to remain competitive heading into 2023.\"","Daily active addresses on the blockchain network rose in 2022, while average daily transactions remained steady at approximately 3.4 million per day. Staking and decentralization on the network also improved.","BNB Chain did face challenges in the fourth quarter, though, including an October exploit. A hacker minted and took 2 million BNB, worth nearly $570 million at the time. Although no users were affected by the hack, roughly $100 million was moved off-chain and was not recovered.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BNB","content":"ORGANIZATION"},{"type":"Messari","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$570 million","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"the fourth quarter","content":"DATE"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}