{"summary":"Lido Finance has upgraded to version 2, enabling users to withdraw ether from the platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230811\/lido-finance-ethereum-withdrawals-upgrade","publishDate":"2023-05-15T13:15:10","id":7440,"type":null,"title":"Lido Finance passes vote to activate withdrawals on Ethereum","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">The largest liquid staking protocol on Ethereum, Lido Finance, has upgraded to version 2 — a critical change that enables users to withdraw ether from the platform.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The move to version 2 was passed through an on-chain vote with community members deliberating over the proposal. The <a href=\"https:\/\/vote.lido.fi\/vote\/156\" data-v-f87c67ca=\"\">governance vote<\/a> number 156, initiated on May 12, was ratified today on the Aragon platform.<\/span>","<span data-v-f87c67ca=\"\">The vote to approve upgrade finalized at 1:15 pm ET today. The upgrade comes hot on the heels of the <a href=\"https:\/\/www.theblock.co\/post\/226036\/ethereum-shapella-upgrade-goes-live\" data-v-f87c67ca=\"\">Shapella hard fork<\/a> last month that allowed staking validators to withdraw ether. Lido required an extra month to facilitate withdrawals due to multiple security audits.<\/span>","<span data-v-f87c67ca=\"\">Lido V2's pivotal feature enables liquid staking users — holders of staked ether (stETH) — to withdraw to ETH from Lido at a 1:1 ratio. This development streamlines the process for individuals to enter and exit Ethereum's liquid staking. <\/span>","<span data-v-f87c67ca=\"\">Staked ether is a derivative of ether (ETH) provided by Lido Finance. When users deposit ETH, the protocol returns staked ether (stETH), a token that unlocks the underlying capital, making it reusable as collateral in other DeFi projects. As it stands, over 6.1 million ether (ETH), valued at approximately <a href=\"https:\/\/www.theblock.co\/post\/226879\/lido-deposits-surpass-12-billion-as-ethereums-shapella-boosts-liquid-staking\" data-v-f87c67ca=\"\">$12 billion<\/a>, is staked on Ethereum via Lido.<\/span>","<span data-v-f87c67ca=\"\">Starting today, stETH holders can initiate a withdrawal request. After the requests are made, an oracle will ascertain which Lido operators need exit validator nodes to meet this request. Lido operators will then request a validator exit, submitted to a consensus node on the Ethereum mainnet. Once the specified validators have exited, stETH holders can claim their ETH.<\/span>","“The launch of Lido V2 represents an architectural evolution of the Lido protocol, ushering in both the ability for stETH holders to natively unstake their stETH in-protocol for ETH,\" said Isidoros Passadis, Lido DAO contributor and Master of Validators. \"Simple, accessible, and timely withdrawals are a core part of a full-fledged staking product.\"","At first, Lido would help process quicker individual withdrawals from a \"withdrawals vault\" that holds ETH. With the Lido V2 upgrade, there is about 270,000 ETH ($490 million) in the vault will be readily available to fulfill withdrawal requests, which avoids a lengthy process of exiting validators.","<span data-v-f87c67ca=\"\">The new version of the Lido protocol is also set to introduce a feature known as the Staking Router that offers to bring modular infrastructure for liquid staking. <\/span>","<span data-v-f87c67ca=\"\">The Staking Router enables new types of node operators on Lido, ranging from solo stakers to DAOs that may run validators either independently or in collaboration through infrastructure like Distributed Validator Technology (DVT). <\/span><span data-v-f87c67ca=\"\">The Staking Router is expected to considerably bolster the decentralization of the network.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"$490 million","content":"MONEY"},{"type":"Master of Validators","content":"ORGANIZATION"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Isidoros Passadis","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"$12 billion","content":"MONEY"},{"type":"Lido DAO","content":"PERSON"},{"type":"1:15","content":"TIME"},{"type":"oracle","content":"ORGANIZATION"},{"type":"last month","content":"DATE"},{"type":"Ethereum","content":"LOCATION"},{"type":"May 12","content":"DATE"}],"hashtag":["ETHEREUM","LIDO FINANCE","STAKING"],"authors":["Vishal Chawla","The Block"]}