{"summary":"Yuga Labs, creator of the Bored Ape Yacht Club collection, is trying to gamify the process of minting NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201354\/yuga-labs-gamifies-minting-nfts-with-dookey-dash","publishDate":"2023-01-11T22:04:26","id":7444,"type":null,"title":"Yuga Labs gamifies minting NFTs with ‘Dookey Dash’","category":["ART AND COLLECTIBLES"],"content":["Yuga Labs, creator of the Bored Ape Yacht Club collection, unveiled plans to gamify the process of minting NFTs.","The startup today <a href=\"https:\/\/twitter.com\/BoredApeYC\/status\/1613331130249256962?s=20&amp;t=lGcMCpK8CFSivI5q3ogrxQ\" data-v-f87c67ca=\"\">announced<\/a> an upcoming online game in which players must navigate a sewer to claim rewards in the form of NFTs.","From Jan. 17, players will be able to claim a free “Sewer Pass” — giving them access to a course named “Dookey Dash.” They then have until Feb. 8 to record as high a score as possible to claim power sources, the purpose of which remains unclear. These prizes will “evolve throughout 2023,” according to Yuga’s tweets.","Anyone with a sewer pass can play the game, even if they don’t own a Bored Ape NFT.","“You’ll get three weeks to play as many times as you want. Players will be rewarded based on their performance in the sewer. When the sewer closes, the leaderboard freezes. After scores are validated, eligible sewer passes will prepare for the summoning and the highest score gets the key,” Yuga said on its <a href=\"https:\/\/mdvmm.xyz\/mint-intro\" data-v-f87c67ca=\"\">website<\/a>. The “summoning” takes place on Feb. 15, a week after the game closes.","Yuga Labs is a heavyweight in the NFT market, <a href=\"https:\/\/www.theblock.co\/linked\/138834\/bored-apes-creator-yuga-labs-raises-450-million-in-round-led-by-a16z-report\" data-v-f87c67ca=\"\">valued at $4 billion<\/a> in a $450 million round led by a16z last year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jan. 17","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$450 million","content":"MONEY"},{"type":"$4 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Yuga","content":"PERSON"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Feb. 15","content":"DATE"},{"type":"Feb. 8","content":"DATE"},{"type":"Bored Ape NFT","content":"ORGANIZATION"}],"hashtag":["BAYC"],"authors":["Ryan Weeks","The Block"]}