{"summary":"Somebody took advantage of the way the APE token airdrop works to net themselves a cool $1 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/138410\/someone-borrowed-5-bored-apes-to-claim-1-1-million-of-ape-tokens","publishDate":"2022-03-18T09:49:37","id":7448,"type":null,"title":"Someone borrowed 5 Bored Apes to claim $1.1 million of APE tokens","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">Yesterday, Yuga Labs, the creators of Bored Ape Yacht Club (BAYC), airdropped ApeCoin (APE) to anyone who owns one of their NFTs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The team allocated 150 million tokens or 15% of the total ApeCoin supply to holders of Bored Ape Yacht Club and Mutant Ape Yacht Club collections, amounting to a staggering value of more than $800 million. Each BAYC holder got 10,094 tokens, valued anywhere between $80,000 to $200,000.<\/span>","<span data-v-f87c67ca=\"\">But someone found a way to claim the airdrop, using NFTs that they did not initially own. They took advantage of the specific way the airdrop works to carry it out. And it was a very effective move that netted them $1.1 million in ApeCoin.<\/span>","<span data-v-f87c67ca=\"\">The trick was that the ApeCoin airdrop was not handed out based on a snapshot of who owned which Bored Ape at a specific time in the past. Instead, it was claimable by anyone who owns a Bored Ape at the point of claiming the airdrop. So if you gave someone your Bored Ape — and you hadn’t already claimed the tokens —&nbsp;they would be able to claim your tokens.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This meant all the person had to do was get a hold of some Bored Apes that hadn’t had their tokens claimed — and they would only need to be in possession of these Apes for a brief moment to claim the airdrop. In fact, they could be handed back straight away.<\/span>","<span data-v-f87c67ca=\"\">For this maneuver, the person started by finding a vault that contained five Bored Ape NFTs, which hadn’t been used to claim the airdrop.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A vault is a way to tokenize an NFT or a set of NFTs. What happens is you take a group of NFTs, put them in the vault and you create a token. This token can then be staked to earn token rewards, or it can be sold (representing part of the value of the collection of NFTs). Anyone who owns enough of the tokens can redeem them for the underlying NFTs.<\/span>","<span data-v-f87c67ca=\"\">This <\/span><a href=\"https:\/\/opensea.io\/BAYCVault-NFTX\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">vault<\/span><\/a><span data-v-f87c67ca=\"\"> was created on a protocol called NFTX. It contained five Bored Apes: #7594, #8214, #9915, #8167, and #4755 worth about 500 ETH ($1.4 million) based on the current floor price. Since the NFTs were locked up in the vault and not controlled by any one party, nobody had used them to claim the airdrop.<\/span>","<span data-v-f87c67ca=\"\">The person wanted to unlock the NFTs to use them to claim the airdrop, but they didn’t want to buy them outright — something that would be expensive to do.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">So they used a flash loan, a tool commonly used for large DeFi hacks, to carry out this plan. Flash loans are a way to borrow large amounts of crypto at low cost, on the basis that the crypto is repaid in the same transaction in the same block (meaning that the funds are never at risk of not being repaid).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In this case, they bought a Bored Ape on NFT marketplace OpenSea for under $300,000 and used it as collateral to take out the flash loan. The flash loan was then used to purchase a large amount of the vault’s token, letting them redeem the five NFTs. The NFTs were used to claim the airdrop — all in this one, complex transaction — before all of them were then returned, the tokens sold back and the loan repaid.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In this process, they managed to claim an airdrop of 60,564 ApeCoin. They then sold these tokens on the decentralized exchange Uniswap for 399 ETH ($1.1 million). After, they sold back the original Bored Ape NFT that was used as collateral to the same NFTX vault.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Even though many social media commentators hailed the incident as an innovative arbitrage trade, security firm BlockSec disagreed. It has <\/span><a href=\"https:\/\/twitter.com\/CertiKAlert\/status\/1504565432765849602\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">labeled<\/span><\/a><span data-v-f87c67ca=\"\"> this as an attack that exploited an issue in the airdrop-claiming mechanism.<\/span>","<span data-v-f87c67ca=\"\">BlockSec told The Block that based on its <\/span><a href=\"https:\/\/blocksecteam.medium.com\/the-short-analysis-of-the-flashloan-attack-to-the-ape-airdrop-490a7d6a1479\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">analysis<\/span><\/a><span data-v-f87c67ca=\"\">, the user likely took advantage of a “vulnerability” in yesterday's airdrop event.<\/span>","<span data-v-f87c67ca=\"\">\"We think it's an attack as the airdrop mechanism has a vulnerability. The airdrop claim depended on the spot state, whether a user held the NFT at that time of claim and the attacker exploited this vulnerability to profit,\" a spokesperson from BlockSec said.<\/span>","<span data-v-f87c67ca=\"\">One way this could have been avoided is if the airdrop had taken into account how long a person owned the NFT before the reward could be claimed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Since Yuga Labs did not take a snapshot — a method that’s common for most airdrops — it meant that anyone could buy the NFT in real time to claim it. This is likely the primary reason why the BAYC sales <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/138309\/bored-ape-nft-volumes-spike-after-apecoin-launch\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">spiked<\/span><\/a><span data-v-f87c67ca=\"\"> so soon after the airdrop announcement.<\/span>","<span data-v-f87c67ca=\"\"><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"9915","content":"DATE"},{"type":"Yuga Labs","content":"PERSON"},{"type":"4755","content":"DATE"},{"type":"Bored Ape","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"BlockSec","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"8214","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"$80,000","content":"MONEY"},{"type":"#7594","content":"DATE"},{"type":"Bored Ape NFT","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1.1 million","content":"MONEY"},{"type":"$200,000","content":"MONEY"},{"type":"15%","content":"PERCENT"},{"type":"$300,000","content":"MONEY"},{"type":"8167","content":"DATE"},{"type":"$1.4 million","content":"MONEY"},{"type":"$800 million","content":"MONEY"}],"hashtag":["AIRDROP"],"authors":["Vishal Chawla","The Block"]}