{"summary":"El Salvador will apparently build a pet hospital with funds from a $4 million surplus related to bitcoin’s rising value.\nThe country’s president, Nayib Bukele, explained the details in a series of tweets on Oct. 9.","author":["Kristin Majcher","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119994\/el-salvadors-president-tweets-plan-to-use-bitcoin-profits-to-build-an-animal-hospital","publishDate":"2021-10-10T11:06:07","id":745,"type":null,"title":"El Salvador&#x27;s president says it will use bitcoin surplus to build a pet hospital","category":["Bitcoin"],"content":["<span data-v-f87c67ca=\"\">El Salvador will use part of its $4 million in bitcoin profits to build a modern-looking pet hospital, its president Nayib Bukele explained Saturday in a <a href=\"https:\/\/twitter.com\/nayibbukele\/status\/1446936617575387140\" data-v-f87c67ca=\"\">series of tweets<\/a>.<\/span>","<span data-v-f87c67ca=\"\">Bukele said the trust El Salvador created to help make Bitcoin legal tender now has a surplus due to the cryptocurrency gaining value. El Salvador’s lawmakers approved the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/116200\/el-salvador-approves-150-million-trust-fund-to-support-bitcoin-ambitions\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$150 million fund<\/span><\/a><span data-v-f87c67ca=\"\"> before Bitcoin officially became legal currency on Sept. 7, and the country has also purchased a total of <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/118055\/el-salvador-bitcoin-btc-buy-150-more\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">700 bitcoins<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bukele wrote a series of tweets on Oct. 9 explaining how the trust works, and why it has a surplus. The president said that the amount of funds in this trust, known as FIDEBITCOIN, is established in dollars by law. The trust’s balance sheet includes both dollars and bitcoin. Chivo, the state company that operates the trust, must settle that amount in dollars to El Salvador’s development bank Bandesal. Chivo is also the name of the <a href=\"https:\/\/www.theblockcrypto.com\/news+\/118348\/a-whos-who-behind-el-salvadors-chivo-bitcoin-wallet-project\" data-v-f87c67ca=\"\">commission-free wallet app<\/a> that Salvadorans are using to send remittances and make digital payments to businesses, both in dollars and bitcoin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Bukele, the trust now has a $4 million surplus. Chivo can get rid of those millions without affecting the total amount in the trust, which keeps the same quantity of bitcoin even when the U.S. dollar amount goes down.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“By the way, we’re not selling any BTC, [we are] using the USD part of the trust, since the BTC part is now worth more than when the trust was established,” Bukele followed up in an English-language tweet. He also added that the value of the pet hospital “will probably appreciate in relation to USD.”<\/span>","<span data-v-f87c67ca=\"\">One of Bukele’s tweets shows a video montage with renderings of the pet hospital, which has an exterior sign reading “Chivo Pets\" and the words \"Veterinary Hospital\" in Spanish. Along with standard offices, the facility would be decked out with areas to handle emergency vet appointments, operations, rehabilitation and grooming, in addition to having a<\/span><span data-v-f87c67ca=\"\">&nbsp;laboratory, classrooms, an auditorium and coworking space.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bitcoin’s <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/119651\/bitcoins-market-cap-is-back-above-1-trillion\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">market capitalization<\/span><\/a><span data-v-f87c67ca=\"\"> recently broke $1 trillion for the first time since May.&nbsp;<\/span>"],"hashtag":["BITCOIN"]}