{"summary":"YouTuber Logan Paul says he traveled 84,000 miles in 99 days to take the photographs for his latest collection, 99 Originals.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141740\/logan-paul-on-how-fighting-floyd-mayweather-led-to-his-new-nft-collection","publishDate":"2022-04-12T19:45:59","id":7451,"type":null,"title":"Logan Paul on how fighting Floyd Mayweather led to his new NFT collection","category":["NFTS"],"content":["It was during the few months after an exhibition fight with boxer Floyd Mayweather that YouTuber Logan Paul felt like he had ticked off everything he had ever wanted to do.","For the first time in his life, Paul said in an interview Tuesday, he was directionless.","“I felt like fighting Floyd Mayweather was something that on paper was impossible. And then all of a sudden it happened and I had my one moment,” Paul tells The Block.","Paul’s fight with Mayweather was the culmination of his path from content creator to guest actor, singer and boxer. He achieved fame on YouTube, with his videos gathering an audience of 23 million followers, and notoriety too, when he filmed the remains of a suicide victim in a forest in Japan and uploaded it to his channel. With this fame, he became a celebrity boxer, fighting fellow YouTuber and rapper KSI, leading eventually to the exhibition bout with Mayweather.","Yet, after the fight — instead of trying to find the next project to engage with or sit back and relax — Paul says he fell into old, hard-partying habits. Yet this period reignited his creativity and Paul had what he describes as an “amazing multifaceted idea beamed into my head.”","Within 36 hours of that moment, he snapped his first Polaroid.","Paul embarked on a journey to take the weirdest and wackiest photographs — all on a traditional Polaroid camera with actual film — to turn into his first major NFT collection. The goal was to take 99 photos over 99 days and use them to create a collection of digital artwork that reflected himself. It was a journey that he says took him to the highest of highs and the lowest of lows.","Over the three and a bit months, Paul ultimately took 4,120 Polaroid photographs. He says the cost of the film was around $10,000. But that was nothing to the strain of the search for interesting backdrops around the world.&nbsp;","<span data-v-f87c67ca=\"\">One of the Polaroid photos that will be used within the collection. Image: Logan Paul.<\/span>","Paul says he traveled 84,029 miles in those 99 days. He says 10% of that traveling was on flights, estimating that he sat for around nine days on airplanes. According to a promotional video <a href=\"https:\/\/twitter.com\/LoganPaul\/status\/1513968852270469122\" data-v-f87c67ca=\"\">released<\/a> today, he spent around 80 hours driving.","The video shows that Paul visited pyramids in Mexico and Stonehenge in the UK. Other shots show him skydiving, driving a motorbike with a sidecar, and spectating one of his brother’s boxing matches.","When asked about the wildest parts of his journey, Paul replies “All of them are too wild for me to verbally say. There’s going to be a written component to this project where I'm going to let it all on the line.”","Since there will be only 99 NFTs, it will be a small collection compared to most NFT projects, which tend to range from 3,000 to 10,000 NFTs. Paul acknowledges this, but points to his other project <a href=\"https:\/\/www.theblockcrypto.com\/post\/140573\/logan-pauls-marketplace-for-tokenized-collectibles-goes-live-after-raising-8-million\" data-v-f87c67ca=\"\">Liquid Marketplace<\/a> as a way to expand its reach. The marketplace is designed to fractionalize digital and physical collectibles and sell these tokens to far more people than would otherwise be able to collect them.","Beyond this, Paul touts that 99 Originals will have a DAO, essentially a community built around the project that will have sway over how it develops. He said the DAO members will decide what to do with its treasury “and god knows what will get done with it.”","“It’s the biggest project I've ever done to date. I've never been more scared to release anything in my life,” says Paul.","Paul is certainly not new to NFTs.&nbsp;","He began collecting in early 2021 and bought his first CryptoPunks after serial entrepreneur Gary Vee told him to in a call with 30 other uber-rich friends, including fellow YouTuber Mr Beast, who <a href=\"https:\/\/www.youtube.com\/watch?v=w-mZ2Qnp_Uc\" data-v-f87c67ca=\"\">recalled<\/a> this story.&nbsp;","After picking up six CryptoPunks, he continued to collect a further 139 NFTs, <a href=\"https:\/\/twitter.com\/LoganPaul\/status\/1474797788072484888\" data-v-f87c67ca=\"\">spending<\/a> a total of $2.6 million during 2021. Vee also told Paul that he had the potential to earn $250 million through NFTs.","This progression may have triggered Paul’s entrepreneurial spirit. In August 2021, Paul launched an NFT project called Cryptozoo, into which <a href=\"https:\/\/www.youtube.com\/watch?time_continue=444&amp;v=rqrH7TbruZA&amp;feature=emb_title\" data-v-f87c67ca=\"\">he says<\/a> that he sunk $1 million and six months of his time. The idea was to create NFTs of animals that you could merge, creating bizarre hybrid animals. The NFTs were also designed to generate some kind of yield — rewarding their owners with tokens.","<span data-v-f87c67ca=\"\">Cryptozoo NFTs involved the merging of two animals together. Image: Cryptozoo.<\/span>","Yet the project sparked controversy when observers on Twitter noticed that some of the images <a href=\"https:\/\/twitter.com\/coffeebreak_YT\/status\/1435079992002633732\" data-v-f87c67ca=\"\">appeared to be taken<\/a> from stock images. Since then, Paul’s tweets regularly get replies asking about the project, with many <a href=\"https:\/\/twitter.com\/StraightMsss\/status\/1511397792429846539\" data-v-f87c67ca=\"\">claiming<\/a> that he’s abandoned it.","Paul acknowledges that the stock image issue was “partially true” but claimed that the project was less about art and more about making hybrid animals that had a virality factor.","Paul also claims that the project’s initial team was problematic, a situation he says has since been rectified. “We got ourselves involved with the wrong people who made some errors and blunders and we have a great team now that are still working on it.”","Paul contends that he was unfamiliar with the space and didn’t realize how dark it could be. But he says that was true for any growing industry where money was involved.&nbsp;","“If there’s an ability to make money there will be people that will capitalize on it, both good and bad.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mayweather","content":"PERSON"},{"type":"YouTuber Logan Paul","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Floyd Mayweather","content":"PERSON"},{"type":"$250 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"August 2021","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Mexico","content":"LOCATION"},{"type":"Logan Paul","content":"LOCATION"},{"type":"$2.6 million","content":"MONEY"},{"type":"Japan","content":"LOCATION"},{"type":"Gary Vee","content":"PERSON"},{"type":"$10,000","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"Paul","content":"PERSON"},{"type":"DAO","content":"ORGANIZATION"},{"type":"KSI","content":"ORGANIZATION"},{"type":"Mr Beast","content":"PERSON"},{"type":"Polaroid","content":"ORGANIZATION"},{"type":"Paul’s","content":"PERSON"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}