{"summary":"Casa CTO Jameson Lopp said that supporting more functionality on Bitcoin could have a large multiplier effect.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258385\/jameson-lopp-calls-for-more-bitcoin-experimentation-and-sidechains","publishDate":"2023-10-19T08:34:40","id":7461,"type":null,"title":"Jameson Lopp calls for more Bitcoin experimentation and sidechains","category":["LAYER 2S AND SCALING"],"content":["<span data-v-f87c67ca=\"\">Casa CTO Jameson Lopp made the case for more experimentation and sidechains on <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.27%\n    <\/span><\/a> <!----><\/span><\/span> in order to expand and improve the ecosystem.<\/span>","“I think that sidechains and Layer 2s as [Stacks co-founder Muneeb Ali] was saying are one of the most important things that we can have happen in this ecosystem because this is how we really enable permissionless innovation,” said Lopp in his keynote address at Bitcoin Unleashed in London on Thursday.","“I think it's not controversial to say that ossification will happen. As I said, it's almost a fundamental rule of networks. And so we want people to be able to innovate on related but different protocols to Bitcoin so that we're not having to constantly fight over changing the base protocol,” he added.","Lopp mentioned existing sidechain projects like Blocksteam’s Liquid Network and Rootstock, but acknowledged that they tend to be based around federations — noting that that might be the reason why adoption of such protocols has stalled.&nbsp;","Lopp mentioned a few sidechain ideas that have been proposed recently, including drivechains, spiderchain and BitVM. Each of these attempts to provide new ways to build layers on top of Bitcoin, with the latter attempting to introduce similar capacities to Ethereum.","“We need to keep allowing the new functionality to happen because that can have an order of magnitude multiplier effect of what people are able to do on these other layers,” Lopp argued.","He clarified that he wasn’t proposing or backing any one idea; he wants all of these ideas to flourish. “I want the experimentation to keep happening and I think the only way forward is to continue building, failing, learning from the failures and evolving. And so, you know, ossification is going to happen, but we need to keep racing forward and get as far as we can before that actually happens.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lopp","content":"PERSON"},{"type":"Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Bitcoin Unleashed","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"Muneeb Ali]","content":"PERSON"},{"type":"Casa CTO Jameson Lopp","content":"ORGANIZATION"},{"type":"-0.27%","content":"PERCENT"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Tim Copeland","The Block"]}