{"summary":"OpenSea has suspended trading in a pixelated turtle project claiming it broke rules related to carrying out financial activities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/120022\/opensea-delists-dao-turtles-project-citing-financialization-concerns","publishDate":"2021-10-11T05:59:47","id":7465,"type":null,"title":"OpenSea delists DAO Turtles project citing financialization concerns","category":["NFTS"],"content":["OpenSea, the online marketplace for NFT trading, has suspended trading in a pixelated turtle project claiming it broke rules related to carrying out financial activities.","The collection of 10,000 DAO Turtles dropped on October 4 and has since recorded trading volume on OpenSea of more than 570 ether (roughly $2 million).","When sales of the turtle images came to an abrupt end late last week, the project’s founders asked staff at OpenSea why the ban had been enforced and shared <a href=\"https:\/\/www.twitlonger.com\/show\/n_1srre8s\" data-v-f87c67ca=\"\">details of their correspondence<\/a> on Twitter.","An employee of the company wrote that DAO Turtles had violated its terms of service, clarifying that it is forbidden to use OpenSea to “carry out any financial activities subject to registration or licensing, including but not limited to creating, listing, or buying securities, commodities, options, real estate, or debt instruments,” or for fundraising for a business or protocol via an array of methods including Initial Coin Offerings.","It is not clear exactly which of OpenSea’s rules DAO Turtles had broken. OpenSea was contacted for comment but did not respond by press time.","One of DAO Turtles’ founders told The Block that they too are unsure how they had breached OpenSea’s terms, but insisted that they had done nothing illegal. The team has now altered language on its website that had promised to pay a percentage of future NFT projects to DAO Turtle owners. It still promises to give each NFT holder a “Turtleshell token,” and to incentivize users in a “non-commercial manner” to quiet concerns about securities rules.","OpenSea's move may have big implications for NFTs, which <a href=\"https:\/\/www.reuters.com\/technology\/nft-sales-surge-107-bln-q3-crypto-asset-frenzy-hits-new-highs-2021-10-04\/\" data-v-f87c67ca=\"\">hit $10.7 billion in sales volume<\/a> in the third quarter of this year.","Since the DAO Turtle ban, Twitter users have <a href=\"https:\/\/twitter.com\/Lucky5Micah\/status\/1446314740095934464\" data-v-f87c67ca=\"\">pointed out<\/a> that other big-name NFT projects would also appear to be in breach of OpenSea’s rules.","Concerns about the attachment of NFTs to financial products has led some to suggest that they could come to be viewed as securities. For its upcoming NFT marketplace, crypto exchange FTX will <a href=\"https:\/\/www.theblockcrypto.com\/post\/120016\/why-ftxs-upcoming-marketplace-is-avoiding-nfts-that-offer-royalties\" data-v-f87c67ca=\"\">eschew projects that offer royalties<\/a>.","Brett Harrison, president of FTX.US, said that “a token which guarantees you a percentage income stream from the sales of a pool of assets starts to look like a security.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"DAO Turtle","content":"ORGANIZATION"},{"type":"October 4","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DAO Turtles","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"Brett Harrison","content":"PERSON"},{"type":"third quarter","content":"DATE"},{"type":"$10.7 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["OPENSEA"],"authors":["Ryan Weeks","The Block"]}