{"summary":"A UK House of Commons committee looking at crypto likened the industry to gambling and suggested it should be regulated in the same way.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231063\/uk-treasury-committee-retail-crypto-trading-regulated-gambling","publishDate":"2023-05-16T19:01:09","id":7467,"type":null,"title":"UK Parliament committee says crypto is akin to gambling","category":["COMPANIES"],"content":["Retail crypto trading is more akin to betting on sport than investing and should be <a href=\"https:\/\/www.theblock.co\/post\/229138\/binance-circle-uk-crypto-regulatory-framework\" data-v-f87c67ca=\"\">regulated<\/a> as such, according to a new report released by the UK House of Common's Treasury Committee.&nbsp;","The report, put together by a group of bipartisan parliamentarians, argues that even bluechip crypto-assets like bitcoin and ether \"have no intrinsic value and serve no useful social purpose\" and therefore should be regulated by the government as gambling instruments.&nbsp;","The release of the report Wednesday follows a February <a href=\"https:\/\/www.gov.uk\/government\/news\/uk-sets-out-plans-to-regulate-crypto-and-protect-consumers\" data-v-f87c67ca=\"\">update from His Majesty's Treasury<\/a> in which the government outlined its plans to \"robustly regulate cryptoasset activities.\" More recently, lobbyists representing <a href=\"https:\/\/www.ft.com\/content\/bb7df9d9-31bb-4b06-8478-749a37342532\" data-v-f87c67ca=\"\">traditional finance firms warned<\/a> that the UK's plans to regulate cryptocurrencies would legitimize a market fraught with risks.&nbsp;&nbsp;","The Treasury Committee shares the same concern, noting in the report that the volatility of cryptocurrencies poses serious risk to retail punters.&nbsp;","\"The Committee is also concerned that regulating consumer crypto trading as a financial service – as proposed by the Government – will create a ‘halo’ effect, leading consumers to believe this activity is safe and protected, when it is not,\" according to a summary of the findings.&nbsp;","CryptoUK, a trade association that represents the crypto industry, strongly disagreed with the report's gambling characterization.&nbsp;","\"We are both concerned and disappointed by these claims which are unhelpful, false, fundamentally flawed and unsubstantiated,\" said Ian Taylor, Board Advisor at CryptoUK. \"The statement fails to reflect the true nature, purpose and potential of the crypto industry.\"","The House of Commons Committee group concedes that the underlying blockchain technology — not crypto itself — may bring some benefits to the financial-services sector.&nbsp;","\"With no intrinsic value, huge price volatility and no discernible social good, consumer trading of cryptocurrencies like Bitcoin more closely resembles gambling than a financial service, and should be regulated as such,\" commented Harriet Baldwin, the chair of the Treasury Committee.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Harriet Baldwin","content":"PERSON"},{"type":"UK House of Common's Treasury Committee","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Ian Taylor","content":"PERSON"},{"type":"His Majesty's Treasury","content":"ORGANIZATION"},{"type":"The Committee","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Board Advisor","content":"ORGANIZATION"},{"type":"House of Commons Committee","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Treasury Committee","content":"ORGANIZATION"}],"hashtag":["UK PARLIAMENT"],"authors":["Frank Chaparro","The Block"]}