{"summary":"Indian crypto exchange ZebPay is seeking a license in Singapore, the CEO said in an interview with Bloomberg. \nThis comes as Indian crypto companies face mounting pressure from authorities in their home country.\nNomics data shows that daily trading volume on ZebPay has dropped from a high of $122 million last October to just over $700,000, following a recent tax levy on crypto. \n\n ","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175466\/indian-crypto-exchange-zebpay-applies-for-license-in-singapore-bloomberg","publishDate":"2022-10-07T06:14:56","id":747,"type":null,"title":"Indian crypto exchange ZebPay applies for license in Singapore: Bloomberg","category":["Exchanges"],"content":["Indian crypto exchange ZebPay is seeking a license in Singapore as crypto companies at home continue to face pressures.&nbsp;","ZebPay is an eight-year-old cryptocurrency exchange that enables its users to trade more than 100 different tokens and earn yields through lending selected cryptocurrencies.&nbsp;","In an interview with <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-10-07\/indian-crypto-exchange-zebpay-seeks-singapore-permit-eyes-uae?srnd=all\" data-v-f87c67ca=\"\">Bloomberg<\/a>, CEO Avinash Shekhar said the company had applied for a license in Singapore and is weighing a similar move in the United Arab Emirates.&nbsp;","He cited a recent 1% tax on every crypto transfer that India instituted earlier this year as a motivation for the move, saying it \"has to come down, otherwise things are not going to improve.\" This is in addition to a<a href=\"https:\/\/techcrunch.com\/2022\/01\/31\/india-proposes-30-tax-on-crypto-and-nfts-income\/\" data-v-f87c67ca=\"\"> 30% tax on profits<\/a> made trading digital assets that was announced in February.&nbsp;","The Block contacted the Monetary Authority of Singapore, the city state's regulatory body, but had not heard back by the time of publication.&nbsp;","The new taxes have had a knock-on effect on the daily trading volumes at companies such as ZebPay. Daily trading volume on ZebPay dropped from a high of $122 million last October to just over $700,000, according to <a href=\"https:\/\/nomics.com\/exchanges\/zebpay\" data-v-f87c67ca=\"\">data from Nomics<\/a>.&nbsp;","Shekhar plans to leave the company to start his own crypto venture via seed funding from the exchange, where he will remain an adviser.&nbsp;","Earlier this month, India-based exchange WazirX<a href=\"https:\/\/www.theblock.co\/post\/174264\/indian-crypto-exchange-wazirx-confirms-layoffs-coindesk\" data-v-f87c67ca=\"\">&nbsp;laid off 40% of its workforce<\/a>, citing taxes, regulations and access to banking.&nbsp;","Indian authorities have sought to clamp down on crypto companies operating in the country. In September, India's Directorate of Enforcement (ED), a law-enforcement agency that investigates financial crimes, <a href=\"https:\/\/www.theblock.co\/post\/173393\/india-directorate-enforcement-freezes-bitcoin-money-laundering\" data-v-f87c67ca=\"\">froze cryptocurrencies<\/a> worth 128 million rupees ($1.5 million).&nbsp;","This followed <a href=\"https:\/\/www.theblock.co\/post\/165818\/andreessen-horowitz-backed-coinswitch-kuber-searched-by-indian-authorities-reports\" data-v-f87c67ca=\"\">an August report<\/a> that Indian authorities searched the offices of CoinSwitch Kuber, a crypto exchange backed by a16z and Tiger Global.&nbsp;"],"hashtag":[]}