{"summary":"Lido has finalized its designs for the next version of its protocol, which will be ready to support Ethereum staking withdrawals.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208982\/lido-presents-plan-for-version-2-adding-staking-withdrawals-and-more","publishDate":"2023-02-07T09:00:08","id":7470,"type":null,"title":"Lido presents plan for Version 2, adding staking withdrawals and more","category":["CRYPTO ECOSYSTEMS"],"content":["Lido Finance finished the design for the second version of its protocol, which will bring in support for Ethereum staking withdrawals post-Shanghai and rework the Staking Router in a way that should boost the platform’s level of decentralization.","The plans were presented to the Lido community in a blog post shared with The Block. It will need to be turned into an official proposal and approved in a vote by token holders before it will be implemented.","Lido Version 2.0 will go through six audits that will include providers such as Sigma Prime, ChainSecurity and Oxorio. The security checks will focus on withdrawals, the code for the staking router code and a key ceremony.","The timeline will see a code freeze in February, when the security audits begin. At the end of February, the upgrade will go to a vote on Lido’s governance platform. At the start of March, the upgrade will go live on the Goerli testnet, and the upgrade will go live on mainnet ahead of the Shanghai-Capella (also referred to as Shapella) upgrades.","The key part of the upgrade will introduce support for staking withdrawals after the Shanghai-Capella upgrades take place, which are estimated for late March. This will let those who have staked ether (stETH) — Lido’s liquid staking derivative token — unstake it and receive the underlying ether at a 1:1 ratio.&nbsp;","Once this happens, it’s probable that stETH will trade fairly closely to the underlying asset because there’s an arbitrage opportunity between the two. Yet since there’s a time delay in unstaking — from 24 hours to a week — it’s likely there will remain a slight difference in price between the two.","One thing Lido is introducing to speed up withdrawals is a buffer. This makes use of ether that happens to be available and can be withdrawn more quickly. This can be ether that hasn’t yet been staked, spare ether left over from validators that are being exited from the system or validator rewards. If someone makes a withdrawal request and there is ether available in the buffer, that will get paid out to them quickly — avoiding the full withdrawal waiting period.&nbsp;","“The idea is that if you need to withdraw a small amount and that amount exists in the buffer, Lido wouldn’t actually need to exit validators in order to meet that redemption request,” said Lido Finance Master of Validators Isidoros Passadis.&nbsp;","Even though this should speed up some withdrawals, it’s unlikely to fully close the difference between stETH and ETH, according to Passadis. This is because it’s unlikely there will be enough ether in the buffer each day to bring the exchange rate on the secondary market to peg. Instead, he pointed toward traders performing arbitrage as potentially having a bigger effect on keeping the market price close to the underlying asset.","Passadis also noted that those unstaking their tokens will be able to trade their positions in the queue. He said this might create a secondary market for these positions, that’s neither the main price of stETH with its discount nor a one-to-one conversion. “There’s probably room in that range for another exchange rate which is somewhere in between the two,” he said.","Under normal conditions, the protocol will work under what’s known as Turbo mode. Yet it will also have a Bunker mode, a means of operating under extreme network conditions. Under this scenario, the process of withdrawing ether is slowed down in order to safeguard those making the withdrawals.","Lido’s Version 2.0 will also come with a redesigned Staking Router, the part of the protocol that assigns staking to selected validators.","Currently there’s only one router, and it’s controlled by the Lido DAO. Under the new design, anyone would be able to propose adding a new router that would pass on staking requirements to validators and have a different set up to the official one.&nbsp;","It’s not certain yet whether stakers will be able to choose which router they will be using. The current options are letting them choose or having an opinionated mechanism, which means each router will be allocated a set percentage of staked ether, Passadis said, noting that there is definitely a desire for having optionality.","The new router will allow a wider range of node operators to take part in the Lido protocol. This will include nodes run by solo stakers, small groups and even DAOs. Plus, it could even allow distributed validator sets (like Obol) where validator keys are split up and spread among different entities to take part. Overall, this should help decentralize the Lido protocol.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Lido DAO","content":"LOCATION"},{"type":"Lido Finance Master of Validators Isidoros Passadis","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Sigma Prime","content":"ORGANIZATION"},{"type":"Shanghai","content":"LOCATION"},{"type":"Staking Router","content":"PERSON"},{"type":"Passadis","content":"PERSON"}],"hashtag":["ETHEREUM","GOVERNANCE VOTES","LIDO FINANCE"],"authors":["Tim Copeland","The Block"]}