{"summary":"Bitcoin&#x27;s hash rate is expected to recover from a recent loss as miners in China&#x27;s Xinjiang province are gradually plugging in their machines again.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/102603\/bitcoin-hash-rate-xinjiang-miner-power","publishDate":"2021-04-22T09:47:16","id":7479,"type":null,"title":"Bitcoin&#x27;s hash rate set to regain loss as Xinjiang miners gradually resume operations","category":["BITCOIN"],"content":["Bitcoin's hash rate is on track to regain recent loss as miners in China's Xinjiang province are gradually plugging in machines again.","Several local bitcoin mining farm operators shared with The Block that some – but not all – of their facilities in parts of Xinjiang have begun to regain power starting today. This development comes as a recent security inspection concludes region by region.","But since Xinjiang is a vast territory, the power resumption process will happen gradually before it can fully reach the level seen prior to the recent coal mine accidents.","Thomas Heller, a former director at Chinese mining pool F2Pool and now heads the business development at Compass Mining also <a href=\"https:\/\/twitter.com\/thomasheller_\/status\/1385166179732312067\" data-v-f87c67ca=\"\">shared<\/a> on Twitter that \"mining farms in Xinjiang are gradually turning power and machines back on from today. It has already started.\"","Real-time hash rate data from mining pool APIs analyzed by The Block on a daily basis shows the network's computing power has climbed up over the past 24 hours with a caveat that luck plays a bigger role in a relatively shorter timeframe.","For instance, the average hash rate decline among most bitcoin mining pools as of now is at 13% compared to the level before April 16. But the decline was around 20% as of Wednesday.","On the other hand, the overall hash rate percentage decline among Chinese mining pools was good news, at least for the past days, for overseas competitors like Slushpool or Foundry USA, both of which gained some market share this week.","","","The Block <a href=\"https:\/\/www.theblockcrypto.com\/linked\/101866\/xinjiang-coal-mine-bitcoins-hash-rate\" data-v-f87c67ca=\"\">reported<\/a> on April 16 that following serious coal mine accidents in China's Xinjiang, Shanxi and Guizhou provinces, the Chinese government directed local coal-based power stations to conduct inspections of security measures.","As a result, although the data centers in Xinjiang, including bitcoin mining farms, didn’t have security issues themselves, they had to shut down due to the power cut. Local farm operators said last week that they expected the inspection process to be completed in about a week.","China is currently in what's called the dry season, which spans from October to May. During this period, there is limited hydro-power resources in the southwestern region of the country so a majority of the bitcoin miners would migrate to coal-based provinces such as Xinjiang.","As a result, bitcoin's three-day moving hash rate after April 16 declined by 16%, data seen on April 18 <a href=\"https:\/\/twitter.com\/WolfieZhao\/status\/1383658436320120833\" data-v-f87c67ca=\"\">showed<\/a>. The seven-day moving average over the past week further extended the drop to around 20%.","<span data-v-f87c67ca=\"\">Mustafa Yilham, who heads the overseas business at Bixin, one of the longest-running bitcoin wallet and miner firms in China, said this data also sheds light on how the hash rate dominance inside China has declined significantly compared to previous years. <\/span>","<span data-v-f87c67ca=\"\">“Right now in China, it’s still [the] dry season, so the majority of the mining operations (&gt;80%) are still taking place in Xinjiang region,” Yilham <\/span><a href=\"https:\/\/twitter.com\/MustafaYilham\/status\/1384278267067203590\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said on Twitter<\/span><\/a><span data-v-f87c67ca=\"\">. “So if estimated 80% of the mining in China was located in Xinjiang as of last week, and 80% of them were shut down and it only affected 20-25% of the network, that means hashrate in China is currently around 32-40% at most.”<\/span>","That also means the power cut collectively caused Xinjiang miners a significant opportunity cost. With 20% of the global bitcoin computing power, for each of the days they had to shut down operations, they could have mined – in theory – one-fifth of bitcoin's 900 BTC daily block subsidies excluding transaction fees.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"Xinjiang","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"Compass Mining","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"Yilham","content":"PERSON"},{"type":"Bixin","content":"LOCATION"},{"type":"25%","content":"PERCENT"},{"type":"13%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"Guizhou","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Foundry USA","content":"ORGANIZATION"},{"type":"April 18","content":"DATE"},{"type":"last week","content":"DATE"},{"type":"16%","content":"PERCENT"},{"type":"April 16","content":"DATE"},{"type":"Shanxi","content":"LOCATION"},{"type":"Thomas Heller","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Mustafa Yilham","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Wolfie Zhao","The Block"]}