{"summary":"Last week, two thousand people piled into an NFT mint that was based on stolen artwork. The real artist only found out Sunday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119513\/meet-the-artist-that-had-his-work-stolen-for-a-138000-crypto-scam","publishDate":"2021-10-05T07:04:37","id":7481,"type":null,"title":"Meet the artist that had his work stolen for a $138,000 crypto scam","category":["NFTS"],"content":["Last week, 2,000 people bought into the presale for a collection of digital figurines and were disappointed to receive nothing but sets of emojis in return. The unknown figure behind the NFT sale made $138,000 and <a href=\"https:\/\/www.theblockcrypto.com\/post\/119150\/supposed-17-year-old-artist-sells-138000-worth-of-fake-nfts-and-disappears\" data-v-f87c67ca=\"\">disappeared with the money<\/a>, leaving a deleted Twitter account in their wake.","Only on Sunday did the artist who created the images — that were shown as previews of the collection — hear about the sale for the first time.","“It was kind of upsetting that someone takes and use your work like that,” said 27-year-old artist Ludvig Holmen. “Although it was nice to see the work has been appreciated by somebody, without me knowing it as well.”","Based in London, Holmen is currently studying architecture at the Architectural Association. While he did a lot of drawing when he was younger and some 3D modelling, it was through architecture that he got more serious about making art.","In February, Holmen heard about NFTs when Beeple <a href=\"https:\/\/www.theblockcrypto.com\/linked\/98047\/christies-beeple-auction-ends-digital-art\" data-v-f87c67ca=\"\">sold one for $69 million<\/a>. Shortly after, he decided to do his own run of NFTs, selling a set of rotating 3D NFTs — called <a href=\"https:\/\/rarible.com\/golemfactory\" data-v-f87c67ca=\"\">GolemFactory<\/a> — for 17 ETH ($59,000 at current prices).&nbsp;","Holmen also created a set of 25 3D digital figurines, custom designing each one, in a collection called Kingdoms Of Ether. His original idea was to sell them as NFTs but he wasn’t sure how to produce enough to make a reasonably sized collection, given they were all individually made. Plus, as a student, he didn’t have much spare time.&nbsp;","<span data-v-f87c67ca=\"\">The real artwork (left) versus the artwork that was actually sent out (right). Image: Ludvig Holmen\/Iconics.<\/span>","“We had been discussing the idea of doing something like that. But the difficulty of pulling it off and keeping the standard of models, made us refrain from doing so — it’s a huge undertaking,” he said, referring to his friend who handled the coding side of things on his Golem project.","So he was not only surprised when he found out someone had used his artwork for a pretend NFT sale but that there had actually been high demand for it, with the presale selling out in minutes.","“It’s interesting to see it’s exactly what we had been talking about doing and the guy pretends to do it,” he said.","Holmen said he was aware that some of the victims of the rugpull had banded together to try to find a solution that would benefit those who lost money. While he hasn’t been able to get in touch with them yet, he added that he was open to helping out in some way.","“I really want to reach out to the people who bought into the project and see what they think about the project in the first place. It would be a shame if there was excitement about the project and I certainly don’t want them to think I was the one who pulled this scam,” he said.","Holmen said that something along the lines of free giveaways to people who were affected by the scam might be an option. So while the NFT mint was a sleazy rugpull, it might not be game over.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"$59,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"$69 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$138,000","content":"MONEY"},{"type":"London","content":"LOCATION"},{"type":"Ludvig Holmen\/Iconics","content":"ORGANIZATION"},{"type":"Holmen","content":"PERSON"},{"type":"Ludvig Holmen","content":"PERSON"},{"type":"Holmen","content":"ORGANIZATION"},{"type":"Architectural Association","content":"ORGANIZATION"}],"hashtag":["BEEPLE"],"authors":["Tim Copeland","The Block"]}