{"summary":"The Bank of International Settlements has published a new survey of central banks, focusing on their work around digital currencies.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53882\/central-banks-bis-digita-currencies-work-survey","publishDate":"2020-01-23T15:53:11","id":7482,"type":null,"title":"Central banks are pursuing &#x27;extensive work&#x27; on digital currencies, BIS researchers say","category":["THE BLOCK"],"content":["Researchers for the Bank of International Settlements (BIS) said in a report published Thursday that the world's central banks are \"undertaking extensive work on central bank digital currencies.\"","The BIS – often called the \"central bank of central banks\" – surveyed such institutions to paint a picture of the state of development around central bank digital currencies, or CBDCs. Sixty-six central banks respondent to the BIS survey, which was carried out in \"in the latter part of 2019,\" according to <a href=\"https:\/\/www.bis.org\/publ\/bppdf\/bispap107.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Thursday's report<\/a>. The institutions covered include those from both advanced and emerging-market economies.","The major finding: work is apace, although it appears that much of what's being done is in the realm of experimentation and the creation of proof-of-concepts.","As the BIS researchers noted:","\"The survey corroborates the findings from last year’s exercise, especially that a wide variety of motivations drives extensive central bank research and experimentation on CBDCs. Only a few EME central banks have progressed to intensive development (eg developing the operational arrangements for a CBDC and\/or amending laws to allow the central bank to issue one) or pilot projects and have firm intentions to issue a CBDC soon. Nonetheless, their plans appear to be accelerating compared with earlier expectations.\"","Eighty percent of respondents are working on such projects, according to the report, which goes on to state: \"Some 40% of central banks have progressed from conceptual research to experiments, or proofs-of-concept; and another 10% have developed pilot projects... Every central bank that has progressed to development or a pilot project is an EME institution.\"","The report also touched on the question of whether central banks have obtained the legal authority in their home countries to issue a wholly digital currency. On that point, the picture is a mixed one, with one-quarter of respondents saying that they have achieved such authority.","\"A central bank issuing a CBDC needs the legal authority to do so which, as in the previous survey, about a quarter of central banks have, or will soon have, such authority,\" the researchers noted. \"A third do not have authority and about 40% remain unsure... The continued high level of uncertainty is not surprising, given that most central bank mandates predate many forms of electronic money.\"","The BIS <a href=\"https:\/\/www.theblockcrypto.com\/linked\/29649\/bis-will-support-central-banks-that-issue-their-own-digital-currencies\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">signaled last year<\/a> that it would support the efforts of central banks as they look to go live with digital currency initiatives. But as BIS general manager Agustín Carstens noted at the time: \"There needs to be evidence for demand... and it is not clear that the demand is there yet.\"","The BIS's survey-takers also queried central banks on the work they've done to date on cryptocurrencies as well as stablecoins, or digital tokens that serve as synthetic stand-ins for government-issued currencies.","\"For cryptocurrencies, the results are almost exactly the same as in the 2018 survey: no central banks reported any significant or wider public use of cryptocurrencies for either domestic or cross-border payments; and the usage of cryptocurrencies is considered either minimal (“trivial\/no use”) or concentrated in niche groups,\" the researchers noted.","Yet there was an interesting point highlighted in the report, which stated that one unnamed central bank reported contrary findings for the 2019 survey.","\"The one difference to highlight is that, in 2019, one central bank that did not contribute in 2018 and whose jurisdiction is facing serious civil unrest, considered cryptocurrency use significant domestically and saw wider public use for cross-border payments.\"","On the topic of stablecoins, the BIS found that sixty percent of surveyed central banks \"are considering the impact of monetary and financial stability of 'stablecoins'.\"","\"Stablecoins could find widespread adoption where cryptocurrencies have failed,\" the report noted in its conclusion. \"Our survey shows that more central banks could be looking at the risks outside the financial system while also exploring ways to improve the system with CBDCs.\"","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bank of International Settlements (BIS","content":"ORGANIZATION"},{"type":"Eighty percent","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Agustín Carstens","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"sixty percent","content":"PERCENT"},{"type":"BIS","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"40%","content":"PERCENT"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}