{"summary":"Coral, known for creating Solana developer framework Anchor, has raised a $20 million strategic funding round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173345\/anchor-creator-coral-raises-20-million-as-it-debuts-wallet-product","publishDate":"2022-09-28T09:00:23","id":7483,"type":null,"title":"Anchor creator Coral raises $20 million led by FTX Ventures and Jump Crypto","category":["WEB3"],"content":["Crypto infrastructure company Coral has raised a $20 million strategic funding round co-led by FTX Ventures and Jump Crypto.","The company is known for creating the Solana development framework Anchor, but is set to dive into the consumer crypto wallet space with a new product.","Other participating investors in the round, which closed in May, include Multicoin Capital, Anagram and K5 Global, according to a release on Wednesday. It declined to share its valuation with The Block.&nbsp;","Along with recruiting efforts, the funds will primarily be used to launch its first consumer offering. Named Backpack, Coral envisions that its wallet will allow users to access all of their assets and decentralized apps in one place through the uptake of its \"xNFT\" developer framework.","xNFTs aim to act as applications within Backpack, allowing users to engage assets from tokens to decentralized applications, fiat onboarding and NFTs across different blockchains and protocols.","“We’re excited to launch a step-function improvement in the way users in the Solana ecosystem interact with protocols and smart contracts,\" said founder Armani Ferrante in a statement. \"xNFTs make the crypto experience smoother, require fewer steps and give projects the power to create more customized experiences for their communities.\"&nbsp;","&nbsp;This all hinges on developer interest, however — and Coral claims that more than 10 of the largest projects on Solana are already developing using the framework. Under the private beta of Backpack, NFT marketplace Magic Eden, blockchain gaming projects DefiLand and Aurory, and trading app Mango Markets are set to debut as xNFT applications.&nbsp;","News of the round follows other recent raises from crypto infrastructure companies creating crypto wallets, despite declines in <a href=\"https:\/\/www.theblock.co\/post\/157648\/blockchain-venture-funding-declined-in-q2-the-block-research\" data-v-f87c67ca=\"\">funding across the sector<\/a>. Earlier today, hardware wallet maker <a href=\"https:\/\/www.theblock.co\/post\/173291\/crypto-hardware-wallet-maker-onekey-raises-20-million-in-series-a-funding\" data-v-f87c67ca=\"\">OneKey announced it had raised $20 million<\/a> in Series A funding, and yesterday, Bitcoin payments firm and wallet provider Strike said it has raised <a href=\"https:\/\/www.theblock.co\/post\/173087\/bitcoin-payments-firm-strike-raises-80-million\" data-v-f87c67ca=\"\">$80 million in Series B funding<\/a>.&nbsp;","According to <a href=\"https:\/\/www.theblockresearch.com\/august-blockchain-funding-recap-169221\" data-v-f87c67ca=\"\">The Block Research<\/a>, 25 deals went towards crypto infrastructure companies, second only to the NFT and gaming sub sector.&nbsp;","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Backpack","content":"LOCATION"},{"type":"Coral","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"$80 million","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Armani Ferrante","content":"PERSON"},{"type":"FTX Ventures","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"Jump Crypto","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"$20 million","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Magic Eden","content":"ORGANIZATION"}],"hashtag":["WALLETS"],"authors":["Tom Matsuda","The Block"]}