{"summary":"Authereum, a platform for onboarding users to decentralized apps or dapps, has gone live on the Ethereum network following a $1.1 million seed round from investors including Coinbase Ventures and Synapse Capital. Authereum aims to make the DApp onboarding process more intuitive for non-technical users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55607\/user-onboarding-platform-authereum-goes-live-today-following-a-1-1m-seed-round","publishDate":"2020-02-12T09:54:57","id":7484,"type":null,"title":"Dapp onboarding platform Authereum goes live on Ethereum network","category":["ETHEREUM"],"content":["<span data-v-f87c67ca=\"\">Authereum, a platform for onboarding users to decentralized apps or dapps, has gone live on the Ethereum network following a $1.1 million seed round from investors including Coinbase Ventures and Synapse Capital.<\/span>","<span data-v-f87c67ca=\"\">After eight months of development, the team announced on Wednesday the launch of the Authereum platform. The startup closed its seed round in mid-January, according to its co-founder Chris Whinfrey, when it raised $1.1 million from 1confirmation, Coinbase Ventures, Republic Labs, Synapse Capital, as well as a group of angel investors.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Authereum aims to make the DApp onboarding process more intuitive for non-technical users, Whinfrey said. Users hold control of their own keys, but instead of managing a seed phrase, they can log in with their username and password, and start using DApps with no download required and zero transaction fees. The built-in fiat on-ramp support makes sure that users can convert fiat into crypto<\/span><span data-v-f87c67ca=\"\">&nbsp;without leaving the wallet or having to complete a Know Your Customer (KYC) verification. <\/span>","<span data-v-f87c67ca=\"\">“We're trying to abstract away as much of the hard-to-understand concepts that you only see in crypto as we can and try to make it feel more like a web 2 kind of application,” Whinfrey said.<\/span>","<span data-v-f87c67ca=\"\">Whinfrey believes that Authereum’s use of contract-based accounts is what sets the platform apart. A regular externally-owned account only has a private key and a public address. As a result, one can either have total control over the account or lose access to it completely. With a contract-based account, on the other hand, Authereum can program the smart contract to enable a wider range of keys and functionalities.<\/span>","<span data-v-f87c67ca=\"\">“We saw an opportunity to break into this market because of the development of contract-based accounts. And we’ll be the only contract-based accounts on Ethereum that don’t require downloads,\" he said. \"I think we’ll see the Ethereum space go through this shift from just externally-owned accounts to contract-based accounts.\"<\/span>","<span data-v-f87c67ca=\"\">Right now, the startup has integrated with payments provider Wyre to provide services to U.S. customers. However, according to Whinfrey, the team is looking to expand its fiat on and off ramp support to include other jurisdictions.<\/span>","<span data-v-f87c67ca=\"\">Other features that Authereum are looking to add include batched transactions, which allows DApps to eliminate unnecessary steps like approving tokens, and native app support, which lets developers build out DApps through Authereum’s system. <\/span>","<span data-v-f87c67ca=\"\">Moreover, the startup plans to release its own native App, likely within the next six months, to offer additional usability, Whinfrey said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Synapse Capital","content":"ORGANIZATION"},{"type":"Authereum","content":"PERSON"},{"type":"Republic Labs","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Chris Whinfrey","content":"PERSON"},{"type":"Wyre","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$1.1 million","content":"MONEY"},{"type":"Whinfrey","content":"PERSON"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Whinfrey","content":"LOCATION"},{"type":"mid-January","content":"DATE"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}