{"summary":"Bitmex cut its headcount. A Coinbase product lead left the exchange. Hong Kong is examining ways to open the crypto market to retail investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183446\/bitmex-coinbase-and-hong-kong-this-weeks-top-stories-in-crypto","publishDate":"2022-11-05T10:22:34","id":7486,"type":null,"title":"Bitmex, Coinbase and Hong Kong: This week&#x27;s top stories in crypto","category":["EXCHANGES"],"content":["As is always the case, it's been another eventful week in the blockchain and cryptocurrency industry.","Bitmex cut its headcount significantly amid a pivot away from its \"beyond derivatives\" strategy, while Coinbase's chief product officer left the company amid a restructuring of the product team. Meanwhile, Hong Kong is examining ways to open the crypto market to retail investors.","Crypto exchange Bitmex <a href=\"https:\/\/www.theblock.co\/post\/181814\/crypto-exchange-bitmex-cuts-part-of-workforce-following-ceo-departure-exclusive\" data-v-f87c67ca=\"\">cut<\/a> its headcount as part of its pivot away from its \"beyond derivatives\" push into spot trading, brokerage and custody services, The Block reported on Nov. 1.","\"We are pivoting from our Beyond Derivatives strategy, and will return much of our focus aiming at providing the crypto derivatives trading experience people will turn to,\" a Bitmex spokesperson said in an email. \"We are going to refocus on liquidity, latencies and a vibrant derivatives community including BMEX Token trading.\"","After initially noting that 30% of the company's workforce was cut, a spokesperson later clarified that the figure was actually lower.","Hong Kong regulators <a href=\"https:\/\/www.theblock.co\/post\/180305\/hong-kong-retail-consultation-virtual-assets\" data-v-f87c67ca=\"\">revealed<\/a> plans to broaden the scope of crypto assets available in the city, The Block reported on Oct. 31, while also examining ways to open the crypto market to retail investors.","\"We recognise the increasing acceptance of [virtual assets] as a vehicle for investment allocation by global investors, be they institutional or individual,\" said the Financial Services and the Treasury Bureau, in a statement.","Hong Kong plans to make an attempt at turning the city into a global center for the digital asset industry.","Coinbase's chief product officer, Surojit Chatterjee, <a href=\"https:\/\/www.theblock.co\/post\/182404\/coinbase-cpo-departs-as-exchange-restructures-product-team\" data-v-f87c67ca=\"\">left<\/a> the crypto exchange on Oct. 28 as it restructured its product team, The Block reported on Nov. 2.","The product team at the exchange will be reconfigured into four divisions, each led by a separate director reporting to Brian Armstrong, Coinbase's CEO, who will be more hands-on.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Oct. 31","content":"DATE"},{"type":"Nov. 1","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Nov. 2","content":"DATE"},{"type":"Treasury Bureau","content":"ORGANIZATION"},{"type":"Oct. 28","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Surojit Chatterjee","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"Financial Services","content":"ORGANIZATION"}],"hashtag":["BITMEX","BRIAN ARMSTRONG","COINBASE"],"authors":["Adam James","The Block"]}