{"summary":"Coinbase-incubated Base has open-sourced its smart contracts and web repositories as part of its commitment to building in the open.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258394\/coinbase-ethereum-layer-2-base-open-sources-smart-contracts-frontend","publishDate":"2023-10-19T13:05:04","id":7488,"type":null,"title":"Coinbase-incubated Layer 2 Base open-sources code to enhance transparency","category":["LAYER 2S AND SCALING"],"content":["Coinbase-incubated Layer 2 network Base has open-sourced its code repositories to enhance transparency and open the project to public contributions.","As of today, developers can access the underlying code enabling various Base processes including contracts and other deployments, according to a statement.","“By sharing our work openly, we enable the community to track our progress and ensure that we're living up to our commitments,” Base said in the announcement. “This transparency also serves as a catalyst for collaboration, as it allows developers to tap into our knowledge base, building upon and refining what's already in place. Further, it provides a channel for valuable community feedback, whether it's about improving documentation or spotting an overlooked bug.”","The Base Layer 2 network on Ethereum is built on OP Stack in collaboration with Optimism. “Supporting open source has been one of our key tenets since we announced the testnet at the start of the year,” Base Senior Software Engineer Anika Raghuvanshi told The Block. “Our goal is to be decentralized, permissionless, and open to anyone. We joined Optimism as a Core Dev on the open source OP Stack, and open sourcing Base’s contracts and frontend is a continuation of our commitment to building a technology that is open for everyone.”","By open-sourcing its smart contract repositories (or repos), the core Base team aims to provide developers with increased transparency around its development. All contracts and scripts are now <a href=\"https:\/\/github.com\/base-org\/contracts\" data-v-f87c67ca=\"\">publicly available<\/a> on GitHub, offering insights into various on-chain actions, from contract deployments to upgrades.","Open-sourcing is an important concept within the crypto industry and a key part of its ethos. It enables transparency over operations and allows for community-based auditing, so vulnerabilities can be seen and fixed faster. On the other hand, it may also make it easier for malicious actors to exploit such vulnerabilities.","Encouraging developers to check out its codebase, the project is also offering a bounty payout of up to $1,000,000 for bug discovery via the Coinbase HackerOne <a href=\"https:\/\/hackerone.com\/coinbase\" data-v-f87c67ca=\"\">bounty program<\/a>.","In addition to smart contracts, Base has also open-sourced its web properties, including base.org, docs.base.org, and bridge.base.org. This is again designed to boost transparency and encourage developers to contribute and provide feedback. For example, developers can delve into the code responsible for Base’s deposits and withdrawals, providing a blueprint for those looking to craft similar functions.","Earlier this year, Base outlined its <a href=\"https:\/\/base.mirror.xyz\/aBwt4flT1WAKJGQTj2AXBpH_8Qd3umQ-ZECLAJoO_nE\" data-v-f87c67ca=\"\">commitment to decentralization<\/a> with the <a href=\"https:\/\/www.theblock.co\/post\/236277\/optimism-changes-name-to-op-mainnet-in-line-with-superchain-vision\" data-v-f87c67ca=\"\">Superchain<\/a> — Optimism’s vision to create a network of many Layer 2 blockchains.","Base said at the time it plans to <a href=\"https:\/\/www.theblock.co\/post\/247268\/coinbase-base-optimism\" data-v-f87c67ca=\"\">fully decentralize<\/a> the network in the future by implementing fault proofs and using diverse client software to keep the network censorship-resistant. However, there is no specific timeline for this transition. It also plans to assist in forming a \"security council\" for the Superchain — aimed at implementing further checks and balances on the security and decentralization of Base, Optimism and related chains.","“Base is still committed to decentralization and strengthening the OP Stack. Decentralization is critical for the success of Base and scaling Ethereum,” Raghuvanshi added. “Technical improvements need to mature before Layer 2s can safely reach higher degrees of decentralization. We’re working closely with the Optimism Collective to decentralize the OP Stack and Base. An effort like this will take time and collaboration from many parties.”","Base said it would continue its commitment to the open-source community by contributing to projects like the OP Stack and introducing improved open-source tools for the ecosystem.","Base's seven-day moving average <a href=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\/transaction-count-daily-7dma\" data-v-f87c67ca=\"\">transaction count<\/a> fell below optimistic rollup rival Arbitrum recently, ending an approximate month-long dominance for the Base Layer 2 that only <a href=\"https:\/\/www.theblock.co\/post\/243899\/base-mainnet-onchain-summer\" data-v-f87c67ca=\"\">launched<\/a> to the public on Aug. 9. The average has fallen around 65% from almost 1.5 million in September to under 500,000, according to The Block’s data dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\/transaction-count-daily-7dma\/embed\" title=\"Transaction Count on Optimistic Rollups (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","“We’re excited to see the energy in Layer 2 activity overall,” Raghuvanshi said. “Base has seen great momentum since we launched the mainnet in August. We’re first and foremost committed to our builders and helping them bring decentralized tech to a billion users.”","Last month, Coinbase Chief Legal Officer Paul Grewal said a <a href=\"https:\/\/www.theblock.co\/post\/252477\/base-token-not-ruled-out-entirely-coinbase-clo-paul-grewal\" data-v-f87c67ca=\"\">new token<\/a> for Base had not been ruled out entirely. However, “Base has no plans to issue a network token,” Raghuvanshi added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Raghuvanshi","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1,000,000","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"Anika Raghuvanshi","content":"PERSON"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"OP Stack","content":"ORGANIZATION"},{"type":"Paul Grewal","content":"PERSON"},{"type":"Aug. 9","content":"DATE"},{"type":"August","content":"DATE"}],"hashtag":["BASE","COINBASE","ETHEREUM","OPTIMISM"],"authors":["James Hunt","The Block"]}