{"summary":"Crypto custody firm Copper has announced the launch of a new digital assets brokerage platform for institutional trading.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265190\/crypto-custody-firm-copper-launches-institutional-trading-platform-for-tokenized-securities","publishDate":"2023-11-29T10:34:48","id":7495,"type":null,"title":"Crypto custody firm Copper launches institutional trading platform for tokenized securities","category":["COMPANIES"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Crypto custody firm <a href=\"https:\/\/www.theblock.co\/post\/176752\/crypto-custodial-firm-copper-raises-196-million-in-series-c-round\" data-v-f87c67ca=\"\">Copper<\/a> on Wednesday launched a new digital assets brokerage platform for institutional trading <\/span>in the&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/232662\/uae-central-bank-issues-aml-cft-guidance-for-crypto\" data-v-f87c67ca=\"\">United Arab Emirates<\/a>.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Called&nbsp;Copper Securities, the platform combines a suite of blockchain-based financial and custodial services, with securities financing and payments applications to follow in the next 12 months. <\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">According to a press release, the new platform will be integrated with Copper's custodial partners, providing access to financial instruments in over 90 markets across the globe.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The new platform offers institutional investors access to tokenized securities, allowing traders to leverage <a href=\"https:\/\/www.theblock.co\/post\/265130\/sei-blockchain-to-add-ethereum-virtual-machine-support-in-v2-upgrade\" data-v-f87c67ca=\"\">blockchain<\/a> technology and smart contracts to manage traditional instruments such as equities. <\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Copper Securities said that it seeks to address inefficiencies and high operating costs in traditional market infrastructure. <\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"Clients using Copper’s ecosystem will benefit from automated processing of corporate actions, settlements, top-ups, and rebalances,\" the firm added.<\/span>","Copper acquired UAE-based blockchain brokerage firm called Securrency Capital earlier this month.<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;<\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The acquisition allows the firm to offer digital securities trading in the Abu Dhabi Global Market (ADGM), via its new Copper Securities platform.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"With the acquisition of Securrency Capital, I’m proud to announce that Copper is launching in the United Arab Emirates. This strategic move builds on our vision of transforming capital markets infrastructure by leveraging the power of blockchain technology and tokenization,\" Copper.co CEO Dmitry Tokarev said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"We believe that this will create a more transparent, efficient, and accessible financial system for institutional investors,\" he added.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Copper","content":"ORGANIZATION"},{"type":"Copper Securities","content":"ORGANIZATION"},{"type":"Dmitry Tokarev","content":"PERSON"},{"type":"United Arab Emirates","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"},{"type":"Securrency Capital","content":"ORGANIZATION"},{"type":"UAE","content":"ORGANIZATION"}],"hashtag":["CRYPTO MOVERS","PRIVATE COMPANY M&AMP;A","STAKING FIRMS"],"authors":["Brian McGleenon","The Block"]}