{"summary":"The next crypto bull cycle will need U.S. regulatory clarity and lower inflation, according to a Nansen researcher. ","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235727\/next-bitcoin-bull-run-will-require-us-clarity-lower-inflation-nansen","publishDate":"2023-06-20T16:54:16","id":75,"type":null,"title":"Next bitcoin bull will require better US regulation, lower inflation: Nansen","category":["Markets"],"content":["The next cryptocurrency <a href=\"https:\/\/www.theblock.co\/post\/235715\/bitcoin-price-surges-past-28000-for-first-time-in-a-month\" data-v-f87c67ca=\"\">bull market<\/a> will need regularity clarity in the U.S. and proof that core inflation is moving lower, according to the crypto analytics firm Nansen","\"Shallow BTC sell-offs and ongoing decrease in crypto implied volatility tell us that a lot of regulatory and macro bad news are already priced in,\" it <a href=\"http:\/\/Shallow BTC sell-offs and ongoing decrease in crypto implied volatility tell us that a lot of regulatory and macro bad news are already priced in\" data-v-f87c67ca=\"\">wrote<\/a> on Twitter, referencing a <a href=\"https:\/\/research.nansen.ai\/articles\/893\" data-v-f87c67ca=\"\">report<\/a> by Nansen research analyst Aurelie Barthere.&nbsp;","\"The scenario of a recession is being pushed back and inflation is surprising by its 'stubbornness,\" it continued. \"This creates non-linear effects, whereby monetary policy (outside of Asia) remains more restrictive for longer, and in turn, becomes an increasing headwind for risk assets.\"","Despite talk of U.S. regulatory uncertainty in the wake of lawsuits filed against crypto exchanges Coinbase and Binance by the Securities and Exchange Commission last month, bitcoin has been a solid performer. The price of the largest crypto by market capitalization is up 66.5% over the past six months and is currently trading at $28,023, according to <a href=\"https:\/\/www.tradingview.com\/symbols\/BTCUSD\/\" data-v-f87c67ca=\"\">TradingView<\/a>.&nbsp;","&nbsp;","&nbsp;"],"hashtag":[]}