{"summary":"This move by the Pyth Network could help increase its usage in decentralized applications and other ecosystems in the future.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206966\/off-chain-data-provider-pyth-expands-into-the-ethereum-ecosystem-by-launching-on-arbitrum","publishDate":"2023-01-31T08:00:12","id":7500,"type":null,"title":"Off-chain data provider Pyth expands into the Ethereum ecosystem by launching on Arbitrum","category":["INFRASTRUCTURE"],"content":["The Pyth Oracle Network launched price feeds on Arbitrum, which previously only had Chainlink oracles available on its network.","This move by Pyth, which has majority of its integrations in the Solana ecosystem, is a new foray for its network into the Ethereum ecosystem. Mike Cahill, director of the Pyth Data Association, praised Ethereum and Arbitrum for their prominence in the crypto space and said it was one of the main reasons behind the expansion.","A few smaller protocols on Arbitrum have already integrated Pyth’s oracles into their applications, but the majority of the Arbitrum ecosystem — such as its flagship options protocol <a href=\"https:\/\/blog.dopex.io\/articles\/marketing-campaigns\/dopex-upgrades-to-chainlink-price-feeds\" data-v-f87c67ca=\"\">Dopex<\/a> — is using Chainlink for its off-chain data sourcing.","The oracle market has largely been dominated by Chainlink, <a href=\"https:\/\/dune.com\/sergiimk\/Oracle-Comparison-(Chainlink-API3-Band-Ocean)\" data-v-f87c67ca=\"\">according<\/a> to Dune Analytics. Chainlink’s Total Value Secured (TVS) is <a href=\"https:\/\/defillama.com\/oracles\/Chainlink\" data-v-f87c67ca=\"\">$11 billion<\/a> and is the main oracle provider used by decentralized applications that need off-chain data. Pyth’s TVS is $110 million and its usage has largely been in the Solana ecosystem.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Oracle Network","content":"ORGANIZATION"},{"type":"Pyth","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$11 billion","content":"MONEY"},{"type":"Mike Cahill","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Chainlink","content":"LOCATION"},{"type":"Pyth Data Association","content":"ORGANIZATION"},{"type":"$110 million","content":"MONEY"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}