{"summary":"Binance has lost considerable market share among global rivals that do not offer U.S. dollar support this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253132\/binance-market-share-non-usd-exchanges","publishDate":"2023-09-27T03:35:40","id":752,"type":null,"title":"Binance&#x27;s market share among non-USD exchanges slips to 50%","category":["EXCHANGES"],"content":["Binance, the world’s largest crypto exchange, has lost considerable market share to global rivals that do not offer U.S. dollar support this year.","Binance finished 2022 with a 75% market share among a group of platforms that also includes major Asian players like Upbit, Huobi, Bybit and OKX — but that figure declined steadily throughout the year, hitting 54% in August, according to The Block Research’s data. Incomplete data for the month of September suggests Binance’s market share will fall further to under 51%.","A spokesperson for Binance declined to comment on the market share figures.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/no-usd-support-exchange-volume-market-share\/embed\" title=\"No USD Support Exchange Volume Market Share\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The exchange behemoth run by Changpeng Zhao has endured a punishing year on the regulatory front — most notably in the U.S., where it has been <a href=\"https:\/\/www.theblock.co\/post\/233154\/sec-files-suit-against-binance\" data-v-f87c67ca=\"\">sued by both the Securities and Exchange Commission<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/223015\/cftc-sues-binance#:~:text=Since%202017,%20Binance%20has%20%E2%80%9Ctaken,illegal%20activity%20since%20the%20site\" data-v-f87c67ca=\"\">the Commodity Futures Trading Commission<\/a>. It has also drawn scrutiny elsewhere, <a href=\"https:\/\/www.theguardian.com\/business\/2023\/jun\/16\/binance-to-quit-the-netherlands-investigation-france-crypto-exchange\" data-v-f87c67ca=\"\">such as in France, where it is under investigation<\/a>, while exiting other markets, like The Netherlands, entirely.","Binance <a href=\"https:\/\/www.theblock.co\/post\/232696\/binance-layoffs-cuts-jobs#:~:text=Crypto%20exchange%20Binance%20has%20laid,no%20plans%20to%20cut%20jobs.\" data-v-f87c67ca=\"\">laid off an undisclosed number of what was once a 7,000-strong workforce<\/a> in May, stating at the time that the decision was in part made “to ensure our resources are allocated properly to reflect the evolving demands of users and regulators.”","Justin d’Anethan, head of business development in Asia Pacific for Keyrock, the market maker, said he suspects both retail and institutional investors will have “shaved off some exposure, in light of the regulatory hurdles Binance is facing, in the U.S. and even globally,” adding: “That’s definitely benefiting the next exchanges in line, which ironically might not necessarily be more compliant but are less under the spotlight.”","The fall in market share for Binance comes with trading volumes are down across the board. Spot volumes across all exchanges <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\" data-v-f87c67ca=\"\">came in at just $423 billion in August<\/a>, the lowest number since 2020.&nbsp;","“We will have to see how such volumes might see a recovery as the markets turns favourable — for Binance it will certainly depend on its ability to secure regulatory clearance wherever it seeks to operate because generally as jurisdictions have been stepping up, whether through enforcement or policy-making,” said&nbsp;Ben Caselin, chief strategy officer at MaskEx. “Over the coming months we should expect investors and crypto traders to increasingly seek out licensed exchanges or, if more inclined towards self-custody, otherwise seek out decentralized trading venues.”","The exact cause of the dip in Binance's market share is hard to pinpoint, however. Steven Zheng, director of research at The Block Research, pointed out that <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-launches-zero-fee-bitcoin-trading-10435147c55d4a40b64fcbf43cb46329\" data-v-f87c67ca=\"\">Binance launched a zero-fee bitcoin trading campaign<\/a> in July 2022 — at roughly the same time that it began gobbling up more market share.","Huobi and Upbit have gained traction as Binance slipped this year, with the latter now accounting for 14.5% of volumes.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Justin d’Anethan","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"14.5%","content":"PERCENT"},{"type":"France","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"54%","content":"PERCENT"},{"type":"Steven Zheng","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"The Netherlands","content":"LOCATION"},{"type":"$423 billion","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"August","content":"DATE"},{"type":"Binance","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"51%","content":"PERCENT"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Asia Pacific","content":"LOCATION"},{"type":"Ben Caselin","content":"PERSON"},{"type":"Huobi","content":"PERSON"},{"type":"July 2022","content":"DATE"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["BINANCE"],"authors":["Ryan Weeks","Timmy Shen","The Block"]}