{"summary":"FTX lawyers lay out allegations that Sam Bankman-Fried, attorneys representing the Bahamian-based subsidiary he still controls, and the Bahamian government are in violation of U.S. bankruptcy law preventing selective payments to creditors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194385\/ftx-bankman-fried-bahamas-authorities","publishDate":"2022-12-13T05:22:17","id":7525,"type":null,"title":"FTX filing alleges Bahamas authorities coordinated with Bankman-Fried","category":["POLICY"],"content":["Attorneys representing the current leadership of FTX, those representing the Bahamas-based trading operation still controlled by former CEO Sam Bankman-Fried, and the Bahamian government are all wrangling over hundreds of millions of dollars' worth of assets kept in the island nation.","In a bombshell motion filed in a U.S. court late yesterday, attorneys representing the failed crypto exchange and its new CEO, corporate bankruptcy and restructuring specialist John Ray, imply that Bahamian officials and attorneys for Bankman-Fried may be breaking U.S. law by keeping large quantities of assets outside of the Chapter 11 bankruptcy process — and that the Bahamas government and the Bahamas Securities Commission may have helped.","The motion objects to an effort to loosen the automatic stay on payments to creditors before the bankruptcy process is completed, a window of time that takes years.&nbsp; It was filed just hours before Bahamian authorities <a href=\"https:\/\/www.theblock.co\/post\/186393\/sam-bankman-fried-arrested-in-the-bahamas\" data-v-f87c67ca=\"\">arrested<\/a> Bankman-Fried in anticipation of a U.S. indictment and subsequent extradition for various charges to be announced later today.&nbsp;&nbsp;","According to the motion, the company also minted new tokens shortly after filing for bankruptcy protection, around the same time an unknown actor withdrew hundreds of millions of dollars-worth of digital assets.","“[FTX] possess information that indicates that the Commission was involved in directing others to access the computer systems of [FTX] on or around November 12, 2022, that digital assets were transferred, that tokens were minted and that such actions were taken (or facilitated) by Messrs. Bankman-Fried and [Gary] Wang, perhaps among others, at the express direction of the Commission and Ms. Christina Rolle, Executive Director of the Commission,” Ray wrote to Bahamian Attorney General Ryan Pinder and Prime Minister Philip Davis in a Dec. 1 letter cited in the filing.","The letter continues to argue that, “Any transfer of assets of the FTX Global Debtors to accounts maintained by the Commission on or after November 11, 2022, constitute a violation of the automatic stay,” on payments to creditors by companies in bankruptcy, including foreign affiliates, according to U.S. law. “Violations of the automatic stay can result in damages, sanctions and penalties, which will be sought as and when necessary.”","Attorneys for FTX argue that actions by lawyers representing the Bahamian subsidiary that Bankman-Fried retains more control of, as well as Bahamian regulators, are in violation of U.S. bankruptcy law forcing an automatic stay on debts until a judge can reach conclusions over who is owed what.&nbsp;","Before putting the majority of his multinational corporate empire into bankruptcy Bankman-Fried also offered to place Bahamian customers ahead of all other FTX customers in direct communication with the country’s attorney general, Ryan Pinder, according to the filing. In the same exchange, Pinder said he was briefing Bahamian PM Davis on the matter.","A day before placing most of his companies into Chapter 11 protection, in which assets must be frozen in place, Bankman-Fried wrote to Pinder to apologize for the situation and told the attorney general, “we have segregated funds for all Bahamian customers on FTX. And we would be more than happy to open up withdrawals for all Bahamian customers on FTX, so that they can, tomorrow, fully withdraw all of their assets, making them fully whole.”","Bankman-Fried continued: “It's your call whether you want us to do this — but we are more than happy to and would consider it the very least of our duty to the country, and could open it up immediately if you reply saying you want us to. If we don't hear back from you, we are going to go ahead and do it tomorrow.”","Pinder’s response, if one came, is not included in the filing. But earlier in email exchanges from the week of FTX’s collapse — which included other FTX executives as well as Bankman-Fried’s father, Stanford Law Professor Joseph Bankman — the Bahamian attorney general pressed SBF on Binance’s onetime proposal to acquire FTX, as well as asking, “What is the ongoing commitment to The Bahamas?”","Twelve hours after Bankman-Fried's offer to make Bahamian customers whole before any others, the FTX corporate Twitter account <a href=\"https:\/\/twitter.com\/FTX_Official\/status\/1590783569471115264?s=20&amp;t=7dTX69fL4wRCHc-2lH5_uA\" data-v-f87c67ca=\"\">tweeted<\/a> that, \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Per our Bahamian HQ's regulation and regulators, we have begun to facilitate withdrawals of Bahamian funds. As such, you may have seen some withdrawals processed by FTX recently as we complied with the regulators.\"<\/span>","Prior to becoming attorney general last year, Pinder was a wealth management attorney and former lawyer for Deltec Bank, the bank for stablecoin issuer Tether. On Nov. 27 Pinder delivered a national address forcefully attacking FTX’s current leadership and defending the Bahamian government’s response to the situation, which FTX’s current attorneys included in transcript form in support of their argument against the Bahamas.","In an email from Pinder to Bankman-Fried sent on the morning of Nov. 9, he asked the former CEO whether any FTX-affiliated company had “leveraged or exposed client assets in any way and for any purpose?”","As he’s done publicly, Bankman-Fried conceded in a one sentence response to the question that the company “did not intend to, but are concerned that poor risk management lead to a liquidity issue.” He also offered to brief Bahamian PM Davis and the Securities Commission in coming days.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Stanford Law","content":"ORGANIZATION"},{"type":"Bahamas Securities Commission","content":"ORGANIZATION"},{"type":"Nov. 9","content":"DATE"},{"type":"Gary] Wang","content":"PERSON"},{"type":"Christina Rolle","content":"PERSON"},{"type":"November 11, 2022","content":"DATE"},{"type":"Pinder","content":"PERSON"},{"type":"Philip Davis","content":"PERSON"},{"type":"Dec. 1","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Securities Commission","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Ryan Pinder","content":"PERSON"},{"type":"Joseph Bankman","content":"PERSON"},{"type":"Deltec Bank","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Davis","content":"PERSON"},{"type":"Nov. 27 Pinder","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"The Bahamas","content":"LOCATION"},{"type":"Alameda","content":"LOCATION"},{"type":"morning","content":"TIME"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"John Ray","content":"PERSON"},{"type":"November 12, 2022","content":"DATE"}],"hashtag":["BANKRUPTCY FILINGS","COURT HEARINGS","FTX"],"authors":["Colin Wilhelm","The Block"]}