{"summary":"Chainlink’s Proof of Reserve (PoR) feature is now available on Aave lending platform on the Avalanche blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209312\/aave-integrates-chainlinks-proof-of-reserves-on-avalanche-via-bgd-labs","publishDate":"2023-02-07T09:38:38","id":7526,"type":null,"title":"Aave integrates Chainlink&#x27;s proof of reserves on Avalanche via BGD Labs","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Chainlink’s Proof of Reserve feature is now available on Aave lending platform on the Avalanche blockchain for on-chain verification and transparency of lending markets.<\/span>","<span data-v-f87c67ca=\"\">BGD Labs, a development firm focusing on the Aave ecosystem, led the integration that <\/span><span data-v-f87c67ca=\"\">will enable transparency for monitoring the financial state of liquidity pools on Avalanche-based Aave platform that contain wrapped tokens like AAVE.e, DAI.e, LINK.e, WBTC.e, and WETH.e.<\/span>","<span data-v-f87c67ca=\"\">Avalanche relies on bridging for many Ethereum-based tokens which can then be used on Aave. The bridging process works by locking up an amount of tokens and issuing an equivalent number of tokens on Avalanche, a process called wrapping.<\/span>","<span data-v-f87c67ca=\"\">As one of the potential challenges with using wrapped tokens being the security risks associated with them. The Chainlink PoR integration will enable users to verify that Aave markets are collateralized and reduce the risks of using wrapped tokens<\/span><span data-v-f87c67ca=\"\"> by providing automated on-chain data feeds.<\/span>","<span data-v-f87c67ca=\"\">\"Real-time access to the state of cross-chain liquidity pools increases the transparency and verifiability of the Aave market on Avalanche,\" said Stani Kulechov, founder and CEO of Aave Companies. \"Bringing additional visibility into reserve collateral is a necessary step forward and will help build more confidence and trust with end-users.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Chainlink’s Proof of Reserve","content":"ORGANIZATION"},{"type":"Aave Companies","content":"ORGANIZATION"},{"type":"Stani Kulechov","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ASSETS","AVALANCHE","LENDING"],"authors":["Vishal Chawla","The Block"]}