{"summary":"Users on OPNX have until Feb. 8 to settle positions and Feb. 14 to withdraw funds and export historical data. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275695\/crypto-derivatives-exchange-opnx-to-shut-down-in-february","publishDate":"2024-02-01T17:01:51","id":7539,"type":null,"title":"Crypto derivatives exchange OPNX to shut down in February","category":["COMPANIES"],"content":["Crypto derivatives and claims trading platform Open Exchange (OPNX) will shut down this month.&nbsp;","In a message to users that was <a href=\"https:\/\/twitter.com\/cole0x\/status\/1753166187590996363?t=u6jTSfzwvIGmtKm4C4AckQ&amp;s=19\" data-v-f87c67ca=\"\">shared<\/a> on the social media platform X, the OPNX team said the platform \"will officially cease operations and shut down in February 2024. We are dedicated to ensuring an orderly closure for all users.\"","The firm added that users should settle all positions before Feb. 7 at 8. a.m. UTC (3 a.m. ET), after which the platform will automatically settle any open positions. Users have until Feb. 14 to withdraw funds and export their historical data.","\"We are deeply thankful to each member of the OPNX community for their dedication and trust. As we conclude this chapter, we cherish the experiences shared and look ahead with gratitude,\" the OPNX team said.&nbsp;","OPNX was previously known as Coinflex but <a href=\"https:\/\/www.theblock.co\/post\/218171\/coinflex-rebrands-to-opnx-with-leslie-lamb-as-ceo-of-3ac-founders-latest-venture\" data-v-f87c67ca=\"\">rebranded<\/a> in March 2023. The exchange is associated with Kyle Davies and&nbsp;<a class=\"c-link\" href=\"https:\/\/www.theblock.co\/post\/210279\/su-zhu-unveils-new-opnx-exchange-for-trading-trapped-crypto-funds\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/210279\/su-zhu-unveils-new-opnx-exchange-for-trading-trapped-crypto-funds\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Su Zhu<\/a>, the co-founders of the bankrupt crypto lender Three Arrows Capital.","The company did not immediately respond to a request for comment from The Block.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Kyle Davies","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"3 a.m.","content":"TIME"},{"type":"Feb. 7","content":"DATE"},{"type":"February 2024","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Su Zhu","content":"PERSON"},{"type":"March 2023","content":"DATE"},{"type":"Feb. 14","content":"DATE"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}