{"summary":"No assets were lost, and user security has not been affected by a critical Remote Code Execution vulnerability in the iOS app.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268406\/crypto-exchange-okx-fixes-vulnerability-in-ios-app-and-urges-users-to-update-it","publishDate":"2023-12-19T10:55:02","id":7541,"type":null,"title":"Crypto exchange OKX fixes vulnerability in iOS app and urges users to update it","category":["COMPANIES"],"content":["Crypto exchange OKX has fixed a vulnerability affecting its iOS wallet app with an update, an OKX spokesperson told The Block.","In a translated <a href=\"https:\/\/twitter.com\/okxchinese\/status\/1737128143981576622?s=20\" data-v-f87c67ca=\"\">post<\/a> on OKX's Chinese social media page, the platform said that the bug affected a third-party application service provider. No assets were lost, and the bug does not threaten the security of user assets.&nbsp;","OKX urged users to update their iOS app as soon as possible, as the vulnerability has been solved for iOS version 6.45.0.&nbsp;","The web3 security analysis platform CertiK noted Tuesday morning that OKX iOS users should update their app as soon as possible, an hour before OKX's Chinese post.&nbsp;","\"We urge users of OKX wallets to update their iOS app to the latest version immediately,\" CertiK <a href=\"https:\/\/twitter.com\/CertiK\/status\/1737110916699959433\" data-v-f87c67ca=\"\">wrote<\/a> on the social media platform X. \"Earlier this month, we identified and reported a critical Remote Code Execution (RCE) vulnerability in the OKX iOS app, leading to potential compromise of sensitive data and crypto assets. The OKX team responded swiftly and issued an updated version today.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"OKX","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"morning","content":"TIME"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Earlier this month","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"}],"hashtag":["OKX"],"authors":["MK Manoylov","The Block"]}