{"summary":"Overview On July 3, 2023, the TRON ecosystem welcomed its first Real-World Asset (RWA) product, stUSDT, which is operated by the decentralized financial","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274118\/stusdt-2023-year-in-review","publishDate":"2024-01-24T09:01:27","id":7542,"type":null,"title":"stUSDT 2023 Year in Review","category":["SPONSORED"],"content":["<strong data-v-f87c67ca=\"\">Overview<\/strong><br data-v-f87c67ca=\"\">\nOn July 3, 2023, the TRON ecosystem welcomed its first Real-World Asset (RWA) product, stUSDT, which is operated by the decentralized financial platform JustLend DAO. <br data-v-f87c67ca=\"\">\nThe stUSDT platform is dedicated to narrowing the divide between retail and institutional investors while connecting the crypto realm with the real world. stUSDT ensures equal opportunities for all to invest in RWAs.","<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">What is stUSDT?<\/strong><br data-v-f87c67ca=\"\">\nstUSDT is a receipt token that complies with the TRC-20 and ERC-20 standards and can be obtained by staking USDT into the stUSDT-RWA Contract. It supports transfers and can be utilized in other DeFi protocols. The exchange rate between stUSDT and USDT is maintained at 1:1 by the stUSDT-RWA Contract (special rules may apply).<br data-v-f87c67ca=\"\">\nStaking rewards are distributed in the form of stUSDT through a daily rebase. There is also a wrapped version of stUSDT, known as wstUSDT. While a holder’s stUSDT balance increases as it receives daily rebase rewards, wstUSDT accrues the underlying stUSDT rewards and will constantly increase in value beyond 1 stUSDT.","<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Growth<\/strong><br data-v-f87c67ca=\"\">\nSince its launch, stUSDT has made an immediate impact on the market, with its TVL surpassing $22 million within the first 24 hours.<br data-v-f87c67ca=\"\">\nThe TVL has continued to rise ever since. On September 29, stUSDT ascended to the top 10 protocols in the DefiLlama TVL rankings, closing out the year with a TVL of $2.29 billion and boasting over 350,600 stakers.<br data-v-f87c67ca=\"\">\nFor the past three months, the APY on both the TRON and Ethereum networks has remained consistent, ranging from 4.7% to 4.8% for each network.","<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Key Events<\/strong><br data-v-f87c67ca=\"\">\nOn July 14, the stUSDT platform officially launched wstUSDT (wrapped stUSDT), a non-rebasing version of stUSDT.<br data-v-f87c67ca=\"\">\nOn July 27, the stUSDT platform added support for the Ethereum network. This integration empowers users to effectively manage and invest their assets by leveraging the diverse Ethereum ecosystem.<br data-v-f87c67ca=\"\">\nOn August 14, the stUSDT platform introduced support for TUSD staking. With this new feature, users can stake TUSD or USDT to obtain stUSDT, thereby earning rewards through the Rebase mechanism. <br data-v-f87c67ca=\"\">\nOn October 10, the proposal from Curve to add a gauge for the stUSDT\/crvUSD pool was passed.<br data-v-f87c67ca=\"\">\nOn November 24, the proposal to empower JST by allocating stUSDT protocol revenue for JST\/TRX liquidity pooling in SunSwap V2 was passed.","<strong data-v-f87c67ca=\"\">Conclusion<\/strong><br data-v-f87c67ca=\"\">\nIn an ever-evolving space where TradFi and DeFi often seem at odds, stUSDT is one of the pioneers striving to create a product that combines the best of both worlds and propels the next phase of growth in the blockchain industry.","<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">This post is commissioned by TRON and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TVL","content":"ORGANIZATION"},{"type":"$2.29 billion","content":"MONEY"},{"type":"4.8%","content":"PERCENT"},{"type":"USDT","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"July 14","content":"DATE"},{"type":"DefiLlama TVL","content":"ORGANIZATION"},{"type":"SunSwap V2","content":"ORGANIZATION"},{"type":"4.7%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"November 24","content":"DATE"},{"type":"August 14","content":"DATE"},{"type":"October 10","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"TRC","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"JustLend DAO","content":"ORGANIZATION"},{"type":"$22 million","content":"MONEY"},{"type":"July 3, 2023","content":"DATE"},{"type":"TRON","content":"ORGANIZATION"},{"type":"JST\/TRX","content":"ORGANIZATION"},{"type":"September 29","content":"DATE"},{"type":"July 27","content":"DATE"}],"hashtag":[],"authors":["Sponsored","The Block"]}