{"summary":"Ethereum scaling solution Optimism has reduced the number of wallets that are eligible to receive its upcoming airdrop.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/148417\/optimism-cracks-down-on-airdrop-farmers","publishDate":"2022-05-24T07:03:03","id":7546,"type":null,"title":"Optimism cracks down on airdrop farmers, removing 17,000 addresses","category":["LAYER 2S AND SCALING"],"content":["Ethereum scaling solution Optimism has reduced the number of wallets that are eligible to receive its upcoming airdrop.","According to a <a href=\"https:\/\/twitter.com\/optimismPBC\/status\/1528830231322165249\" data-v-f87c67ca=\"\">post<\/a> on Twitter yesterday, Optimism has removed 17,000 addresses that it thinks were traders trying to deliberately game the system.","This is a process known as airdrop farming, or also called a sybil attack. It's done by those who are speculating that a project might do an airdrop. To do this, they spin up a lot of wallets and use the application in question across all the wallets, hoping that if each one receives the airdrop, they might make a lot of money.","Optimism said the tokens that would have been sent to these wallets will be redistributed among the remaining eligible wallets.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Optimism is for the people, not the sybils,\" Optimism said on Twitter.<\/span>","Airdrop farming has hit several previous crypto projects. The most high-profile case was when Divergence Ventures used a lot of addresses to <a href=\"https:\/\/www.theblockcrypto.com\/news+\/120824\/vcs-pre-farming-defi-projects-raises-questions-about-ethics-in-crypto-investing-and-aidrops\" data-v-f87c67ca=\"\">try to game<\/a> the Ribbon Finance airdrop, a project that it had earlier invested in. It <a href=\"https:\/\/www.theblockcrypto.com\/news+\/124393\/the-delicate-balance-of-getting-a-big-crypto-airdrop-right\" data-v-f87c67ca=\"\">initially earned<\/a> $3.2 million from this strategy but later returned the money after it was identified on Twitter and a backlash ensued.","On April 26, Optimism <a href=\"https:\/\/www.theblockcrypto.com\/linked\/143635\/ethereum-scaling-startup-optimism-confirms-governance-token-as-part-of-broader-shift\" data-v-f87c67ca=\"\">announced<\/a> its airdrop, saying that 250,000 addresses were eligible. It is only handing out 5% of its total supply of tokens, with a further 14% designated for future airdrops. The remaining tokens will be spread among an ecosystem fund, public goods funding, its core contributors and private investors.","In Optimism's Discord server, an Optimism contributor known as NoobMan <a href=\"https:\/\/discord.com\/channels\/667044843901681675\/968498016417902673\/976125478349987890\" data-v-f87c67ca=\"\">said<\/a> the token distribution was likely to happen at the end of May or in June.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ribbon Finance","content":"ORGANIZATION"},{"type":"April 26","content":"DATE"},{"type":"14%","content":"PERCENT"},{"type":"NoobMan","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Divergence Ventures","content":"ORGANIZATION"},{"type":"$3.2 million","content":"MONEY"}],"hashtag":["AIRDROP","OPTIMISM"],"authors":["Tim Copeland","The Block"]}