{"summary":"The Australian Securities Exchange (ASX) has further delayed the rollout of its blockchain settlement system — this time by one more year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/69950\/asx-further-delays-launch-of-its-blockchain-settlement-system-this-time-by-one-more-year","publishDate":"2020-06-30T07:50:38","id":7549,"type":null,"title":"ASX further delays launch of its blockchain settlement system — this time by one more year","category":["LAYER 1S"],"content":["The Australian Securities Exchange (ASX) has further delayed the rollout of its blockchain settlement system — this time by one more year.","ASX is now targeting the <a href=\"https:\/\/www2.asx.com.au\/content\/dam\/asx\/about\/media-releases\/2020\/asx-consultation-on-new-implementation-date-for-chess-replacement-media-release.pdf\" data-v-f87c67ca=\"\">launch date of April 2022<\/a>, subject to user feedback. The exchange is conducting a <a href=\"http:\/\/www2.asx.com.au\/content\/dam\/asx\/markets\/clearing-and-settlement-services\/chess-replacement-consultation-paper-revised-implementation-timetable.pdf\" data-v-f87c67ca=\"\">month-long consultation<\/a> with users of its existing CHESS (clearing house electronic subregister system) system to determine whether they are able to meet the revised timetable. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nCHESS is over 25 years old. ASX deputy CEO Peter Hiom said the new CHESS system will deliver “existing services, new and enhanced functionality, high availability, reliability and performance, and will underpin Australia’s financial markets for the next decade and beyond.”","In March, ASX <a href=\"https:\/\/www.theblockcrypto.com\/post\/59853\/asx-further-delays-launch-of-blockchain-settlement-system-this-time-due-to-coronavirus\" data-v-f87c67ca=\"\">put<\/a> the CHESS replacement project under review due to coronavirus and to allow CHESS users to focus on day-to-day operations during the pandemic.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","Hiom said ASX remains “committed” to the project. The new CHESS system is developed in partnership with Digital Asset. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nASX said 34 organizations have connected to the customer development environment (CDE), including software providers, brokers and share registries. It also said that 89% of the core clearing and settlement functionality to be used by customers has been deployed into CDE, so it can be tested by participants.","The industry-testing environment, initially for back-office software providers, has been pushed by six months to December 2020. \"We have made great progress in challenging circumstances and are focused on delivering the solution in a safe and timely manner,” said Hiom.","ASX's customers are reportedly worried about the new CHESS system and want the exchange to delay its launch. For instance, stock transfer company Computershare, <a href=\"https:\/\/www.ft.com\/content\/9acde1ba-184a-4827-880f-a5168275da38\" data-v-f87c67ca=\"\">told<\/a> the Financial Times that it was seeking a two-year delay in implementation because the project lacks clarity. Australia’s Stockbrokers and Financial Advisers Association told the outlet it also wants a 6-to-12-month delay to the project.","The CHESS replacement project has been under development since 2016 and has faced several delays to date.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"ASX","content":"ORGANIZATION"},{"type":"Australia’s Stockbrokers and Financial Advisers Association","content":"ORGANIZATION"},{"type":"April 2022","content":"DATE"},{"type":"Peter Hiom","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Digital Asset","content":"ORGANIZATION"},{"type":"89%","content":"PERCENT"},{"type":"Australian Securities Exchange (ASX","content":"ORGANIZATION"},{"type":"Computershare","content":"ORGANIZATION"},{"type":"December 2020","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Australia","content":"LOCATION"},{"type":"Hiom","content":"PERSON"},{"type":"Financial Times","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}