{"summary":"The CFTC is bringing an action against Digitex Futures and its founder for failing to register and attempting to pump its token.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174081\/cftc-brings-action-against-digitex-futures","publishDate":"2022-09-30T13:40:34","id":755,"type":null,"title":"CFTC brings action against Digitex Futures","category":["LEGAL"],"content":["The Commodity Futures Trading Commission (CFTC) is suing crypto futures exchange Digitex LLC and its founder and CEO Adam Todd for failing to register with the agency and attempting to manipulate the price of their token.","Digitex Futures met the definition of designated contract market or foreign board of trade, yet never sought registration with the commission as a futures commission merchant, a necessary licensure according to the CFTC. The complaint also alleges Digitex failed to comply with Bank Secrecy Act requirements, including implementing effective know-your-customer checks and a customer information program.","The complaint further alleges that Todd attempted to manipulate the price of the exchange's native token, DGTX. The CFTC claims Todd allegedly manipulated the price of DGTX by buying up swaths of the token, not with the intention of making money on the individual trades, but inflating the exchange's holdings by pumping the price of the token. The complaint cites multiple moments where Todd discussed the actions on livestreams.&nbsp;","\"Unless restrained and enjoined by this Court, Defendants are likely to continue to engage in the acts and practices alleged in this complaint and similar acts and practices,\" said the complaint.","The CFTC wants a court order prohibiting Digitex and Todd from continuing transactions. The CFTC also wants Digitex and Todd to be halted from trading on registered exchanges, engaging in transactions involving \"commodity interests,\" and digital assets considered commodities, or soliciting or accepting funds for the purpose of purchasing or selling commodities. The agency also wants the firm return profits and disgorge other gains, make full restitution and pay civil monetary penalties to be determined.","A Twitter account appearing to be the company's official one touts a 'Digitex 2.o coming soon' from April 29. The company's website no longer appears to be active.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Adam Todd","content":"PERSON"},{"type":"Digitex LLC","content":"ORGANIZATION"},{"type":"April 29","content":"DATE"},{"type":"Todd","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Digitex","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"}],"hashtag":["CFTC"],"authors":["Aislinn Keely","The Block"]}