{"summary":"Australia’s financial watchdog sued Finder Wallet, the subsidiary of comparison website Finder.com, over a product crypto-related yield product.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195590\/australian-regulator-sues-finder-wallet-for-unlicensed-financial-services","publishDate":"2022-12-15T21:30:16","id":7552,"type":null,"title":"Australian regulator sues Finder Wallet for &#x27;unlicensed&#x27; financial services","category":["REGULATION"],"content":["Australia’s financial watchdog sued Finder Wallet, a subsidiary of comparison website Finder.com, over a crypto-linked yield product.","The Australian Securities and Investment Commission (ASIC) sued the startup for “alleged unlicensed conduct and inadequate risk disclosure,” it said in <a href=\"https:\/\/asic.gov.au\/about-asic\/news-centre\/find-a-media-release\/2022-releases\/22-359mr-finder-wallet-sued-for-alleged-unlicensed-conduct-and-inadequate-risk-disclosure-over-finder-earn-product\/\" data-v-f87c67ca=\"\">a statement<\/a> on Dec. 15.","The product in question, Finder Earn, was offered between February and Nov. 10 this year, and involved converting user deposits in Australian dollars into an Australian dollar-linked stablecoin called TAUD, which Finder then used as working capital. The company offered interest rates on deposits of 4.01% and 6.01%.","ASIC said the product closely resembled a debenture, and therefore required appropriate licensing.","“This is ASIC’s third recent action against a firm offering a crypto-asset related product that we consider to be a financial product. Our message to industry is clear — just because an offer involves a crypto-asset related product does not guarantee it will fall outside the current regulatory regime,” ASIC deputy chair Sarah Court said.","Finder Wallet stopped offering its Finder Earn product on Nov. 24, returning all funds to customers, after ASIC informed the company of its concerns. ASIC said it is “seeking declarations and pecuniary penalties from the court.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6.01%","content":"PERCENT"},{"type":"Australia","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Nov. 10 this year","content":"DATE"},{"type":"February","content":"DATE"},{"type":"4.01%","content":"PERCENT"},{"type":"Sarah Court","content":"PERSON"},{"type":"Australian Securities and Investment Commission","content":"ORGANIZATION"},{"type":"Dec. 15","content":"DATE"},{"type":"Nov. 24","content":"DATE"},{"type":"ASIC","content":"ORGANIZATION"}],"hashtag":["LAWSUITS"],"authors":["Ryan Weeks","The Block"]}