{"summary":"The Ukrainian government launched a collection with 2,182 NFTs representing a timeline of the war with Russia. After a week of being out, hundreds of those NFTs haven&#x27;t yet sold.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/140608\/ukraines-nft-collection-is-still-far-from-selling-out-after-a-week","publishDate":"2022-04-07T17:33:58","id":7558,"type":null,"title":"Ukraine&#x27;s NFT collection is still far from selling out after a week","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">Midway through last week, the Ukrainian government launched its <a href=\"https:\/\/www.theblockcrypto.com\/linked\/137658\/ukraines-nft-collection-will-be-like-a-museum-of-the-war-minister-says\" data-v-f87c67ca=\"\">much-anticipated NFT collection<\/a>, with the goal of raising around $1 million for war and humanitarian efforts. Yet after a week has passed, hundreds of the 2,182 NFTs have yet to be sold.&nbsp;<\/span>","It's the first time a nation has launched its own NFT collection. But so far the sale has been met with much less enthusiasm than other high-profile NFT sales, which often sell out immediately.","<span data-v-f87c67ca=\"\">The collection was announced at the beginning of March when the Ukrainian government <a href=\"https:\/\/www.theblockcrypto.com\/linked\/136211\/ukraine-cancels-crypto-airdrop-plans-to-sell-nfts-instead\" data-v-f87c67ca=\"\">canceled its original plan for a crypto airdrop<\/a> and said that it would instead sell NFTs. It then took nearly a month to reveal the collection. <\/span>","<span data-v-f87c67ca=\"\">Named \"META HISTORY: Museum of War,\" it depicts a timeline of events from the start of the war through artworks with a tweet stacked on top. <\/span><span data-v-f87c67ca=\"\">One of them is a drawing of airplanes inside a birdcage, calling back to when European Commission President Ursula von der Leyen announced the EU would close its airspace to all Russian aircraft. Another shows a number of skulls with flowers growing out of them symbolizing Russian soldiers who lost their lives.<\/span>","Source: OpenSea","<span data-v-f87c67ca=\"\">To buy one, users must visit the project's website and mint it, after which the NFTs are listed on OpenSea. The Ukraine government announced 24 hours after the launch that 1,051 had sold. As of Thursday afternoon, under 1,600<\/span><span data-v-f87c67ca=\"\"> were listed on OpenSea, with the total number of owners being 641.<\/span>","A spokesperson for The Ukrainian Ministry of Digital Transformation, the agency behind the NFT sale, said it has raised over $600,000 so far.","<span data-v-f87c67ca=\"\">Meanwhile, the floor price on OpenSea stands at 0.155 ETH and the secondary trading volume at 13.6 ETH as of Thursday afternoon — numbers that indicate that the secondary market for the collection isn’t very strong.&nbsp;<\/span>","The spokesperson declined to answer questions about whether the sale has met the agency's expectations thus far. <span data-v-f87c67ca=\"\">If it does reach its goal of raising a little over $1 million, that would be just a small portion of the more than $70 million that the country has received in crypto assets since Russia’s invasion on February 24.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"February 24","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"$600,000","content":"MONEY"},{"type":"$70 million","content":"MONEY"},{"type":"European Commission President Ursula von der Leyen","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Russia","content":"LOCATION"},{"type":"The Ukrainian Ministry of Digital Transformation","content":"ORGANIZATION"},{"type":"afternoon","content":"TIME"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}