{"summary":"The chair of the House Financial Services Committee invited former FTX CEO Sam Bankman-Fried to bring his “candid” discussions about the exchange’s collapse to Capitol Hill.\nRep. Maxine Waters, D-Calif., would “welcome” Bankman-Fried’s participation during the committee’s FTX hearing later this month.","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191765\/rep-waters-sam-bankman-fried-should-bring-candid-ftx-discussions-to-congress","publishDate":"2022-12-02T10:48:18","id":756,"type":null,"title":"Rep. Waters: Sam Bankman-Fried should bring &#x27;candid&#x27; FTX discussions to Congress","category":["Policy"],"content":["A key House lawmaker has an idea for the next stop on Sam Bankman-Fried’s apology tour: Capitol Hill.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","House Financial Services Committee Chair Maxine Waters lauded Bankman-Fried’s “candid” comments about the FTX collapse in a <a href=\"https:\/\/twitter.com\/RepMaxineWaters\/status\/1598693811252875264\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">tweet<\/span><\/a> on Friday, and invited him to come to a committee hearing on Dec. 13.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“We appreciate that you've been candid in your discussions about what happened at <span class=\"s2\" data-v-f87c67ca=\"\">#FTX<\/span>. Your willingness to talk to the public will help the company's customers, investors, and others. To that end, we would welcome your participation in our hearing on the 13th,” Waters wrote.","Bankman-Fried resigned as CEO of FTX when the firm filed for bankruptcy protection last month. Since then, the former billionaire has posted on Twitter and spoken with a number of media outlets to explain what led to the collapse of his crypto empire. In recent days, Bankman-Fried has said he <a href=\"https:\/\/www.theblock.co\/post\/191616\/sam-bankman-frieds-still-sorry-but-now-he-says-his-memory-isnt-great\" data-v-f87c67ca=\"\">doesn't remember<\/a> some details about how he ran FTX.","Waters’ committee will hold its first <a href=\"https:\/\/www.theblock.co\/post\/187617\/u-s-house-committee-to-hold-hearing-on-ftx-collapse-and-crypto-fall-out\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">hearing<\/span><\/a> on the FTX crash later this month. The Democratic chair and ranking Republican Rep. Patrick McHenry, R-N.C., said they expect to hear from Bankman-Fried and others involved in the catastrophe, including former executives from his Alameda Research trading firm and representatives of rival exchange Binance, which helped kick off the collapse.","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">\"As you said, <\/span><span class=\"r-18u37iz\" data-v-f87c67ca=\"\">@SBF_FTX<\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">, &nbsp;you have a duty to 'try to do what’s right' and to 'help customers out here.' If this is a true statement, testify before the House Financial Services Committee on 12\/13. Staff is ready to work with you to make this happen,\" McHenry said in a <a href=\"https:\/\/twitter.com\/PatrickMcHenry\/status\/1598694454231277569\" data-v-f87c67ca=\"\">tweet<\/a>. The Republican lawmaker is likely to chair the committee next year.<\/span>","Bankman-Fried did not respond to a request for comment.","The former FTX boss hinted this week that he may appear at future congressional hearings, but did not specify whether he will accept Waters’s invitation. It’s also unclear whether Bankman-Fried, who has been speaking with media from The Bahamas, would come to the U.S. for a hearing.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“I, you know, would not be surprised if, you know, sometime I am, you know, up there talking about what happened to our representatives or, you know, wherever else is most appropriate,” Bankman-Fried said during the New York Times DealBook <a href=\"https:\/\/www.theblock.co\/post\/191141\/sam-bankman-fried-set-to-speak-at-new-york-times-event-a-live-look\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">summit<\/span><\/a> this week.","Both chambers are taking a close look at FTX. The Senate Agriculture Committee held its first FTX <a href=\"https:\/\/www.theblock.co\/post\/191407\/cftc-chair-behnam-walks-fine-line-during-congress-first-ftx-hearing\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">hearing<\/span><\/a> this week, and the Senate Banking Committee is working to schedule a hearing of its own."],"hashtag":["FTX"]}