{"summary":"Lisk is collaborating with Optimism and Gelato to transition from a Layer 1 to an Ethereum Layer 2 solution.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268317\/lisk-ethereum-layer-2-optimism-gelato-lsk","publishDate":"2023-12-19T08:01:14","id":7568,"type":null,"title":"Lisk blockchain will become an Ethereum Layer 2 via Optimism and Gelato","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Lisk <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/256960\/lisk-lsk-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Lisk_Symbol_-_Blue.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">LSK<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.0071%\n    <\/span><\/a> <!----><\/span><\/span>, a Layer 1 blockchain launched in 2016, is transitioning to the Ethereum ecosystem as a Layer 2 solution.<\/span>","The new Lisk network will be powered by OP Stack, Optimism’s open-source framework for developing Layer 2 chains, and built using Gelato’s rollup-as-a-service platform. Lisk's Layer 2 will focus on real-world assets and decentralized physical infrastructure networks (<a href=\"https:\/\/www.theblock.co\/post\/252775\/solana-depin-projects-gig-economy-next-level\" data-v-f87c67ca=\"\">DePINs<\/a>), according to a statement.","“Integrating with the Ethereum ecosystem and aligning with industry standards brings us closer to our goal of making blockchain accessible than ever before,” Lisk co-founder Max Kordek said.&nbsp;","Back in the heyday of the 2017 bull market, Lisk was a <a href=\"https:\/\/coinmarketcap.com\/historical\/20171210\/\" data-v-f87c67ca=\"\">top 20<\/a> cryptocurrency by market capitalization. Fast-forward to 2023, and as the blockchain industry has matured, Lisk finds itself comparatively out of favor, falling to 272 in the rankings as its market cap declined <a href=\"https:\/\/coinmarketcap.com\/?page=3\" data-v-f87c67ca=\"\">83%<\/a> from $919 million to $152 million. With the widespread adoption of the Ethereum Virtual Machine, Lisk said it now sees a better opportunity to expedite its mission by migrating to become an Ethereum Layer 2.","The testnet deployment of Lisk’s Layer 2 network is scheduled for the first quarter of 2024 ahead of a mainnet launch, enabling developers to access up to 90% cheaper fees than the Ethereum mainnet, the Lisk team said.","The transition also involves the migration of the LSK token to Ethereum, designed to improve its usability across various dApps and DeFi protocols in the Ethereum ecosystem.&nbsp;","Lisk said existing reward-sharing mechanisms for LSK will continue, with the token also used for on-chain governance in an upcoming Lisk DAO.","Lisk also plans an initial airdrop of LSK tokens to incentivize activity on the new chain, with more details expected leading up to its mainnet launch.","Lisk joins Optimism and the Coinbase-incubated Layer 2 <a href=\"https:\/\/www.theblock.co\/post\/247268\/coinbase-base-optimism\" data-v-f87c67ca=\"\">Base<\/a> in utilizing the OP Stack, becoming the first Layer 1 to contribute to the development of the <a href=\"https:\/\/www.theblock.co\/post\/236277\/optimism-changes-name-to-op-mainnet-in-line-with-superchain-vision\" data-v-f87c67ca=\"\">Optimism Superchain<\/a> network of Layer 2 blockchains, the team said.","“Lisk’s transition to the OP Stack underscores our conviction that Layer 2s are the path to scaling not just Ethereum, but the blockchain movement itself,” Optimism Foundation Chief Scientist Ben Jones added.","Lisk is also collaborating with Ethereum rollup-as-a-service platform Gelato to build the Layer 2, allowing it to deploy the OP chain in just a few clicks without writing any additional code. Gelato will let Lisk integrate infrastructure and web3 services such as block explorers, bridges and oracles from launch.","“Using Gelato’s Rollup-as-a-Service platform allows the Lisk research and development team to be primarily focused on building additional products and tooling that developers and end users love, while also committing resources to the Superchain’s development,” Lisk Chief Project Officer Dominic Schwenter said.","The collaboration follows an expansion of Gelato’s platform, also announced today, to include OP Stack support in addition to Polygon CDK.","“We have known the team since our early days together in Berlin, and are excited to finally be able to work together more closely,” Gelato co-founder Hilmar Orth said. “By embracing Ethereum's ecosystem and porting its existing community onto a powerful Layer 2 blockchain using Gelato, we are collectively shaping the future of web3 scalability. The Lisk ecosystem will benefit greatly from better access to liquidity, developers and sequencing fee revenue generated from its Layer 2 blockchain.”","\"We are excited that Gelato has extended support to the Superchain as a RaaS provider for Lisk, making it easier for developers to onboard new users into the Superchain ecosystem,\" Optimism Foundation’s Ben Jones added.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Dominic Schwenter","content":"PERSON"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Max Kordek","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Ben Jones","content":"PERSON"},{"type":"Hilmar Orth","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Berlin","content":"LOCATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"-0.0071%","content":"PERCENT"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"$152 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"83%","content":"PERCENT"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Polygon CDK","content":"ORGANIZATION"},{"type":"$919 million","content":"MONEY"},{"type":"Lisk DAO","content":"ORGANIZATION"},{"type":"OP Stack","content":"ORGANIZATION"},{"type":"Lisk","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","OPTIMISM"],"authors":["James Hunt","The Block"]}