{"summary":"Fantom said its Sonic release, targeting 2,000 transactions per second, is expected to debut in late summer or early fall of this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284587\/fantom-plans-leverage-sonic-build-shared-sequencer","publishDate":"2024-03-26T01:22:18","id":7575,"type":null,"title":"Fantom plans to leverage Sonic to build a &#x27;shared sequencer&#x27;","category":["CRYPTO ECOSYSTEMS"],"content":["Fantom Foundation CEO Michael Kong stated that the project is gearing up to introduce its next iteration, Sonic.&nbsp;","Sonic promises to process 2,000 transactions per second (TPS) with sub-second finality and is anticipated to launch in late summer or early fall of this year, according to <a href=\"https:\/\/blog.fantom.foundation\/michael-kong-unveils-sonics-launch-and-beyond\/\" data-v-f87c67ca=\"\">Kong<\/a>.","It is being developed as the next step after the existing Opera version of Fantom that’s able to facilitate 200 transactions per second. Sonic’s rollout includes plans to enhance DeFi activities on Fantom through support for liquid staking tokens and the expansion of grant programs to fund development.","The team also plans to leverage Sonic as a “shared sequencer” for other Layer 1 and Layer 2 chains — Kong noted. A shared sequencer is a party or protocol that produces blocks for multiple rollups simultaneously. They are essentially a pool of sequencers that can be used by multiple rollups. Other examples of shared sequencers in development include Espresso, Astria and FairBlock. Last year, the project noted <a href=\"https:\/\/www.theblock.pro\/news\/post\/243220\/fantom-optimistic-rollups-ethereum\" data-v-f87c67ca=\"\">exploring<\/a> adding optimistic rollups to connect to Ethereum.","\"Sonic will be used to create a new best-in-class shared sequencer for L1 and L2 chains, capable of processing over 180 million daily transactions with real, sub-second confirmation times, and serve as the foundation to relaunch Fantom as an entirely new community-centric brand,\" Kong <a href=\"https:\/\/blog.fantom.foundation\/michael-kong-unveils-sonics-launch-and-beyond\/\" data-v-f87c67ca=\"\">said<\/a>.","Sonic's launch will be accompanied by proposed governance changes, including new staking mechanisms and a more decentralized and secure bridging solution to allow users to bridge funds from Ethereum. “We developed a Sonic rollup implementation, a first-class citizen in our validator set, to fully decentralize the bridge while using our existing network security plus inheriting Ethereum’s economic security,” Kong added.","With Sonic’s rollout, a new bridge will be a critical infrastructure component for the foundation, particularly after last year’s hack on a cross-chain bridge with Ethereum called Multichain. The foundation lost one-third of the total $210 million taken during the heist in July 2023, though <a href=\"https:\/\/blog.fantom.foundation\/fantom-foundation-awarded-default-judgement-against-multichain\/\" data-v-f87c67ca=\"\">recovery actions<\/a> are currently underway.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Michael Kong","content":"PERSON"},{"type":"Astria","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Kong","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Fantom Foundation","content":"ORGANIZATION"},{"type":"$210 million","content":"MONEY"},{"type":"Fantom","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"July 2023","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["DEVELOPER TOOLS","MODULAR","PROTOCOLS","ROLLUPS","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}