{"summary":"The European Parliament passed a cybersecurity bill with new rules for digital finance and crypto asset service providers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185360\/eu-parliament-passes-cybersecurity-legislation-for-crypto-and-fintech-firms","publishDate":"2022-11-10T10:48:04","id":7578,"type":null,"title":"EU Parliament passes cybersecurity legislation for crypto and fintech firms","category":["INTERNATIONAL POLICYMAKING"],"content":["<span data-v-f87c67ca=\"\">The European Parliament passed the Digital Operational Resilience Act, which creates new rules on cybersecurity for crypto asset service providers.&nbsp; <\/span>","<span data-v-f87c67ca=\"\">The legislation passed by a margin of 556 in favor, and 18 against.<\/span>","<span data-v-f87c67ca=\"\">DORA is intended to harmonize risk management requirements and processes for reporting cybersecurity incidents. Financial institutions will be required to monitor and report security events, and tech service providers will be subject to oversight by European regulators.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Financial institutions and companies, including in the crypto space, hold extremely sensitive information about customers and it is vital that EU-wide digital security measures are put in place to defeat the threat that exists,” Frances Fitzgerald, a center-right member of the European Parliament who co-drafted the law, said in a statement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Regulations related to the law will take effect 24 months following its publication in the Official Journal of the EU, meaning the new law is anticipated to be fully enforced in 2025.<\/span>","<span data-v-f87c67ca=\"\">The Block previously <\/span><a href=\"https:\/\/www.theblock.co\/post\/176824\/hacktober-surprise-worst-month-in-worst-year-of-hacks-chainalysis-says\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> that the month of October had the highest hacking activity for digital assets in a year. On top of that, hacks resulted in more than $3 billion losses across 125 breaches in 2021, <\/span><a href=\"https:\/\/twitter.com\/chainalysis\/status\/1580312149557026817\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">according<\/span><\/a><span data-v-f87c67ca=\"\"> to analytics firm Chainalysis.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We need to implement stronger protections for our citizens. We do not want to see anyone's personal financial information hacked,” Fitzgerald added. The MEP continued that DORA will “ensure that Europe will remain an important center for investment.”<\/span>","DORA stems from the European Union's 2020 package on digital finance, which includes the Markets in Crypto Assets bill, that sets out laws to regulate crypto assets and their service providers. The vote on MiCA has been <a href=\"https:\/\/www.theblock.co\/post\/182776\/eus-mica-regulation-vote-deferred-to-february-2023-spokesperson\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">postponed<\/a> to February next year due to the lengthy translation process.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"European Parliament","content":"ORGANIZATION"},{"type":"$3 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"European Union","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Fitzgerald","content":"PERSON"},{"type":"Frances Fitzgerald","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"October","content":"DATE"},{"type":"DORA","content":"ORGANIZATION"}],"hashtag":["EUROPEAN PARLIAMENT"],"authors":["Inbar Preiss","The Block"]}