{"summary":"News of the fresh funding comes ahead of the marketplace&#x27;s hyped Valentine&#x27;s Day token launch.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210668\/nft-marketplace-blur-raise-billion-dollar-valuation","publishDate":"2023-02-14T04:17:24","id":758,"type":null,"title":"NFT marketplace Blur set to raise at billion dollar valuation: sources","category":["DEALS"],"content":["Blur, a rival to NFT marketplace heavyweight OpenSea, is set to close a funding round at a billion dollar valuation.&nbsp;","The startup's valuation climbed to unicorn status in negotiations with investors, according to two people with direct knowledge of the effort. One of those people said Blur initially went out to potential backers in the hope of raising $15 million to $30 million, with a price tag of $700 million in mind, only to see it tick higher as the round became oversubscribed.&nbsp;","Blur did not respond to requests for comment.&nbsp;","News of the fundraising effort comes on the same day as Blur's hyped native token launch, which is due to <a href=\"https:\/\/twitter.com\/blur_io\/status\/1625204166682636288\" data-v-f87c67ca=\"\">go live<\/a>&nbsp;at noon ET on Feb. 14.&nbsp;The startup last said it had raised funds in March 2022, with Paradigm, eGirl Capital, 0xMaki and LedgerStatus on the ticket for its $11 million <a href=\"https:\/\/www.theblock.co\/linked\/139617\/nft-marketplace-blur-raises-11-million-in-seed-round-led-by-paradigm\" data-v-f87c67ca=\"\">seed round<\/a>.&nbsp;","The marketplace launched mid-October to much fanfare from the NFT community — muscling in on an increasingly competitive niche in the market.&nbsp;","Blur is known for its low trading fees and its floor sweeping function. It was the third-largest NFT marketplace by volume in January, creeping up on top dog OpenSea, according to data from The Block Research.","","","Part of its rise to prominence could be attributed to its schedule of airdrops — with prizes including blur tokens for traders who had different levels of engagement with the platform since its launch. So far, the business has orchestrated three airdrops but not laid out a long-term plan for the tokens.&nbsp;","Blur delayed its token launch in January, <a href=\"https:\/\/twitter.com\/blur_io\/status\/1616125798951571456?s=20&amp;t=vCUoRYK7mzg3H6YoGzgN9A\" data-v-f87c67ca=\"\">saying that<\/a> an \"extra two weeks will allow us to deliver a launch that hasn’t been done before.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"$11 million","content":"MONEY"},{"type":"$15 million","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$700 million","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"March 2022","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"Feb. 14","content":"DATE"}],"hashtag":["BLUR","SERIES A"],"authors":["Lucy Harley-McKeown","Ryan Weeks","The Block"]}