{"summary":"The following free access of Global Coin Research&#x27;s insights is republished with permission from Global Coin Research, a global research firm with a focus","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/37782\/7-things-you-probably-didnt-know-about-chinas-digital-currency-global-coin-research","publishDate":"2019-08-27T15:25:08","id":7581,"type":null,"title":"7 things you probably didn’t know about China’s digital currency - Global Coin Research","category":["CHINA"],"content":["<em class=\"ga\" data-v-f87c67ca=\"\">The following free access of Global Coin Research's insights is republished with permission from Global Coin Research, a global research firm with a focus on Asia blockchain and related technologies. You can find more resources on Asia Cryptocurrency and Blockchain at GlobalCoinResearch.com and on Twitter at @globalcoinrsrch<\/em>","There have been a number of reports on China’s Central Bank Digital Currency (CBDC) in the crypto media, nevertheless, GCR has found numerous more rigorous sources on the details in Chinese language media and Chinese media.&nbsp;<strong data-v-f87c67ca=\"\">Here we highlight seven things that have not been reported or emphasized:<\/strong>","1.&nbsp;<strong data-v-f87c67ca=\"\">Private businesses and institutions are the focus for China's CBDC pilot.<\/strong>","Thus far, multiple approaches are being tested for the launch of the first central bank digital currency in China. Multiple players, including private and state-owned companies, can join the process together with the central bank. But officials are <a href=\"http:\/\/www.chinadaily.com.cn\/a\/201908\/20\/WS5d5b5d1ca310cf3e35566c01.html\" data-v-f87c67ca=\"\">expecting more participation from private institutions in adopting the government-backed currency<\/a>.","No specific names of companies involved in the pilots.","<em data-v-f87c67ca=\"\">Why?<\/em>","For folks who are not familiar with China’s businesses, there are many state-owned enterprises and banks in China. State-owned companies are legal entities that undertake commercial activities on behalf of an owner government.","For example,&nbsp;<a href=\"https:\/\/www.weforum.org\/agenda\/2019\/05\/why-chinas-state-owned-companies-still-have-a-key-role-to-play\/\" data-v-f87c67ca=\"\">China is home to 109 corporations listed on the Fortune Global 500<\/a>&nbsp;– but only 15% of those are privately owned.","Nevertheless, China’s private sector – which has been revving up since the global financial crisis – is now serving as the main driver of China’s economic growth. The combination of numbers 60\/70\/80\/90 are frequently used to describe the private sector’s contribution to the Chinese economy: they contribute 60% of China’s GDP, and are responsible for 70% of innovation, 80% of urban employment and provide 90% of new jobs.","Given this increasing importance of China’s private institutions, integrating the CBDC into them will allow officials to have a full view of their money movements. It may be one of the ways regulators are attempting to onboard and “privatize” those companies.","If you are interested in learning more, check out this book on China’s economy that we recommend on the GCR booklist-&gt;&nbsp;<a href=\"https:\/\/globalcoinresearch.com\/2019\/01\/05\/5-books-to-understanding-china-and-its-internet-economy-including-implications-for-the-cryptocurrency-ecosystem\/\" data-v-f87c67ca=\"\">On China’s Economy: What Everyone Needs to Know<\/a>","&nbsp;","2.&nbsp;<strong data-v-f87c67ca=\"\">The PBoC is very forward-looking<\/strong>.","It may not be widely known that the PBoC initiated the CBDC project in 2014. Beginning five years ago, the officials have already began looking into launching its own digital currency to cut the costs circulating cash and boost policymakers’ control of money supply. Although the project has been closely guarded, various media reports suggest that the central bank’s researchers have been working intensively on the cryptocurrency’s systems for the past year.","We recently interviewed&nbsp;<a href=\"https:\/\/globalcoinresearch.com\/2019\/08\/21\/interview-with-circle-ceo-jeremy-allaire-on-the-rapid-rise-of-usdc-chinas-digital-currency-and-regulatory-headwinds-in-the-us\/\" data-v-f87c67ca=\"\">Jeremy Allaire from Circle<\/a>&nbsp;on his thoughts on the digital currency. He claims that China is way ahead in terms of technical innovation as “not a single person in the United States government or in the federal reserve” has been working on anything remotely close to developing a government-backed digital currency.","&nbsp;","<strong data-v-f87c67ca=\"\">3. The CBDC will return the financial power back to the banks in China.<\/strong>","The deputy director of China<a href=\"https:\/\/www.scmp.com\/print\/business\/banking-finance\/article\/3023309\/chinas-proposed-digital-currency-will-help-banks-bridge\" data-v-f87c67ca=\"\">&nbsp;specified that<\/a> PBoC would rely on Chinese commercial banks to be the conversion agency, helping to convert cash in circulation into the PBoC-backed digital currency, and vice versa.","By designating Chinese banks as the conversion agency, the PBoC is enabling them to regain the channel through which they could capture and analyze customers’ transaction data.","In the past, “Commercial banks have been disadvantaged in competing for mobile payment businesses because the big data related to the end-users’ payment and online behavior has been captured by Alipay and WeChat Pay. But with their new role under the PBOC’s digital currency initiative, I expect banks to form their own platform and network on big data,” said Hui, a professor at the Hong Kong University of Science and Technology.","While the largest banks in China are mostly state-owned and are relatively more advanced than banks in the states, they still lag the tech conglomerates that have entered fintech in the last decade. Some banks that are early movers in retail banking will likely benefit more from the digital currency project than others.","<a href=\"https:\/\/www.scmp.com\/print\/business\/banking-finance\/article\/3023309\/chinas-proposed-digital-currency-will-help-banks-bridge\" data-v-f87c67ca=\"\">“Those that are more aggressive&nbsp;<\/a>in mobile banking, such as China Merchants Bank and Ping An Bank, could be keen to work with the PBoC and support this digital currency project.”","By designating banks as the agent to convert between the PBoC digital currency and fiat money, then banks could use their own internet banking services to retain cash held by individuals and merchants and ultimately, turn them into banks’ deposits.","&nbsp;","4.&nbsp;<strong data-v-f87c67ca=\"\">CBDC is not crypto, and the officials recognize that.<\/strong>","The Chinese officials<a href=\"https:\/\/www.weibo.com\/1891366595\/I3e7Cj7qa?filter=hot&amp;root_comment_id=0&amp;type=comment#_rnd1566567653825\" data-v-f87c67ca=\"\">&nbsp;recognize<\/a> the difference between cryptocurrencies such as Bitcoin and CBDC. They claim that the CBDC is very different from Bitcoin. The ledger is centralized and the ledger must adopt real-name verification. Residents will be able to exchange the digital currency in commercial institutions.&nbsp;","Nevertheless, the ambition to be a recognized global currency is not to be ignored. Looking out to the rest of 2019, the PBOC said it would expedite the research of China’s legal digital tender and monitor the trends of virtual currency development both overseas and at home.","To sum up, the central bank’s digital currency system will be a centralized, electronic cash system that uses public\/private key encryption technology to implement the off-account system. Mobile online banking and payment applications can support CBDC.","&nbsp;","5.&nbsp;<strong data-v-f87c67ca=\"\">The CBDC will likely come out before Libra<\/strong>.","We believe the Chinese government-backed digital currency may come out earlier than the official launch of Libra.","While Libra’s official announcement is to come out 2020, we think it’s very unlikely to happen based on our discussion with related parties inside and outside of the team and the current regulatory limitations on cryptocurrencies in the U.S.","The time seems to be more ripe for introducing the central bank digital currency, based on ongoing trials in some areas and&nbsp;<a href=\"https:\/\/cointelegraph.com\/news\/china-shenzhen-special-economic-zone-to-include-digital-currency-research\" data-v-f87c67ca=\"\">Shenzhen&nbsp;Special Economic Zone announcement<\/a>, where they included research and promotion of&nbsp;digital&nbsp;funds and the national cryptocurrency based on the renminbi as one of the initiatives.","GCR learned that current reception among the Chinese for the Central Bank Digital Currency has been relatively controversial and political, according to <a href=\"https:\/\/globalcoinresearch.com\/2019\/08\/12\/gcr-workshop-9-dforce-and-defi-trends-in-china\/\" data-v-f87c67ca=\"\">Mindao Yang, founder of the Defi protocol Dforce, which was also invested in by a Chinese bank<\/a>.","When launched, Libra’s announcement actually sparked discussions among Chinese financial regulators, driving the designer to rethink various models which can involve more non-governmental institutions in the CBDC development and issuance process. Multiple regulators, including the PBOC, have reiterated that Libra must be put under central bank oversight to prevent potential foreign exchange risks and protect the authority of monetary policy.","&nbsp;","6.&nbsp;<strong data-v-f87c67ca=\"\">The CBDC will be 100% backed by reserves.<\/strong>","PBoC announced that the CBDC will be 100% backed by the reserves that commercial institutions pay to the central bank.","“<a href=\"https:\/\/www.scmp.com\/business\/banking-finance\/article\/3023309\/chinas-proposed-digital-currency-will-help-banks-bridge\" data-v-f87c67ca=\"\">With banks’ loan-to-deposit ratio rising,<\/a> if banks continue to lose their deposit base it will be difficult for them to keep up with their lending, so through the digital currency the PBoC hopes to divert some of the deposits back to the banking system,” said one bank researcher.","While Wechat and Alipay is also 100% backed by reserves,&nbsp;<a href=\"https:\/\/globalcoinresearch.com\/2018\/10\/17\/%F0%9F%8C%9F-what-is-in-a-stablecoin-a-china-perspective-on-tether-and-stablecoins\/\" data-v-f87c67ca=\"\">this was only a recent phenomenon, which we highlighted in October last year<\/a>, which we are sharing some excerpts below again:","“Alipay and Wechat pay did not have actual assets backing its payment system for over 10 years. Yes, you read that right. Over 10 years. To be specific, it was more like 14 years.","[…]","It was not until&nbsp;<em data-v-f87c67ca=\"\">this year&nbsp;<\/em>that the Central Bank of China required payment firms to <a href=\"http:\/\/bit.ly\/2P4xkra\" target=\"_blank\" rel=\"noreferrer noopener\" data-v-f87c67ca=\"\">deposit 100% of their reserves of client funds with a centralized custodian by Jan. 14 — part of a broader effort to crack down on financial risk<\/a>.","Additionally, it was only last year, in January 2017 when the People’s Bank of China (PBoC) said that it would require third-party payment companies to keep 20% of their customer deposits at commercial banks in single custodial accounts that bear no interest. China’s third-party payments providers had previously been given free rein to invest funds collected from customers, effectively functioning in a manner akin to depository institutions without the obligation to make interest payments for funds.","This means that Alipay’s reserve did not come into government supervision and spotlight completely until very recently, only when Wechat Pay and Alipay have become dominant payment systems in the country. […]","PBoC has since announced this reserve requirement will rise to 100% by January next year in 2019, after first lifting the ratio to 50% in April.”","&nbsp;","7.&nbsp;<strong data-v-f87c67ca=\"\">Challenges with the CBDC<\/strong>","The value of CBDC will include “tracking the money flow in economic activities and supporting making monetary policy”,&nbsp;<a href=\"https:\/\/www.google.com\/search?q=value+of+CBDC+will+include+%22tracking+the+money+flow+in+economic+activities+and+supporting+making+monetary+policy%22%2C+according+to+Shao+Fujun%2C+chairman+of+China+UnionPay+and+a+former+PBOC+official.&amp;oq=value+of+CBDC+will+include+%22tracking+the+money+flow+in+economic+activities+and+supporting+making+monetary+policy%22%2C+according+to+Shao+Fujun%2C+chairman+of+China+UnionPay+and+a+former+PBOC+official.&amp;aqs=chrome..69i57.165j0j4&amp;sourceid=chrome&amp;ie=UTF-8\" data-v-f87c67ca=\"\">according to Shao Fujun, chairman of China UnionPay and a former PBOC official.<\/a>&nbsp;But it is also facing difficulties, such as international coordination in monetary and exchange rate policy.","“Where we are now is just like in a horserace, when several designated institutions are taking different technical routes for developing the digital currency and electronic payment. The winner will be the one who has the best approach, accepted by the public and the market. So that is a process of market competition,” said Mu, the deputy director of the central bank’s payments.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"2014","content":"DATE"},{"type":"70%","content":"PERCENT"},{"type":"Hong Kong University of Science and Technology","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Global Coin Research","content":"ORGANIZATION"},{"type":"PBOC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Shao Fujun","content":"PERSON"},{"type":"Jan. 14","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Asia","content":"LOCATION"},{"type":"60%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"100%","content":"PERCENT"},{"type":"China Merchants Bank","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Mindao Yang","content":"PERSON"},{"type":"Shenzhen&nbsp;Special Economic Zone","content":"ORGANIZATION"},{"type":"Asia Cryptocurrency","content":"LOCATION"},{"type":"Libra","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Ping An Bank","content":"ORGANIZATION"},{"type":"Alipay","content":"PERSON"},{"type":"Jeremy Allaire","content":"PERSON"},{"type":"Central Bank of China","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"PBoC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"January 2017","content":"DATE"},{"type":"October last year","content":"DATE"},{"type":"GCR","content":"ORGANIZATION"},{"type":"Hui","content":"PERSON"},{"type":"five years ago","content":"DATE"},{"type":"CBDC","content":"ORGANIZATION"},{"type":"People’s Bank of China (PBoC","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"Central Bank Digital Currency","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Contributor Network","The Block"]}