{"summary":"Web3 wallet MetaMask is partnering with security firm Blockaid to add native security alerts to its browser extension.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260176\/metamask-and-blockaid-collaborate-to-introduce-native-security-alerts-in-wallet-extension","publishDate":"2023-10-31T09:45:44","id":7586,"type":null,"title":"MetaMask and Blockaid collaborate to introduce native security alerts in wallet extension","category":["CRYPTO ECOSYSTEMS"],"content":["Web3 wallet MetaMask has partnered with security firm Blockaid to introduce native security alerts within its browser extension.","This collaboration positions MetaMask as one of the first self-custody web3 wallets to include integrated security alerts. The feature aims to proactively prevent malicious transactions and protect users from scams, phishing attempts and hacks, claiming to do it without compromising user privacy.","MetaMask and Blockaid anticipate that the privacy-focused security alerts will help safeguard crypto assets from theft.","The official launch is scheduled to start from November, and desktop users can opt into the feature through MetaMask's experimental settings. This follows a previous collaboration between MetaMask and Blockaid in April 2023, when the two entities jointly launched Opensea security alerts as an opt-in experimental feature.","MetaMask has more than 20 million monthly active users, making it the most popular crypto wallet in the world.","Blockaid, a security startup founded by two former members of the Israeli military's cyber intelligence unit, recently <a href=\"https:\/\/www.theblock.co\/post\/258907\/blockaid-web3-security-funding-israel\" data-v-f87c67ca=\"\">emerged<\/a> from stealth mode with $33 million in funding.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"November","content":"DATE"},{"type":"$33 million","content":"MONEY"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}