{"summary":"Users of the Grab super-app can now set up a web3 wallet, win blockchain-based rewards like NFTs and more on the platform. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249787\/southeast-asia-super-app-grab-adds-support-for-web3-services","publishDate":"2023-09-07T12:43:46","id":7596,"type":null,"title":"Southeast Asia super-app Grab adds support for web3 services","category":["COMPANIES"],"content":["Grab, a ride-hailing super-app popular in Southeast Asia, has incorporated web3 services.&nbsp;","Users can now set up a web3 wallet, win blockchain-based rewards, pay with NFTs and more. In addition, Grab&nbsp;<span class=\"s1\" data-v-f87c67ca=\"\">partnered with the Monetary Authority of Singapore to bring NFT vouchers for popular eats and experiences in the city, according to Grab app screenshots viewed by The Block.&nbsp;<\/span>","Grab maintains over 34.9 million monthly transacted users as of the <a href=\"https:\/\/investors.grab.com\/news-releases\/news-release-details\/grab-reports-second-quarter-2023-results\" data-v-f87c67ca=\"\">third<\/a> quarter of 2023. The firm operates in over 500 cities and offers food delivery, package delivery, online payment services and more.&nbsp;","Grab did not respond to a request for comment from The Block. It appears the web3 services are first available in Singapore.&nbsp;","In June of this year, Grab <a href=\"https:\/\/www.theblock.co\/post\/235809\/singapores-mas-proposes-digital-money-system-amazon-and-grab-initiate-pilot-trials\" data-v-f87c67ca=\"\">signed on<\/a> to be a part of a pilot study with the Monetary Authority of Singapore surrounding the use of three digital assets including central bank digital currencies, tokenized bank deposits and stablecoins. Grab, along with Amazon and Southest Asian financial services firm Fazz, has also tested escrow arrangements for a new digital asset-based payment system called Purpose Bound Money.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fazz","content":"ORGANIZATION"},{"type":"Southeast Asia","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"June of this year","content":"DATE"},{"type":"Amazon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Purpose Bound Money","content":"ORGANIZATION"},{"type":"third<\/a> quarter of 2023","content":"DATE"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}