{"summary":"Manifold Finance has launched a new maximal extractable value (MEV) protocol, focused on providing the most value for validators.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253843\/manifold-finance-mev-auction-protocol","publishDate":"2023-10-04T16:00:03","id":7599,"type":null,"title":"Manifold Finance rolls out an MEV auction protocol, names Frax founder and 0xMaki as advisors","category":["CRYPTO ECOSYSTEMS"],"content":["Manifold Finance has launched a new maximal extractable value (MEV) protocol. It introduces a new auction system that allows multiple winners for each auction slot, in contrast to the predominant “one winner per slot” model in the Ethereum ecosystem.","Manifold Finance says that the transition to this new auction system will lay the foundation necessary to support advanced applications related to priority-sensitive transactions and multi-slot bidding for block builders.","This new MEV protocol, Manifold Finance claims, can redefine how value is captured and distributed within the Ethereum network, with the focus on providing the most optimal MEV revenue for validators. It aims to compete with the prevalent MEV protocol offered by Flashbots.","MEV denotes the additional value that blockchain validators — those creating new blocks on the network — can acquire by manipulating the order of transactions within the blocks they produce. Entities called block builders on Ethereum capture the profits from MEV by determining the order of transactions and relaying it to Ethereum validators.","A standout feature of the new protocol is its integration of <a href=\"https:\/\/www.theblock.co\/post\/224570\/manifold-cream-finance-deal\" data-v-f87c67ca=\"\">mevETH<\/a>, a novel liquid staking token (LST) launched last month. Manifold Finance serves as the infrastructure partner for mevETH.","Manifold Finance confirmed that since August, the MEV Protocol’s mevETH has seen more than 28,000 ETH staked and has started receiving rewards. It also unveiled a streamlined process for users to deposit ETH and mint mevETH directly through its platform.","The project is led by Cream Finance co-founder Leo Cheng, while Manifold Finance founder Sam Bacha, who previously contributed to Yearn Finance, serves as its chief architect.","The initiative has also brought onboard notable figures from the Ethereum community — such as Frax founder Sam Kazemian and 0xMaki — as advisors.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sam Kazemian","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Manifold Finance","content":"ORGANIZATION"},{"type":"Sam Bacha","content":"PERSON"},{"type":"Leo Cheng","content":"PERSON"},{"type":"Yearn Finance","content":"ORGANIZATION"},{"type":"Cream Finance","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":["ASSETS","DEVELOPER TOOLS","DEXS","MEV","SMART CONTRACTS","VALIDATORS"],"authors":["Vishal Chawla","The Block"]}