{"summary":"Alpen Labs aims to help fix scaling issues with the Bitcoin network through zero-knowledge proofs and rollups.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287629\/bitcoin-scaling-developer-alpen-labs-comes-out-of-stealth-reveals-10-6-million-in-past-seed-funding","publishDate":"2024-04-10T12:41:28","id":76,"type":null,"title":"Alpen Labs comes out of stealth, reveals $10.6 million in past funding","category":["STARTUPS"],"content":["Alpen Labs, a startup scaling bitcoin with zero-knowledge technology and rollups, went out of stealth Wednesday and announced $10.6 million in prior funding.","The venture firm Ribbit Capital led a seed funding round for Alpen in 2023, which the firm used to grow its team of cryptographers and engineers, according to an official company release shared with The Block. Alpen Labs's other backers include Castle Island Ventures, Geometry Research, Stillmark, Village Global, Robot Ventures, Axiom Capital, WillowTree Investments, John Pfeffer, Charlie Songhurst, Charles Cascarilla, Ben Davenport, Ashwin Ramachandran, Waitkit Lau and others.","Alpen Labs aims to help fix certain problems related to the Bitcoin network, such as privacy, programmability and scalability, using zero-knowledge proofs (ZKPs). ZKPs verify data without revealing information about the data itself. Using zero-knowledge technology, Alpen aims to breaking down running large programs on Bitcoin into more manageable tasks of verifying smaller digital signatures to help scale the network, the company said in a release.","In addition, Alpen Labs is developing Bitcoin rollup infrastructure, which is a way to combine numerous transactions into one on the blockchain. The firm intends to release more information on its rollup ecosystem soon, with a testnet launch slated for sometime in 2024.","\"We envision a programmable, scalable Layer 2 ecosystem on Bitcoin as the best place for on-chain finance: from payments to lending, custody, stablecoins and use cases not-yet-imagined,\" said Alpen Labs Co-Founder and CEO Simanta Gautam in a release.&nbsp;","Some of the end goals Alpen Labs <a href=\"https:\/\/www.alpenlabs.io\/blog\/alpen-at-the-convergence-of-two-revolutions\" data-v-f87c67ca=\"\">envisions<\/a> include BTC-collateralized stablecoins, hashrate futures for miners, applications offering trust-minimized yield on BTC and overcollateralized borrowing on BTC, among others.","\"With over one trillion dollars stored in Bitcoin, we believe it has significant potential to usher in a better money future, with unprecedented global appeal,\" said Ribbit Capital's Justin Saslaw in a statement. \"By introducing more scalability, expressivity and privacy to Bitcoin, the Alpen team is helping to unlock opportunities for application-level creativity and growth, for a more dynamic and inclusive financial ecosystem.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alpen","content":"ORGANIZATION"},{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ribbit Capital","content":"ORGANIZATION"},{"type":"Stillmark","content":"LOCATION"},{"type":"John Pfeffer","content":"PERSON"},{"type":"Ashwin Ramachandran","content":"PERSON"},{"type":"one trillion dollars","content":"MONEY"},{"type":"WillowTree Investments","content":"ORGANIZATION"},{"type":"Waitkit Lau","content":"PERSON"},{"type":"Alpen Labs","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Ben Davenport","content":"PERSON"},{"type":"Robot Ventures","content":"ORGANIZATION"},{"type":"Charles Cascarilla","content":"PERSON"},{"type":"Justin Saslaw","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$10.6 million","content":"MONEY"},{"type":"Simanta Gautam","content":"PERSON"},{"type":"Charlie Songhurst","content":"PERSON"},{"type":"Geometry Research","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN","ROLLUPS","SEED &AMP; PRE-SEED"],"authors":["MK Manoylov","The Block"]}