{"summary":"Digital assets can be a strong source of innovation for financial services. What they need are rules of the road.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160673\/how-well-designed-regulation-could-unleash-cryptos-potential-for-innovation","publishDate":"2022-08-02T09:00:32","id":7600,"type":null,"title":"How well-designed regulation could unleash crypto’s potential for innovation","category":["SPONSORED"],"content":["<em data-v-f87c67ca=\"\">Digital assets can be a strong source of innovation for financial services. What they need are rules of the road.<\/em>","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">By Jesse McWaters, Mastercard’s Head of Regulatory Advocacy<\/em><\/strong>","Blockchain technology has sparked the imagination of the world, triggering the explosive development of thousands of digital asset ecosystems with grand ambitions to transform the way we do business. Innovators in this space are exploring new models of financial services, the enablement of exciting digital assets like NFTs, and the creation of new decentralized services for everything from messaging to identity.","But today these efforts are facing a very public reckoning, with crypto-asset valuations plummeting in the first half of 2022. It is tempting to try to link this crisis of confidence to a single event, like the collapse of a prominent stablecoin or the recent bankruptcy of several notable crypto firms, but the truth is that it stems from a deeper problem: a lack of user trust in crypto itself.","That may seem like an odd statement for a technology that frequently bills itself as “trustless,” but the reality for consumers, merchants and regulated financial institutions is that – even putting aside the underlying volatility of crypto asset valuations – the world of crypto is a risky place. Assets that purport to have a stable link to the dollar can collapse overnight. The counterparty on the other end of your transaction might (unbeknownst to you) turn out to be a criminal or sanctioned entity. In 2021 alone, consumers lost $14 billion, with little or no recourse, to a myriad of thefts and scams[1].","Today these risks are keeping many consumers and financial institutions on the sidelines of crypto and holding back efforts to unlock the potential of crypto for non-speculative uses. The data back this up: 90% of Americans who used crypto-assets in the last year did so with the expectation of speculative gains, according to a 2022 Federal Reserve study, rather than using them as, say, a decentralized messaging service or to play a blockchain-based game that they genuinely enjoy. That makes sense when you consider that navigating crypto’s many risks only makes sense if there is a potential jackpot on the other side.","The missing element the unlocks the broader use of crypto to power digital commerce is the very thing Bitcoin promised to make obsolete: legal and regulatory oversight. Everyday merchants and consumers want to have confidence that the transactions they are making are overseen by regulation designed to protect their interests, that the payment instruments they are using maintain a stable value, and that even when the unexpected happens, their interests will continue to be protected. Clear, consistent and enforceable regulations are a critical ingredient in making that possible.","The world of crypto needs to be regulated so that buyers and sellers can trust that their counterparty is who they say they are and that their payment instrument won’t become worthless overnight. In the traditional financial system, for example, Mastercard carefully measures risks, ensures safety of our users and has frameworks to manage unforeseen circumstances. The trust in our network was built over decades of innovating in the space.","There’s a tendency among the tech crowd to see regulators and legislators as hopelessly out of touch and only preoccupied with preserving status quo instead of adapting to new realities they’re presented with. This is an easy narrative to tweet, but doesn’t capture the full picture.","The financial regulators in the U.S. and many of their peers around the world are trying to walk a fine line, encouraging the kind of innovation and competition that makes financial services better without letting bad actors leverage a new ecosystem for mischief or ill-gotten gains. They know the lack of clarity in rules governing digital assets disadvantage tightly regulated banks and rule-following crypto-native players alike, handing a potential cost advantage to shadier outfits who don’t perform “know your customer” checks or scan transactions for potential sanctions violations.","In the European Union, the proposed Markets in Crypto Assets Regulation (MiCA) seeks to rectify this imbalance by, for example, establishing a clear regulatory framework for stablecoins that requires them to be fully-backed by high- quality liquid assets and places certain stablecoins under a similar regulatory framework to other long-standing assets like pre-paid “e-money” payment services. The U.S. has so far struggled to achieve consensus around a comprehensive legislative package to regulate crypto, but a recent executive order by the Biden Administration, as well as a slew of bills proposed in the House and the Senate, show that this topic is on policymakers’ minds.","Champions of crypto could help if more of them would publicly recognize the harm that this lack of clarity is doing to their creations. At Mastercard, we believe that a well-regulated crypto ecosystem can incorporate many of the attributes already present in the traditional system. That includes making traditional bank deposits available for use on the blockchain, establishing clear rules around how digital assets are taxed, providing consumers with protections against fraud and hacks.","Building this regulatory framework won’t be simple, and private industry will need to partner with government to ensure a balance between opportunities and risks. Regulators should continue to work toward creating clear, high and consistent standards of compliance in and around crypto-assets that clarify expectations and that are consistent across different payment types. The future of digital assets and the blockchain could be very bright, and Mastercard has already implemented numerous programs to incorporate its innovations into our global payment network. But without clear rules, crypto will be stuck in a loop, unable to realize its potential.","<a href=\"#_ftnref2\" name=\"_ftn2\" data-v-f87c67ca=\"\"><\/a>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Mastercard <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","[1] https:\/\/www.cnbc.com\/2022\/01\/06\/crypto-scammers-took-a-record-14-billion-in-2021-chainalysis.html#:~:text=Scammers%20around%20the%20world%20took,%243.2%20billion%20worth%20of%20cryptocurrency.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Mastercard’s Head of Regulatory Advocacy","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"the first half of 2022","content":"DATE"},{"type":"Biden Administration","content":"ORGANIZATION"},{"type":"European Union","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"$14 billion","content":"MONEY"},{"type":"Jesse McWaters","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}