{"summary":"Israel’s Ministry of Finance and Tel Aviv Stock Exchange (TASE) are preparing to test out using digital state bonds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177985\/israel-ministry-of-finance-stock-exchange-to-test-use-of-digital-state-bonds","publishDate":"2022-10-19T02:00:59","id":7606,"type":null,"title":"Israel Ministry of Finance, stock exchange to test use of digital state bonds","category":["CENTRAL BANKS"],"content":["The Israeli Ministry of Finance's Office of the Accountant General and Tel Aviv Stock Exchange (TASE) are preparing to test out using digital state bonds.","The two have established a joint team to pilot the clearing of the bonds on a new blockchain technology-backed platform for the trading of digital assets, according to a statement on Wednesday.","The test will look at how blockchain technology can streamline processes, reduce costs, shorten the duration of issuance and clearing of state bonds, improve transparency and mitigate risks.","Israeli startup and blockchain infrastructure company Fireblocks and multi-cloud service provider VMware will assist with the study. The latter’s blockchain technology was used in the Bank of Israel’s trial issuance of a digital shekel earlier this year.","TASE and the Ministry of Finance said they have been following the developments in the financial markets in recent years around distributed ledger technology, the tokenizing of different types of assets and the various tests run by financial institutions and central banks worldwide concerning the issuance of Central Bank Digital Currency, or CBDC.","“The current project kicks off the journey into this new world, allowing a first and important foothold that will serve as the foundation for the upgrading of other traditional mechanisms down the road,” TASE said in a statement.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tel Aviv Stock Exchange (TASE","content":"ORGANIZATION"},{"type":"the Ministry of Finance","content":"ORGANIZATION"},{"type":"TASE","content":"ORGANIZATION"},{"type":"Israeli Ministry of Finance","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Bank of Israel","content":"ORGANIZATION"},{"type":"VMware","content":"ORGANIZATION"},{"type":"Central Bank Digital Currency","content":"ORGANIZATION"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}