{"summary":"Crypto wallet provider Blockchain.com, which boasts of having over 46 million users, has rolled out the retail lending desk. Dubbed &quot;Borrow,&quot; the desk allows users to borrow USD-pegged stablecoin, USD Digital, against bitcoin held in their Blockchain.com wallets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58251\/after-institutional-launch-blockchain-com-now-jumps-into-retail-lending-business","publishDate":"2020-03-10T08:01:20","id":7608,"type":null,"title":"After institutional launch, Blockchain.com now jumps into retail lending business","category":["LENDING"],"content":["Crypto wallet provider Blockchain.com, which boasts of having over 46 million users, has rolled out the retail lending desk.","Dubbed \"Borrow,\" the desk allows users to borrow USD-pegged stablecoin, USD Digital, against bitcoin held in their Blockchain.com wallets.","USD Digital is Blockchain.com's in-wallet stablecoin, a spokesperson of the firm told The Block, adding that it is powered by Paxos and functions \"just like\" Paxos Standard (PAX) stablecoin.&nbsp;","\"Given the state of the global markets, people are looking outside of the traditional finance system for new ways to borrow money against what they've previously saved,\" Xen Baynham-Herd, executive vice president at Blockchain.com, told The Block.","Notably, the desk currently only supports bitcoin, but it has plans to support more coins \"soon,\" said the spokesperson. Bitcoin cash (BCH), ether (ETH), and stellar lumens (XLM) are other coins that Blockchain.com <a href=\"https:\/\/support.blockchain.com\/hc\/en-us\/articles\/115005883426-What-currencies-are-supported-in-the-Blockchain-wallet-\" data-v-f87c67ca=\"\">currently supports<\/a> in its wallet in general.","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Follows institutional lending desk<\/span><\/strong>","The launch of Borrow follows Blockchain.com's <a href=\"https:\/\/www.theblockcrypto.com\/post\/47054\/as-credit-concerns-loom-in-crypto-blockchain-com-secretly-builds-multi-million-dollar-loan-desk\" data-v-f87c67ca=\"\">rollout<\/a> of an institutional lending desk last August, which increased its loan originations to $120 million in November.","It is not clear how the recent numbers have been, but the spokesperson said: \"We have continued to aggressively grow since launch, and Borrow is built off that success.\"","Blockchain.com is expected to release the latest origination figures \"a few weeks after Q1,\" the spokesperson said.","When Blockchain.com's institutional lending desk came out of stealth mode last November, the firm estimated to be one of the top five crypto lenders at the time. It remains to be seen how its retail lending business pans out.","\"Institutional and retail investors have the same financial goals – grow wealth and manage risks,\" said Peter Smith, co-founder and CEO of Blockchain.com. With Borrow, \"retail users can trade like the big guys without selling the crypto they've stockpiled or leaving their wallet.\"","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Credit bubble?<\/span><\/strong>","<a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-10-29\/another-credit-bubble-grows-the-5-billion-crypto-loan-market\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">According to some observers<\/a>, the crypto lending market is growing too quickly, given that it has reportedly reached $5 billion in the last two years from nothing. As a result, market participants have questioned whether there is a credit bubble forming in the space.","But Smith is less concerned about a \"Lehman\" like blowup, at least for his firm. \"Our loan desk is so heavily collateralized a Lehman moment would be impossible,\" he <a href=\"https:\/\/www.theblockcrypto.com\/post\/47054\/as-credit-concerns-loom-in-crypto-blockchain-com-secretly-builds-multi-million-dollar-loan-desk\" data-v-f87c67ca=\"\">told<\/a> The Block in November.","\"We are pretty selective. [...] we never had someone late for a margin call,\" Smith said at the time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BCH","content":"ORGANIZATION"},{"type":"Herd","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"last August","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$5 billion","content":"MONEY"},{"type":"last two years","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Smith","content":"PERSON"},{"type":"Xen Baynham","content":"PERSON"},{"type":"USD Digital","content":"ORGANIZATION"},{"type":"$120 million","content":"MONEY"},{"type":"Peter Smith","content":"PERSON"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}