{"summary":"BIT Mining has raised $50 million less than a month after its 400 megawatts facilities in China were shut down.\nChina’s recent crackdown has had an adverse effect on the stock prices of Chinese bitcoin mining firms listed in the U.S.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/111117\/china-bitcoin-miner-bit-mining-50-million-overseas","publishDate":"2021-07-13T05:45:42","id":761,"type":null,"title":"Chinese bitcoin miner BIT Mining raises $50 million to move overseas","category":["Mining"],"content":["Publicly traded Chinese bitcoin miner BIT Mining has raised $50 million in a private stock offering as it secures back-up plans after China's crackdown orders.","The New York Stock Exchange-listed firm said in announcement on Tuesday that it has entered a purchasing agreement with institutional and accredited investors for the issuance.","BIT Mining, which is headquartered in Shenzhen and formerly known as <a href=\"https:\/\/www.theblockcrypto.com\/daily\/96817\/chinese-state-owned-capital-500-bitcoin-mining\" data-v-f87c67ca=\"\">500.com<\/a>, said it plans to use the net proceeds to \"acquire additional mining machines, build new data centers overseas, expand its infrastructure, and improve its working capital position.\"","The $50 million private raise comes less than a month after its bitcoin mining facilities in China's Sichuan province were forced to suspend operations due to the power cut ordered by the local government.","Through a controlled <a href=\"https:\/\/www.theblockcrypto.com\/post\/110077\/sichuan-bitcoin-mining-crackdown-hong-kong-loto-interactive\" data-v-f87c67ca=\"\">subsidiary<\/a> in Hong Kong called Loto Interactive, BIT Mining owned three bitcoin mining sites with two that had been running before June 22 and a third one that was supposed to be operational in June. The now-shutdown facilities were said to have a capacity of 400 megawatts.&nbsp;","BIT Mining has already sent the first batch of its proprietary equipment to the neighboring country of Kazakhstan.","Similarly, Shanghai-based <a href=\"https:\/\/www.theblockcrypto.com\/post\/111097\/us-china-bitcoin-miner-the9-russia-crackdown\" data-v-f87c67ca=\"\">The9 City<\/a> has also signed an agreement with Russian colocation provider BitRiver to reserve 15 megawatts of mining capacity.&nbsp;","Business operations aside, Chinese bitcoin mining firms listed in the U.S. have also seen their stock prices take a collateral hit by China's recent policy change.","China first revealed its effort to crack down on the bitcoin mining space on May 21.&nbsp;","Since then, the stock prices of BIT Mining, BIT Digital and The9 City have dropped by 43%, 37% and 10%, respectively, based on data from The Block's Dashboard.","BIT Digital has not yet informed public shareholders how it plans to do with the more than 32,000 bitcoin ASIC miners it had deployed inside China, which accounted for 80% of its entire fleet.","On the other hand, the performances of major U.S. bitcoin mining firms like Riot Blockchain and Marathon Patent Group have seen an uptick during the same period.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/crypto-mining-stocks-marketcaps\/embed\" title=\"Crypto Mining Stocks Marketcaps\" width=\"100%\" data-mce-fragment=\"1\" data-v-f87c67ca=\"\"><\/iframe>","Meanwhile, bitcoin's price is down by about 20% from $41,000 to its current price of $33,000."],"hashtag":["BITCOIN"]}