{"summary":"The publicly-traded exchange sued the Securities and Exchange Commission to force the SEC to respond to a petition that the company filed aiming for a rule specific to digital assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228047\/coinbase-sues-the-sec-for-answer-on-rule-specific-to-digital-assets","publishDate":"2023-04-24T20:00:03","id":7611,"type":null,"title":"Coinbase sues the SEC to get digital asset-specific rule","category":["POLICY"],"content":["Coinbase is suing the Securities and Exchange Commission.&nbsp;","The lawsuit follows on a <a href=\"https:\/\/www.sec.gov\/rules\/petitions\/2022\/petn4-789.pdf\" data-v-f87c67ca=\"\">petition for a rulemaking<\/a> that the company filed with the SEC last summer, requesting the commission draft and approve a rule specific to digital assets. The lawsuit aims to force the agency to provide a yes or no to Coinbase's ask.&nbsp;","Since that request by Coinbase, the SEC has reopened <a href=\"https:\/\/www.theblock.co\/post\/211786\/sec-to-vote-on-rule-that-would-tighten-crypto-custody-requirements\" data-v-f87c67ca=\"\">custody<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/226344\/sec-poised-to-increase-scrutiny-of-defi\" data-v-f87c67ca=\"\">exchange rules<\/a> to explicitly say that they apply to digital assets, but has not engaged in drafting a rule specific to digital assets. The agency has also engaged in several enforcement actions against crypto companies, including an <a href=\"https:\/\/www.coinbase.com\/blog\/we-asked-the-sec-for-reasonable-crypto-rules-for-americans-we-got-legal\" data-v-f87c67ca=\"\">investigation into Coinbase<\/a>.&nbsp;","<span data-v-f87c67ca=\"\">\"From the SEC’s public statements and enforcement activity in the crypto industry, it seems like the SEC has already made up its mind to deny our petition. But they haven’t told the public yet. So the action Coinbase filed today simply asks the court to ask the SEC to share its decision,\" the company's <a href=\"https:\/\/www.coinbase.com\/blog\/coinbase-takes-another-formal-step-to-seek-regulatory-clarity-from-sec-for\" data-v-f87c67ca=\"\">chief legal officer Paul Grewal<\/a> wrote in a blog post about the filing.&nbsp;<\/span>","The suit filed by Coinbase is a&nbsp;<a class=\"c-link\" href=\"https:\/\/www.justice.gov\/jm\/civil-resource-manual-215-mandamus\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.justice.gov\/jm\/civil-resource-manual-215-mandamus\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">writ of mandamus<\/a>, a type of lawsuit for \"exceptional circumstances\" in which a court can force federal officials to act.","Eugene Scalia, son of former Supreme Court Justice Antonin Scalia and former secretary of labor, a cabinet-level position, is one of the outside counsels representing Coinbase in their petition. Scalia, currently a partner at the law firm Gibson Dunn, has won several suits against financial regulators, including a case against the Financial Stability Oversight Council that ended with the revoking of insurance company MetLife's \"too big to fail\" regulatory status.&nbsp;","If the SEC declines to make a new rule, Coinbase can file another lawsuit in an attempt to make a federal court force them to do so.&nbsp;","The lawsuit isn't the crypto company's only recent legal fight with the U.S. government. Aside from the publicly-acknowledged SEC investigation into Coinbase's listing of certain digital assets, as well as its wallet and staking services, the trading platform backed a <a href=\"https:\/\/www.theblock.co\/post\/168502\/backed-by-coinbase-employees-sue-treasury-to-roll-back-tornado-cash-sanctions\" data-v-f87c67ca=\"\">lawsuit against the U.S. Treasury Department<\/a> over the sanctioning of transaction mixer Tornado Cash.&nbsp;","Coinbase also fell under legal scrutiny last year when the SEC and federal prosecutors <a href=\"https:\/\/www.theblock.co\/post\/158960\/former-coinbase-product-manager-arrested-on-insider-trading-charges\" data-v-f87c67ca=\"\">charged<\/a> a former employee, Ishan Wahi, with front-running the public listing to Coinbase customers in a landmark insider trading case for the digital asset industry. The SEC alleged that nine of the tokens Coinbase&nbsp;announced it would list were unregistered securities, which would open up the exchange to its own legal risk; the SEC complaint against Wahi was made the same day that Coinbase filed its petition with the regulatory agency. Coinbase itself was not accused of any wrongdoing.&nbsp;","The tokens alleged to be unregistered securities by the SEC were also listed by other crypto firms, creating potential legal risk for much of the industry that sells tokens to customers in the U.S.&nbsp;","<a href=\"https:\/\/www.theblock.co\/post\/209149\/former-coinbase-product-manager-pleads-guilty-to-criminal-charges-in-landmark-case\" data-v-f87c67ca=\"\">Wahi pleaded guilty<\/a> to the criminal case earlier this year, and indicated in a <a href=\"https:\/\/www.theblock.co\/post\/224919\/former-coinbase-employee-insider-trading\" data-v-f87c67ca=\"\">recent joint court filing with the SEC<\/a> earlier this month that he may be ready to settle and cooperate on the civil case brought against him.&nbsp;","<em data-v-f87c67ca=\"\">Updated with additional context in regards to legal action involving Coinbase.&nbsp;<\/em>","<em data-v-f87c67ca=\"\">Correction: story updated to show not all the tokens cited in the Wahi case were ultimately listed on Coinbase.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Gibson Dunn","content":"PERSON"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Ishan Wahi","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"MetLife","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Supreme Court Justice Antonin Scalia","content":"ORGANIZATION"},{"type":"last summer","content":"DATE"},{"type":"Eugene Scalia","content":"PERSON"},{"type":"Paul Grewal","content":"PERSON"},{"type":"Financial Stability Oversight Council","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Colin Wilhelm","The Block"]}