{"summary":"HashKey OTC has received an in-principle approval for a major payment institution license from the Monetary Authority of Singapore.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279582\/hashkey-otc-receives-in-principle-approval-for-major-payment-institution-license-in-singapore","publishDate":"2024-02-28T11:10:38","id":7615,"type":null,"title":"HashKey OTC receives in-principle approval for major payment institution license in Singapore","category":["COMPANIES"],"content":["<span data-v-02bbd79b=\"\" data-v-f87c67ca=\"\">In January, HashKey Capital and FTSE Russell, a London Stock Exchange subsidiary, launched three indices that track crypto asset performances. <\/span><span data-v-02bbd79b=\"\" data-v-f87c67ca=\"\">In a statement <a href=\"https:\/\/www.theblock.co\/post\/274227\/hashkey-capital-launches-three-crypto-indices-with-ftse-russell\" data-v-f87c67ca=\"\">shared<\/a> with The Block, HashKey said that the three indices are designed for investors who seek to add crypto exposure to their investment portfolios.<\/span>","As that statement outlines, the FTSE Custom Digital Asset Top 20 Index aims to monitor the top 20 cryptocurrencies by market capitalization. Additionally, the FTSE Custom Digital Asset Infrastructure Index is designed to follow digital assets constituting the industry's infrastructure, whereas the FTSE Custom Digital Asset Application Index focuses on tracking crypto assets that possess application functionalities.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"London Stock Exchange","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"HashKey","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"FTSE Russell","content":"ORGANIZATION"},{"type":"HashKey Capital","content":"ORGANIZATION"},{"type":"FTSE Custom Digital Asset Infrastructure Index","content":"ORGANIZATION"}],"hashtag":["ASIAN REGULATION","HASHKEY","PAYMENTS"],"authors":["Brian McGleenon","The Block"]}