{"summary":"Cambrial Capital&#x27;s Ha Duong dives deep into the process of constructing a VC portfolio.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64151\/crypto-vc-portfolio-construction-the-lps-perspective","publishDate":"2020-05-09T12:19:33","id":762,"type":null,"title":"Crypto VC portfolio construction: the LP&#x27;s perspective","category":["INVESTMENTS"],"content":["<i data-v-f87c67ca=\"\">Ha Duong is a Principal at Cambrial Capital, a fund of funds specializing in the digital asset space. Previously, he was an Investment Manager at the Berlin-based venture capital firm Project A. Ha is a mentor at Techstars and connected across the European tech ecosystem.<\/i>","Crypto is an emerging asset class and whilst general investment principles are the same as in conventional markets, their application needs to be re-evaluated and sometimes adapted to cryptoassets’ singular features. The same holds true for how a fund of crypto venture funds is constructed. Whilst the principles and philosophy remain the same, we do not believe General Partners (GPs) should simply copy\/paste established practices and guidelines or that Limited Partners (LPs) can demand that of them.","The&nbsp;<a class=\"bt dg hu hv hw hx\" href=\"https:\/\/medium.com\/@Samirkaji\/is-there-ideal-portfolio-construction-for-seed-funds-5322714ec897\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">standard VC portfolio model<\/a>&nbsp;of “30 portfolio companies, with about half of the fund reserved for doubling down on portfolio companies that show the most promise early-on” has been adopted by most emerging managers. In our opinion, this cannot be simply adopted in crypto without further considerations.","As professional LPs, we would like to share our own perspective and findings on portfolio construction for crypto venture funds.","The GP’s approach to portfolio construction — especially in venture — is crucial because it will likely have a bigger impact on returns than any single investment decision. As with most things in investing, it is simple conceptually and difficult in practice. Venture investor Kendrick Geluz Kho&nbsp;<a class=\"bt dg hu hv hw hx\" href=\"https:\/\/blog.usejournal.com\/diversification-in-venture-portfolio-construction-8bb7980e7ea1\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-v-f87c67ca=\"\">summarises<\/a>&nbsp;the task:","“For fund managers, it starts with 1) figuring out what galaxy of startups you can reasonably discover and access; 2) understanding what level of risk and return you (and your LPs!) are comfortable with; and 3) sizing appropriately to those parameters.”","The devil, of course, is in the detail. In public markets, portfolio construction is about sizing positions and spreading them across sectors and other dimensions. Hard enough, but in venture, GPs make path-dependent decisions about variables including investment stage, fund size, portfolio concentration, ticket sizing, target ownership, reserves, exit planning, secondaries, and recycling. Path-dependency arises because investments are (typically) illiquid; so decisions taken early in the life of the fund cannot easily be corrected (e.g. by selling assets or rebalancing) and will affect opportunities later in the life of the fund (and beyond that fund’s lifetime). For example, the size of your initial investment affects your ability to set terms and how much you can follow-on, and a manager typically has to ‘pick their bet’ for a given vertical since investing in direct competitors is frowned upon.","In our opinion, more crypto VCs should make a conscious effort to independently come up with an ideal portfolio construction strategy for crypto. That is not an easy task. Getting a robust answer to where value will accrue in this next-generation digital economy is only one critical prerequisite for an investor. Taking that thesis and constructing an entire portfolio around it that optimises investment returns is a whole different art.","GPs are expected to have a view as to which verticals are likely to grow and how value can accrue or be captured. Over the past decade, the thesis around ‘bitcoin is money’ could have been expressed across multiple layers of the stack: bitcoin itself, exchanges, apps (wallets, HSMs, remittance rails…) or Layer 2 (Lightning Network). Indeed, some of our earliest conversations with crypto venture managers in 2014–16 revolved principally around where in the stack to invest. Successful venture investors are able to pick the right&nbsp;<em class=\"hy\" data-v-f87c67ca=\"\">vertical<\/em>&nbsp;and also the right&nbsp;<em class=\"hy\" data-v-f87c67ca=\"\">layer<\/em>&nbsp;to invest in. We get excited when GPs are able to demonstrate thoughtfulness about both.","In traditional venture, value is mainly captured via equity. With ‘<strong class=\"hc jk\" data-v-f87c67ca=\"\">cryptonetworks’<\/strong>, the dominant form of investment is in digital assets (network tokens), convertibles for these (e.g.&nbsp;<a class=\"bt dg hu hv hw hx\" href=\"https:\/\/medium.com\/the-capital\/simple-agreement-for-future-tokens-saft-explained-a72d23cddf77\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">SAFT<\/a>s), or in equity of the founding company which includes a claim to potential future tokens issued (but, again, the value ultimately is in the&nbsp;<em class=\"hy\" data-v-f87c67ca=\"\">token<\/em>, not the equity). Besides cryptonetworks, GPs will likely also consider equity investments in conventional ‘<strong class=\"hc jk\" data-v-f87c67ca=\"\">picks and shovels<\/strong>’ businesses, and a portfolio with both types of investments is even more difficult to construct.","Our experience is that this space is in its infancy and evolves significantly from year to year, never mind between a first close and the end of an investment period. Accordingly, our view is that managers should be agnostic (but thoughtful!). Managers are best served by their LPs by being given a full quiver of instruments at their disposal as they go about capturing maximal value for their investors. There are verticals in which token investments likely make the most sense (decentralised market networks), others in which equity does (exchanges), and some in which nobody has yet figured it out (layer 2). We look for managers thoughtful enough to have an opinion, sophisticated enough to understand the trade-offs between various instruments, and disciplined enough to act with conviction.","Fund size is the biggest influence on a GP’s portfolio strategy because it constrains the portfolio construction and should align with the investment universe as well as the risk parameters of the fund. If funds are sized too small, GPs may not be able to execute the investment strategy as conceptualised. On the contrary, if funds are too big, the risk-return profile of the fund may look different than originally promised to LPs. The supply of great investment opportunities in any given sector may be very limited and can easily amount to less than the fund needs to deploy. Given the vast majority of attractive venture opportunities in crypto today are seed and early stage, and the typical crypto seed round is ~$2–4m, sizing a crypto venture fund at $400m makes little sense to us.","LPs need to satisfy themselves that the GP’s strategy and portfolio construction are compatible with their fund’s size.","As a rule, the earlier the stage at which a VC fund invests, the higher the potential return on the initial investment and the value of the <em data-v-f87c67ca=\"\">pro rata<\/em> right to invest in later stages, but the greater the risk. Greater variance in pre-seed and seed stage means greater dispersion of returns between the top and bottom quartiles. Selecting a higher variance (less efficient) playground allows emerging managers to demonstrate their edge in the marketplace.","Traditional venture capital has recognised terms like ‘Series A’ and ‘Seed’ but cryptonetworks have their own maturity stages as managers can invest in liquid tokens or progressively earlier through locked tokens, pre-network launch, pre-testnet, pre-technology, pre-whitepaper or even pre-team. Just as for non-crypto startups, a sophisticated investor will form a thesis on the biggest risks per stage and try to mitigate them.","Cryptonetwork investments do not have a shorter time to maturity, but they certainly have a shorter time to liquidity (or rather ‘tradeability’), with fewer funding rounds until such a liquidity event. Instead of taking 6–9 years and &gt;5 funding rounds until exit, most cryptonetworks so far have only done a few private funding rounds before launching their network and respective tokens. Accessing these opportunities at an early stage and underwriting the risks in spite of incomplete information is largely the domain of smaller, emerging funds. Unlike in traditional venture, ‘liquid’ is not shorthand for ‘mature’, as we will discuss later. Understanding this is key to understanding venture in the crypto sector.","The balance between maximising exposure to winners and risk diversification is particularly challenging in the venture capital asset class. VC investment returns have a power law distribution, meaning that only a fraction of the portfolio delivers the majority of the returns. Benedict Evans, until recently a Partner at a16z, shows that 12% of deals done (amounting to 10% of invested capital) were responsible for 74% of the total returns of US venture investments. Concentration risk is real.","<em data-v-f87c67ca=\"\">Source: <a href=\"https:\/\/www.ben-evans.com\/benedictevans\/2016\/4\/28\/winning-and-losing\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Benedict Evans — In praise of failure<\/a><\/em>","Venture portfolios are driven by outliers. If you are mathematically inclined, Jerry Neumann has done an excellent job&nbsp;<a class=\"bt dg hu hv hw hx\" href=\"http:\/\/reactionwheel.net\/2017\/12\/power-laws-in-venture-portfolio-construction.html\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-v-f87c67ca=\"\">simulating<\/a>&nbsp;how power laws affect venture portfolio returns, drawing the conclusion that larger portfolios have a better chance of delivering greater returns while acknowledging certain practical limitations (such as constraints in operational portfolio management).","Our analysis of historical&nbsp;<a class=\"bt dg hu hv hw hx\" href=\"https:\/\/docs.google.com\/forms\/d\/e\/1FAIpQLSeAWWAMjDVqbw7l_t1nW65yIFJ9DS0sd38jYtVcbWkLjv717w\/viewform\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-v-f87c67ca=\"\">investment returns data<\/a>&nbsp;for crypto VC deals shows that the power law distribution may be even stronger than in conventional startup deals. This presents a challenge for crypto GPs because, if they miss out on their share of ‘Unicorns’, their funds will underperform significantly. The investment universe is small and there may only be 10–15 exceptional deals per year, globally.","Our assumption as LPs is that managers will find it difficult to control their win\/loss ratio so their edge may rely on maximising returns from the winners. GPs that understand this, usually opt for more concentrated portfolios despite concentration risk. Portfolio concentration hereby refers to the allocation of capital to 10–15 core positions with maximum position sizes of up to 15%. This does not necessarily exclude portfolio approaches that start with a larger portfolio before refocusing on the apparent winners. Focus allows VCs to be selective and to have sufficient resources to add value to invested companies. Diversification should not be at the expense of quality and portfolio support.","Target ownership is the percentage of the invested company that a fund desires to own. For example, a fund making an investment of $2m in a firm with a pre-money valuation of $18m will then own 10% percent of the firm. Target ownership is important for many traditional VC firms because there are so few winners per VC portfolio meaning high exposure in the winners is required to return the fund. Additionally, larger ownership stakes allow fund managers to have more influence, set terms, and\/or be more involved in governance as a board member. Our own view is that a fund should concentrate on exposure and valuation and let the ownership be derived from that, rather than target it explicitly. This is even truer in token investments, where the governance role a GP may play is either diminished or not as strongly tied to their own monetary investment (particularly in delegated PoS networks, where other investors may proxy to them).","Exposure is important since VCs want to put meaningful amounts of capital to work per deal so that it justifies their opportunity costs of time for due diligence, portfolio management, and value-adding activities. Valuation speaks for itself. Limited capacity in competitive deals are hurdles that GPs must balance with upside maximization (and downside protection).","Further confusion arises because crypto VC investors are only exposed partly through equity. Investments in the native network tokens enable users to get exposure to the value of the network — at least that is the intention — but may not give them control over the company sponsoring the project and selling the tokens. Furthermore, it is often the explicit intention of the project to create a decentralised network with distributed ownership. That conflicts directly with any VC funds’ desires to retain a degree of control over their investment. The whole question of governance of crypto networks is a topic we have&nbsp;<a class=\"bt dg hu hv hw hx\" href=\"https:\/\/www.eventbrite.com\/e\/cambrial-investing-in-governance-tickets-53733665841#\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-v-f87c67ca=\"\">spent<\/a>&nbsp;<a class=\"bt dg hu hv hw hx\" href=\"https:\/\/www.youtube.com\/watch?v=m2LMwOfBDq8\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-v-f87c67ca=\"\">some<\/a>&nbsp;<a class=\"bt dg hu hv hw hx\" href=\"https:\/\/www.youtube.com\/watch?v=JhwY1svuOLo&amp;t=2s\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-v-f87c67ca=\"\">time<\/a>&nbsp;on, and is generally relevant to venture investing in the space.","Sophisticated LPs look for managers who are able to secure allocations in competitive rounds while staying valuation-sensitive. Managers can always exercise soft governance through personal relationships, providing sound advice and being seen as an important and influential investor.","<a href=\"https:\/\/avc.com\/2017\/01\/reserves\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Reserves<\/a> are the portion of the committed capital of the fund which is held back for follow-on investments. The sizing of reserves is a hotly debated topic among GPs and LPs. If reserves are high, the fund shifts its profile more towards later rounds (with lower variance). If reserves are too low, it means VCs cannot support founders in follow-on rounds and protect their ownership through capital raises.","GPs actively involved in a portfolio company (e.g. with a board seat) are beneficiaries of a powerful and legal&nbsp;<em class=\"hy\" data-v-f87c67ca=\"\">informational advantage (edge)<\/em>, in deciding whether to participate in a follow-on round. Of course, this edge is so widely understood that the act of&nbsp;<em class=\"hy\" data-v-f87c67ca=\"\">not<\/em>&nbsp;following on is seen as strong negative signaling, and may jeopardize the founder’s chances of raising their next round. Perversely, this incentivises GPs to follow-on in investments they would not otherwise choose to.","Unfortunately, the best deals are typically the most competitive, and&nbsp;<em class=\"hy\" data-v-f87c67ca=\"\">pro rata<\/em>&nbsp;rights may be exceedingly difficult to secure or protect. Reserves allow GPs to double down on winners, but they must manage the risk of adverse selection: it is easier to deploy incremental follow-on capital into the bottom than the top quartile of a portfolio.","Reserves are also important for reasons other than dilution protection. In venture capital, exhaustively negotiated investor protections such as pro-rata rights, dilution protection rights and liquidation preferences may all lose their value if the investor cannot allocate additional capital in subsequent rounds to fulfill the pay-to-play clause. A fundamental reason for keeping reserves is to make sure that preferred stock is not converted into&nbsp;<a class=\"bt dg hu hv hw hx\" href=\"https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=2955455\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-v-f87c67ca=\"\">less valuable common stock<\/a>.","However, in crypto, we’ve seen: a) fewer subsequent private rounds where participation is required, b) weaker traditional investor protections in earlier rounds and c) a lower cumulative amount of capital that can be deployed in the winners pre-liquidity. Thus, the natural need for reserves is reduced.","Given that conclusion, should larger amounts of reserves be kept to continue investing in a network in public token markets?","After all, inflation-based cryptonetworks have a dilution dynamic similar to subsequent funding rounds in conventional venture. While non-crypto VCs don’t expect much additional dilution post-liquidity, it is common for cryptonetworks’ inflation schedules or consensus mechanisms to dilute their day-one backers incrementally until the network is fully decentralized. Hence, crypto VCs might want to hold on to reserves for open-market purchases, or&nbsp;<a class=\"bt dg hu hv hw hx\" href=\"https:\/\/medium.com\/cambrial-capital\/generalised-mining-the-lps-perspective-72dfa2d22afd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">engage in Generalized Mining<\/a>&nbsp;to avoid dilution of their stake (or earn incremental allocations) while supporting the network fundamentally.","Traditional venture LPs might struggle with the idea that reserves are kept in order to double down on crypto networks via public markets.","<a class=\"bt dg hu hv hw hx\" href=\"https:\/\/en.wikipedia.org\/wiki\/Efficient-market_hypothesis\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-v-f87c67ca=\"\">In theory<\/a>, public markets have greater access and fewer informational asymmetries, leading to more accurate pricing and a liquidity premium.&nbsp;<em class=\"hy\" data-v-f87c67ca=\"\">Prima facie<\/em>, crypto VCs should focus on allocating capital to private markets where their edge is stronger. In practice, it is far from clear that this is the case for this nascent sector. We have found scant evidence of thoughtful, rigorous and disciplined valuation work among most public crypto market investors. Indeed, given the extremes we see in public crypto markets, they may be more mispriced (have higher alpha) than private markets, which are dominated by professional investors.","The fact that a token is publicly traded tells us very little about the stage, maturity or risk level of a particular cryptonetwork, save that they have probably reached or surpassed the ‘beta’ stage. There is every chance the investment is still an early-stage bet on technology with asymmetric return potential and it should be treated as such until it matures, regardless of liquidity.","Unlike in traditional venture, we believe it is entirely possible for a follow-on investment to be executed in the public markets, and GPs should be unapologetic about doing so.","Overall, the ‘correct’ level of reserves for an early-stage crypto-focussed venture fund is a subject our team at Cambrial will continue thinking about. But liquidity is barely a relevant parameter in our discussions. Instead, due to the reduced path dependencies (governance, share class, etc.) that require follow-on investments, we believe (for now) that crypto venture funds should have smaller reserves than traditional VCs. With a relatively higher portion of committed capital invested in first checks, getting access and higher allocations to the best opportunities early on will be a key driver for portfolio returns.","Unless you are Warren Buffet, it is not advisable to make an investment without a clear idea of how, if not when (under which conditions), you intend to disinvest and which returns you’d expect to make. For VCs generally, <a href=\"http:\/\/www.industryventures.com\/venture-capital-secondary-funds-the-third-exit-option\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">the exit routes<\/a> through IPO or acquisition are well-trodden. The same is not true in crypto: VC investors have been able to exit their positions once the network tokens become tradeable but there is not enough experience across market cycles to know whether this will hold up, dwindle or be replaced by something else entirely.","Whereas equity VC investors typically exit during or shortly after a liquidity event, this may not be optimal in crypto VC. Because a liquid token is a prerequisite for a functioning cryptonetwork, token liquidity — by necessity — occurs very early in the maturity of a project — too soon for the true value of it to be apparent and often while the firm behind it has additional capital needs. Just because a venture investment (e.g. in a SAFT) becomes liquid, GPs should not feel pressured to sell their position. At the same time, the fact there is a liquid market for a venture portfolio’s assets implies that the GP makes a decision of omission or commission every day by choosing to leave or readjust a position.","As projects mature, using secondary markets as an exit route is a controversial topic amongst GPs and LPs. On the one hand, it enables the Funds to return profits to investors sooner, increasing the short-term IRR and de-risking the portfolio at the same time. On the other hand, GPs may face criticism from their LPs if they sell winners too soon, and from investee founders that they are not long-term partners.","Overall, crypto investments do require active portfolio management in the post-network-launch stage and, without trading in and out, managers do need to pick their exit points and use available sources of liquidity, especially OTC desks, to realise their profits. If done well, crypto VCs can construct portfolios that have a flatter&nbsp;<a class=\"bt dg hu hv hw hx\" href=\"http:\/\/www.allenlatta.com\/allens-blog\/lp-corner-the-j-curve\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-v-f87c67ca=\"\">J-Curve<\/a>&nbsp;than conventional venture funds.","<a href=\"https:\/\/feld.com\/archives\/2018\/08\/the-economics-of-vcs-recycling-management-fees.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Recycling<\/a> is the practice of reinvesting profits back into the fund and, assuming profitability, will increase the fund net multiples (TVPI, DPI) but, by delaying capital return, may actually reduce the IRR in the short-term. In traditional VC, some limited recycling is common, often to compensate for the total cost base (management fees and fund expenses).","As cryptonetwork investments have earlier liquidity and high volatility post liquidity event, managers can argue for higher recycling percentages<strong class=\"hc jk\" data-v-f87c67ca=\"\">&nbsp;<\/strong>if they plan to actively manage and rebalance their liquid portfolio on a regular, maybe monthly basis. The resulting shorter holding periods and realised gains and losses resulting from portfolio rebalancing may have tax consequences for the LP and regulatory implications on the suitable fund structure which the GP will need to consider.","VC investors are used to working with emerging technologies but with crypto, they are in the new position of using the same emerging technology that they are invested in.","As we have seen, this introduces whole new dimensions of uncertainty covering value accrual and exit mechanics. It is impossible to plan exit routes and exit valuations in the way we, as LPs, would like to see. Second best, we want to see GPs who can work closely with the firms to plan the trajectory of the business, are able to be flexible when the conditions demand it and have a good sense of the way the market and technology are heading.","Many portfolio construction parameters are trade-offs with no absolute right answers and LPs should be open to arguments from GPs who plan to deviate substantially from standard industry parameter levels. If forced to put some hard numbers down, our ideal VC funds would fall in the ranges below but we are sure this view will be subject to change in the future.","<em data-v-f87c67ca=\"\">Cambrial Capital’s ideal Crypto VC Fund parameters <\/em>","<strong class=\"hc jk\" data-v-f87c67ca=\"\"><em class=\"hy\" data-v-f87c67ca=\"\">Acknowledgments<\/em><\/strong>&nbsp;??","<em class=\"hy\" data-v-f87c67ca=\"\">Thanks to&nbsp;<\/em><a class=\"bt dg hu hv hw hx\" href=\"https:\/\/twitter.com\/dfauchier\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-v-f87c67ca=\"\"><em class=\"hy\" data-v-f87c67ca=\"\">David<\/em><\/a><em class=\"hy\" data-v-f87c67ca=\"\">,&nbsp;<\/em><a class=\"bt dg hu hv hw hx\" href=\"https:\/\/twitter.com\/EdwardMNelson\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-v-f87c67ca=\"\"><em class=\"hy\" data-v-f87c67ca=\"\">Edward<\/em><\/a><em class=\"hy\" data-v-f87c67ca=\"\">, and&nbsp;<\/em><a class=\"bt dg hu hv hw hx\" href=\"https:\/\/twitter.com\/ObadiaAlex\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-v-f87c67ca=\"\"><em class=\"hy\" data-v-f87c67ca=\"\">Alex<\/em><\/a><em class=\"hy\" data-v-f87c67ca=\"\">&nbsp;for contributing to this post.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"10% percent","content":"PERCENT"},{"type":"Jerry Neumann","content":"PERSON"},{"type":"$400m","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"12%","content":"PERCENT"},{"type":"$2","content":"MONEY"},{"type":"Duong","content":"ORGANIZATION"},{"type":"Berlin","content":"LOCATION"},{"type":"74%","content":"PERCENT"},{"type":"Edward","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"$18m","content":"MONEY"},{"type":"Kendrick Geluz Kho","content":"PERSON"},{"type":"Benedict Evans","content":"PERSON"},{"type":"IRR","content":"ORGANIZATION"},{"type":"$2m","content":"MONEY"},{"type":"LP","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"David","content":"PERSON"},{"type":"Cambrial Capital","content":"ORGANIZATION"},{"type":"Lightning Network)","content":"ORGANIZATION"},{"type":"Alex","content":"PERSON"},{"type":"Project A. Ha","content":"ORGANIZATION"},{"type":"General Partners","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Cambrial","content":"ORGANIZATION"},{"type":"Warren Buffet","content":"ORGANIZATION"}],"hashtag":[],"authors":["Ha Duong","The Block"]}