{"summary":"Crypto has the potential to replace cash in the next decade, per Deutsche Bank research\nThe current fiat system looks “fragile,” particularly because of “decades of low labor costs” and inflation\nCrypto, however, needs to become legal in the eyes of governments and regulators to become widespread","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49621\/deutsche-bank-says-crypto-could-replace-cash-by-2030-as-fiat-system-looks-fragile","publishDate":"2019-12-07T08:45:22","id":762,"type":null,"title":"Deutsche Bank says crypto could replace cash by 2030 as fiat system looks ‘fragile’","category":["Cryptocurrency"],"content":["Cryptocurrencies have the potential to eventually replace cash, according to new research from financial services giant Deutsche Bank.","In the “<a href=\"https:\/\/www.dbresearch.com\/PROD\/RPS_EN-PROD\/PROD0000000000503196\/Imagine_2030.PDF\" data-v-f87c67ca=\"\">Imagine 2030<\/a>” research report, Germany-headquartered Deutsche Bank said cryptocurrencies may have been “additions” rather than “substitutes” in the finance world thus far, but the next decade could change that as regulatory hurdles get past.","“If one of the GAFA [Google, Apple, Facebook and Amazon] (or their Chinese counterparts BATX [Baidu, Alibaba, Tencent and Xiaomi]) for example are able to overcome regulatory hurdles...this would broaden the appeal of cryptocurrencies, hasten their adoption, and give them the potential to eventually replace cash,” per the report, which is led by Jim Reid, global head of fundamental credit strategy and thematic research at Deutsche Bank.","The current fiat system looks “fragile,” particularly because of “decades of low labor costs” and inflation. Over the next decade, things could change and “demand for alternative currencies, from gold to crypto, could take off,” according to the report.","Benefits of cryptocurrencies such as security, speed, minimal transaction fees, ease of storage and “relevance in the digital era” could help drive mass adoption in the years to come, it added.","","","Another reason that cryptocurrencies could become the “21st-century cash” is their privacy, per the report. “Nearly two thirds of consumers prefer dematerialised to cash payments and a third are concerned by anonymity. These are the two things that cryptocurrencies do best.”","Eventually, inflation could drive demand for alternative currencies. “Will fiat currencies survive the policy dilemma that authorities will experience as they try to balance higher yields with record levels of debt? That’s the multi-trillion dollar (or bitcoin) question for the decade ahead,” said Reid.","Cryptocurrencies, however, need to become legal in the eyes of governments and regulators to become widespread, per the report. This would bring price stability, allow for global reach and see increased interest from companies in the payments industry, such as Visa and Mastercard, as well as from retailers such as Amazon and Walmart.","While many predict the end of cash in the years to come, Deutsche Bank believes that plastic cards could die out as smartphones make physical cards obsolete. “Whether it is through the eager adoption by millennials or the increased digitalisation of countries’ infrastructure, the plastic card could be on its way out over the next decade while people will still be paying with humble notes and coins.” Governments and banks are also moving towards a cashless society, per the report.","Based on current trends, the Deutsche Bank research report further said that the number of blockchain wallet users would increase to 200 million by 2030."],"hashtag":[]}