{"summary":"UBS will not acquire robo-advisory firm Wealthfront as previously announced, according to a Friday statement.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167606\/ubs-wealthfront-call-off-1-4-billion-deal","publishDate":"2022-09-02T17:34:28","id":7620,"type":null,"title":"UBS, Wealthfront call off $1.4 billion deal","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">UBS nixed a <a href=\"https:\/\/www.theblock.co\/linked\/131805\/ubs-to-acquire-robo-advisor-wealthfront-for-1-4-billion\" data-v-f87c67ca=\"\">$1.4 billion<\/a> deal to buy robo-advisory firm Wealthfront, the companies said.<\/span>","UBS said the two companies mutually agreed to terminate their merger agreement, which they announced in January. UBS will purchase a nearly $70 billion note convertible into Wealthfront shares, maintaining the $1.4 billion valuation.","\"UBS remains committed to its growth plans in the U.S. and will continue the build-out of its digital wealth management offering,” the bank said in a statement.","“We're incredibly excited about Wealthfront’s path forward as an independent company and are proud to share that thanks to the hard work of our team and the trust you put in us, we will be cash flow positive and EBITDA profitable in the next few months,” Wealthfront <a href=\"https:\/\/twitter.com\/Wealthfront\/status\/1565804678289424388\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a> on Twitter.","Wealthfront began offering exposure to Grayscale’s bitcoin and ether-tied investment trusts last year, as previously reported.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wealthfront","content":"PERSON"},{"type":"$1.4 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"UBS","content":"ORGANIZATION"},{"type":"$70 billion","content":"MONEY"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}