{"summary":"The MoonPay app has launched the swaps functionality, letting users exchange one cryptocurrency for another.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255192\/moonpay-crypto-swaps-app","publishDate":"2023-10-06T09:05:04","id":7627,"type":null,"title":"MoonPay adds the ability to swap cryptocurrencies in its consumer app","category":["COMPANIES"],"content":["The MoonPay app has released a swaps functionality, letting users exchange one cryptocurrency for another.","MoonPay, a crypto payments infrastructure firm, <a href=\"https:\/\/www.theblock.co\/post\/229163\/moonpay-pushes-into-retail-space-with-new-crypto-app\" data-v-f87c67ca=\"\">launched its retail-facing crypto app in May<\/a>, allowing users to buy cryptocurrencies and manage multiple wallets within the app. By adding swaps, this will provide far more functionality for its app users.","\"The way that we have implemented swapping on the MoonPay app allows us to optimize how the swap is executed,\" Ivan Soto-Wright, co-founder and CEO of MoonPay, told The Block.","\"Specifically, rather than using smart contracts to execute the swap (which can get very expensive given the complexity of the smart contract call operations), MoonPay conducts two sends (one for receiving the deposit, one for sending the quote amount) which is more gas efficient by reducing the number of operations required for the swap,\" said Soto-Wright.","MoonPay claims to have 16 million customers globally.","Founded in 2018, MoonPay has lately diversified its core business model of payments infrastructure for consumer-facing businesses, including the app and NFTs. The firm also <a href=\"https:\/\/www.theblock.co\/post\/247910\/moonpay-launches-investment-arm-moonpay-ventures?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">launched its venture capital unit<\/a> in August to invest in early stage web3 and fintech startups. Earlier this year, MoonPay <a href=\"https:\/\/www.theblock.co\/post\/203799\/moonpay-acquires-web3-creative-studio-nightshift-in-its-first-deal?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">made its first acquisition<\/a> deal by buying web3 creative agency Nightshift to help brands offer web3 features.","MoonPay <a href=\"https:\/\/www.theblock.co\/post\/124980\/moonpay-raise\" data-v-f87c67ca=\"\">was valued at $3.4 billion in late 2021<\/a> following its massive $555 million Series A funding round led by Tiger Global Management and Coatue. Soto-Wright and other executives at MoonPay reportedly <a href=\"https:\/\/www.theblock.co\/post\/232592\/moonpay-insiders-pocket-150-million-the-information?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">cashed out $150 million<\/a> by selling shares as part of the Series A round. Soon after the funding round was announced, Soto-Wright purchased a $38 million mansion in Miami.","MoonPay was hit with a <a href=\"https:\/\/www.theblock.co\/post\/193746\/yuga-labs-moonpay-named-in-celebrity-nft-endorsement-lawsuit\" data-v-f87c67ca=\"\">class action lawsuit<\/a> last December for allegedly conspiring with Bored Ape NFTs creator Yuga Labs and several celebrities to inflate the value of NFTs. In June of this year, The Block <a href=\"https:\/\/www.theblock.co\/post\/233594\/moonpay-gave-hollywood-celebs-bored-apes-to-promote-itself?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">reported<\/a> that MoonPay had gifted celebrities the valuable Bored Apes NFTs in order to promote its business. MoonPay denied giving celebrities Bored Apes free of charge at the time without providing further details.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Soto","content":"PERSON"},{"type":"June of this year","content":"DATE"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"Coatue","content":"ORGANIZATION"},{"type":"$555 million","content":"MONEY"},{"type":"Ivan Soto","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"fintech","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Tiger Global Management","content":"ORGANIZATION"},{"type":"$38 million","content":"MONEY"},{"type":"$3.4 billion","content":"MONEY"},{"type":"Wright","content":"PERSON"},{"type":"MoonPay","content":"ORGANIZATION"},{"type":"Bored Ape NFTs","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}