{"summary":"Ethereum users can stake their liquid staking tokens on EigenLayer to receive additional yield — with extra risk.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234627\/eigenlayer-goes-live-on-ethereum-with-initial-17-million-deposit-limit","publishDate":"2023-06-14T15:37:29","id":7628,"type":null,"title":"EigenLayer goes live on Ethereum with initial $17 million LST deposit limit","category":["CRYPTO ECOSYSTEMS"],"content":["Re-staking protocol EigenLayer launched on Ethereum today, enabling holders of liquid staking tokens to double down for additional yield — at the cost of extra risk.","The core idea behind <a href=\"https:\/\/www.eigenlayer.xyz\/\" data-v-f87c67ca=\"\">EigenLayer<\/a> is that the staking security provided by ether stakers can be used to secure other protocols on the network. To use it, holders of liquid staking tokens — like Lido staked ether (stETH) — can stake these tokens through EigenLayer. This means that the token holders will gain extra rewards from the newer protocols they’re supporting, but it opens them up to more risk of penalties through slashing.","“This is a significant step forward for Eigenlayer and we are excited to build the future of shared security together to work to hyperscale Ethereum,” the project's team said in a press release.","At launch, EigenLayer will support native staking of ether plus liquid staking tokens stETH, Rocket Pool ether (rETH), and Coinbase's wrapped staked ether (cbETH).&nbsp;","The protocol commences operation with some capacity limits. For example, it will only allow 3,200 tokens for each liquid staking token, creating a total limit of 9,600 liquid staking tokens. At ether's current price, that's a limit of around $16.7 million. The protocol will only let each crypto wallet deposit a maximum of 32 tokens, resulting in at least 300 deposits from separate wallets.&nbsp;","Those who are staking their ether directly can also choose to use EigenLayer. This approach is accomplished through the creation of what’s called an EigenPod. The number of pods will be capped but not the number of staked ether.","“These limits will be raised progressively over the coming weeks and months, with the goal of reaching a totally open and uncapped state where any user can restake any amount of staked Ether,” said EigenLayer.","EigenLayer previously raised $64.5 million, <a href=\"https:\/\/www.theblock.co\/post\/222901\/eigenlayer-series-a\" data-v-f87c67ca=\"\">including<\/a> a $50 million Series A in March. The startup said today that its Series A raise was at a $500 million valuation, confirming The Block’s <a href=\"https:\/\/www.theblock.co\/post\/208015\/eigenlayer-series-a-round\" data-v-f87c67ca=\"\">reporting<\/a> ahead of the raise. Its backers include Blockchain Capital, Coinbase Ventures, Polychain Capital, Hack VC and Electric Capital.&nbsp;","The startup was founded in 2021 by Sreeram Kannan, an assistant professor at the University of Washington, Seattle.","The re-staking model has drawn criticism from some notable corners of the Ethereum ecosystem. Perhaps most notably, Ethereum co-founder Vitalik Buterin has <a href=\"https:\/\/www.theblock.co\/post\/231676\/vitalik-buterin-urges-caution-when-it-comes-to-re-staking-on-ethereum\" data-v-f87c67ca=\"\">expressed concern<\/a> about the emergence of re-staking.&nbsp;","“We should tread lightly when application-layer projects aim to extend the ‘scope’ of blockchain consensus beyond the validation of essential Ethereum protocol rules,” Buterin stated in a blog post.","Buterin noted that while re-staking can be used for low-risk purposes, there are situations where it could compromise the mainnet’s security, such as when Ethereum validators face slashing on third-party chains.","“We should instead preserve the chain’s minimalism and support uses of re-staking that do not seem like slippery slopes towards extending the role of Ethereum consensus,” Buterin suggested.","At the time, EigenLayer co-founder Sreeram Kannan agreed with some of the concerns but argued that re-staking can be used in low-risk situations.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"EigenLayer","content":"ORGANIZATION"},{"type":"Electric Capital","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"$16.7 million","content":"MONEY"},{"type":"Sreeram Kannan","content":"PERSON"},{"type":"$64.5 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"University of Washington","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"EigenPod","content":"ORGANIZATION"},{"type":"Seattle","content":"LOCATION"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}