{"summary":"The first thing to understand about cryptocurrency and blockchains is: this is not about technology. Satoshi Nakamoto deserves full credit for putting the","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/9716\/the-buttcoin-standard-the-problem-with-bitcoin","publishDate":"2019-01-31T11:19:06","id":7629,"type":null,"title":"The Buttcoin Standard: the problem with Bitcoin","category":["OP-ED"],"content":["<span data-v-f87c67ca=\"\">The first thing to understand about cryptocurrency and blockchains is: this is not about technology.<\/span>","<span data-v-f87c67ca=\"\">Satoshi Nakamoto deserves full credit for putting the pieces together. But all the technology in Bitcoin was old by 2008. All the parts were in place<\/span><a href=\"https:\/\/www.gwern.net\/Bitcoin-is-Worse-is-Better#pre-requisites\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">by 2001.<\/span><\/a><span data-v-f87c67ca=\"\"> Byzantine fault tolerance dates from <\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/Byzantine_fault#Early_solutions\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">1982.<\/span><\/a><span data-v-f87c67ca=\"\"> Even decentralised consensus with proof of work was<\/span><a href=\"https:\/\/dl.acm.org\/citation.cfm?doid=945445.945451\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">no later than 2003.<\/span><\/a>","<span data-v-f87c67ca=\"\">Bitcoin - I'm going to use \"Bitcoin\" as a synecdoche for the crypto and blockchain world, because it all comes back to Bitcoin - is about psychology: the promise of getting rich for free. Blockchain is about the same promises: getting fabulous organisational efficiency for free.<\/span>","<span data-v-f87c67ca=\"\">There is no such thing as a get-rich quick scheme. There is no One Weird Trick. There is no silver (or gold) bullet. Even if you say \"technology\" a lot.<\/span>","<span data-v-f87c67ca=\"\">So the first thing you should ask when you see something for nothing is: <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">what's wrong with this?<\/span><\/i>","<span data-v-f87c67ca=\"\">When you start hearing phrases like \"a whole new form of money,\" or \"the old rules don’t apply any more,\" people get gullible - and the ethically-challenged get creative.<\/span>","<span data-v-f87c67ca=\"\">Also, taking the first paper-and-string mockup of an idea and pressing it into production leads to a number of practical issues.<\/span>","<span data-v-f87c67ca=\"\">Bitcoin started as an implementation of incorrect economics: an attempt to create a digital version of the gold standard, with a strictly fixed money supply.<\/span>","<span data-v-f87c67ca=\"\">We gave up the gold standard because it didn't work. People who espouse gold standards - including digital gold standards - are<\/span><a href=\"https:\/\/davidgerard.co.uk\/blockchain\/the-conspiracist-gold-bug-economics-of-bitcoin\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">conspiracy theorists.<\/span><\/a>","<span data-v-f87c67ca=\"\">This <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">helps<\/span><\/i><span data-v-f87c67ca=\"\"> in marketing Bitcoin - because \"you can get rich for free if you just believe the weird thing\" is a great incentive to believe the weird thing.<\/span>","<span data-v-f87c67ca=\"\">The formalised version of the gold standard is Austrian economics, which doesn't work, and has never worked in practice. This shouldn't be a surprise, as Mises<\/span><a href=\"https:\/\/mises.org\/library\/human-action-0\/html\/pp\/638\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">literally opposed empirical testing of his economic predictions<\/span><\/a><span data-v-f87c67ca=\"\">. Austrians still <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">make<\/span><\/i><span data-v-f87c67ca=\"\"> predictions, expecting anyone to take the predictions seriously.<\/span>","<span data-v-f87c67ca=\"\">Bitcoin is based in Austrian economics ... but many Austrians don't want a bar of it. They want actual gold, not some endlessly duplicable electronic ersatz. They think it's interesting - but not at all what they're after.<\/span>","<span data-v-f87c67ca=\"\">The market doesn't care about Bitcoin's ideology. Markets consider ideology superfluous baggage that gets in the way, and they optimise around it. So we see Bitcoin-like coins, centralised chains like Ripple, and completely centrally-controlled ICO tokens all traded in the same markets on the same terms - as a mass of \"cryptos.\" Both the trading and payment use cases happily switch between coins as is convenient.<\/span>","<span data-v-f87c67ca=\"\">If your plan assumes \"firstly, normal people want what Bitcoin Austrianism wants,\" then that's a fail out of the gate.<\/span>","<span data-v-f87c67ca=\"\">Proof of work mining is overwhelmingly the worst thing about Bitcoin.<\/span>","<span data-v-f87c67ca=\"\">Proof of work is bad. Really stupendously bad. Using <\/span><a href=\"https:\/\/digiconomist.net\/bitcoin-energy-consumption\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">an entire country's<\/span><\/a><span data-v-f87c67ca=\"\"> worth of electricity, and causing that much CO<\/span><span data-v-f87c67ca=\"\">2<\/span><span data-v-f87c67ca=\"\"> to be generated, for <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the most inefficient payment network in the history of civilisation<\/span><\/i><span data-v-f87c67ca=\"\"> levels of bad.<\/span>","<span data-v-f87c67ca=\"\">To normal people, this is obvious. Whenever I tell normal people just how much goddamn power Bitcoin uses, they get <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">angry<\/span><\/i><span data-v-f87c67ca=\"\"> - they never realised it was that seriously damaging to the world, not just an obviously silly ripoff for gullible people.<\/span>","<span data-v-f87c67ca=\"\">Fortunately, the recent crash in both price and hashrate shows us the way to deal with Bitcoin's horrendous carbon production - crash the price of Bitcoin, by whatever means necessary. I tell politicians this one too, by the way. Get some Paris agreement points cheap.<\/span>","<span data-v-f87c67ca=\"\">(My lobbying brief is: 1. Proof of work needs to be stopped however possible. 2. Better protection for retail crypto investors. 3. No, blockchain doesn't make any bureaucracy run better, don't believe the white papers. Is there smoke without fire? There's certainly a hell of a lot of fog machines in play. I find the MPs with computer science degrees know precisely what a blockchain is and how it works, and are notably unimpressed.)<\/span>","<span data-v-f87c67ca=\"\">No, Bitcoin<\/span><a href=\"https:\/\/jmkorhonen.net\/2018\/05\/25\/bitcoin-is-not-a-good-fit-for-renewable-energy-heres-why\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">doesn't encourage clean energy<\/span><\/a><span data-v-f87c67ca=\"\"> - as a 24\/7 load, it directly encourages coal. When it does use clean energy, it doesn't build clean energy infrastructure - it<\/span><a href=\"https:\/\/www.politico.com\/magazine\/story\/2018\/03\/09\/bitcoin-mining-energy-prices-smalltown-feature-217230\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">pushes the existing local users onto dirty energy<\/span><\/a><span data-v-f87c67ca=\"\">. Then it<\/span><a href=\"https:\/\/sverigesradio.se\/sida\/artikel.aspx?programid=98&amp;artikel=7089107\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">vanishes<\/span><\/a><span data-v-f87c67ca=\"\"> like a locust horde after the field is razed, well before the years of investment needed for new infrastructure.<\/span>","<span data-v-f87c67ca=\"\">(Replying to the claims about Bitcoin mining in full detail would <\/span><a href=\"https:\/\/rationalwiki.org\/wiki\/Gish_Gallop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">take thousands of words<\/span><\/a><span data-v-f87c67ca=\"\"> in itself. I recommend<\/span><a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/30\/bitcoin-doesnt-incentivize-green-energy\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">Maximilian Fiege's response<\/span><\/a><span data-v-f87c67ca=\"\"> to the<\/span><a href=\"https:\/\/coinshares.co.uk\/bitcoin-mining-cost\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">CoinShares Mining Report.<\/span><\/a><span data-v-f87c67ca=\"\">)<\/span>","<span data-v-f87c67ca=\"\">For some reason, Bitcoiners think, \"what about the energy used by the existing financial system?\" is a sensible comparison - particularly if the subject is energy efficiency. Bitcoiners making this argument never put forward numbers. So here are some:<\/span>","<span data-v-f87c67ca=\"\">Transaction speed is not an ideal measure - but if the question is efficiency, that's measured by how much a system gets done with what resources. Also, it's bitcoiners who make the comparison to the existing system in the first place, and don't suggest a better measure of efficiency.<\/span>","<span data-v-f87c67ca=\"\">But the claim is predicated on Bitcoin possibly being able to replace the existing financial system at all. There's no reason to think this is even possible.<\/span>","<span data-v-f87c67ca=\"\">There's almost no cryptocurrency economy - no circular flow of income - so the crypto system remains <\/span><a href=\"https:\/\/www.coindesk.com\/bitcoin-still-needs-fiat-currency-wont-change-2018\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">utterly dependent<\/span><\/a><span data-v-f87c67ca=\"\"> on the existing system.<\/span>","<span data-v-f87c67ca=\"\">Even Bitcoin maximalists never shut up about the price in U.S. dollars. The price is the last-ditch argument when they can't convince normal people this stuff is any good.<\/span>","<span data-v-f87c67ca=\"\">Crypto has so far been weirdly detached from the real-world economy. For all the activity within the crypto economy - and headlines about number going up or down - it <\/span><a href=\"http:\/\/www.fsb.org\/2018\/07\/fsb-report-sets-out-framework-to-monitor-crypto-asset-markets\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">doesn't much affect<\/span><\/a><span data-v-f87c67ca=\"\"> the real-world economy.<\/span>","<span data-v-f87c67ca=\"\">If you believe Bitcoin is a legitimate alternative to the current monetary system - set out how that would happen. Make a plan that doesn't have really obvious huge glaring holes in it - and that shows comprehension of how the existing system works and the stuff it does.<\/span>","<span data-v-f87c67ca=\"\">Bitcoiners have never put forward a reality-based plan to replace the present financial system, that accounts for what the existing system does.<\/span>","<span data-v-f87c67ca=\"\">Just saying \"but the present system is bad!\" doesn't mean your system is better. You need to show that.<\/span>","<span data-v-f87c67ca=\"\">\"Bitcoin will become the new gold standard\" seems to be pure wishful thinking. I expect the maximalists saying this don't think they're saying \"Bitcoin will become the new version of that thing the real economy hasn't run on in several decades, and longer if you count from the invention of paper money.\"<\/span>","<span data-v-f87c67ca=\"\">Gold is<\/span><a href=\"https:\/\/www.forbes.com\/sites\/timworstall\/2016\/08\/05\/so-why-do-indian-households-invest-so-much-in-gold\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">still popular as money<\/span><\/a><span data-v-f87c67ca=\"\"> in India, where a lot of people<\/span><a href=\"https:\/\/www.economist.com\/the-economist-explains\/2013\/11\/20\/why-do-indians-love-gold\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">don't have good access<\/span><\/a><span data-v-f87c67ca=\"\"> to the banking system - has Bitcoin made any inroads there? Why would a normal Indian think your computer data was just as good as gold - for the things they use gold for? Why is Bitcoin failing to bank these unbanked?<\/span>","<span data-v-f87c67ca=\"\">(Nothing has a lustre quite like corrosion-resistant aluminium, you know. That's what makes it a<\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/Precious_metal#Aluminium\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">precious metal,<\/span><\/a><span data-v-f87c67ca=\"\"> and highly sought after.)<\/span>","<span data-v-f87c67ca=\"\">Proof of work was only ever a way to take central control out of the Bitcoin system. But <\/span><a href=\"https:\/\/www.longhash.com\/news\/interview-with-emin-gun-sirer-there-are-no-truly-decentralized-coins\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">decentralisation is hard<\/span><\/a><span data-v-f87c67ca=\"\"> - centralisation is always more efficient. So decentralisation failed by 2014, when mining had recentralised to a few large pools. Remember the <\/span><a href=\"https:\/\/www.theguardian.com\/technology\/2014\/jun\/16\/bitcoin-currency-destroyed-51-attack-ghash-io\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">51% apocalypse<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;in 2014?<\/span>","<span data-v-f87c67ca=\"\">Bitmain has controlled up to 50% of the mining (across multiple pools), makes 80% of the ASICs, and already<\/span><a href=\"https:\/\/davidgerard.co.uk\/blockchain\/2017\/11\/14\/chinese-bitcoin-mining-shutdowns-how-is-bitcoin-vs-bitcoin-cash-affected\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">messed with the BTC hash rate in late 2017.<\/span><\/a><span data-v-f87c67ca=\"\"> Nobody cared much at the time, because the crypto bubble was in the throes of full \"number go up\" on the exchanges.<\/span>","<span data-v-f87c67ca=\"\">The point of cryptocurrency was decentralisation. If you remove that, the only question left is \"why on earth are you bothering with all of this.\"<\/span>","<span data-v-f87c67ca=\"\">(There's arguably a hypothetical use case for a centrally-administered blockchain-like currency, such as XRP, which then doesn't have to bother with proof of work. In that case, we're still waiting for non-hypothetical production systems that move beyond pilot stage.)<\/span>","<span data-v-f87c67ca=\"\">\"Uncensorable!\" has transmuted with time into \"censorship-resistant!\" - where any degree of censorability in practice is handwaved away with \"I said <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">resistant<\/span><\/i><span data-v-f87c67ca=\"\">.\"<\/span>","<span data-v-f87c67ca=\"\">You can't censor a Bitcoin transaction before the fact. And that is significant! But you can totally<\/span><a href=\"https:\/\/www.coindesk.com\/iran-bitcoin-sanctions-wallets-ofac-crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">censor it after,<\/span><\/a><span data-v-f87c67ca=\"\"> and that too is significant.<\/span>","<span data-v-f87c67ca=\"\">I'm all for there being channels for exchange outside the Sauron-like eye of the authorities. But I'm really unconvinced that crypto-assets can do the job at greater than a trivial scale.<\/span>","<span data-v-f87c67ca=\"\">Spending a country's worth of electricity to secure a seven transaction per second payment network is not just inherently ludicrous - it's insufficient. You're only securing a single element of a large and complicated system.<\/span>","<span data-v-f87c67ca=\"\">Nobody attacks a cryptographic system at the strongest point - they attack at the weak points. The Bitcoin system is much more than a blockchain.<\/span>","<span data-v-f87c67ca=\"\">And so we see an endless string of exchange and user hacks - because the Bitcoin blockchain's cryptographic security is a six-inch steel plate door in a cardboard frame.<\/span>","<span data-v-f87c67ca=\"\">Don't forget mining's price sensitivity - and all the dark hashpower that price drops leave lying around, just waiting for redeployment.<\/span>","<span data-v-f87c67ca=\"\">Other justifications include immutability as a timestamp mechanism. <\/span><a href=\"https:\/\/twitter.com\/fetchmercury\/status\/1089149800933703680\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">But,<\/span><\/a><span data-v-f87c67ca=\"\"> per Alkahest on Twitter: \"Humanity's first writing was immutable, tamper-evident, and lasted forever unless someone smashed it. A shared database is not more durable than the letter to Ea-Nasir.\" And a clay tablet doesn't need the entire energy consumption of Austria to sustain it.<\/span>","<span data-v-f87c67ca=\"\">(Timestamping in a Merkle tree<\/span><a href=\"https:\/\/link.springer.com\/chapter\/10.1007%2F3-540-38424-3_32\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">dates from 1991<\/span><\/a><span data-v-f87c67ca=\"\"> and was first<\/span><a href=\"http:\/\/surety.com\/about\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">commercialised in 1994.<\/span><\/a><span data-v-f87c67ca=\"\"> There are almost no real-life use cases for timestamping that have zero trust in them, and any trust at all means you don't need to do anything as silly as proof of work.)<\/span>","<span data-v-f87c67ca=\"\">The almost-universal Bitcoin maximalist response to public concerns is <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">defiance.<\/span><\/i><span data-v-f87c67ca=\"\"> Or justifications that only make sense if you first assume Bitcoin. Or just repeating Bitcoin catchphrases.<\/span>","<span data-v-f87c67ca=\"\">Bitcoiners seem to have given up even trying to convince normal people about Bitcoin. All I see is them trying to convince each other. Hodl!<\/span>","<span data-v-f87c67ca=\"\">Bitcoin advocates don't seem to understand that the public ire at proof of work using a country's worth of electricity is a question of whether Bitcoin will be allowed to exist in its present form. They have to be able to answer the question: \"have you considered not doing the stupid and wasteful thing?\" Defiance will only stick for so long.<\/span>","<span data-v-f87c67ca=\"\">Even Hal Finney - the second bitcoiner, Satoshi's beta-tester - realised proof of work <\/span><a href=\"https:\/\/twitter.com\/halfin\/status\/1153096538\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">was going to be a CO<\/span><span data-v-f87c67ca=\"\">2<\/span><span data-v-f87c67ca=\"\"> problem<\/span><\/a><span data-v-f87c67ca=\"\"> in 2009. Take heed from him.<\/span>","<span data-v-f87c67ca=\"\">Literally the subheading of the Bitcoin white paper is \"An electronic peer-to-peer cash system.\"<\/span>","<span data-v-f87c67ca=\"\">But irreversibility makes it really bad for this job - normal consumers overwhelmingly expect reversibility in a payment system. They don't want to use a system where all hacks, frauds and human errors are final.<\/span>","<span data-v-f87c67ca=\"\">So cryptocurrency's merchant use case was always extremely limited. And the transaction clog from mid-2015 until the popping of the 2017 bubble shook off most of the remaining merchants.<\/span>","<span data-v-f87c67ca=\"\">The claim retreats to Bitcoin being a \"settlement network\" for ... some non-Bitcoin system that is usable as cash.<\/span>","<span data-v-f87c67ca=\"\">Lightning Network won't save it here. Lightning can't solve the path-finding problem without the network<\/span><a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/15\/the-growth-of-the-lightning-network-has-been-remarkable-but-theres-a-catch\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">degenerating into a few supernodes<\/span><\/a><span data-v-f87c67ca=\"\"> - which throws decentralisation out the window.<\/span>","<span data-v-f87c67ca=\"\">Functionally, the use case for the Lightning Network is to be an excuse for past failures that's perpetually six months from usability - not to be a good payment system.<\/span>","<span data-v-f87c67ca=\"\">Being chain-agnostic means that even if Lightning could become a good payment network, it wouldn't have to attach itself to a millstone like Bitcoin. Although then you have the problem of<\/span><a href=\"https:\/\/coinjournal.net\/flaw-discovered-in-lightning-networks-cross-chain-functionality\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">cross-chain arbitrage<\/span><\/a><span data-v-f87c67ca=\"\">. The posited solution to which is ... <\/span><a href=\"https:\/\/bitonic.nl\/public\/slowdown_prevention.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a trusted third party!<\/span><\/a>","<span data-v-f87c67ca=\"\">The Lightning Network is the one last hope that bitcoin will work as electronic peer-to-peer cash, and maybe number will go up again. Everything else can be thrown away, as long as number goes up again.<\/span>","<span data-v-f87c67ca=\"\">The actual network used as cash during the transaction clog was other crypto-assets whose transactions hadn't clogged yet, and the actual Layer 2 is exchanges.<\/span>","<span data-v-f87c67ca=\"\">So the new excuse is \"store of value.\" It isn't - nobody outside Bitcoin takes it seriously as a store of value, it's way too volatile, it lost 85% of its value in the past year, and it's troublesome to convert in a crunch.<\/span>","<span data-v-f87c67ca=\"\">It's only a \"store of value\" based on the expectation that someone will definitely come along and pay you more for your heavy bags later. There is no other use for held bitcoins. It's a slow-moving game of hot potato.<\/span>","<span data-v-f87c67ca=\"\">The phrase \"store of value\" is marketing for Bitcoin, that correctly translates \"failed hard as 'electronic peer-to-peer cash'\" and \"my bags weigh a ton, please buy so I can sell.\"<\/span>","<span data-v-f87c67ca=\"\">I have seen bitcoiners claim Bitcoin is a \"store of value\" as long as its price is above zero. This would imply that a<\/span><a href=\"https:\/\/www.youtube.com\/watch?v=tF7HYRH_xt8\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">large pile of horse manure<\/span><\/a><span data-v-f87c67ca=\"\"> is a \"store of value\" if you could plausibly sell it for something, ever. I suggest you'll have trouble getting people to take it seriously as an investment vehicle, though.<\/span>","<span data-v-f87c67ca=\"\">And all this horse poop - which is clearly not limited in supply - doesn't mean there must be a pony in here somewhere.<\/span>","<span data-v-f87c67ca=\"\">The Bitcoin subculture wants to hear <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">good<\/span><\/i><span data-v-f87c67ca=\"\"> news!<\/span>","<span data-v-f87c67ca=\"\">Trouble is, the news is bad - the price has crashed, the ordinary retail buyers from the 2017 bubble have been skinned and a new crop will take a few years at least, transaction volume is through the floor, buying pressure is down, selling pressure from miners remains constant.<\/span>","<span data-v-f87c67ca=\"\">As it gets worse, the subculture boils down to the fanatical.<\/span>","<span data-v-f87c67ca=\"\">I've frequently been wrong about Bitcoin! Generally when I've assumed the market is in any way rational. If anyone ever tries to tell you that markets should be assumed efficient, introduce them to Bitcoin.<\/span>","<span data-v-f87c67ca=\"\">I'd want to see Bitcoin showing it was good and worked for something in the wider world, outside the noisiest advocates. The proposed economics would have to not be gibberingly insane. Also, proof-of-work mining? That's reprehensible, and has to either go, or successfully justify itself to anyone other than advocates.<\/span>","<span data-v-f87c67ca=\"\">Given the system's track record on \"coming soon\" over the past decade - you understand that I'll believe it when I see it.<\/span>","<span data-v-f87c67ca=\"\">More bitcoiners need to consider the possibility: \"but what if this is all it ends up doing, over and over, for years?\"<\/span>","<span data-v-f87c67ca=\"\">Ten years of failing at your One Big Goal is not generally followed by an eleventh year of HUGE SUCCESS!!! \"Nascent\" and \"time will tell\" are markers of failure to date - after ten years, you only say \"could\" when you can't say \"actually does.\"<\/span>","<span data-v-f87c67ca=\"\">I expect the future of crypto-assets is that they'll become increasingly normalised - they'll become a much more routine sort of assets, the markets will be cleaned up, the KYC\/AML gateways will get even more stringent. They'll be around for a while.<\/span>","<span data-v-f87c67ca=\"\">There'll be something called \"Bitcoin\", descended from the present software and blockchain, for decades. It just takes two interested people, after all.<\/span>","<span data-v-f87c67ca=\"\">How much it will interact with the rest of the world is an open question. <\/span>","<span data-v-f87c67ca=\"\">Most new technologies don't really go anywhere, after all.<\/span>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"1982","content":"DATE"},{"type":"Austria","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"2017","content":"DATE"},{"type":"Paris","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Hal Finney","content":"PERSON"},{"type":"Nasir","content":"ORGANIZATION"},{"type":"Merkle","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"2003","content":"DATE"},{"type":"Maximilian Fiege","content":"PERSON"},{"type":"1994","content":"DATE"},{"type":"2001","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"1991","content":"DATE"},{"type":"Satoshi","content":"PERSON"},{"type":"2008","content":"DATE"},{"type":"2009","content":"DATE"},{"type":"85%","content":"PERCENT"},{"type":"51%","content":"PERCENT"},{"type":"Bitcoin Austrianism","content":"PERSON"},{"type":"India","content":"LOCATION"},{"type":"Mises","content":"LOCATION"},{"type":"Ea","content":"ORGANIZATION"},{"type":"Sauron","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Contributor Network","The Block"]}