{"summary":"Metaverse game developer and publisher Bisonic launched the first playable demo of its Forgotten Runiverse on Monday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152764\/forgotten-runes-wizards-cult-launches-create-to-earn-metaverse-demo","publishDate":"2022-06-20T08:00:23","id":7633,"type":null,"title":"Forgotten Runes Wizard’s Cult launches &#x27;create-to-earn&#x27; metaverse demo","category":["GAMING AND METAVERSE"],"content":["Metaverse game developer and publisher Bisonic launched the first playable demo of its Forgotten Runiverse on Monday, a massive multiplayer online role-playing game (MMORPG) based on the NFT collection Forgotten Runes Wizard’s Cult.","The game has been in development since late last year in cooperation with blockchain studio Machine Magic. While the company is hoping for a V1.0 release in early 2023, it said in a statement that it wanted to give players an “early look” at the platform.","“This first playable build won't have any purchases. It's really about letting people see the start of the world that we're building,” said TetraTiger, Bisonic’s head of marketing.","Players will be able to explore the game’s different regions and hunt for frogs in the Runiverse. These frogs will grant in-game power-ups and an improved spot on the allow list for the upcoming land sale.","Forgotten Runiverse is one of several projects that have started marketing themselves as “create-to-earn,” an alternative to the popular but struggling play-to-earn monetization model that focuses on rewarding players who add value to the community through the creation of items and use of land.","“Each item in the game is unique depending on who makes it, their crafting ability, and the combination of materials used,\" said TetraTiger. \"So you can create a really cool, or really powerful item that you actually on-chain, and then you're at liberty to sell it and earn from your efforts... A player who builds a forge on their plot could gain a crafting fee whenever another player uses it or could sell tickets to a poetry reading or other event in their Guild Hall.”&nbsp;","The launch follows a private <a href=\"https:\/\/www.theblock.co\/post\/141759\/dialectic-seven-seven-six-back-forgotten-runiverse-fundraise\" data-v-f87c67ca=\"\">land sale announced in April<\/a> led by Swiss crypto fund Dialectic. Seven Seven Six, founded by Reddit co-founder Alexis Ohanian, also joined the initial investment round, alongside Libertus Capital, Kenetic Capital, Placeholder, 1confirmation, Wenew Labs, No Goat Milk (Future Corp) and crypto Twitter anons Fiskantes, Deeze and Soby.","According to data provider&nbsp;<a href=\"https:\/\/cryptoslam.io\/\" data-v-f87c67ca=\"\">CryptoSlam<\/a>, the Forgotten Runes collection currently ranks 136th in all time sales volume for NFT collections.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kenetic Capital","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Reddit","content":"LOCATION"},{"type":"Machine Magic","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Hall","content":"PERSON"},{"type":"Wenew Labs","content":"ORGANIZATION"},{"type":"Runiverse","content":"LOCATION"},{"type":"Alexis Ohanian","content":"PERSON"},{"type":"April","content":"DATE"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}