{"summary":"Hugo Boss is the latest brand of many to attempt to make a splash in metaverse fashion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174617\/hugo-boss-to-launch-nft-and-360-degree-metaverse-experience-with-imaginary-ones","publishDate":"2022-10-04T06:22:58","id":7634,"type":null,"title":"Hugo Boss to launch NFT and &#x27;360-degree metaverse experience&#x27; with Imaginary Ones","category":["NFTS"],"content":["Hugo, the youth-focused arm of Hugo Boss, said that it would be taking its apparel into the metaverse via a partnership with the whimsical NFT project Imaginary Ones. It&nbsp;will launch a \"holistic, 360-degree metaverse experience,\" Hugo announced on Tuesday, as part of a \"global refresh\" of its brand.&nbsp;","The NFT collection, which launches in early November, will consist of 1,001 three-dimensional animations and will be entitled Embrace Your Emotions (EYE).&nbsp;","\"The aim of the collection is to encourage everyone to connect with their emotions, and to share a message that all feelings – positive and negative – are valid and should be embraced, as the freedom to feel and express can significantly improve mental health and overall well-being,\" Imaginary Ones <a href=\"https:\/\/imaginary-ones_1.prowly.com\/209331-hugo-partners-with-imaginary-ones-to-launch-exclusive-nft-collection\" data-v-f87c67ca=\"\">explained<\/a> in a release.","Proceeds will be donated to the charity Youth Aware of Mental Health (YAM).","While it's not immediately clear what a \"360-degree\" metaverse experience actually involves, the brand said an allowlist of 500 spots will be allocated to customers who purchase a limited edition \"phygital\" t-shirt. Each t-shirt will contain a QR code, from which users will be directed to a Snapchat lens to create a special augmented-reality effect.","Holders of the NFT will have access to Imaginary Ones’ staking ecosystem, which grants the holder a separate set of special Hugo x IO merchandise, experiences and content — including digital wearables.","Imaginary Ones original NFT collection is a set of 8,888 animated characters. Its floor price is currently 0.73 ETH ($980).","Hugo Boss is the latest of many fashion brands attempting to make a splash in metaverse fashion. Various brands have tried — with varying degrees of success — to capitalize on web3.&nbsp;","Earlier this year, Gucci<a href=\"https:\/\/www.theblock.co\/post\/153785\/gucci-buys-into-superrare-dao-eyes-new-virtual-art-space\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">&nbsp;announced<\/a> joining its first decentralized autonomous organization with SuperRare. Burberry also launched a web3 game. Meanwhile, Louis Vuitton filed four trademark applications, dated June 23, for NFTs, virtual goods and digital collectibles.&nbsp;","<a href=\"https:\/\/www.theblock.co\/post\/154683\/fashion-industry-leans-into-nft-experimentation-in-spite-of-bear-market-woes\" data-v-f87c67ca=\"\">Projects<\/a> that will survive long-term, according to LVMH’s web3 leader Nelly Mensah, are the ones that find an overlap between who their customer is and who the current web3 consumer is. For Hugo Boss, this seems to be rooted in the younger market.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nelly Mensah","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Hugo Boss","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"LVMH","content":"ORGANIZATION"},{"type":"$980","content":"MONEY"},{"type":"Louis Vuitton","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"charity Youth Aware of Mental Health (YAM)","content":"ORGANIZATION"},{"type":"Gucci","content":"ORGANIZATION"},{"type":"June 23","content":"DATE"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}