{"summary":"Bloomberg Intelligence ETF analyst James Seyffart explained why spot bitcoin ETF approvals are likely in January but ether is different.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267786\/january-spot-bitcoin-etf-approvals-likely-but-ether-is-a-completely-different-animal-bloomberg-etf-analyst","publishDate":"2023-12-15T10:19:31","id":7636,"type":null,"title":"January spot bitcoin ETF approvals likely but ether is a &#x27;completely different animal&#x27;: Bloomberg ETF analyst","category":["PEOPLE"],"content":["Bloomberg Intelligence ETF research analyst James Seyffart and his colleague Eric Balchunas have become famous on Crypto Twitter this year for their spot bitcoin ETF analysis and predictions, earlier to the call than most that approvals were likely around the corner.&nbsp;","In an interview with The Block’s Frank Chaparro on The Scoop podcast, Seyffart reiterated that the <a href=\"https:\/\/x.com\/JSeyff\/status\/1730327792066195501?s=20\" data-v-f87c67ca=\"\">window<\/a><span data-v-f87c67ca=\"\"> for a potential spot bitcoin (<span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.19%\n    <\/span><\/a> <!----><\/span>) ETF approval was looking like it would fall between Jan. 8 and Jan. 10. He has suggested since October there was a 90% chance of approval by Jan. 10. This is when the Ark and 21Shares application — which was filed first in April ahead of finance giant <\/span><a href=\"https:\/\/www.theblock.co\/post\/235056\/blackrock-takes-giant-leap-toward-spot-bitcoin-etf-with-sec-filing\" data-v-f87c67ca=\"\">BlackRock<\/a> in June, among a field which now includes another 12 firms — reaches its final deadline.","So far, the Securities and Exchange Commission has delayed making a decision, but with regard to the Ark and 21Shares ETF, it must approve or deny one by this deadline on Jan. 10. Seyffart argues the SEC has been strategically delaying, lining up the various applications, or most at least, to be approved at the same time, so as not to give one firm an advantage — and that’s why Seyffart thinks en masse approval will happen in January.","“If the SEC is going to deny them here, though, it would be the SEC kind of going nuclear in a way,” he said.","The SEC “doesn't want to be picking favorites here to win these races, whether it's getting the most assets or acquiring the most liquidity,” Seyffart said. “So if the SEC is going to approve all these things, it’s likely going to approve them all at once, because, again, it doesn’t want to play kingmaker in this case.”","Asked what gave the Bloomberg analyst that sense, Seyffart said, “We've heard rumblings from different people, from people involved in this process, people who know other people involved in this process.\"","“We have sources that are very reliable and some sources that we don't know how reliable they can be. But we're hearing similar things from a bunch of different people, coming from different angles, which we’ve been hearing for over a year,” he added.","“But yeah, it's real nitty gritty, trying to find things out, looking at calendars, looking at all these dates and deadlines, but trying to read the tea leaves here,” he said.","<iframe frameborder=\"0\" height=\"315\" src=\"\/\/www.youtube.com\/embed\/hMavd-2bBmw?si=XO8Ki_RGo-GqHFi8\" title=\"YouTube video player\" width=\"560\" data-v-f87c67ca=\"\"><\/iframe>","The prospect of mass approvals is unusual compared to traditional ETF filings where if a firm is the first to file and the SEC approves, it goes out first, Seyffart continued, but it’s a unique situation and there is precedence with the approval of various <a href=\"https:\/\/www.theblock.co\/post\/253426\/vaneck-prepares-to-launch-ethereum-futures-etf\" data-v-f87c67ca=\"\">ether futures ETFs<\/a> at the same time earlier this year.","“There were a lot of moves by different players [for the ether futures ETFs]. Valkyrie specifically, some other issuers were trying to jump the line and get out first. But the SEC just basically did everything they possibly could to make sure everyone was going out on the same day,” Seyffart said.","“So the fact that it was willing to go to those lengths to make sure that not one person got a head start on everyone else shows to us that that's likely what it's going to do here with spot if they indeed are going to approve like we expect,” he added.","Grayscale Investments’ <a href=\"https:\/\/www.theblock.co\/post\/246115\/court-hands-grayscale-win-in-long-running-suit-against-sec\" data-v-f87c67ca=\"\">win<\/a> against the SEC in August over its application to convert its flagship Grayscale Bitcoin Trust (GBTC) product into a spot bitcoin ETF is another major factor in the SEC’s potential approval, Seyffart said.","“I think the SEC has kind of been backed into a corner here by the judges basically throwing out every decision and reasoning it's used to deny an ETF in the past,” he added. “I think the SEC and Chair Gary Gensler know that they were overplaying their hand a bit and are kind of forced into a corner right now.”","Grayscale’s case obviated the need for a surveillance-sharing agreement, similar to those many applicants currently have with Coinbase, he argued. However, since this situation is unprecedented, there are no guidelines for the necessary response time or approval process. This is despite ongoing meetings between Grayscale and the SEC, Seyffart noted.","“So my view is if anyone's not going to go out on the first day or not going to get the opportunity to uplift on the same day, it might be Grayscale,” he added.","While optimism surrounds a potential spot bitcoin ETF approval soon, Seyffart said the prospect of a spot ether ETF was a \"completely different animal.\"","<span data-v-f87c67ca=\"\">Seyffart said he could understand how the SEC and Gensler might argue that the situation differs, noting that the futures market is not as robust or institutionalized as Bitcoin’s and highlighting differences between Bitcoin’s proof-of-work model and <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.47%\n    <\/span><\/a> <!----><\/span><\/span>’s proof-of-stake model. He added that he did not agree with these points, but if the SEC aimed to halt the process, it could delay decision-making or assert that ether is a security.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/eth-price\/embed\" title=\"ETH Price\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","However, the SEC has implicitly accepted ether as a commodity in Seyffart’s view, which is why he thinks spot ether ETFs will ultimately be approved “more likely than not” by the end of May — citing final deadlines for Ark and 21Shares and VanEck spot ether ETFs applications on May. 23 and May. 24.","That “doesn't imply automatically that we get an approval.\" he said. \"I do think it's 100% a positive sign if we get these bitcoin ETFs approved, that it's a very positive indication that we will likely see the ether spots approved. But we're not at that 90% level, that's for sure.”","The straightforward answer is that the timeline between the potential approval of spot bitcoin ETFs and their launch remains uncertain. Seyffart pointed out that approvals fall under the SEC Trading and Markets division’s 19b-4 process. But for the ETFs to launch and start trading, their S-1 prospectuses, which provide details of the issuer’s business operations and financials, must first receive approval from the SEC’s Corporate Finance division.","Seffart added that numerous <a href=\"https:\/\/www.theblock.co\/post\/267062\/blackrock-and-fidelity-hash-out-details-over-spot-bitcoin-etf-redemption-models-with-the-sec-as-anticipation-mounts\" data-v-f87c67ca=\"\">meetings<\/a> have occurred between the SEC and issuers to resolve these issues, leading him to believe that the S-1 sign-off might occur as soon as the 19b-4 approval is granted. Conversely, if the SEC is not prepared, they may only provide 19b-4 approvals, and listings would be delayed until the S-1s are approved, which could take days or weeks. Still, he emphasized that there is no certainty in predicting the exact timeline.","Seyffart emphasized that if and when these funds are listed, the cautious approach of major brokerages and banks, characterized by rigorous due diligence processes and the requirement for lengthy track records, could decelerate their immediate uptake. “So it's not going to necessarily be this immediate ramp up where every advisor is going to put a couple of percent of their client portfolios in there,” he said.","“The people who are going to buy this immediately are likely going to be more into independent IRAs or independent advisors,” he added, with some money just transferring exposure from the existing Grayscale Trust or international crypto ETF ecosystems. “That said, if anyone can get it added quickly, it's likely to be BlackRock because they have a very good relationship with all of these types of platforms.”","“Obviously, I think there will be hype on day one when it launches. So we'll see exactly what that looks like. Could be hundreds of millions would be my guess,” Seyffart said. “Over the long term, I think it will undoubtedly be some billions of dollars that flow into these products — there's a reason that the largest asset owners in the world are trying to launch these things and compete.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"-0.19%","content":"PERCENT"},{"type":"90%","content":"PERCENT"},{"type":"Bloomberg Intelligence ETF","content":"ORGANIZATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Jan. 10","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"VanEck","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"April","content":"DATE"},{"type":"-0.47%","content":"PERCENT"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"James Seyffart","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Jan. 8","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Seyffart","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"SEC’s Corporate Finance","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN","ETHEREUM","INVESTMENT FIRMS"],"authors":["James Hunt","The Block"]}