{"summary":"Kraken users who traded more than $20,000 in a calendar year will have their transaction information turnover.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237381\/kraken-to-turn-over-information-to-irs-after-court-order","publishDate":"2023-07-01T17:45:19","id":7637,"type":null,"title":"Kraken ordered to turn over transaction information by courts","category":["THE BLOCK"],"content":["A federal court has ruled that cryptocurrency exchange Kraken must provide the Internal Revenue Service (IRS) with account and transaction information.","The IRS requested this information to investigate potential tax underreporting by users of the exchange. The court petition was filed by the IRS in February after Kraken settled charges with the U.S. Securities and Exchange Commission related to its staking service violating securities law.","The IRS claimed that it had previously issued a summons to Kraken, which the exchange failed to comply with. The requested information includes user details such as name, birthdate, taxpayer identification number, address, phone number, email address, and other relevant documents.","Kraken is obligated to provide this information for users who conducted transactions exceeding $20,000 in a calendar year between 2016 and 2020.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"$20,000","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"}],"hashtag":["CRYPTO"],"authors":["Frank Chaparro","The Block"]}