{"summary":"Synthetix, a decentralized crypto derivatives marketplace, has deployed V3 of its perpetuals contracts protocol on Base.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274350\/synthetix-deploys-first-perpetuals-protocol-on-base-blockchain","publishDate":"2024-01-24T16:00:04","id":7639,"type":null,"title":"Synthetix deploys first perpetuals protocol on Base blockchain","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Synthetix, a decentralized crypto derivatives marketplace, has deployed V3 of its perpetuals contracts protocol on Base, an Ethereum Layer-2 blockchain developed by Coinbase.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Perps V3 will simplify the launching of new derivatives products on Synthetix for developers building on Base, as well as trading on Synthetix-powered exchanges like Kwenta, Polynomial, and dHEDGE, the company said in a statement.<\/span>","<span data-v-f87c67ca=\"\">According to Synthetix, more products for Synthetix V3 are planned to be deployed on Base in the coming months, including a new perpetual futures exchange called Infinex.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Decentralized crypto trading still has to catch up with activity on centralized platforms, Synthetix Founder Kain Warwick said. \"The problem is, we're still using centralized infrastructure for most crypto transactions. Most crypto activity is not leveraging the decentralized technology we’ve built,\" he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Perps V3 product was launched with the Synthetix V3 system upgrade, which has been in progress since late last year, the company said. According to Synthetix, the previous iteration of perpetuals V2, launched last January, has generated more than $43 billion in trading volume and attracted tens of thousands of unique traders.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Perps V3 is designed to improve the experience for both traders and developers with alternative forms of collateral for liquidity providers including USDC, sUSD, sETH and sBTC. Previously, collateral could only be in Synthetix<\/span> <span data-v-f87c67ca=\"\">own token, SNX.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">New features also include cross margin capabilities, delegation of account permissions, improvements of the liquidation and settlement mechanisms.<\/span>","<span data-v-f87c67ca=\"\">“Eventually the end game for Synthetix could be to govern over, and earn fees from, a large and diverse range of collateral, across many chains,” Synthetix Core Contributor going by Cavalier said. <\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Kain Warwick","content":"PERSON"},{"type":"Synthetix","content":"LOCATION"},{"type":"Synthetix","content":"ORGANIZATION"},{"type":"Cavalier","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$43 billion","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Kwenta","content":"PERSON"}],"hashtag":["BASE"],"authors":["Anna Baydakova","The Block"]}