{"summary":"Troubled Asian crypto lender Vauld has around $10 million stuck on FTX, one source with direct knowledge of the matter told The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188021\/troubled-crypto-lender-vauld-has-10-million-stuck-on-ftx-source","publishDate":"2022-11-17T12:09:33","id":7647,"type":null,"title":"Troubled crypto lender Vauld has $10 million stuck on FTX: Source","category":["FINANCE FIRMS"],"content":["Troubled Asian crypto lender Vauld has funds stuck in the now-bankrupt crypto exchange FTX, two sources with direct knowledge of the matter told The Block.","The exposure is worth around $10 million, one of the sources said. Vauld used FTX, among other exchanges, to execute trades of its customers since it does not have its own order book, said the source.","The FTX exposure is the latest blow for Vauld, which <a href=\"https:\/\/www.theblock.co\/post\/155679\/vauld-halts-withdrawals-hires-legal-financial-advisors\" data-v-f87c67ca=\"\">halted<\/a> client withdrawals in July and <a href=\"https:\/\/www.theblock.co\/post\/158647\/crypto-lender-vauld-owes-363-million-to-retail-investors-after-halting-withdrawals\" data-v-f87c67ca=\"\">owes<\/a> over $400 million to creditors. In August, India's Enforcement Directorate <a href=\"https:\/\/www.theblock.co\/post\/163329\/indian-authorities-freeze-46-million-worth-of-vaulds-assets\" data-v-f87c67ca=\"\">froze<\/a> assets worth $46 million after it found a Vauld client was involved in a money laundering case.","Vauld has until Jan. 20 to sort its financial issues, <a href=\"https:\/\/www.theblock.co\/post\/185858\/vauld-creditor-protection-exntension-january\" data-v-f87c67ca=\"\">having received<\/a> another credit protection extension last week. The firm, however, has the option to apply for yet another extension if needed.","As part of its restructuring options, Vauld has been discussing a potential deal with rival Nexo since July. At the time, Nexo <a href=\"https:\/\/www.theblock.co\/post\/155790\/nexo-vauld-offer-potential-acquisition\" data-v-f87c67ca=\"\">entered<\/a> into a 60-day exclusive due diligence agreement with Vauld to potentially acquire it, but it has extended the due diligence period twice. Last month, The Block <a href=\"https:\/\/www.theblock.co\/post\/179034\/vauld-seeks-another-four-months-of-protection-against-creditors\" data-v-f87c67ca=\"\">reported<\/a> that Nexo could weigh a possible deal.","Vauld is now set to host a meeting with Nexo, its creditor committee and financial advisor Kroll on Nov. 19, said the second source.","The purpose of the meeting will be to update the creditor committee regarding Vauld's progress in the restructuring, including a discussion on the Nexo terms, said the source.","It remains to be seen whether Nexo is still interested in making a deal with Vauld after the FTX exposure. Nexo declined to comment to The Block and Vauld did not respond to a request for comment.","Vauld customers' funds remain stuck. If Nexo doesn't acquire Vauld, the latter has said it has other options to explore, including issuing a token and raising capital.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nov. 19","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nexo","content":"ORGANIZATION"},{"type":"Jan. 20","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Enforcement Directorate","content":"ORGANIZATION"},{"type":"Vauld","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Vauld","content":"ORGANIZATION"},{"type":"$400 million","content":"MONEY"},{"type":"India","content":"LOCATION"},{"type":"$46 million","content":"MONEY"},{"type":"Nexo","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}