{"summary":"Researcher Joon Ian Wong assesses the current state of social tokens and their potential future role in the media space.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/91551\/social-tokens-media-future-payments","publishDate":"2021-01-17T07:34:39","id":7648,"type":null,"title":"Social tokens and the future of media","category":["OP-ED"],"content":["<i data-v-f87c67ca=\"\">Joon Ian Wong (@joonian) is a researcher-in-residence at Rally and a member of Seed Club. <\/i>","What’s the best way to pay for the media? The question, always in the background, is being asked out loud again. The newspaper business might be a good example.","Some media companies appear to have cracked the code. The New York Times Company’s subscriptions and digital advertising business generated $450 million for the first three quarters of the year, <a href=\"https:\/\/www.niemanlab.org\/2020\/11\/for-the-first-time-the-new-york-times-digital-subscriptions-generate-more-revenue-than-its-print-ones\/\" data-v-f87c67ca=\"\">surpassing its print revenues<\/a> for the first time in its history.","But cast your gaze out onto the long tail of newspaper companies in the United States and the story is far more bleak. The Poynter Institute <a href=\"https:\/\/www.poynter.org\/business-work\/2020\/here-are-the-newsroom-layoffs-furloughs-and-closures-caused-by-the-coronavirus\/\" data-v-f87c67ca=\"\">maintains a list<\/a>, updated daily, of furloughs, layoffs and closures in the news industry. The page scrolls far longer than most would have the heart to see out. Poynter <a href=\"https:\/\/www.poynter.org\/locally\/2020\/the-coronavirus-has-closed-more-than-25-local-newsrooms-across-america-and-counting\/\" data-v-f87c67ca=\"\">also reports<\/a> that more than 60 newsrooms have closed this year.","The long tail of media — publications that serve local or niche communities — is where current business models are failing. The audiences just aren’t big enough to deliver the clicks, or they’re not a wealthy enough demographic to pay for the subscriptions.","The solutions offered so far are wanting. There’s the Substackerati, which, as <a href=\"https:\/\/www.cjr.org\/special_report\/substackerati.php\" data-v-f87c67ca=\"\">the Columbia Journalism Review points out<\/a>, appears to be useful to writers who already have a wealthy audience who will pay for Substack subscriptions in the first place. What’s more, it appears to employ the logic of the very tech platforms that caused the media business to implode in the first place.","Then there’s talk of the creator economy or the passion economy. These models offer partial solutions to the problem of creating a sustainable economic base for writers, streamers and producers of miscellaneous “content.” But they don’t go far enough. Quite often the prescription is a slightly trendier spin on the old model of getting more clicks or selling more things.","There is a third option: tokenised media, with tokenised communities attached to them. Wait a minute, you ask, didn’t someone already try this and flame out? You would be right to point to that cautionary tale — tokenising everything is not a panacea. But the crypto ecosystem is a different place today than 2017 — just look at the explosion of activity in the once implausible area of DeFi this summer.","The basic idea is this: writers, streamers and anyone who creates media products on the internet can improve the odds stacked against them by the platforms by moving value off platforms and into decentralised networks. This value will be contained in crypto tokens that are held by creators, and crucially, by the communities who benefit the most from their work. A virtuous circle is then created, as both creators and their fans generate economic activity and increase the value captured by the social token.","As the investor Jesse Walden memorably called it, it’s <a href=\"https:\/\/a16z.com\/2020\/09\/18\/a16z-podcast-new-fan-club-creators-fans-power-of-markets-crypto\/\" data-v-f87c67ca=\"\">the new fan club<\/a>.","The principles behind communities creating currencies customised for their own ends are not new. I’ve <a href=\"https:\/\/medium.com\/rallynetwork\/introducing-pacenotes-a-column-on-navigating-tokenised-communities-537c0189ed9\" data-v-f87c67ca=\"\">investigated the ideas<\/a> behind social tokens by diving into the literature in adjacent fields, from anthropology to fan studies, as a researcher in residence at Rally, a startup that creates the infrastructure for Creator Coins.","From the sociologist Georg Simmel’s idea of “perfect money” in 1900 to the French anarchist Pierre-Jospeh Proudhon’s “Bank of the People”, which gave rise to mutualism, a range of thinkers have proposed utopic solutions using specialised money, as the sociologist Nigel Dodd sets out in ‘The Social Life of Money’.","Communities over time have experimented with some of these ideas. The <a href=\"https:\/\/medium.com\/rallynetwork\/communities-currencies-and-personal-tokens-6fa83d734875\" data-v-f87c67ca=\"\">LETS and time-banking movements<\/a> in the 1980s and 90s saw hundreds of communities in North America issue their own local currencies, issued not by a central bank, but the collective assent of community members. These ideas are re-animated in the cryptocurrency world by the Circles UBI project, which can trace its key feature of demurrage, or “<a href=\"https:\/\/medium.com\/rallynetwork\/rotting-money-and-community-tokens-on-the-blockchain-d3e25e6c323f?source=collection_home---4------2-----------------------\" data-v-f87c67ca=\"\">rotting money<\/a>” to notions proposed by Silvio Gessell, a student of Proudhon’s.","Lessons in community ownership can also be found in the history of <a href=\"https:\/\/medium.com\/rallynetwork\/owning-everything-together-9308d860ac?source=collection_home---4------1-----------------------\" data-v-f87c67ca=\"\">the co-operative movement<\/a>. The idea of the worker-owner, as distinct from the investor, lies behind the co-operative structure. Recent re-interpretations of cooperatives for the internet age by Trebor Scholz and Nathan Schneider have given rise to the notions of platform cooperativism and <a href=\"https:\/\/medium.com\/rallynetwork\/pacenotes-exit-to-community-and-personal-tokens-with-nathan-schneider-b6c5adee5789?source=collection_home---4------14-----------------------\" data-v-f87c67ca=\"\">exit to community<\/a>. Scholz and Schneider’s ideas are proposals to more closely align the interests of users of large platforms with their owners; and to conceive of firms aiming not just for the blockbuster stock-market flotation for their investors to exit, but for workers and users to unlock that value instead.","The crypto world has seized on some of these themes almost instinctively. Walden, formerly of a16z Crypto and now of Variant Fund, is aiming his investments at firms building the “<a href=\"https:\/\/variant.fund\/the-ownership-economy-crypto-and-consumer-software\/\" data-v-f87c67ca=\"\">ownership economy<\/a>”, which look like cooperatives, with a crypto twist.","IDEO’s venture arm has declared “<a href=\"https:\/\/twitter.com\/ianjohnlee\/status\/1339969541053448192?s=20\" data-v-f87c67ca=\"\">crypto social<\/a>”—the commingling of personal and community tokens—the next breakout area, and has hired Reuben Bramanathan, an early experimenter with personal tokens, to do just that.","Messari’s Ryan Selkis is bullish on the idea of “social money,” and has invested in the platform Roll to capitalise on that trend. These types of tokens will start out looking like toys, be hated by the crypto cognoscenti, but ultimately will look obvious in hindsight, Selkis writes in <a href=\"https:\/\/messari.io\/pdf\/messari-report-crypto-theses-for-2021.pdf\" data-v-f87c67ca=\"\">Messari’s annual forecast<\/a> (p. 118).","So much for the investors and their theories. How much of this is real? The answer is, quite a lot. At the centre of the social token economy are platforms that help people issue their tokens. The two best known examples are <a href=\"https:\/\/a16z.com\/2020\/03\/09\/monetization-for-gamers-in-the-new-cryptoeconomy\/\" data-v-f87c67ca=\"\">16z-backed Rally<\/a> and Roll, who has <a href=\"https:\/\/www.coindesk.com\/roll-raises-another-1m-to-make-money-social\" data-v-f87c67ca=\"\">raised from Fabric Ventures<\/a> and others.","A crop of new tools have also appeared, taking advantage of Ethereum’s famous composability. Perhaps the most widely used tool is <a href=\"http:\/\/collab.land\/\" data-v-f87c67ca=\"\">Collab.land<\/a>, which allows communities to gate various social media channels, allowing only those users who hold a certain balance of social tokens in their wallets — essentially tokenising social media. Collab.land is used by over 400 communities with over 40,000 users in total, <a href=\"https:\/\/collabland.substack.com\/p\/collabland-update-1\" data-v-f87c67ca=\"\">according to the company<\/a>.","Newer tools, like <a href=\"http:\/\/unite.community\/\" data-v-f87c67ca=\"\">Unite Community<\/a>, which make it easy to airdrop tokens on Twitter; and <a href=\"https:\/\/llama.community\/\" data-v-f87c67ca=\"\">Llama<\/a>, which eases the task of managing a community treasury, have just been built. Both of those tools were the result of a hackathon organised by <a href=\"https:\/\/seedclub.xyz\/\" data-v-f87c67ca=\"\">Seed Club<\/a>, an incubator of social tokens that saw the Grammy-winning musician RAC and others complete its first cohort (<i data-v-f87c67ca=\"\">Disclosure: I’m a founding member<\/i>). Other tools on the radar of social token communities are <a href=\"https:\/\/dfame.app\/\" data-v-f87c67ca=\"\">Dfame<\/a> and <a href=\"https:\/\/coinvise.co\/\" data-v-f87c67ca=\"\">Coinvise<\/a>, which offer new ways to gate content, and to mint and distribute tokens.","There’s even a newsletter covering all of this — and tracking which tokens are breaking out — called <a href=\"https:\/\/forefront.news\/\" data-v-f87c67ca=\"\">Forefront<\/a>. According to data from Forefront and Coingecko, <a href=\"https:\/\/messari.io\/pdf\/messari-report-crypto-theses-for-2021.pdf\" data-v-f87c67ca=\"\">Messari estimates<\/a> (p. 120) that the top social tokens were worth about $200 million in fully diluted market capitalisation, as of October.","All the issues around social tokens are far from solved. For instance, how to protect fans who might hold a token as memorabilia, from speculators, who will ruthlessly devalue that token by selling? How to manage the complexities of decentralised liquidity, ever-noiser Discord servers, and airdrops? A creator issuing a social token represents a ton of new and complicated work to do, for an unclear payoff.","This brings us back to solutions to the media conundrum on the internet. For writers, streamers, and anyone who makes a living from transmitting their creative output over the internet, social tokens offer an opportunity to re-align the interests of creators and their communities."],"entity":[{"type":"Columbia Journalism Review","content":"ORGANIZATION"},{"type":"Jospeh Proudhon","content":"PERSON"},{"type":"$450 million","content":"MONEY"},{"type":"Unite Community","content":"ORGANIZATION"},{"type":"Seed Club","content":"ORGANIZATION"},{"type":"IDEO","content":"ORGANIZATION"},{"type":"1980s","content":"DATE"},{"type":"Nigel Dodd","content":"PERSON"},{"type":"hindsight","content":"LOCATION"},{"type":"1900","content":"DATE"},{"type":"Pierre","content":"PERSON"},{"type":"Silvio Gessell","content":"PERSON"},{"type":"Joon Ian Wong","content":"PERSON"},{"type":"Forefront","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"Llama","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Ryan Selkis","content":"PERSON"},{"type":"Schneider","content":"PERSON"},{"type":"Trebor Scholz","content":"PERSON"},{"type":"Jesse Walden","content":"PERSON"},{"type":"North America","content":"LOCATION"},{"type":"Fabric Ventures","content":"ORGANIZATION"},{"type":"Georg Simmel","content":"PERSON"},{"type":"New York Times Company","content":"ORGANIZATION"},{"type":"Rally","content":"ORGANIZATION"},{"type":"Scholz","content":"PERSON"},{"type":"Social Life of Money’","content":"ORGANIZATION"},{"type":"Reuben Bramanathan","content":"PERSON"},{"type":"Nathan Schneider","content":"PERSON"},{"type":"Poynter Institute","content":"ORGANIZATION"},{"type":"RAC","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"October","content":"DATE"}],"hashtag":["PAYMENTS"],"authors":["Joon Ian Wong","The Block"]}