{"summary":"Ethereum Layer 2 Starknet introduced “appchains,” a framework facilitating the creation of multiple application-specific blockchains.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240480\/starknet-appchains-framework","publishDate":"2023-07-19T07:18:31","id":7656,"type":null,"title":"Starknet unveils &#x27;appchains&#x27; framework, eyeing multi-chain ecosystem","category":["LAYER 2S AND SCALING"],"content":["Ethereum Layer 2 Starknet has announced the launch of “appchains,” a framework that allows developers to create several application-specific blockchains within its ecosystem.&nbsp;","This step is consistent with the broader evolution of the Layer 2 ecosystem, where projects such as <a href=\"https:\/\/www.theblock.co\/post\/236277\/optimism-changes-name-to-op-mainnet-in-line-with-superchain-vision\" data-v-f87c67ca=\"\">Optimism<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/234354\/polygon-2-zk\" data-v-f87c67ca=\"\">Polygon<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/236322\/zksync-matter-labs-releases-zk-stack-for-building-hyperchains\" data-v-f87c67ca=\"\">zkSync<\/a>, and <a href=\"https:\/\/www.theblock.co\/post\/235980\/offchain-labs-unveils-tool-to-build-layer-3-orbit-chains-on-arbitrum\" data-v-f87c67ca=\"\">Arbitrum<\/a>&nbsp;have already set the stage for similar modular networks. Starknet is the latest addition to this lineup.","Developers can create appchains using Starknet Stack, the ecosystem’s native developer tooling. These chains will utilize STARK proofs for enhanced security. Central to this stack is Cairo, a programming language developed by the StarkWare team, which shares similarities with Rust.","In a blog <a href=\"https:\/\/starkware.co\/resource\/the-starknet-stacks-growth-spurt\/\" data-v-f87c67ca=\"\">post<\/a>, the team suggested that by leveraging Starknet appchains, developers can benefit from enhanced performance. This claim is bolstered by Starknet’s recent <a href=\"https:\/\/www.theblock.co\/post\/239112\/starknet-quantum-leap-upgrade\" data-v-f87c67ca=\"\">v0.12.0 upgrade<\/a> on mainnet, which reportedly boosted its network performance.","A notable aspect of appchains is their capacity to support features not yet present on Starknet’s main network. This includes features like custom fee market logic, consensus mechanisms and others. Such flexibility can potentially afford developers the ability to customize their application’s configurations and functionalities, the team added.","“Starknet Appchains are the bespoke environment where applications can tailor an instance of Starknet to achieve better control over the specs, lower cost, greater scale and opt-in privacy,” wrote the team.","The team highlighted that there is an escalating interest in application-specific blockchains tailored to meet customized requirements.“The need for appchains has been apparent for several years and is now getting renewed attention,” the team noted.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Polygon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Starknet Appchains","content":"PERSON"},{"type":"Cairo","content":"LOCATION"}],"hashtag":["ETHEREUM","STARKNET"],"authors":["Vishal Chawla","The Block"]}