{"summary":"MakerDAO will launch the first phase of Endgame in the summer of 2024, which will accompany two new tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282112\/makerdao-first-phase-launch-endgame","publishDate":"2024-03-13T02:30:48","id":7658,"type":null,"title":"MakerDAO founder announces two new tokens in &#x27;Endgame&#x27; launch details","category":["WEB3"],"content":["<span data-v-f87c67ca=\"\">The Endgame launch will be accompanied with two new tokens, tentatively named NewStable and NewGovToken.<\/span>","Dai stablecoin issuer MakerDAO will launch the first phase of <a href=\"https:\/\/www.theblock.co\/post\/223134\/makerdao-endgame-plan-ratified-in-new-constitution\" data-v-f87c67ca=\"\">Endgame<\/a> in the summer of 2024, according to a post by founder Rune Christensen on the project’s official governance forum. The release includes two new tokens, tentatively titled NewStable and NewGovToken.","<span data-v-f87c67ca=\"\">The project’s stablecoin Dai and <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248390\/maker-mkr-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Mark_Maker.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">MKR<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.83%\n    <\/span><\/a> <!----><\/span> governance token will continue as they are currently, yet users will have the option to upgrade to NewStable and NewGovToken if they wish.<\/span>","The <a href=\"https:\/\/www.theblock.co\/post\/248798\/makerdao-announces-final-phase-of-endgame-highlights-solana-codebase\" data-v-f87c67ca=\"\">launch<\/a> season of Endgame is scheduled to occur in back-to-back stages, starting with the reveal of a new brand. A month later, two new tokens under the tentative titles NewStable and NewGovToken will be rolled out. Users will be given the option to upgrade their Dai and Maker (MKR) tokens to the new coins, which are expected to be involved with new staking and yield farming features in the ecosystem.","“The ecosystem will explore ways to eventually differentiate Dai and NewStable, with Dai focusing on crypto-native use cases and NewStable focusing on mass adoption,” <a href=\"https:\/\/forum.makerdao.com\/t\/makerdao-endgame-launch-season\/23857\" data-v-f87c67ca=\"\">wrote<\/a> Rune Christensen.","Other new features will follow the new token launch, including the Lockstake Engine, where users can lock their MKR or NewGovToken for a long period of time for more risk\/reward exposure, and a new low-cost bridge that connects Maker ecosystem tokens from Ethereum to a yet-to-be-determined major Layer-2 network.","Christensen further highlighted the importance of Spark, Maker’s first SubDAO that's also expected to have its own token. The lending product was launched a year ago. SparkDAO will further expand its line of features to include real-world assets and perpetual swap yields, the forum post said.","MakerDAO’s Endgame will be completed in three more phases following the initial launch stage, which is expected to scale up Maker’s SubDAOs and launch a new Layer-1 blockchain.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"summer of 2024","content":"DATE"},{"type":"Lockstake Engine","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Dai","content":"PERSON"},{"type":"NewStable","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"+0.83%","content":"PERCENT"},{"type":"Rune Christensen","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"NewGovToken","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["CRYPTO","DAI","DAOS"],"authors":["Danny Park","The Block"]}