{"summary":"Sam Bankman-Fried says he won&#x27;t travel to Washington, D.C. for a congressional hearing, citing his busy schedule and paparazzi concerns.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194205\/overbooked-sam-bankman-fried-to-testify-before-congress-virtually","publishDate":"2022-12-12T13:28:12","id":7665,"type":null,"title":"&#x27;Overbooked&#x27; Sam Bankman-Fried to testify before Congress virtually","category":["POLICY"],"content":["Former FTX CEO Sam Bankman-Fried will testify virtually before Congress on Tuesday, saying he can’t travel to Washington, D.C. due to his busy schedule and security concerns about paparazzi.","“I'm quite overbooked and was not planning to be testifying until, like, very recently,” Bankman-Fried said. “From a security standpoint … It's very difficult for me to move right now and travel because just, like, the paparazzi effect is quite large.”","Bankman-Fried will testify virtually before the House Financial Services Committee for its first hearing on the collapse of FTX and broader implications for the digital asset industry, he said during a Twitter Spaces interview. Bankman-Fried’s crypto exchange, once valued at $32 billion, filed for bankruptcy protection after a run on its utility token last month following concerns that the business wasn't properly capitalized.&nbsp;","The disgraced crypto boss remains in the Bahamas, where FTX's main trading subsidiary, FTX Digital Markets, is based. Before the company fell apart, Bankman-Fried visited Washington often to meet with policymakers and regulators.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The hour-long interview was the latest stop on Bankman-Fried’s extraordinary whirlwind media tour. He played the “Storybook Brawl” video game during the talk, which was hosted by options flow data platform Unusual Whales.","Bankman-Fried initially brushed off a hearing request from the House Financial Services Committee. Despite his recent media circuit and tweets detailing his view of the collapse, Bankman-Fried said he needed more time to understand what happened at his own companies before speaking to lawmakers. But he reversed course and agreed to <a href=\"https:\/\/www.theblock.co\/post\/193831\/congressional-committee-confirms-sbf-as-ftx-hearing-witness\" data-v-f87c67ca=\"\">testify<\/a> last week, after committee Chair Maxine Waters, D-Calif., pressed him to appear at the scheduled hearing.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Lawmakers in both chambers are investigating what happened at FTX. Bankman-Fried has not committed to appearing before the Senate Banking Committee, which will hold its own hearing on Wednesday and has threatened him with a <a href=\"https:\/\/www.theblock.co\/post\/193132\/senate-banking-committee-calls-on-bankman-fried-to-testify-on-dec-14\" data-v-f87c67ca=\"\">subpoena<\/a>.&nbsp;","“I am not currently scheduled to do that,” Bankman-Fried said. “I am open and willing to have a conversation with the chair or the ranking member about the hearing if they believe it's important that I attend,” Bankman-Fried said, noting that he expects the two hearings will be “very materially similar” because they are happening back-to-back.","Although he’s avoided leaving the Bahamas since the FTX crash, Bankman-Fried said he would not expect to be detained if he enters the country, despite ongoing law enforcement investigations into the company's practices leading up to the collapse.&nbsp;","\"I don't believe I would be,” Bankman-Fried said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"Washington","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Calif.","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"last week","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"D.C.","content":"LOCATION"},{"type":"FTX Digital Markets","content":"ORGANIZATION"}],"hashtag":["CONGRESS","HOUSE FINANCIAL SERVICES COMMITTEE","MAXINE WATERS","SAM BANKMAN-FRIED"],"authors":["Stephanie Murray","The Block"]}