{"summary":"Circle’s Cross-Chain Transfer Protocol is now operational on Arbitrum, a Layer 2 scaling solution for Ethereum.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236693\/circle-adds-cctp-to-arbitrum-for-layer-2-usdc-transfers-from-ethereum-avalanche","publishDate":"2023-06-27T10:47:47","id":7668,"type":null,"title":"Circle adds CCTP to Arbitrum for Layer 2 USDC transfers from Ethereum, Avalanche","category":["CRYPTO ECOSYSTEMS"],"content":["Circle, the issuer of the USD Coin stablecoin, said that its Cross-Chain Transfer Protocol is now operational on Arbitrum, a Layer 2 scaling solution for Ethereum. The protocol is designed to enable faster and more secure transfers of USDC across multiple chains including Ethereum, Avalanche and Arbitrum.","CCTP enables the <a href=\"https:\/\/www.theblock.co\/post\/228407\/circle-protocol-stablecoin-transfers-ethereum-avalanche\" data-v-f87c67ca=\"\">transfer<\/a> of USDC across different blockchain networks by burning the native USDC on the initial chain and minting an equal amount on the recipient chain. Arbitrum is the third chain offering support for CCTP and is live on the official Arbitrum Bridge, as <a href=\"https:\/\/twitter.com\/circle\/status\/1673678081892950019\" data-v-f87c67ca=\"\">noted<\/a> by Circle.","The CCTP integration comes after Circle <a href=\"https:\/\/arbitrumfoundation.medium.com\/usdc-to-come-natively-to-arbitrum-f751a30e3d83\" data-v-f87c67ca=\"\">announced<\/a>&nbsp;a native version of its stablecoin on the Arbitrum network.","Other bridge projects and interoperability-focused protocols, such as Celer Network, Li.Fi, Wormhole, O3 Labs, Wanchain and Router Protocol, have already integrated CCTP into their systems to allow USDC transfers via their platforms.","Notably, the integration of CCTP with Arbitrum aims to supersede the conventional “lock-and-mint” bridging process traditionally used to transfer tokens between chains. That mechanism has previously been implicated in security incidents. Moreover, employing CCTP contributes to more expedited bridge transfers, according to Circle.","USDC is the second-largest centralized stablecoin in the market after USD Tether, with a supply nearing <a href=\"https:\/\/www.coingecko.com\/en\/coins\/usd-coin\" data-v-f87c67ca=\"\">$28 billion<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wormhole","content":"LOCATION"},{"type":"USD Coin","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Arbitrum Bridge","content":"ORGANIZATION"},{"type":"$28 billion","content":"MONEY"},{"type":"Cross-Chain Transfer Protocol","content":"ORGANIZATION"},{"type":"Wanchain","content":"PERSON"}],"hashtag":["USDC"],"authors":["Vishal Chawla","The Block"]}