{"summary":"The firm will develop a range of single-coin, multi-coin and thematic indexes through the partnership.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205136\/wilshire-to-partner-with-falconx-as-preferred-digital-asset-index-provider","publishDate":"2023-01-24T12:17:32","id":7669,"type":null,"title":"Wilshire to partner with FalconX as preferred digital asset index provider","category":["COMPANIES"],"content":["Wilshire, the financial services firm, announced a partnership with crypto prime broker FalconX to provide institutional investors with access to the OTC crypto derivatives market.","The firm, which has office's across the U.S. and in London, will develop a range of single-coin, multi-coin and thematic indexes through the partnership, the company said in a statement.","\"We aim to help institutional investors realize the benefits of new digital forms of investment and blockchain technologies while providing the products that meet the most stringent institutional requirements to access this emerging asset class confidently,\" CEO Mark Makepeace <a href=\"https:\/\/www.wilshire.com\/press-releases\/wilshire-announces-partnership-with-falconx-as-its-preferred-digital-asset-index-product-provider\" data-v-f87c67ca=\"\">said<\/a>.","FalconX CEO Raghu Yarlagadda said that the crypto derivatives ecosystem is at a \"critical growth juncture,\" adding that the company plans to strengthen its offering by working with Wilshire.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Mark Makepeace","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wilshire","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"Raghu Yarlagadda","content":"PERSON"}],"hashtag":["DATA PROVIDERS","FINTECH","INVESTMENT FIRMS"],"authors":["Adam Morgan McCarthy","The Block"]}