{"summary":"The bitcoin halving may already be priced into the market, say Coinbase analysts, as they weigh in on a long-running debate.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286428\/bitcoins-recent-all-time-high-could-mean-the-halving-is-priced-in-say-coinbase-analysts","publishDate":"2024-04-04T07:56:39","id":767,"type":null,"title":"Bitcoin&#x27;s recent all-time high could mean the halving is priced in, say Coinbase analysts","category":["MARKETS"],"content":["The question of whether the bitcoin halving is priced in gets thrown around endlessly each time the halving comes around — often with little resolve. Yet there is one data point that makes a case for it being priced in this time around, according to Coinbase analysts.","\"This is the first halving cycle which saw bitcoin breach its all-time high before the halving, which could mean that the effect has already been priced in by savvy traders,\" Coinbase analysts David Duong and David Han said in a note sent to The Block.","However, the analysts also added that there is still a collective belief that the halving might drive prices up, \"which could result in behavior that results in a rally.\"","The anticipated bitcoin halving is on schedule to occur sometime between April 16 and April 22 of this year, according to <a href=\"https:\/\/www.theblock.co\/halving\" data-v-f87c67ca=\"\">The Block's Halving Countdown<\/a>.","For much of the last few weeks, the price of bitcoin has hovered around $70,000 mark. However, on Tuesday the price took a sharp fall <a href=\"https:\/\/www.theblock.co\/price\/248348\/bitcoin-btc\" data-v-f87c67ca=\"\">into the $65,000 range<\/a>.","YouHolder Risk Manager Sergei Gorev agreed that any potential value appreciation for bitcoin resulting from the halving may have already been factored into the market. He added that bitcoin's recent price decline could indicate that traders are taking profits in anticipation of increased volatility leading up to the upcoming halving event.","\"With the next bitcoin halving approaching, the current dynamics of quotes actually indicate that more and more crypto holders believe that the halving is already included in the price. Tuesday's price drop means that investors are taking profits before the event. However, so far the downward movement looks more like a correction than a trend,\" Gorev told The Block.","A&nbsp;<a href=\"https:\/\/links.coinbase.com\/a\/click?_t=3aca56371967418192255878e9689713&amp;_m=c16b88bc7ee545108dca2f69636860ac&amp;_e=RaZCdCw2pkTIb8l7xFbEL-eua7eALAEbfIszy4yJ5kHzmhjaLVy8RBgfdNQJmDcuHY-0-x_v5t5a-zjdfvSoZgcpwUSaTKv11CKX8Ftuv1JibDOdzaSmReYNUBEwubdSykXmlag1tFIBBBHjE3lJLW87ZTrTaN0fM_dzg5YFMveo5Ynwn8L9x5AgUcG0zEU3tIXo28rq8LIUTsHTkdpUh-ur7FD8xmOhvu59vdvOFXh66720HKw_kIqzR8Qj8WKDwVIQbTSXGsRf6e22kQ5zK0aUEA11tEFaer4Ru2RvKpSV4IGpMuZvcQYpz0Sb1KgQ5dRqtQEqwIUJ9KF0YUZAns3-grDSRbxDXAmF84sBzASody05zQrMgX34z_oFzpne1HhZwiON2Scg1k3hMk4qIrmF1UgkybfoUCPGpjsUcIg%3D\" target=\"_blank\" rel=\"noopener noreferrer\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/links.coinbase.com\/a\/click?_t%3D3aca56371967418192255878e9689713%26_m%3Dc16b88bc7ee545108dca2f69636860ac%26_e%3DRaZCdCw2pkTIb8l7xFbEL-eua7eALAEbfIszy4yJ5kHzmhjaLVy8RBgfdNQJmDcuHY-0-x_v5t5a-zjdfvSoZgcpwUSaTKv11CKX8Ftuv1JibDOdzaSmReYNUBEwubdSykXmlag1tFIBBBHjE3lJLW87ZTrTaN0fM_dzg5YFMveo5Ynwn8L9x5AgUcG0zEU3tIXo28rq8LIUTsHTkdpUh-ur7FD8xmOhvu59vdvOFXh66720HKw_kIqzR8Qj8WKDwVIQbTSXGsRf6e22kQ5zK0aUEA11tEFaer4Ru2RvKpSV4IGpMuZvcQYpz0Sb1KgQ5dRqtQEqwIUJ9KF0YUZAns3-grDSRbxDXAmF84sBzASody05zQrMgX34z_oFzpne1HhZwiON2Scg1k3hMk4qIrmF1UgkybfoUCPGpjsUcIg%253D&amp;source=gmail&amp;ust=1712310399028000&amp;usg=AOvVaw0Oqx6KRbXXG4bv_dwEfIkj\" data-v-f87c67ca=\"\">recent report<\/a> from Coinbase Institutional also noted that forecasting a price appreciation for bitcoin after the halving event is problematic because there is \"only a small sample size of just three prior halvings that makes it hard to definitively predict what to expect.\"","Duong said the halving’s main impact could be the attention it brings to bitcoin, as well as other contextual factors like market sentiment and adoption trends.&nbsp;","Duong noted that the current bitcoin rally is largely a result of new phenomena, such as spot ETF inflows and rising institutional interest. The analyst said these factors have \"irrevocably altered\" the bitcoin market.","\"This means that bitcoin's response to the upcoming halving may not necessarily mirror its performance in prior cycles,\" he added.","Every four years, a mechanism coded into bitcoin’s blockchain <a href=\"https:\/\/www.theblock.co\/halving\" data-v-f87c67ca=\"\">cuts the block reward earned by miners in half<\/a>.","<span data-v-f87c67ca=\"\">This time around that means each new block of Bitcoin that’s mined roughly every ten minutes will yield 3.125 <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +1.29%\n    <\/span><\/a> <!----><\/span>, down from the current 6.25 BTC block reward.<\/span>","Historically, a lot of bitcoin’s gains have come in the 12 to 18 months after a <a href=\"https:\/\/www.theblock.co\/post\/283623\/bitcoin-halving-event-a-month-away\" data-v-f87c67ca=\"\">halving<\/a>, when newly diminishing supply accompanied surging demand. At the time of 2020’s halving, for instance, one bitcoin cost less than $10,000. By the peak in 2022, prices had climbed to more than $67,000.","What's different in this case is there has been surging demand from the arrival of 11 <a href=\"https:\/\/www.theblock.co\/learn\/259998\/what-is-bitcoin-etf\" data-v-f87c67ca=\"\">spot bitcoin ETFs<\/a>. However, as Coinbase noted, perhaps the gains have already come.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$65,000","content":"MONEY"},{"type":"+1.29%","content":"PERCENT"},{"type":"David Han","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"David Duong","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"April 22","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$67,000","content":"MONEY"},{"type":"Coinbase Institutional","content":"ORGANIZATION"},{"type":"$10,000","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$70,000","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"April 16","content":"DATE"},{"type":"Sergei Gorev","content":"PERSON"},{"type":"2020","content":"DATE"}],"hashtag":["CRYPTO MOVERS"],"authors":["Brian McGleenon","The Block"]}