{"summary":"Michael Sonnenshein, Managing Director at Grayscale joins The Scoop, The Blocks new podcast, to discuss news of a record breaking number of inflows into the firm&#x27;s many different crypto asset funds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/43492\/a-conversation-with-michael-sonnenshein-managing-director-at-grayscale","publishDate":"2019-10-16T16:00:30","id":7670,"type":null,"title":"Michael Sonnenshein, Managing Director at Grayscale stops by The Scoop","category":["BITCOIN"],"content":["<em data-v-f87c67ca=\"\">The following transcript is taken from episode twenty four of The Scoop, The Block’s flagship podcast. Listen below, and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>,&nbsp;<a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>,&nbsp;<a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>,&nbsp;<a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback and revision requests to&nbsp;<a href=\"\/cdn-cgi\/l\/email-protection#2c5c43484f4d5f586c5844494e40434f474f5e555c5843024f4341\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"166679727577656256627e73747a79757d75646f6662793875797b\">[email&nbsp;protected]<\/span><\/a>. This transcript has been edited for clarity and length.<\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK3798336804\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Ladies and gentlemen thank you so much for tuning in for what is an incredibly exciting episode of The Scoop because there is an actual scoop tied to it. We're joined by <a href=\"https:\/\/twitter.com\/Sonnenshein?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" data-v-f87c67ca=\"\">Michael Sonnenshein <\/a>, the managing director at Grayscale -- one of the largest asset managers, probably the largest asset manager -- a couple billion dollars under their helm here in New York City and I am of course joined by Ryan Todd my very special co-host and and an analyst at The Block. Michael is joining us to share news of a record breaking number of inflows into the firm's many different crypto asset funds. Michael's been with the firm since 2014 I believe, he's risen through the ranks. He's got a small but gritty team over there sitting alongside our other friend Michael Mauro. Michael thank you so much for joining us. Please, I guess the best place to start if we're gonna start anywhere is with this quarter three report. It's a record breaking quarter. What's behind it?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> Well first of all thanks for having me.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> I'm sorry for being late.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> Well the public apology is is really, I gotta say I really appreciate it. But let's dive into the numbers. This was an amazing quarter for Grayscale. We raised just shy of $250 million in the third quarter of 2019 which breaks every preceding quarter we've had in the six year history of the Grayscale business. The flows were mostly dominated by institutional investors which is probably one of the most important things for us to talk about Frank. Whether it's you guys or other folks in the press, you're always asking us, where are the institutions? And why aren't the institutions coming into digital currencies yet? And I would argue that they've been not only showing up to Grayscale but they've actually been showing up in droves.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> It's interesting. You make a good point, there is this dichotomy that I'm seeing as well. You have certain players that are doing better than others. When we look at companies like Fidelity that's off to a slow and steady pace. Bakkt -- the volumes aren't quite where we would want them to be perhaps. There aren't that many headlines about larger hedge funds and larger pension funds entering the market or entering the fray. But we do have these numbers at the same time so is it... Are they quieter firms that maybe don't want the press attention? What is Grayscale's quote unquote secret? If they're attracting these inflows that other firms might not necessarily be seeing?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> By and large it's difficult if you're a hedge fund or an institution or even as an individual to get exposure to digital currency. Folks have got to figure out where they're gonna buy it, how they're going to transfer it, how they're going to store it, how they're going to safekeep it and that's challenging because it's definitely not the same as going into your brokerage account, punching in some stock symbol and just clicking buy and then all the settlement and payment kind of happens in the background for you automatically. Digital currencies are totally different from that. And so the secret of what or not so secret sauce at Grayscale is the fact that we have packaged digital currency exposure into a security so if you're a hedge fund, if you're a high net worth investor you can buy into any one of our private placements any day of the week. We have 10 different funds and that lets you do something that feels very familiar to any of the other investments you make. It's a security with a CUSIP and has audited financial statements and produces tax documents. It's what investors want to see.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So let's break it down why would I as an investor of a large, say manage hundreds of millions of dollars. Break down for me why it's better or more familiar to invest via these private placements? This is a security as opposed to onboarding through the... a lot of these crypto exchanges have institutional offerings. Why is it better to get the exposure via private placement as a hedge fund versus just opening up an account with white glove services on Coinbase?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> A lot of hedge funds just by mandate can't hold a digital asset. It needs to be held either with a qualified custodian or be something that they're easily able to have on their books and records. And so for a lot of folks when we start talking to not just the CIO but when they're ready to invest and we start talking with the legal teams and the auditors and the risk teams the fact that they have something that is a security that has a CUSIP and that's audited is exactly the same thing as any other instrument or derivative that any of these funds use when they're looking to gain exposure to something. If they're to buy digital currency directly they have to figure out who at the firm is going to have access to the private keys. They're going to have to determine what's the appropriate cadence of checking the balances of the digital assets et cetera. And quite honestly investors are really more so and should be more so focused on when's the right time to gain and take off exposure to certain assets, not necessarily worrying about the security and safekeeping of an asset they're invested in.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> I get that argument, something I'm always curious about is how do you compare that versus say the regulated futures that are now starting to come out. Whether that's Bakkt's physically delivered product or even CME's bitcoin futures product. Hedgefunds do have familiarity with those types of products, what's the value add with Bitcoin Trust?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> We have a lot of our clients using futures to hedge. No question about it but there are some of them that are either looking at capital requirements related to using some of those products and when they look at the transactional costs they would actually deduce that it is more cost effective to gain exposure to Bitcoin through Grayscale Bitcoin Trust than it would be for them to either use futures or even buy these assets directly if they had the legal framework that allowed them to buy and hold directly which most institutions unfortunately don't.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Bottom line is you're saying it's cheaper to buy GBTC as opposed to...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Even with the premium, do you guys take that into account as well?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> So where are institutions are getting involved is through our private placement. So any of our institutions can come to Grayscale directly buy an NAV on a daily basis and that way they're actually getting exposure to digital currency directly at a price that reflects where it is on a given day when they're investing.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So let's focus in on that for one second because it has been a topic of conversation which is the premium that sometimes occurs with this product. Sometimes hundreds of percentage points in some cases with certain products. Is that something that you guys can remedy? And in conversations with clients when they bring this up how do you sort of walk them through the understanding of it?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> So if you're an accredited investor, high networth individual, family office, hedge fund other type of institution you can buy into the private placement for Grayscale Bitcoin Trust or any of our other products you're subject to a one year holding period at which point you're able to get liquidity on your investment by selling your shares into the public market. So for Grayscale Bitcoin Trust that is symbol GBTC and as you guys suggested that does historically and currently trade at a premium to the fund's net asset value. That is primarily a function we believe of supply and demand in the market. There is more demand than there is supply of shares available because this is the only security available in the US that lets investors gain exposure to Bitcoin right alongside any of the other assets they may own in their brokerage accounts or retirement accounts et cetera. And so it is not something that we can directly remedy so much as the price is really dictated by the market on a day to day basis.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Do you guys get excited when well maybe not excited, I don't know but it's favorable when ETF's on bitcoin don't get passed for your product? Just in general, it's still the only avenue for these types of investors to get exposure into this product. How would that change if there was an ETF?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> So we actually spent 2017 working on registering our product as a 33 act ETF and ultimately pulled out of the process just citing that the market wasn't ready for it nor were really regulators and so when we have conversations down in D.C. folks have generally been pretty proactive about the space. The level of understanding that they have when we're there has ramped up so substantially over the last few years and an ETF is really more of a matter of when not so much a matter of if.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Specifically does it impact your business in any meaningful way whether one gets approved or not?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> We're in favor of seeing any additional onramp into the asset class so whether we now have an additional derivative using Bakkt as opposed to only having CME or seeing exchanges have better KYC &amp; AML or even seeing additional access products get launched -- the more avenues there are for capital to flow into the asset class from our standpoint the better the asset class will be overall.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So Grayscale has made some waves, has gotten some attention for their recent drop gold campaign. It's been a couple of months in the making. You guys put a lot of resources... I actually see the commercial pretty frequently on YouTube and other business shows or CNBC. What has the success of that product looked like? And has it played into this pretty significant uptick of non Bitcoin trust inflows since a few months ago?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> Sure. Well so Drop Gold #DropGold. We launched in the beginning of May of this year and so the idea behind the campaign has been and continues to be a call to action for the investment community. It is now nearly 2020 and we're starting to task investors with this question which is, what constitutes a store of value? It historically has been gold but that may have made more sense for a physical age. As we are in fully immersing ourselves now in this digital age perhaps gold doesn't hold up as much as it once did as that store of value and perhaps investors need to think about a digital store of value such as Bitcoin and the campaign has been really the core of that question for the investment community. Dropgold.com -- we created to kind of house a bunch of educational content for investors thinking through this question. And as Frank said the campaign has taken the form of even a TV ad that's been playing on CNBC and other outlets throughout the year. What we've learned through the campaign is this is not only a narrative that is resonated with the investment community. Zero question about that but more so that it is driven awareness around Grayscale and driven awareness around the product offering. We'd certainly attribute some of the success of the campaign back to a record breaking quarter for us on the asset raising front.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Outside of the campaign. What other types of getting out there in front of investors... Like what's that process look like? I in person? frequet meetings? How do you actually bring in actively?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> Sure it's it's important for us to be out in front of investors. While most investors these days we encounter have that kind of preliminary 101 digital currency education it is still interesting to see in the age that we're in that handshakes and face to face interactions and giving investors the opportunity to ask questions that they may not otherwise ask through a phone call or over email is something that we do in person. So our team is out on the road quite a bit with investors and will descend on a city -- call it Chicago or we were just in Vancouver a couple of days ago and what's been interesting to see is that even though we only give ourselves two or three days in a given place we're actually so busy we're either having to divide and conquer as a team to make sure we see everyone or in a lot of instances we're actually turning down meetings and having to schedule follow up calls or emails because we just don't have enough time while we're in a given place to kind of see everyone.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What are some of the questions that they're asking?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> There are certainly going to continue to be questions around regulation and what we think the regulatory landscape looks like now and how it'll shift. More than anything investors are curious about information so we point investors to this quarterly report that we put out which from our standpoint and a lot of folks in the industry's standpoint has really become the de facto sentiment indicator for flows into digital currencies. When you look at a quarter like this and it's not just bitcoin dominating the flows but we're seeing flows to Ethereum and Ethereum Classic. In other products across the Grayscale family investors can take those insights and actually do something about them -- these are actionable intelligence items for them.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Is that something you're looking to package up and offer to them in a way that they can make more actionable investment decisions around some of your data?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> Yeah this report is publicly disseminated each quarter and having the opportunity to sit down and chat about it with with guys like you is exactly what we want to do so that folks do have the right tools in their tool belt so to speak to make informed investing decisions.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> We talked about the Drop Gold campaign that relates more directly to Bitcoin's thesis. You mentioned flows have been more mixed this quarter which is good to see. How does that conversation shape then when you're trying to explain the value of these other types of products that you have?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> There's zero doubt that most investors we are approaching or who are approaching us have probably done most of their homework around Bitcoin. They have the most resources available to them on Bitcoin. It's kind of overcome quite a bit of adversity over the 10-11 years it's been around. That's probably where they're most comfortable deploying capital as a result. But what we very quickly find is that investors like to diversify. They see that there's diversification benefits even within the digital currency asset class not just by having digital currency as part of their portfolio but within digital currencies themselves. And so following usually an investment in bitcoin we start seeing folks look at assets like Ethereum, Ethereum Classic or even looking at our diversified fund -- digital large cap fund.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> But is it them coming to you with this thesis of hey this is why I want to invest in a Ethereum Classic, do they come to you with the thesis on Ethereum Classic which saw a big uptick or do you sort of say hey you got into bitcoin here's why maybe Ethereum Classic might be interesting too?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> We try and put tools like that in front of investors. We've written theses around some of these different assets for investors to take a look at and then very recently we launched a new educational series called Building Blocks where we kind of do a relatively agnostic deep dive into each digital currency and give that to investors so as they're thinking about which of the currencies they want exposure to and which they don't, they have some good resources in front of them to make those decisions.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And you were talking about what might have been behind the Ethereum Classic.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> The Ethereum and Ethereum Classic communities are probably working more collaboratively than they ever have before. We have a lot of investors who are excited about the technological promise embedded in Ethereum as a technology and often want to gain exposure to both Ethereum and Ethereum Classic and it's also worth noting that this past quarter is when our Ethereum product got approved for its public quotation ticker symbol ETAG. Investors continue to look at those products even more probably once they have a public quotation given that there is then a known path to liquidity and just kind of elevates the profile of the product a little more.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Let's shift gears and focus in on you Michael, you joined Grayscale from JP Morgan from the Wall Street world in 2014. Tell us a little bit about your bitcoin journey.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> So I wasn't on a bitcoin journey...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Not any of us really.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> Well I don't actually even know how you found your way into this but you asked me the question.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> I was forced.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> I was at J.P. Morgan at the time I was having then at that time worked at three bulge bracket banks. I was ready for an environment that was smaller where I would have a little bit more autonomy and I wanted to stay within financial services. So actually most of my search was around hedge funds and family offices and things like that. I had the fortunate pleasure however to interview with our founder and CEO Barry Silbert and when I met Barry we only had I don't know... Maybe 10 15 minutes together tops and I had found the opportunity to work with Barry on LinkedIn of all places and actually I have to say this is not a plug for LinkedIn but some of our best employees at Grayscale we have all found through LinkedIn surprisingly -- not the recruiters or anything like that. And so Barry and I had a good chat. My knowledge of bitcoin at the time was de minimus. I remember sitting in my office in JP Morgan I'd see maybe Bitcoin flash up on CNBC every once in a while but no one cared. I mean people were interested in the jobless claims numbers and any other kind of economic data or earnings reports coming out. No one really cared what was going on with bitcoin when CNBC would report on it. Barry kind of gave me his pitch on why he was so excited about bitcoin and I very politely told him it sounded cool, it sounded interesting but I was probably going to go work for this hedge fund and he actually of all things because my initial role with him was to do sales for Grayscale -- he actually had me sell him of all things a pen and I must have done a damn good job selling him that pen because Barry said to me why don't you come work for me? Why don't you come help me build something? And if at any point it feels...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Grayscale was already operating at this point?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> We had just launched the Bitcoin Trust, so the Bitcoin Trust launched in September of 2013. This is early January 14' and he said to me come help me build something and if at any point it feels like it's going off the rails or this doesn't feel aligned with what you want to do career wise, you can always go work for a hedge fund or always go work for a family office but take a chance. And within 24-36 hours they had made me an offer and I said you know what? I'll take the risk, I'll take the chance. I was smart enough to actually negotiate a couple of Bitcoin from the company as part of my starting package back then and the rest is history. Six years later we've grown from one product with about 60 million dollars in AUM when I joined to today, 10 products and over two billion dollars of AUM so it's really been amazing to kind of be a part of the journey.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Was there at any point you mentioned, he kind of as part of his proposition said if we ever get off track either reel us back in or you can go off somewhere and do something else. Was there any point where you felt like the company was not going in the direction that you wanted it to?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> I actually don't think that there really has been and that's been one of the most amazing things about working with and for Barry which is that he's always been kind of prudent about keeping headcount low and keeping a really lean and mean team and allowing us to move through crypto winter and times maybe when it was all about blockchain and not about bitcoin and then kind of keep morale alive and positive at the team and the company as a whole. We've definitely been through a few cycles to say the least over the last couple of years but at no point was my interest in being there and helping him build this ever wavering.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Let's look forward and think about what's going to become of Grayscale over the next year. You have 10 products now. The staff isn't that much bigger from a few years ago, you have been able to maintain a lean team doing basically the same thing -- pitching family offices, financial advisors on these products, growing your AUM. Does the future of Grayscale look different than what it's looked like in the past and how would you relate it maybe to... I feel like whenever someone comes on the show or frequently they'll say 'well we're the X for the Bitcoin world...'","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> We as a business have taken our cues from the incumbent asset managers -- the WisdomTrees, the State Streets, the iShares of the world and we have modeled ourselves after those companies because it's been about finding the best possible service providers to surround each of our products and do what we can to manage those relationships and constantly make sure that the products get the time and attention that they need from each of those service providers. If I had to say we'd kind of be the WisdomTree or the iShares of the digital currency asset class by giving investors a whole family of access products so that they can get exposure to the asset class. That's kind of who Grayscale is and will continue to be and if we look at the next year sure we'll probably add to headcount a little bit. You'll see a little bit more from us on the #dropgold campaign. You will maybe see us launch a couple of new products but time will tell. That's a delicate balance for us. It's what products we think are investable and are good opportunities balanced with what investors are telling us are the areas of the market they want exposure to that the current lineup doesn't already provide and we'll also continue to really invest in putting out good content on these quarterly reports, really do give investors actionable insight and other educational content like our building blocks series. We're excited to kind of continue on all those fronts as we move into next year.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What is the process of adding new products look like in terms of expense, human capital. Obviously there's regulatory hurdles to getting a product online. What is to stop you from launching as many products as possible so to speak.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> Good question. I mean the most obvious ones for us that screen out products we can't launch are things like are there sound custodial solutions for a given asset? Is there an addressable market? Is there an accessible market? Is there a fair pricing mechanism that we can use for said asset? Ultimately some of our products have attracted more capital than others and maybe that's so much as some of them today resonate with investors more than others. But that may change over time and so we look at a lot of these products as planting seeds for the asset class as a whole.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And when you look at maybe some of the new competitors that are coming online Bitwise is offering similar products and recently [...] which has failed to get it's many ETF applications off the ground doing something similar, targeting large investors with a trust mechanism to invest or get exposure to Bitcoin. As you go out and you try to pitch new clients or existing clients but more their money into the market, why with you and not with others?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> Most investors are attracted to Grayscale because of the operational excellence and the track record that we have. We have now been at this for a little over six years. We just celebrated the six year anniversary since we launched our first product and in the face of a lot of changes across the eco system we have done a good job of finding the right service providers to surround these products with and have operated in a way that gives investors a lot of comfort. There is something to be said about having audited financial statements and having the right level of disclosure and maintaining a certain level of operational excellence and investors throw due diligence questionnaires at us all the time and I'm yet to encounter an institution that has not invested with Grayscale as a result of a deficiency there. An institution has only not invested with us in the instance that they just weren't ready for investing in the asset class. Nothing to do with Grayscale specifically.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How do you avoid losing a deal like that or do you just sort of throw up your arms?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> Some of these are long protracted conversations. I can think of several of our institutional investors for whom we met with over the course of two and a half years intermittently -- kind of giving them updates on how things were changing across the ecosystem before they were ever ready to deploy capital whereas other times we will encounter firms who maybe have an analyst or portfolio manager internally that's already very excited about the space and so we become kind of this external ally for them and kind of help them make the right pitches internally so that they actually can deploy capital and get buy-in from the rest of their investment team.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Can you unpack a little bit when you see these stats of your investor profiles predominantly institutional investors, it's like that huge bracket, like what is an institutional investor? You guys listed as hedge funds are those largely crypto funds or are there long short funds? What's the typical profile of these institutional investors?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> Most of our institutional investors are actually not crypto hedge funds. Most crypto hedge funds I would say are much more actively managing their positions whereas the investors who are coming to Grayscale and using the products are usually looking for longer time horizons, they have a medium to long term time horizon and that kind of fits with our products anyway because they carry a one year holding period. If you subscribe to the private placements and I would say that it really runs the gamut of investor types so we have tons of global macro funds who maybe look at digital assets as a way to be short fiat money or thinking about all the economic and political turmoil going on globally and this is the right way to hedge against those types of events. We have no shortage of tech investors, right? These are folks that just historically or are currently comfortable investing in tech and are excited by digital assets and blockchain technology. We certainly have no shortage of Arb funds or momentum funds. I can't really say that there's any one investor type that isn't represented but these are storied institutions and that's probably the other thing that I'd mention to you guys is this is kind of gained momentum throughout 2019. The kind of institution that we're interacting with is getting larger in terms of their AUM is getting longer, in terms of their operating track record and so the picture that I'm hopefully painting for you is one of that the investor that's coming to us is usually not that like startup fund that just got their funding and is trying to swing for the fences early on and building their track record. And it's important to take that away because it's showing compelling data that institutions who have been through all kinds of cycles are really excited about this asset class and really in fact don't think it's going to go away much the same way that we don't believe it is nor do you guys do.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How large is the biggest fund invested with you guys?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> We have funds that are over 10 or 15 billion dollars in AUM as clients.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> When I talked to the the different exchanges there are some who have onboarded or have done due diligence. We're talking about the D.E. Shaw's of the world who've done due diligence on companies like Coinbase to onboard or other exchanges but they're not necessarily actually trading or in the market. Do you think that and we kind of touched on this before but it is an interesting data point that there might actually be firms in the cryptocurrency market that are investing through Grayscale but not active in other ways?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> There is a mix. We even have investors who want to kind of take up core positions so to speak in a given digital currency Bitcoin or otherwise and then may also say it's important for us to have a little bit of digital currency that we ourselves can manage or experiment with so to speak and so they'll work with our sister firm Genesis -- an OTC trading desk and for someone like that type of institution they're going to do that in a relatively small way. But we we see investors that are doing all kinds of things whether they're participating in public markets and in stocks or different assets that have exposure to the digital currency realm whether it's chip makers folks that are getting involved in the futures as we said to hedge. Folks that are looking at things like swaps and other ways. It's often a complementary thing that investors can do.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Would you say that the larger funds 5, 10, 15 billion that are invested with you guys are those positions typically smaller than some of the more modest sized investors or not necessarily?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> So it depends. We have some investors who come to us and say you know what? This is X number of dollars or we have X percentage of the fund that we want to allocate to digital currencies, Bitcoin or otherwise and they just deploy it as soon as possible, they've made the decision they're ready to invest and make the decision. We have other investors who look at this position sizing as something they want to do over time. They'll leg into the trade over a series of weeks or months or we have some investors that do so over a series of years. It really it really depends from scenario to scenario. But again what we're seeing most recently is larger check sizes, larger institutions and also exploration beyond just exposure to Bitcoin.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> You talked about legging into the trade. Did people leg into it that July 14th week when it popped?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> That was a big week of inflows. We had a day that week where we raised over 75 million dollars in a single day which was the largest inflow we ever had in a single day. That's what we're hoping continues to happen is that more investors are excited about the asset class, recognize the diversification benefits. Looking for that uncorrelated Alpha and look to digital currencies and whether it's Grayscale or futures or otherwise we're just excited to see more capital flow into the space.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> You've been in the space now six years full time working with Grayscale. What gets you most excited about where we're heading as a space over the next year? There's been a lot of developments this year, a lot of news flow both positive and negative. Last week there was a flurry of news updates on Friday.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Libra kind of almost falling apart on the payment side and the ETF denial also happened last week.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> CFTC commissioner talking about ETH as a commodity.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That's that's good.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> These guys are all good things but we don't look at these singular instances of news as things that get us excited or keep us committed to this space. We're looking at larger trends that maybe aren't spoken about as much or reported on as much and for us which is something that we've started writing about quite a bit and something the investing community needs to focus more on is what's going to happen to generational wealth as it changes hands. We've been looking into this statistic which is that over the next 25 years 68 trillion dollars is going to pass from older generations. We're talking about baby boomers and our parents passing that money down to Millennials and GenX and GenY. If you think about what the profile of that investment is today, how is that capital currently allocated? What does it sit in? Is it conservative? Does it have a large proclivity towards owning gold and kind of other historical stores of value and as it gets passed down to a younger generation, how is that going to shift? If you inherit that money are you going to keep it in things like gold or are you going to keep it in things like bonds? As we look at investor preferences of the younger generation, this is the Robinhood generation the robo advisor generation -- those kinds of investments just don't resonate with them. I'm not sitting here with you guys today saying Oh all that money is going into digital currencies are going into Bitcoin but we'd all be pretty remiss to not believe that some portion of it is going to go into digital currencies as that wealth shift happens. When you look at the total outstanding market cap of digital currencies today and you think about what even a small slice of that 68 trillion dollars moving into digital assets would do -- that is a really staggering statistic and the numbers get silly very quickly.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> We got the numbers right here, Ryan Todd pulling up some nifty numbers from CB Insights.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> It's by 2030 millennials will hold 5x as much wealth as they do now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> You have to think about that. What resonates with a younger investor? Is it things like bitcoin? Is it the companies that they are subscribers of and users of and that they patronize all the time? Or is it things like gold which they've probably never had any kind of direct experience with? This is a really important theme that we're looking at and again we don't think it's being spoken about enough","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How do you tap into that that wealth that's coming? That transition of trillions of dollars? Is it partnering with some of the firms you mentioned, the robo advisors or the Robinhoods of the world to kind of tap into some of these millennials who are using these platforms and very well soon may be accredited investors themselves.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> The campaign's helped too.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> Well yeah the campaign #droppedgold and droppedgold.com kind of speaks to a lot of the themes that I'm talking about and is starting to have that conversation be had amongst investors. As you look at newer platforms like Square and Robinhood et cetera they're kind of seeing where the puck is going and are starting to skate towards it. They're already offering services around crypto assets because their user bases want them and they want those access points. It's gonna be interesting to see how it all plays out but if we're successful in keeping digital currencies as a main part of the financial system -- kind of bridging those gaps with respect to custody and safekeeping and order management systems and making all of this easier to access, we're going to have a difficult time not seeing a lot of that wealth shift into digital currencies.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Is there anything that worries you? That transition of wealth seems to be the North Star and you're not paying attention much to the ebbs and flows of day to day news but is there anything existential that worries you?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> I don't think there's anything so much that worries me so much as I wish everyone would stop looking at digital currencies and asking, when? There's such an impatience. It's just kind of unnecessary, if you look at where bitcoin and other digital assets have gone from nothing to something in ten eleven years. We now have derivatives around Bitcoin that trade on exchanges next to the assets that have been around for millennia. There is this this narrative around impatience of when is this all going to happen but we'd actually say, well stop and actually look at how much has happened over the last ten eleven years. Take notice of how much clarity we actually do have from regulatory bodies, not to mention how much job creation there has been and how much... In the way there's been around innovations around cryptography and new ideas around what constitutes money. I mean this is all really exciting. So if everyone would just kind of own up to how much progress has been made and stop asking about when we'd all just get back to focusing on building around these assets and can hopefully continue to posture them to flourish.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That is a great place to leave things off with our friend Michael Sonnenshein and their quarter three report over at Grayscale. Thank you so much for joining us.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Sonnenshein<\/span><\/strong> Thanks for having me.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$250 million","content":"MONEY"},{"type":"Ryan Todd<\/span><\/strong> Even","content":"PERSON"},{"type":"January 14","content":"DATE"},{"type":"J.P. Morgan","content":"ORGANIZATION"},{"type":"Barry Silbert","content":"PERSON"},{"type":"75 million dollars","content":"MONEY"},{"type":"Spotify","content":"LOCATION"},{"type":"Frank","content":"PERSON"},{"type":"Ryan Todd<\/span><\/strong> You","content":"PERSON"},{"type":"AML","content":"ORGANIZATION"},{"type":"Chicago","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"2030","content":"DATE"},{"type":"Ryan Todd<\/span><\/strong> Outside","content":"PERSON"},{"type":"Chaparro","content":"PERSON"},{"type":"CME","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"trillions of dollars","content":"MONEY"},{"type":"Ryan Todd","content":"PERSON"},{"type":"Michael Mauro","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"July 14th week","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Bitcoin Trust","content":"ORGANIZATION"},{"type":"two billion dollars","content":"MONEY"},{"type":"Barry","content":"PERSON"},{"type":"60 million dollars","content":"MONEY"},{"type":"68 trillion dollars","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"Michael Sonnenshein","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"D.C.","content":"LOCATION"},{"type":"Ethereum Classic","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"Chaparro<\/span><\/strong> Libra","content":"PERSON"},{"type":"2014","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"May of this year","content":"DATE"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"15 billion dollars","content":"MONEY"},{"type":"Robinhoods","content":"PERSON"},{"type":"last ten eleven years","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"CB Insights","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"11 years","content":"DATE"},{"type":"Vancouver","content":"LOCATION"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"September of 2013","content":"DATE"},{"type":"State Streets","content":"ORGANIZATION"},{"type":"couple billion dollars","content":"MONEY"},{"type":"Chaparro<\/span><\/strong> Grayscale","content":"PERSON"},{"type":"Grayscale","content":"LOCATION"},{"type":"NAV","content":"ORGANIZATION"},{"type":"Michael Sonnenshein<\/span><\/strong> Well","content":"PERSON"},{"type":"36","content":"DATE"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Todd<\/span><\/strong> CFTC","content":"ORGANIZATION"},{"type":"winter","content":"DATE"},{"type":"D.E. Shaw","content":"PERSON"},{"type":"OTC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Michael","content":"PERSON"},{"type":"third quarter of 2019","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["DERIVATIVES"],"authors":["Frank Chaparro","Ryan Todd","The Block"]}