{"summary":"&quot;The CFTC should not be creating enforcement actions against decentralized (DeFi) protocols,&quot; Coinbase CEO Brian Armstrong said Wednesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250898\/coinbases-armstrong-wants-defi-to-take-cftc-to-court","publishDate":"2023-09-13T16:15:02","id":7673,"type":null,"title":"Coinbase&#x27;s Armstrong wants DeFi to take CFTC to court","category":["COMPANIES"],"content":["Coinbase CEO <a href=\"https:\/\/www.theblock.co\/post\/250375\/coinbase-to-push-for-global-consensus-on-crypto-rules-through-g20-in-brazil\" data-v-f87c67ca=\"\">Brian Armstrong<\/a> chimed in on recent enforcement actions brought by the Commodity Futures Trading Commission&nbsp;against several operators of decentralized finance protocols, saying he hoped they take the regulator to court.","\"The CFTC should not be creating enforcement actions against decentralized (DeFi) protocols,\" he <a href=\"https:\/\/twitter.com\/brian_armstrong\/status\/1702043655928955139?t=MKo7gN1e0bzBoWLLfOl4ug&amp;s=19\" data-v-f87c67ca=\"\">wrote<\/a> on X. \"These are not financial service businesses, and it’s highly unlikely the Commodity Exchange Act even applies to them.\"","The CFTC last week said it had <a href=\"https:\/\/www.theblock.co\/post\/249865\/cftc-settles-charges-against-defi-protocols-opyn-zeroex-and-deridex\" data-v-f87c67ca=\"\">settled charges<\/a> against DeFi protocols Opyn, ZeroEx, and Deridex, which were ordered to pay civil monetary penalties of $250,000, $200,000, and $100,000, respectively.","<span lang=\"EN\" xml:lang=\"EN\" data-v-f87c67ca=\"\">Deridex and Opyn were charged with&nbsp;<\/span>failing to register as a swap execution facility or designated contract market, failing to register as a futures commission merchant, and failing to adopt a customer identification program as part of a Bank Secrecy Act compliance program.&nbsp;","ZeroEx, Opyn and Deridex were also charged by the regulator with illegally offering leveraged and margined retail commodity transactions in digital assets.","\"My hope is these DeFi protocols take these cases to court to establish precedent,\" Coinbase's Armstrong wrote. \"The courts have proven to be very willing to uphold rule of law. The only thing this is accomplishing is to push an important industry offshore.\"","The crypto exchange has been involved in its own, long-running dispute with the Securities and Exchange Commission, which <a href=\"https:\/\/www.theblock.co\/post\/243128\/coinbase-plans-friday-filing-to-seek-dismissal-of-secs-case-in-its-entirety\" data-v-f87c67ca=\"\">in June charged<\/a> it over several aspects of its business, including not registering as an exchange, broker or a clearing agency.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"$100,000","content":"MONEY"},{"type":"Opyn","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"$200,000","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Nathan Crooks","The Block"]}