{"summary":"The firm cuts nearly 1,000 jobs amid crypto winter, but Needham still sees potential.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200531\/coinbase-pops-7-after-job-cuts-needham-says-buy","publishDate":"2023-01-10T10:53:37","id":7674,"type":null,"title":"Coinbase pops 7% after job cuts; Needham says buy","category":["EXCHANGES"],"content":["Coinbase jumped 7% after saying it would cut staff, with Needham calling it \"necessary\" and holding onto its buy rating.&nbsp;","The exchange is cutting 950 employees, which should reduce operating costs by about 25% versus the December quarter.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"We view the cost reductions as a positive for the stock and a necessary step given the uncertain volume picture in 2023,\" Needham analyst John Todaro wrote in a note. \"We remain positive on 1) interest income from the expansion of USDC and 2) the staking opportunity coming out of the Shanghai Upgrade which we model a slight boost to ETH staking revenue in Q3\/Q4 '23. Reiterate BUY and $73PT off 4x EV\/Rev on our '23 est.\"","Coinbase is the latest crypto company to announce layoffs. Last week, Genesis and Silvergate also said they would cut jobs as the industry continues to struggle with the fallout from numerous bankruptcies and a slump in crypto prices since 2021.&nbsp;","\"We view Coinbase as an attractive way to play the growing crypto asset universe, which includes overlap in the high growth areas of stablecoins, decentralized finance (DeFi), non-fungible tokens (NFTs), borrow\/lend applications, and 'yield farming,'\" the analyst wrote. \"We expect Coinbase to grow its trading revenue as the market-leading, fiat-crypto on-ramp in the quickly growing crypto ecosystem.\"","Todaro wasn't fully positive about the company. \"However, we believe there is still fallout from FTX and so remain cautious on volumes for the first half of '23,\" Todaro wrote.","The firm also lowered its December and 2022 full-year revenue estimates on expected lowered volume for retail and institutions.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"$73","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"'23","content":"DATE"},{"type":"Shanghai Upgrade","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"John Todaro","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"Needham","content":"ORGANIZATION"},{"type":"December quarter","content":"DATE"},{"type":"Todaro","content":"PERSON"},{"type":"Q4 '23","content":"DATE"}],"hashtag":["COINBASE"],"authors":["Christiana Loureiro","The Block"]}