{"summary":"The UK Treasury wants to develop tax policy specific to DeFi applications.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228638\/uk-defi-staking","publishDate":"2023-04-27T11:58:13","id":7677,"type":null,"title":"UK Treasury opens tax policy consultation on DeFi staking and lending","category":["POLICY"],"content":["HM Treasury, the UK's <a href=\"https:\/\/www.gov.uk\/government\/organisations\/hm-treasury\" data-v-f87c67ca=\"\">finance ministry<\/a>, said Thursday that it has opened a consultation on possible new tax regulations for decentralized finance activities.","In particular, the Treasury is focused on lending and staking — two key activities in the DeFi ecosystem. The Treasury said it wants to \"create a regime that better aligns...with the underlying economic substance, whilst reducing the administrative burden on users,\" the Treasury said in its announcement.\"","The Treasury's notice went on to say:","\"Under the proposed changes, the use of cryptoassets in <abbr title=\"decentralised finance\" data-v-f87c67ca=\"\">DeFi<\/abbr>&nbsp;transactions would no longer be treated as giving rise to a disposal for tax purposes. Instead, a tax disposal would arise when the cryptoassets are economically disposed of in a non-<abbr title=\"decentralised finance\" data-v-f87c67ca=\"\">DeFi<\/abbr> transaction.\"","&nbsp;","Notably, the consultation will have implications for users of third-party platforms as well. \"[T]he proposed tax framework outlined below is also intended to apply to the lending and staking of cryptoassets which is done through an intermediary,\" the Treasury said.","The UK government has, for the past two years, <a href=\"https:\/\/www.theblock.co\/post\/99517\/uk-taxman-fresh-guidance-crypto\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">moved toward<\/a> the development of crypto-specific tax guidance and policies. Starting in the 2024-2025 tax year, taxpayers in the country <a href=\"https:\/\/www.theblock.co\/post\/220118\/uk-taxpayers-must-file-crypto-profits-separately-from-2025\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">will be required<\/a> to split out crypto-derived profits on their tax returns.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"2024","content":"DATE"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}