{"summary":"Coinbase has announced a new reward program for market makers.\nIt will incentivize those who would improve the exchange’s liquidity for less-liquid trading pairs. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/86150\/coinbase-to-incentivize-market-makers-liquidity-reward-program","publishDate":"2020-12-01T05:55:10","id":768,"type":null,"title":"Coinbase to incentivize market makers for improving the liquidity of less liquid trading pairs","category":["Exchanges"],"content":["Crypto exchange Coinbase has announced a new reward program for market makers who would improve the liquidity of its less-liquid trading pairs.&nbsp;","The <a href=\"https:\/\/blog.coinbase.com\/coinbase-december-2020-market-maker-program-ed60c128850a\" data-v-f87c67ca=\"\">program<\/a> is aimed at incentivizing participants \"for diversifying their activity across a wide set of trading pairs,\" including low-liquidity and new trading pairs.","Market makers will have to meet certain conditions to qualify for the program. First, they will have to trade above a certain threshold in the trailing 30-day adjusted maker volume (AMV). The AMV multipliers for low-liquidity and new trading pairs are 15x, medium-liquidity (10x), and high-liquidity (1x), suggesting that Coinbase wants to improve the liquidity for the first two categories of trading pairs.&nbsp;","","","The minimum AMV for the December program is $500 million. That means qualifying market makers with an AMV of greater than $500 million would be charged lesser taker fees than the current program (i.e. 3 basis points instead of 5 basis points). Market makers make markets on both buy and sell sides and thus are subject to both maker and taker fees. When they make markets or provide liquidity, they get paid maker fees, and when they remove liquidity, they are charged a taker fee. While there is almost always a taker fee, in some cases, the maker fees are zero.&nbsp;","Coinbase's reward program comes four months after the exchange appointed former Circle executive Vishal Gupta as its new head of exchange in September. While crypto exchanges typically reward market makers, Coinbase's program appears to be specifically aimed at improving the liquidity of its less liquid and new trading pairs.","To be sure, the exchange has high liquidity for popular trading pairs, such as those tied to bitcoin and ether, but its liquidity for other trading pairs is low as compared to rival exchanges such as Binance. It remains to be seen whether this program ends up serving its intended purposes.","Coinbase said the program might change over time, including the AMV threshold and what is considered to be low, medium, and high liquidity trading pairs. For the December program, specifically, below is the classification of each trading pair and their AMV multipliers:","",""],"hashtag":["COINBASE"]}