{"summary":"Jack Dorsey&#x27;s Bluesky revealed documentation and a fresh name, Authenticated Transport Protocol.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178158\/decentralized-social-media-platform-bluesky-unveils-latest-protocol","publishDate":"2022-10-18T18:50:20","id":7681,"type":null,"title":"Decentralized social media project Bluesky unveils latest protocol","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">Twitter founder Jack Dorsey’s decentralized social media initiative, <\/span><span data-v-f87c67ca=\"\">Bluesky, announced on Twitter that it would rename its protocol from “ADX” to the Authenticated Transport (AT) Protocol and provided additional documentation on the scope of the project.<\/span>","<span data-v-f87c67ca=\"\">As Twitter’s answer to a call for a decentralized approach to social media platform creation, AT Protocol will hinge on account portability, algorithmic choice, interoperation, and performance according to a thread posted by Bluesky. Thus far the project has an <\/span><a href=\"https:\/\/atproto.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">official website<\/span><\/a><span data-v-f87c67ca=\"\"> that remains under construction, and the company teased the release of an upcoming socially-focused <\/span><a href=\"https:\/\/bsky.app\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bluesky App<\/span><\/a><span data-v-f87c67ca=\"\">, built on the AT Protocol, for which users may join the waitlist.<\/span>","<span data-v-f87c67ca=\"\">AT Protocol will run on a federated network, said Bluesky, which is a type of network configuration featuring central management frameworks that allocate shared resources across a number of connected networks, or locations. To explain the network model, Bluesky offered an example where many sites run the protocol, and users may choose among providers. In turn, individuals or businesses can choose to self-host.<\/span>","<span data-v-f87c67ca=\"\">In terms of online identity management, in an effort to provide greater control to users, AT Protocol will enable account swaps between providers that Bluesky said will not incur any data loss or impact social graphs<\/span><span data-v-f87c67ca=\"\">. Bluesky's approach to account management \"doesn't require ties to real-world identity,\" Dorsey <a href=\"https:\/\/twitter.com\/jack\/status\/1582463343549612032?s=20&amp;t=wiEOaCG-WO8OUeNqAUFjIw\" data-v-f87c67ca=\"\">tweeted<\/a> a response to another user in his own thread on the announcement, adding that to do so would be \"very wrong.\"<\/span>","<span data-v-f87c67ca=\"\">Closed source algorithms that select what users see and who they can connect with can become problematic in cases where misinformation or divisive messages become overtly prevalent. Bluesky will support open-source algorithms that, it said, will put a greater degree of control back into the hands of users in terms of content and connectivity.<\/span>","<span data-v-f87c67ca=\"\">In August 2021 Bluesky <\/span><a href=\"https:\/\/www.theblock.co\/linked\/114709\/twitter-taps-crypto-developer-to-lead-decentralized-social-media-initiative-bluesky\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">hired<\/span><\/a><span data-v-f87c67ca=\"\"> Jay Graber, a former Zcash and Skuchain software engineer and founder of the social event startup Happening Inc., to drive development for the decentralized social media protocol.<\/span>","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Correction:<\/strong> Updates report to correct Josh Graber to Jay Graber. <\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Josh Graber","content":"PERSON"},{"type":"Jay Graber","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Authenticated Transport","content":"ORGANIZATION"},{"type":"Bluesky App","content":"ORGANIZATION"},{"type":"August 2021","content":"DATE"},{"type":"Bluesky","content":"ORGANIZATION"},{"type":"Happening Inc.","content":"ORGANIZATION"},{"type":"Dorsey","content":"PERSON"},{"type":"Jack Dorsey","content":"PERSON"}],"hashtag":["BLUESKY","SOCIAL MEDIA","TWITTER"],"authors":["Jeremy Nation","The Block"]}