{"summary":"Crypto prices moved higher then lower following the Fed&#x27;s decision to raise interest rates by 75 basis points.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182306\/bitcoin-ether-whipsaw-as-fed-chairs-comments-roil-markets","publishDate":"2022-11-02T15:29:47","id":7683,"type":null,"title":"Bitcoin, ether whipsaw as Fed Chair&#x27;s comments roil markets","category":["MARKETS"],"content":["Crypto markets whipsawed alongside traditional counterparts after Federal Reserve Chair Jerome Powell said it's premature to think about pausing rate hikes, even after the Federal Open Market Committee indicated its latest rate <a href=\"https:\/\/www.theblock.co\/post\/182225\/federal-reserve-raises-interest-rates-by-75-basis-points-for-fourth-time-in-a-row\" data-v-f87c67ca=\"\">hike<\/a> signaled a possible end in sight.","The ultimate level of rates will be higher than previously expected, Powell said after the announcement of the latest 75-basis point hike. That said, the rate of increases may begin to slow as soon as December.","It's \"very premature to be thinking about pausing,\" Powell said at a press conference following the rate decision. “Incoming data since our last meeting suggests that the ultimate level of interest rates will be higher than previously expected.”","Bitcoin initially traded higher following the rate decision but dropped 1.8% after his statement. Bitcoin was trading at $20,495 at the time of writing, according to data via Coinbase.&nbsp;","","","Ether also whipsawed, albeit more modestly.&nbsp;","","","The hike was in line with expectations, but many speculators were looking for something else in the FOMC's release — namely, signs of a pivot. The FOMC <a href=\"https:\/\/www.theblock.co\/post\/182225\/federal-reserve-raises-interest-rates-by-75-basis-points-for-fourth-time-in-a-row\" data-v-f87c67ca=\"\">said<\/a> it anticipates ongoing increases in the target range will be appropriate to return to 2% inflation. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nCrucially, the Fed said it would consider various factors concerning future hikes, including \"the cumulative tightening of monetary policy, the lags with which monetary policy affects economic activity and inflation, and economic and financial developments.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Jerome Powell","content":"PERSON"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"1.8%","content":"PERCENT"},{"type":"Federal Open Market Committee","content":"ORGANIZATION"},{"type":"$20,495","content":"MONEY"},{"type":"FOMC","content":"ORGANIZATION"},{"type":"Powell","content":"PERSON"},{"type":"December","content":"DATE"}],"hashtag":[],"authors":["Adam Morgan McCarthy","The Block"]}