{"summary":"A new project is trying to &quot;physicalize&quot; the universe of Loot, the Ethereum-based, user-generated game concept. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/137530\/lootlarp-is-embedding-nfts-into-physical-objects-for-a-real-life-role-playing-game","publishDate":"2022-03-12T11:09:38","id":7686,"type":null,"title":"LootLARP is ‘embedding’ NFTs into physical objects for a real-life RPGs","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">The bearded man crumpled to the floor, clutching his stomach and steadying himself with his medieval mace. His killer beamed in victory, the weapon — a broadsword made out of foam — still in hand.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The audience cheered for the victor. The bearded man returned to his feet, steadied his mace, and resumed battle. Foam struck against foam. Shoulders jerked to avoid fake blades as the two men circled each other in the taped-off square arena.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">I have never seen non-fungible tokens (NFTs) used this way before.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Two people squaring off with a fake sword and mace at a LootLARP event. Photo by MK Manoylov.<\/span>","<span data-v-f87c67ca=\"\">In fact, the fight was a live-action role play (LARP). So, no actual death or injury occurred here at this repurposed warehouse in south Denver, Colorado.<\/span>","<span data-v-f87c67ca=\"\">I’m in Denver for the Ethereum-focused conference, ETHDenver. I came here hoping to get a sense of the most cutting-edge trends in the Ethereum world. I did not expect any of these to involve Loot.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In case you don’t remember Loot, it was one of the most talked-about things in crypto for a few weeks in the late summer and early fall of 2021. Enthusiasts were buying Loot NFTs attached to images of nothing but white text on a black background. The text, which included things like “warhammer,” “crown” and “Necklace of Perfection” is supposed to refer to items in a yet-to-be-created fantasy game.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Loot hype then seemed to die down almost as quickly as it had taken off. But Loot still has enthusiasts — and some of them have been busy tying the game’s NFTs to real-world objects, for use in a real-world version of the game.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">LootLARP weapons with chips in them. Photo by MK Manoylov.<\/span>","<span data-v-f87c67ca=\"\">What I have just witnessed was your standard LARP experience — with a web3 twist.<\/span>","<span data-v-f87c67ca=\"\">The whole battle arena was put on by <a href=\"https:\/\/www.lootlarp.xyz\/\" data-v-f87c67ca=\"\">LootLARP<\/a>, an organization that creates physical elements and designs gameplay for Loot.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Loot itself was born last August when Vine co-founder Dom Hofmann <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/116746\/cryptos-latest-trend-is-to-play-games-before-theyre-even-built\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">published a link<\/span><\/a><span data-v-f87c67ca=\"\"> to an Ethereum contract<\/span><span data-v-f87c67ca=\"\"> that people could use to create a limited number of “bags” of “randomized adventure gear.” The bags were actually just lists of words.<\/span>","<span data-v-f87c67ca=\"\">A Loot NFT.<\/span>","<span data-v-f87c67ca=\"\">The simplicity inspired LootLARP’s core contributor, who goes by <\/span><span data-v-f87c67ca=\"\">ndimwit online and prefers to remain pseudonymous<\/span><span data-v-f87c67ca=\"\">. “A Loot NFT is literally just text — it’s the most low-fidelity thing there could be,” said ndimwit. “So I figured, why don't we try to actually physicalize the universe?”<\/span>","<span data-v-f87c67ca=\"\">LootLARP partnered with a Quebec-based manufacturer to create foam role-playing items like swords, maces and magic tomes. And it worked with Kong, a company that primarily makes chips for crypto payment cards, to “embed” NFTs into the items.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The LootLARP broadsword I had a chance to hold felt about as heavy as a bottle of wine. The firm foam of the blade yielded in my palm when squeezed. On the butt of the sword, the exposed chip looked like a small, black navigational compass with a yellow face.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The LootLARP team showed me how their app scans LootLARP NFTs, tracks player data and displays quests. The team is still developing LootLARP’s quests and game world as well as methods to privatize user data, but it’s supposed to be finished in time for the NFT NYC conference in June. The plan is to let people use LootLARP’s tech to play at the conference.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In Times Square, a town crier will direct players to pick up their weapons from the LootLARP truck. Players will then scan the chips in their items. The chips, which the project’s <\/span><a href=\"https:\/\/www.lootproject.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">website<\/span><\/a><span data-v-f87c67ca=\"\"> calls “low-cost, durable, secure elements that can be cryptographically linked to an Ethereum smart contract,” sign transactions that tie the object to the blockchain and confirm that the owner has entered the game’s universe.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">From there, players can tackle various quests, which the LootLARP team is creating to <\/span><span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">demonstrate various use cases and to quickly create a compelling and cohesive experience, set in the Lootverse,” according to ndimwit<\/span><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To receive admission to the game, users must mint a so-called Redemption NFT, which ndimwit said is essentially a ticket. They must also have one of the original Loot NFTs, or an mLoot NFT — an offshoot of the original Loot project which stands for “More Loot” — to “activate” their item, according to LootLARP’s website.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The in-game transaction fees should be low since LootLARP uses Ethereum scaling platform Polygon. Still, ndimwit said the team is considering covering the fees for the NFT.NYC event.<\/span>","<span data-v-f87c67ca=\"\">In the true spirit of Loot, the project’s ultimate goal is to let the players build the game. The current LootLARP platform only consists of the chip-enabled physical items and player app, but the team plans to build features in which users can create their own quests.<\/span>","<span data-v-f87c67ca=\"\">“What we're building is essentially like a platform for people to make quests and games for each other, so that they can collectively build the world together,” ndimwit said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Something about [Loot] really captured the spirit of web3 for me, in a way where it's opening up creative use cases like world-building as a decentralized process,” he says. With LootLARP, “we can do something that’s at the bleeding edge of crypto.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"south Denver","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Vine","content":"ORGANIZATION"},{"type":"Kong","content":"LOCATION"},{"type":"Denver","content":"LOCATION"},{"type":"MK Manoylov","content":"ORGANIZATION"},{"type":"Colorado","content":"LOCATION"},{"type":"Loot NFT","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Times Square","content":"ORGANIZATION"},{"type":"Dom Hofmann","content":"PERSON"},{"type":"fidelity","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Lootverse","content":"LOCATION"},{"type":"Quebec","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}