{"summary":"The attack on Solend targeted three lending pools that held Hubble stablecoins, Coin98 tokens and Kamino tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182055\/solend-exploited-attack","publishDate":"2022-11-02T05:07:00","id":7689,"type":null,"title":"Solend exploited for $1.26 million in market manipulation attack","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Solend, a Solana-based lending protocol, reported a market manipulation attack that resulted in $1.26 million of bad debt for the protocol. The incident occurred on Wednesday, as <\/span><a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1587686180962783234\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">noted<\/span><\/a><span data-v-f87c67ca=\"\"> by security firm PeckShield.&nbsp;<\/span>","<span data-v-f87c67ca=\"\"> Solend runs a decentralized lending system that allows users to borrow and earn interest on crypto assets with the help of lending pools. <\/span>","<span data-v-f87c67ca=\"\">The platform&nbsp;<\/span><span data-v-f87c67ca=\"\">acknowledged the exploit and said the attack targeted three lending pools that held Hubble stablecoins, Coin98 tokens and Kamino tokens. <\/span><span data-v-f87c67ca=\"\">“An oracle attack on USDH affecting the Stable, Coin98, and Kamino isolated pools was detected, resulting in $1.26M in bad debt,” Solend<\/span> <a href=\"https:\/\/twitter.com\/solendprotocol\/status\/1587671511137398784\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweeted<\/span><\/a><span data-v-f87c67ca=\"\">. <\/span>","<span data-v-f87c67ca=\"\">The three affected pools have been frozen after the incident. All other lending pools remained unaffected, the Solend further clarified.&nbsp;<\/span><span data-v-f87c67ca=\"\">According to the Solend team, the attacker took advantage of an issue in the project's price-data oracle — a system used to track the prices of different crypto assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Malicious actors generally target lending protocols where they may inflate the price of certain crypto assets and borrow other assets with the intention of never repaying the borrowed amount. This results in bad debt, or debt that is unlikely to be paid back.&nbsp;<\/span>","Solana Labs CEO Anatoly Yakovenko described the incident as market manipulation. \"It was a market manipulation attack besides the oracle relied on a single low liquidity pool,\" Yakovenko said.&nbsp;","<span data-v-f87c67ca=\"\">The Solend team has yet to release a post-mortem report.<\/span>","<em data-v-f87c67ca=\"\">Update: Headline and report copy updated for clarity.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"PeckShield","content":"ORGANIZATION"},{"type":"$1.26","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Yakovenko","content":"PERSON"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"$1.26 million","content":"MONEY"},{"type":"Solana","content":"LOCATION"},{"type":"Kamino","content":"PERSON"}],"hashtag":["LENDING"],"authors":["Vishal Chawla","The Block"]}