{"summary":"An SEC custody rule that would mean changes for crypto firms also faces significant opposition from a broad swath of the traditional financial industry and senior Republicans on the House Financial Services Committee. Banks, hedge funds, investment advisers and House Republicans joined criticism from the crypto industry, including Coinbase, Circle, and Andreesen Horowitz over proposed change from the SEC over how customer assets should be safeguarded","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230713\/banks-congress-sec-custody-rule-crypto","publishDate":"2023-05-15T19:01:07","id":7696,"type":null,"title":"Financial firms, lawmakers join crypto industry opposing SEC rule change","category":["POLICY"],"content":["It’s not just the usual cast of crypto companies complaining about a proposed overhaul to custody rules from the SEC. Republican lawmakers and traditional finance companies aren’t happy either, and that could send regulators back to the drawing board.","<span data-v-f87c67ca=\"\">The rule changes, which advanced with bipartisan support within the commission and are still early in the rulemaking process, have raised concerns that they will further limit the number of banks willing to do business with the industry, and trading platforms like Coinbase fear their current means of safeguarding assets in pooled wallets could be upended.&nbsp; <\/span>","Congressional Republicans, led by House Financial Services Committee Chair Patrick McHenry, suggested the new rule language could further limit the universe of banks willing or able to work with digital asset companies, a concern in the industry following regulator guidance in January warning about exposure to crypto clients and assets.&nbsp;","“Recent joint statements from the federal banking regulators have discouraged federally chartered banks from holding digital assets or even holding the deposits of digital asset firms. As a result, many digital asset companies have opted to custody their assets with state-chartered banks and trusts,” a<a href=\"https:\/\/www.sec.gov\/comments\/s7-04-23\/s70423-188459-343662.pdf\" data-v-f87c67ca=\"\">&nbsp;comment letter<\/a> from McHenry, as well as each subcommittee chair on his committee, reads. “Thus, the question in the proposal regarding whether qualified custodians should be limited to federally chartered entities is highly concerning, especially as it applies to digital assets.”","<span data-v-f87c67ca=\"\">At issue is a rule change that would alter what it means to be a “qualified custodian,” and in doing so would strip some banks and savings associations of that definition with a stroke of a pen. <\/span><span data-v-f87c67ca=\"\">A broad coalition of bank and financial industry associations that includes the American Bankers Association and the Securities Industry and Financial Markets Association, among others, has said the proposal “could have a material impact on their business.\"<\/span>&nbsp;","The business groups signing onto the letter count industry giants like Fidelity Investments, Franklin Templeton, Goldman Sachs, Blackstone, Bridgewater Associates, Elliot Investment Management, Bain Capital, and Bank of America among the hundreds to thousands of financial companies who are members to the groups that raised concerns. The Independent Community Bankers of America, who represent smaller banks but are one of the most influential trade groups in Washington, also signed onto one of the business association letters expressing concerns.&nbsp;","Trade associations representing community bankers, hedge funds, investment broker-dealers, private equity and large banks asked for a 60-day extension to the comment period for the proposed rule in order for more analysis to be done on its effects, intended or otherwise.&nbsp;","Stablecoin issuer Circle raised similar concerns over the impact on state-chartered banks and trusts, arguing that the SEC could address them by simply making explicit that those companies, like crypto industry players Paxos and Custodia Bank, qualify as custodians under the proposed new changes.&nbsp;","“The SEC should finalize the rule as proposed and explicitly affirm that state-chartered banking organizations may continue to serve as qualified custodians,” Circle’s<a href=\"https:\/\/www.sec.gov\/comments\/s7-04-23\/s70423-187959-342983.pdf\" data-v-f87c67ca=\"\"> letter to the markets regulator reads<\/a>.&nbsp;","Paxos, a New York-chartered trust that provides custody services to crypto firms, also wanted the SEC to clarify that financial institutions regulated at the state level could continue to provide custody services to digital asset companies. The SEC could do that by setting a minimum standard for state-chartered companies to meet,<a href=\"https:\/\/www.sec.gov\/comments\/s7-04-23\/s70423-187759-342863.pdf\" data-v-f87c67ca=\"\"> Paxos argued<\/a>.&nbsp;","The approach by those two companies contrasts with<a href=\"https:\/\/www.theblock.co\/post\/229944\/a16z-sec-crypto-regulation-investment-advisers-coinbase\" data-v-f87c67ca=\"\"> stronger opposition<\/a> from venture capital firm Andreesen Horowitz and a company it invested in, U.S. crypto trading giant Coinbase.&nbsp;","Circle also echoed congressional Republican critique the potential unintended consequence with guidance to federal banks against exposure to digital assets, and raised flags about how the proposed rule changes could interact with smart contracts.&nbsp;","But the company said it supports the spirit of the effort, which also includes language specifically aimed at limiting risks to customers in the event of future digital asset company failures. In explaining his rationale for the rule changes, SEC Chair Gary Gensler <a href=\"https:\/\/www.theblock.co\/post\/212241\/gensler-opens-new-regulatory-front-for-crypto-firms-custody\" data-v-f87c67ca=\"\">referenced several high-profile crypto failures last year<\/a>, like FTX, Celsius, and Voyager, that put customers into lengthy bankruptcy processes in which they’re unlikely to fully recover the assets they kept with those companies.&nbsp;","Despite some of those concerns Circle said it supports the SEC's goals in changing the rule, despite the criticisms raised by the major stablecoin issuer.&nbsp;","“Circle supports the SEC’s goals in proposing the Safeguarding Rule and proposals including the expansion of the rule to include cryptoassets, among other client positions,” the company said in its letter. “It believes that the Safeguarding Rule will protect investors, increase confidence in the cryptoasset industry, and keep investment in this generational technology inside of the United States. As the SEC finalizes the rule, it should pay attention to unintended effects that would lead to investor harm as described above.”&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bain Capital","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Custodia Bank","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Bank of America","content":"ORGANIZATION"},{"type":"Independent Community Bankers of America","content":"ORGANIZATION"},{"type":"Fidelity Investments","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"House Financial Services Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Securities Industry and Financial Markets Association","content":"ORGANIZATION"},{"type":"McHenry","content":"ORGANIZATION"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Elliot Investment Management","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Bridgewater Associates","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Andreesen Horowitz","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Blackstone","content":"ORGANIZATION"},{"type":"American Bankers Association","content":"ORGANIZATION"}],"hashtag":["COINBASE","CONGRESS","FTX","GARY GENSLER","HOUSE FINANCIAL SERVICES COMMITTEE","PATRICK MCHENRY","SEC"],"authors":["Colin Wilhelm","The Block"]}