{"summary":"A judge unsealed a superseding indictment in Bankman-Fried’s criminal case on Thursday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214491\/sam-bankman-fried-faces-new-criminal-charges-including-conspiracy-to-commit-bank-fraud","publishDate":"2023-02-23T09:55:51","id":7698,"type":null,"title":"Sam Bankman-Fried faces new criminal charges including conspiracy to commit bank fraud","category":["LEGAL"],"content":["FTX founder Sam Bankman-Fried is facing new criminal charges after a judge unsealed a new 12-count indictment against him on Thursday, months after the former crypto exchange head was first indicted on eight counts last year.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Bankman-Fried is currently under house arrest on a $250 million bond. He has pleaded not guilty to criminal charges and is awaiting an October trial. A Bankman-Fried spokesperson declined to comment.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The new indictment charges Bankman-Fried with conspiracy to commit bank fraud and conspiracy to operate an unlicensed money transfer business. Bankman-Fried is also accused of committing wire fraud on FTX customers, securities fraud on FTX investors and conspiracy to make unlawful political contributions and defraud the Federal Election Commission, among other crimes.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The new indictment alleges Bankman-Fried had certain political contributions made in the names of two other FTX executives because he did not want to be known as a left-leaning partisan or have his name attached to some Republican candidates. One executive “ultimately became — at least in name — one of the largest Democratic donors in the 2022 midterm elections,” the indictment said.","The 39-page document also accuses Bankman-Fried of “willfully and knowingly” conspiring to commit bank fraud. The former FTX boss is accused of telling a financial institution that an account would be used for trading and market making, “even though Bankman-Fried knew that the account would be used to receive and transmit customer funds in the operation of a cryptocurrency exchange.”","Bankman-Fried could spend decades in jail if he is convicted on all counts.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<i data-v-f87c67ca=\"\">The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.<\/i>","<em data-v-f87c67ca=\"\">(Updates with additional details in fourth and fifth paragraphs.)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"$250 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Federal Election Commission","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}