{"summary":"What it really means to ‘Harness the power of Ethereum&#x27; An Introduction to Ethereum Ethereum is the 2nd largest cryptocurrency in the world by market cap,","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238\/consensys-ethereums-hub","publishDate":"2018-08-17T16:48:47","id":77,"type":null,"title":"ConsenSys: Ethereum’s hub","category":["ETHEREUM"],"content":["<em data-v-f87c67ca=\"\">What it really means to ‘Harness the power of Ethereum'<\/em>","Ethereum is the 2nd largest cryptocurrency in the world by market cap, trading at ~$30B this afternoon. The&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.investopedia.com\/terms\/e\/ethereum.asp\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.investopedia.com\/terms\/e\/ethereum.asp\" data-v-f87c67ca=\"\">Investopedia definition<\/a>&nbsp;of Ethereum tells us what this blockchain platform does.","<em data-v-f87c67ca=\"\">\"Launched in 2015, Ethereum is a decentralized software platform that enables SmartContracts and Distributed Applications (DApps) to be built and run without any downtime, fraud, control, or interference from a third party. The platform is also the basis for its own virtual currency, Ether. Ethereum is not just a platform but also a programming language (Turing complete) running on a blockchain, helping developers to build and publish distributed applications. The potential applications of Ethereum are wide ranging.\"<\/em>","This definition does not tell us how Ethereum has come to separate itself from other blockchains that perform similar functions. A recent count shows that there are at least&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/twitter.com\/AshAEgan\/status\/1029107646635421701\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/twitter.com\/AshAEgan\/status\/1029107646635421701\" data-v-f87c67ca=\"\">57 smart-protocol platforms<\/a>&nbsp;live or in the works. This figure includes EOS, which recently&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.cnbc.com\/2018\/05\/31\/a-blockchain-start-up-just-raised-4-billion-without-a-live-product.html\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.cnbc.com\/2018\/05\/31\/a-blockchain-start-up-just-raised-4-billion-without-a-live-product.html\" data-v-f87c67ca=\"\">raised $4B in a year-long ICO<\/a>, despite not having a live blockchain for most of this time. Against an extremely competitive backdrop, Ethereum has a few key attributes going for it (1) it was an early mover with an&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/cointelegraph.com\/news\/ethereum-raises-3700-btc-in-first-12-hours-of-ether-presale\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/cointelegraph.com\/news\/ethereum-raises-3700-btc-in-first-12-hours-of-ether-presale\" data-v-f87c67ca=\"\">ICO in 2014<\/a>&nbsp;and (2) it has a brilliant charismatic leader in&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/en.wikipedia.org\/wiki\/Vitalik_Buterin\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/en.wikipedia.org\/wiki\/Vitalik_Buterin\" data-v-f87c67ca=\"\">Vitalik Buterin<\/a>. In addition to these characteristics, Ethereum has what is possibly its most important attribute: an extremely strong and passionate developer community. And this developer community did not simply come about out of thin air; it took great marketing, dedication, and evangelism from a core group of Ethereum founders, including Joe Lubin, the founder of ConsenSys.","ConsenSys, headquartered in a converted warehouse in Brooklyn but with offices globally, currently uses the rather grand tag line: “Harness the power of Ethereum.” According to their&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/new.consensys.net\/\" target=\"_blank\" rel=\"noopener nofollow\" data-href=\"https:\/\/new.consensys.net\/\" data-v-f87c67ca=\"\">home page<\/a>, “ConsenSys is a global formation of technologists and entrepreneurs building the infrastructure, applications, and practices that enable a decentralized world.”&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/en.wikipedia.org\/wiki\/ConsenSys\" target=\"_blank\" rel=\"noopener nofollow\" data-href=\"https:\/\/en.wikipedia.org\/wiki\/ConsenSys\" data-v-f87c67ca=\"\">Founded in October 2014<\/a>, ConsenSys has grown at breakneck speed, from an entity with ~100 people in early 2016 to more than&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/cheddar.com\/videos\/inside-ethereum-incubator-consensys\" target=\"_blank\" rel=\"noopener nofollow\" data-href=\"https:\/\/cheddar.com\/videos\/inside-ethereum-incubator-consensys\" data-v-f87c67ca=\"\">1,000 today<\/a>. In fact,&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/twitter.com\/mdudas\/status\/1028842869828870144\" target=\"_blank\" rel=\"noopener nofollow\" data-href=\"https:\/\/twitter.com\/mdudas\/status\/1028842869828870144\" data-v-f87c67ca=\"\">the pace of hiring is accelerating<\/a>despite the significant decline in $ETH price over the past 4 months. ConsenSys reportedly had only about 600 employees in Q1 2018 and 900 employees as recently as last month!","The ConsenSys team is clearly planting a flag in the ground that they are&nbsp;<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">the&nbsp;<\/em><\/strong>hub of the Ethereum ecosystem. No other single entity on Earth has 1,000+ people working exclusively on the Ethereum blockchain, and no other organization has been reported to be hiring at such a feverish pace into a&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.reuters.com\/article\/cryptocurrency-bitcoin\/bitcoin-ethereum-tumble-as-crypto-bear-market-lingers-idUSL1N1V50SJ\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.reuters.com\/article\/cryptocurrency-bitcoin\/bitcoin-ethereum-tumble-as-crypto-bear-market-lingers-idUSL1N1V50SJ\" data-v-f87c67ca=\"\">bear market<\/a>. In fact, even after the recent hiring binge, ConsenSys still has&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/new.consensys.net\/careers\/#contact-form-anchor\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/new.consensys.net\/careers\/#contact-form-anchor\" data-v-f87c67ca=\"\">227 job openings<\/a>&nbsp;on its website today! This organization is ALL IN on Ethereum, and it isn’t slowing down anytime soon.","One might naturally ask: What gives ConsenSys so much confidence in Ethereum? And how can they bankroll such a sprawling and rapidly growing organization? For that answer, we must look to&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/consensys.net\/team\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/consensys.net\/team\/\" data-v-f87c67ca=\"\">the background<\/a>&nbsp;of the founder of ConsenSys, Joe Lubin. His early career involved a stint at Goldman Sachs where “software engineering, finance and cryptography were central” to his employment, followed by him working at a few hedge funds. Joe clearly understands finance and he clearly understands technology. Joe’s next step was a move to Kingston, Jamaica to work on music projects before making the decision of the millennium and joining up to co-found the Ethereum Project in January 2014. Joe’s knowledge of finance and tech gave him the ability to see the future in Ethereum and to team up to lead from the beginning.","As one of the founders of Ethereum, Joe became incredibly wealthy. In February 2018, near the peak of $ETH’s price, Lubin&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.forbes.com\/sites\/laurashin\/2018\/02\/07\/joseph-lubin-ethereum-ether-consensys-crypto-cryptocurrency\/#4b76f3f83575\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.forbes.com\/sites\/laurashin\/2018\/02\/07\/joseph-lubin-ethereum-ether-consensys-crypto-cryptocurrency\/#4b76f3f83575\" data-v-f87c67ca=\"\">was reported to be worth billions of dollars<\/a>. And despite the fact that $ETH has crashed from ~$850 in late February to less than $300 today, Lubin is still extremely crypto-wealthy. Since ConsenSys is strongly rumored to be largely bankrolled by Lubin’s crypto-wealth, his huge war chest gives ConsenSys a financial buffer that other companies, projects, protocols and teams cannot benefit from. Today, ConsenSys is rumored to be burning $100M+ per year, something virtually no other crypto entity on Earth can do. His money is a moat. And it has allowed ConsenSys to grow and evolve regardless of the ups and downs of the price of $ETH.","ConsenSys was originally created to ensure that developers flocked to Ethereum and that valuable projects and businesses were built on top of the protocol. Lubin and team knew that they alone would not be able to build a global decentralized app and smart contract platform; it would require the support of thousands of developers. They followed the model of other technology platforms, who built reference projects to inspire others to join them — and offered support as these projects grew.","<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/store.consensys.net\/pages\/about-us\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/store.consensys.net\/pages\/about-us\" data-v-f87c67ca=\"\">In 2016<\/a>, ConsenSys described itself as follows:","<em data-v-f87c67ca=\"\">\"We are ConsenSys — a decentralized blockchain production studio, a “hub” that coordinates, incubates, accelerates and spawns “spoke” ventures through development, resource sharing, acquisitions, investments and the formation of joint ventures. These spokes benefit from foundational components built by ConsenSys that enable new services and business models to be built on the blockchain\"<\/em>","Soon,&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/consensys.net\/team\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/consensys.net\/team\/\" data-v-f87c67ca=\"\">the definition<\/a>&nbsp;evolved to this:","<em data-v-f87c67ca=\"\">\"ConsenSys began as a blockchain production studio building decentralized applications, mostly on Ethereum, and continues on this track, but has expanded its activities since inception. Many of those components are core elements that can be used to construct larger solutions as well as being standalone solutions in their own right. Since ConsenSys began operations before the Ethereum ecosystem existed, ConsenSys has also built core infrastructure elements like Ethereum clients, testing frameworks, rapid application development frameworks, and Integrated Development Environments. ConsenSys Enterprise, the professional services arm, works with various enterprises to help them formulate their blockchain strategy and develop business processes for them on private or consortium blockchains, as well as on the public Ethereum network.\"<\/em>","From the description above, one can see how rapidly ConsenSys expanded from focusing on smaller development teams to enterprises and large organizations. They worked to develop standards and participate in consortiums that could influence the development and direction of the Ethereum platform.","Fast forward to today: ConsenSys declines to define itself as any one particular thing. They have grown in many different directions and now encompass a great variety of activity, as highlighted by these five large areas:","ConsenSys is now a sprawling hub with numerous divisions, or “spokes.” They refer to this collectively as the “mesh”, and more than 50 projects exist! This is a global operation with 14 offices spread across six cities with more to come. The spokes are building across every part of the blockchain stack, from infrastructure to developer tools to core components to apps, services, and platforms. These projects are incredibly varied, spanning industries such as law, publishing, token marketplaces, prediction markets, virtual gaming, gambling, financial infrastructure, property ownership, Dapp browser transactions, and much more.","<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/new.consensys.net\/labs\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/new.consensys.net\/labs\/\" data-v-f87c67ca=\"\">ConsenSys Labs<\/a>&nbsp;is the incubator of the majority of spokes. These projects are generally left to operate on their own despite financial and resource support from the main hub. They range from small projects with just a few members to projects that have many dozens of people working on them globally. And they touch a very broad range of industries in the hopes of impacting them via decentralized technology on a blockchain.","<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/consensys.net\/academy\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/consensys.net\/academy\/\" data-v-f87c67ca=\"\">ConsenSys Academy<\/a>&nbsp;is the self-described “Educational core of the Ethereum movement.” They aim to increase the number of highly capable developers building on the Ethereum blockchain:","<em data-v-f87c67ca=\"\">\"ConsenSys Academy’s mission is to develop the global blockchain ecosystem by bridging the Ethereum knowledge gap, becoming the beacon for Ethereum education, and revolutionizing education through blockchain technology.\"<\/em>","<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/new.consensys.net\/solutions\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/new.consensys.net\/solutions\/\" data-v-f87c67ca=\"\">ConsenSys Solutions<\/a>&nbsp;works with large organizations on a consulting basis to help them “build, test, and deploy public and private blockchain solutions.” This business is believed to be a cash cow and supports Lubin’s own war chest in funding ConsenSys operations.","<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/new.consensys.net\/capital\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/new.consensys.net\/capital\/\" data-v-f87c67ca=\"\">ConsenSys Capital<\/a>&nbsp;is the venture-capital arm of ConsenSys, investing in promising projects that do not become a direct part of the organization’s “mesh.” They refer to it as “the constellation of financial service offerings for digital assets and blockchain-based companies.”","And&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/etherealsummit.com\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/etherealsummit.com\/\" data-v-f87c67ca=\"\">Ethereal<\/a>&nbsp;is the company’s media brand, including content, programming, conferences, and other events around the world. The focus is on people who unite around “around how we can build our decentralized future together using blockchain technology.”","<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"56f89f949263\" data-v-f87c67ca=\"\">While Vitalik Buterin gets much of the credit for being the face and brains of Ethereum, Joe Lubin is just as important to the blockchain protocol’s success. He is an incredible “Chief Operating Officer” who has turned the project into something that thousands upon thousands of developers want to build on. While ConsenSys is based in Brooklyn, Ethereum is widely viewed as Silicon Valley’s favored protocol due to its programmability plus apps and services layer. ConsenSys projects both employ engineers as well as show great applications of the technology that other engineers might work on in their projects.<\/span>","One of the reasons that Ethereum is such a promising cryptocurrency and blockchain protocol is that no other blockchain has attracted such a large army of developers. And one of the main reasons that Ethereum has been able to attract so many developers is that Joe Lubin and ConsenSys have educated developers, given them a home, put them to work on practical use cases, and evangelized the decentralized world like crazy.","Moving forward, there is&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/twitter.com\/QWQiao\/status\/1022453343376080898\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/twitter.com\/QWQiao\/status\/1022453343376080898\" data-v-f87c67ca=\"\">debate<\/a>&nbsp;about whether the developer advantage that Ethereum has over other blockchains will matter as much as it has in traditional technology ecosystems.&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/twitter.com\/BMBernstein\/status\/1022471212243578880\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/twitter.com\/BMBernstein\/status\/1022471212243578880\" data-v-f87c67ca=\"\">We are talking about crypto<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">currencies<\/em>, i.e. money<\/a>, after all — and many believe that value will accrue to the blockchain that first becomes a store of value and then a medium of exchange. While others argue that Ethereum can create&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.quora.com\/Why-does-Ether-Ethereum-have-value\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.quora.com\/Why-does-Ether-Ethereum-have-value\" data-v-f87c67ca=\"\">value via its utility<\/a>&nbsp;and also as a “reserve currency for crypto” if many of the world’s decentralized apps and services run on the protocol. Of course, there is much competition there as well, with 57 competitors and counting! However, many folks view&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/bravenewcoin.com\/news\/bitcoin-vs-ethereum-stacking-up-a-currency-against-a-supercomputer\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/bravenewcoin.com\/news\/bitcoin-vs-ethereum-stacking-up-a-currency-against-a-supercomputer\/\" data-v-f87c67ca=\"\">Ethereum as complementary to bitcoin<\/a>&nbsp;and other cryptocurrencies that aim to accrue value as sound money.","Whatever one’s long term belief in the value of $ETH as a cryptocurrency, it must be acknowledged that Ethereum’s strong and growing developer community position it today as the largest, most active and most stable decentralized computing platform. And Joe Lubin’s ConsenSys has played the leading role in securing Ethereum that lofty perch. Lubin and team have turned a converted warehouse in Brooklyn into the epicenter of the decentralized blockchain movement.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"$ETH","content":"MONEY"},{"type":"billions of dollars","content":"MONEY"},{"type":"$300","content":"MONEY"},{"type":"Ethereum Project","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"LOCATION"},{"type":"Lubin","content":"PERSON"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Integrated Development Environments","content":"ORGANIZATION"},{"type":"Jamaica","content":"LOCATION"},{"type":"Joe Lubin","content":"PERSON"},{"type":"Kingston","content":"LOCATION"},{"type":"Earth","content":"LOCATION"},{"type":"Enterprise","content":"ORGANIZATION"},{"type":"$850","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"ConsenSys Academy","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"October 2014","content":"DATE"},{"type":"January 2014","content":"DATE"},{"type":"February 2018","content":"DATE"},{"type":"$4B","content":"MONEY"},{"type":"Joe","content":"PERSON"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"$100M","content":"MONEY"},{"type":"$30B","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"Investopedia definition<\/a>&nbsp;of Ethereum","content":"ORGANIZATION"},{"type":"Brooklyn","content":"LOCATION"},{"type":"Academy","content":"ORGANIZATION"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Mike Dudas","The Block"]}