{"summary":"The New York state attorney general put out a call for crypto whistleblowers on Monday, after the crypto market was upended earlier this summer.\n\nState Attorney General Tish James is also urging investors who were “deceived by crypto platforms” to report their concerns to her office.","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160669\/new-york-ag-seeks-crypto-whistleblowers-and-deceived-investors","publishDate":"2022-08-01T14:47:46","id":770,"type":null,"title":"New York AG seeks crypto whistleblowers and &#x27;deceived&#x27; investors ","category":["Legal"],"content":["Crypto industry workers in New York who witnessed misconduct within their companies should file a whistleblower complaint, New York State Attorney General Tish James announced on Monday.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","James issued an “investor alert” urging those involved with crypto firms to contact her office if they have been impacted by recent chaos in the market, or if they witnessed improper behavior inside a crypto company.","“The recent turbulence and significant losses in the cryptocurrency market are concerning,” James said in a statement. “Investors were promised large returns on cryptocurrencies, but instead lost their hard-earned money. I urge any New Yorker who believes they were deceived by crypto platforms to contact my office, and I encourage workers in crypto companies who may have witnessed misconduct to file a whistleblower complaint.”","James’ call for whistleblowers comes as the crypto market sagged this summer. New Yorkers impacted by the Terra crash or by turmoil at Celsius, Voyager, and other firms to contact the office’s <a href=\"https:\/\/urldefense.com\/v3\/__https:\/lnks.gd\/l\/eyJhbGciOiJIUzI1NiJ9.eyJidWxsZXRpbl9saW5rX2lkIjoxMDQsInVyaSI6ImJwMjpjbGljayIsImJ1bGxldGluX2lkIjoiMjAyMjA2MDIuNTg4MDg5MTEiLCJ1cmwiOiJodHRwczovL2FnLm55Lmdvdi9pbnZlc3Rvci1wcm90ZWN0aW9uL3N1Ym1pdC1jb21wbGFpbnQifQ.s0lK6SHm1HeXi9y7WyIaQrBHvb0OKDzdp26Y-oT3xvE\/s\/947023778\/br\/132306269498-l__;!!Ke5ujdWW74OM!5YkbVGst5XxORbavio8GEUrLKKeYIKNNyhvWdLq_ORB9qL6-StuA4p15V9T0BxmJBpCSRT9P7-r9x7keI7XTmjfurb7BS73Meqz4BB__MkA$\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">investor protection bureau<\/span><\/a>. The state attorney general’s office also has an online <a href=\"https:\/\/ag.ny.gov\/whistleblower\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">whistleblower complaint portal<\/span><\/a>.","James has taken aim at crypto firms in the past. The attorney general settled with BlockFi for nearly $1 million in June, and directed unregistered crypto lending platforms to cease operations for not allegedly not fulfilling legal obligations last fall.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>"],"hashtag":[]}