{"summary":"DeFi project Strips Finance has raised $8.5 million to launch an exchange for trading interest rates on Ethereum scaling solution Arbitrum.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119621\/defi-project-strips-finance-funding-interest-rates-trading-platform","publishDate":"2021-10-06T10:00:30","id":7706,"type":null,"title":"DeFi project Strips Finance raises $8.5 million in new funding","category":["VENTURE CAPITAL"],"content":["Strips Finance, a decentralized finance (DeFi) project, has raised $8.5 million in a private token sale round.","Multicoin Capital led the round, with Sequoia Capital India, Fabric Ventures, and Morningstar Capital also participating. The fresh capital injection comes in three months after the project raised $2.5 million in a private token sale round in June, bringing its total funding to date to $11 million.","Strips Finance is working on launching a decentralized exchange to trade interest rates through a derivatives instrument called interest rate swaps. Interest rate swaps allow participants to swap variable interest rates for fixed interest rates.","\"Because swaps require little capital up front, they give traders a way to speculate on movements in interest rates without tying up capital,\" Ming Wu, founder of Strips Finance, told The Block. \"Traders simply select the interest rate they would like to trade and place a trade to go long or short.\"","The Strips exchange is being built on the Ethereum scaling solution Arbitrum, which uses optimistic rollups technology. The exchange is expected to launch next month.","Strips Finance says it is using a virtual automated market maker (vAMM) model instead of a standard AMM for its platform. A standard AMM-based exchange has two types of users: liquidity providers who provide tokens and traders who swap available tokens. In a vAMM model, liquidity providers are not required, said Wu, adding that users can trade based on collateral stored in a smart contract vault.","\"A major innovation that we have developed internally is the ability to stake LP [liquidity provider] tokens as collateral for a derivatives AMM,\" said Wu.","The project is also launching its native STRP token next week. Wu said users will have to provide \"Sushiswap STRP-USDC LP tokens\" in order to participate on the platform.","There are currently ten people working for Strips Finance, and Wu is planning to take the headcount to 20-30 in the near future to launch additional fixed-income products, he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ming Wu","content":"PERSON"},{"type":"USDC LP","content":"ORGANIZATION"},{"type":"$11 million","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"$2.5 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$8.5 million","content":"MONEY"},{"type":"Sequoia Capital India, Fabric Ventures","content":"ORGANIZATION"},{"type":"Strips Finance","content":"ORGANIZATION"},{"type":"Morningstar Capital","content":"ORGANIZATION"},{"type":"30","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}