{"summary":"South Korea proposed amendments that would mandate new executives at crypto firms to obtain regulatory approval before assuming duties.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275940\/south-korea-proposes-vetting-process-for-crypto-executives","publishDate":"2024-02-05T00:04:42","id":771,"type":null,"title":"South Korea proposes vetting process for crypto executives to strengthen oversight","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">The proposed amendments could give the local regulator more authority over the crypto sector.<\/span>","<span data-v-f87c67ca=\"\">Binance last week reportedly announced plans to reduce its stakes in local exchange Gopax to ease regulatory concerns.<\/span>","<span data-v-f87c67ca=\"\">South Korea’s Financial Services Commission (FSC) proposed new amendments on Monday that would mandate new executives at crypto companies to obtain regulatory approval before assuming duties, potentially giving the financial watchdog more authority over the local crypto sector.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The FSC <\/span><a href=\"https:\/\/www.moleg.go.kr\/lawinfo\/makingInfo.mo?lawSeq=76590&amp;lawCd=0&amp;&amp;lawType=TYPE5&amp;mid=a10104010000\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> in the announcement that it intends to “improve” pain points of the current law that oversees the local crypto industry. If enacted, new executives at South Korean crypto companies will not be able to start work until the FSC approves their personnel change applications, a requirement not currently detailed in the country’s law on the use and reporting of financial transaction information.<\/span>","<span data-v-f87c67ca=\"\">The amendments are set to undergo revision by the Ministry of Government Legislation and a voting process by the FSC, and are expected to enact at the end of March, according to local news outlet <\/span><a href=\"https:\/\/news.mt.co.kr\/mtview.php?no=2024020423442012484\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Money Today<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">The proposed amendments also seek to give the FSC the authority to suspend the review of a crypto company’s license registration if the company or its members are being investigated by local or international regulators.<\/span>","Such amendments would empower the FSC to revoke a company's registration if it violates the Act on Corporate Governance of Financial Companies by improperly electing an executive, according to the notice. This would effectively bar individuals — who have been sentenced to a fine or more severe penalties for any crime and have not yet completed five years since the execution of their sentence — from becoming executives at a crypto firm.","<span data-v-f87c67ca=\"\">Last week, Binance <\/span><span data-v-f87c67ca=\"\">reportedly said<\/span><span data-v-f87c67ca=\"\"> that it is <a href=\"https:\/\/www.theblock.co\/post\/275342\/binance-south-korea-gopax\" data-v-f87c67ca=\"\">exploring ways to reduce its stake<\/a> in South Korean exchange Gopax, where it currently serves as the largest shareholder, to address concerns from the FSC. The FSC has delayed approving Gopax’s structural change since Binance’s acquisition, possibly taking issue with Binance’s legal trouble in the U.S.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The FSC is soliciting public feedback on the proposed amendments until March 4. The regulator did not immediately respond to The Block’s request for further comment.<\/span>","<em data-v-f87c67ca=\"\">Update: Added more details from the notice<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"’s Financial Services Commission (FSC","content":"ORGANIZATION"},{"type":"South Korea","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"FSC","content":"ORGANIZATION"},{"type":"Money Today","content":"ORGANIZATION"},{"type":"South Korean exchange Gopax","content":"LOCATION"},{"type":"Ministry of Government Legislation","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"March 4","content":"DATE"},{"type":"Corporate Governance of Financial Companies","content":"ORGANIZATION"}],"hashtag":["ASIAN REGULATION"],"authors":["Danny Park","The Block"]}