{"summary":"Missteps in regulating the technology underlying staking ecosystems may have serious consequences, Coinbase Chief Legal Officer Paul Grewal argued.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210784\/coinbase-says-its-staking-services-are-not-securities","publishDate":"2023-02-10T17:48:25","id":7710,"type":null,"title":"Coinbase says its staking services are not securities","category":["COMPANIES"],"content":["Staking services fail to meet criteria laid out in the Howey Test, according to Coinbase Chief Legal Officer Paul Grewal.","Missteps in regulating the technology underlying staking ecosystems may have serious — and negative — consequences, including forcing U.S. consumers to less-regulated foreign platforms,&nbsp; Coinbase Chief Legal Officer Paul Grewal argued in a blog post.","Grewal was adamant that Coinbase's staking services are not securities. The post came one day after the Kraken exchange shut down its staking services in the U.S. in response to a Securities and Exchange Commission enforcement action.&nbsp;","“Given the importance of this technology, getting regulation wrong could do serious harm to the development of the crypto industry in the U.S.,” Grewal wrote. By presenting “aggressive mandates” and superimposing securities laws onto the staking ecosystem, regulators may “prevent U.S. consumers from accessing basic crypto services and push users to offshore, unregulated platforms,” he added.","“Staking is not a security under the U.S. Securities Act, nor under the Howey Test, which the SEC uses to determine whether an investment contract is a security,” said Grewal, adding that the topic of whether it should even be applied to crypto at all merits a separate discussion.","Since staking customers “retain full ownership of their assets at all times, as well as the right to 'unstake' those assets consistent with the underlying protocol,” the related services “do not constitute an investment of money, even under an expanded definition,” Grewal said.","Staking also fails to meet Howey’s criteria for common enterprise “because assets are staked on decentralized networks” and transactions are validated “through a community of users, not a common enterprise,” Grewal said. Nor do staking services meet the Howey Test's “reasonable expectation of profits,” he added.&nbsp;","Staking rewards are determined via protocol, not Coinbase. “Therefore, this does not meet the case law definition of common enterprise,” said Grewal.","“Finally, staking services do not pay rewards based on the ‘efforts of others,'\" Grewal said. “Service providers' staking services are not entrepreneurial, managerial, or a significant factor in whether customers receive staking rewards or the amount of rewards received.”","“These are IT services, not investment services,” he said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Howey","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Grewal","content":"PERSON"},{"type":"Paul Grewal","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}