{"summary":"BitGo confirmed to The Block that it has laid off 12% of its workforce.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/62276\/crypto-bitgo-layoffs-reorganization","publishDate":"2020-04-17T17:26:30","id":7716,"type":null,"title":"Crypto custody firm BitGo has laid off 12% of its workforce","category":["STARTUPS"],"content":["<strong data-v-f87c67ca=\"\">Quick Takes<\/strong>","Crypto custody provider BitGo has laid off 12% of its workforce, the firm said Friday.","According to sources, the layoffs spanned various business units, including marketing and sales. The layoffs are the latest to hit the cryptocurrency industry, as other firms have let staff go amid a challenging business environment.","Analytic firms Chainalysis, Elliptic, and CipherTrace<a href=\"https:\/\/www.theblockcrypto.com\/daily\/61411\/blockchain-analytics-chainalysis-elliptic-ciphertrace-coronavirus\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> have either laid off staff or cut salaries<\/a> because of the economic impact of the coronavirus pandemic, as The Block reported late last week.","A representative for BitGo confirmed the layoffs when reached for comment, telling The Block:","\"BitGo's evolution to become a digital asset financial services firm for the institutional market has accelerated with two acquisitions in the last quarter. As we move into new markets with new products and services, we are making changes to strengthen the business and reorganize our teams. We have made the difficult decision to let go of a small number of people totaling 12% of our workforce. It is never easy to make a decision like this and we have deep gratitude for the contributions and talent of those affected.\"","The layoffs at BitGo follow news yesterday that the firm acquired tax management platform <a href=\"https:\/\/www.theblockcrypto.com\/linked\/62099\/crypto-custodian-bitgo-acquires-portfolio-management-platform-lumina\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Lumina<\/a>. BitGo also recently acquired Harbor, the security token issuance platform. Harbor, Lumina, and BitGo share an investor in David Sacks, who leads venture capital firm Craft Ventures.","BitGo has been taking steps to grow beyond just serving as a custody platform. The firm announced the launch of a lending business <a href=\"https:\/\/www.theblockcrypto.com\/post\/57805\/as-crypto-credit-bubble-concerns-loom-bitgo-announces-launch-of-a-150-million-lending-business\" data-v-f87c67ca=\"\">earlier this year<\/a>.&nbsp;Last October, BitGo&nbsp;<a href=\"https:\/\/blog.bitgo.com\/announcing-bitgos-staking-services-and-acquisition-of-hedge-1b599c686d79\" data-v-f87c67ca=\"\">acquired<\/a>&nbsp;staking infrastructure provider Hedge. Sources say BitGo is moving in the direction of building out a full-scale prime broker, which would allow clients of its custody business to trade across markets.&nbsp;","Still, sources have questioned the viability of BitGo expanding into trading and lending as it would pin them against many of their wallet clients.&nbsp;","BitGo counts a number of investors as backers, including Goldman Sachs and Mike Novogratz's Galaxy. As reported by <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2018-10-18\/goldman-wades-deeper-in-crypto-betting-on-bitgo-with-novogratz\" data-v-f87c67ca=\"\">Bloomberg News<\/a>, the firms contributed&nbsp;around&nbsp;<span class=\"\" data-value=\"15000000\" data-original=\"$15 million\" data-symbol=\"$\" data-v-f87c67ca=\"\">$15 million<\/span>&nbsp;to BitGo’s 2018 Series B fundraise.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"David Sacks","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Craft Ventures","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"12%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"Lumina","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"Elliptic","content":"LOCATION"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"last quarter","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Bloomberg News","content":"ORGANIZATION"}],"hashtag":["LAYOFFS"],"authors":["Frank Chaparro","The Block"]}