{"summary":"LGND Music will include a collaboration with Dutch electronic music record label Spinnin&#x27; Records.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192422\/warner-music-group-and-polygon-team-up-on-virtual-vinyl-platform","publishDate":"2022-12-06T11:00:12","id":7718,"type":null,"title":"Warner Music Group and Polygon team up on virtual vinyl platform","category":["METAVERSE & NFT"],"content":["Polygon and Warner Music Group have teamed up with e-commerce platform LGND.io to roll out a multi-year web3 music program that will allow users to play digital vinyl on-the-go.&nbsp;","The platform, called LGND Music, will support digital collectibles from any blockchain even though it has Polygon as its main partner. The tie-up also includes a collaboration with Dutch electronic music record label Spinnin' Records, according to a company release.","Upon its launch in January, it will sell its own digital collectables, which will give customers access to special content and experiences from their favorite artists.","“We’ve been working for over a year to deliver the best-in-class blockchain experience for passionate music lovers all over the world, and look forward to innovative and unique content from all types of WMG artists,\" Michael Rockwell, CEO of LGND Music, said in a statement.","The new collaboration marks Warner Music Group's latest step into web3, following <a href=\"https:\/\/www.theblock.co\/post\/173729\/opensea-partners-with-warner-music-group-on-music-nft-drops\" data-v-f87c67ca=\"\">its arrangement<\/a> with marketplace giant OpenSea. The collaboration was set up to spearhead NFT drops for its artists. WMG also has moved to <a href=\"https:\/\/www.theblock.co\/post\/175070\/warner-music-group-is-hiring-a-metaverse-development-director\" data-v-f87c67ca=\"\">build out<\/a> its metaverse partnerships teams in recent months.&nbsp;","“We are incredibly excited about the ways in which evolving technologies are changing and challenging the music industry,\" said Oana Ruxandra, chief digital officer and EVP of business development at WMG. \"There is tremendous untapped potential for artists to interact with their fans and to monetize that fandom.\"","Polygon is fast becoming the blockchain mega corporations turn to to expand their crypto presence. Reddit chose the chain for its own set of <a href=\"https:\/\/www.theblock.co\/post\/191984\/reddit-digital-collectible-minting-hits-all-time-high\" data-v-f87c67ca=\"\">collectable avatars,<\/a> Meta's Instagram tapped it for its upcoming <a href=\"https:\/\/www.theblock.co\/post\/182451\/instagram-to-support-polygon-powered-nft-marketplace\" data-v-f87c67ca=\"\">NFT marketplace<\/a> and Starbucks used it for its <a href=\"https:\/\/www.theblock.co\/post\/169195\/polygon-chosen-for-starbucks-web3-odyssey\" data-v-f87c67ca=\"\">web3 loyalty product<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Oana Ruxandra","content":"PERSON"},{"type":"Michael Rockwell","content":"PERSON"},{"type":"LGND Music","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Spinnin","content":"PERSON"},{"type":"WMG","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"Warner Music Group","content":"ORGANIZATION"},{"type":"Meta","content":"PERSON"}],"hashtag":["ONBOARDING"],"authors":["Lucy Harley-McKeown","The Block"]}