{"summary":"Bored Ape Yacht Club is a NFT project that has been rapidly growing in popularity.\nIt has now donated $850,000 in cryptocurrency to Orangutan Outreach.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/114030\/nft-project-bored-ape-yacht-club-has-donated-850000-to-an-orangutan-charity","publishDate":"2021-08-10T14:34:39","id":772,"type":null,"title":"NFT project Bored Ape Yacht Club has donated $850,000 to an orangutan charity","category":["NFTs"],"content":["An ape-themed NFT project called Bored Ape Yacht Club has <a href=\"https:\/\/twitter.com\/BoredApeYC\/status\/1424825734565146625\" data-v-f87c67ca=\"\">donated<\/a> 66.45 ETH ($208,000) to an orangutan charity called Orangutan Outreach today. This puts their total donations to the charity at $850,000 at current prices.","The donation was made with an Ethereum transaction, organized through crypto donation platform The Giving Block. This platform enables anyone to make a direct cryptocurrency payment to a range of supported charities.","Founded in 2007, Orangutan Outreach is a New York-based non-profit focused on protecting orangutans in Borneo and Sumatra.","Bored Ape Yacht Club is a collection of NFTs featuring a range of — you guessed it — bored apes. But NFT owners get some other privileges including the ability to draw pixels on a shared digital canvas. (They do this by signing in with their Ethereum wallets, proving that they own the NFT in question — a decentralized replacement to signing in with Facebook or Google.)","The NFT collection was launched on April 23 but it took until May 1 to sell out. The cost of minting each ape was 0.08 ETH, worth around $220 each at the time. With 10,000 NFTs that means the project netted around $2.2 million.","Bored Ape Yacht Club swiftly took hold, with many crypto members changing their Twitter profile pictures to show off their own bored apes. With this interest, prices for these NFTs rocketed up with the current floor price (meaning the lowest prices the NFTs are currently being sold for) now above 15 ETH ($47,000).","The group <a href=\"https:\/\/twitter.com\/BoredApeYC\/status\/1410309505431257091\/photo\/1\" data-v-f87c67ca=\"\">previously donated<\/a> 135 ETH ($419,000) to a range of animal charities on June 30, including a 33.75 ETH ($100,000) donation to Orangutan Outreach at the time. Other charities included Friends of Bonobos (bonobos being a type of great ape) and Wright-Way Rescue, which rescues pets.","On July 9, it donated 11.5 ETH ($36,000) via The Giving Block, including 5.75 ETH ($18,000) to Orangutan Outreach. And on July 28, it gave 169 ETH ($524,000) to the same cause.","To put this in context, members of the crypto community jokingly refer to themselves as \"apes,\" in reference to the idea of \"aping into\" a hot new project or NFT collection. (Hence why FTX CEO Sam Bankman-Fried <a href=\"https:\/\/www.wsj.com\/amp\/articles\/this-vegan-billionaire-disrupted-the-crypto-markets-stocks-may-be-next-11618565408\" data-v-f87c67ca=\"\">has an \"APE SZN\" sign<\/a> next to his desk, standing for \"ape season.\")"],"hashtag":[]}