{"summary":"A growing percentage of bitcoin is being locked up and used on the Ethereum blockchain, through various tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107540\/1-3-of-bitcoins-supply-has-now-been-wrapped-onto-ethereum","publishDate":"2021-06-08T05:14:43","id":7727,"type":null,"title":"1.3% of Bitcoin’s supply has now been wrapped onto Ethereum","category":["ETHEREUM"],"content":["A considerable percentage of Bitcoin’s circulating supply has now been locked up to be utilized on the Ethereum blockchain.&nbsp;","According to <a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/asset-management\" data-v-f87c67ca=\"\">The Block’s Data Dashboard<\/a>, 240,000 bitcoin has now been wrapped onto Ethereum. This represents 1.3% of its current circulating supply (and 1.1% of Bitcoin’s eventual total supply).&nbsp;","The amount of tokenized bitcoin has increased by 100,000 BTC since the start of the year and has been growing at a rapid clip.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/asset-management\/btc-on-ethereum-daily\/embed\" title=\"BTC on Ethereum\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The tokenization process works by locking up an amount of bitcoin and issuing an equivalent number of tokens on Ethereum. The bitcoin-backed tokens are pegged to bitcoin’s price but can also be used on DeFi platforms and in other protocols. To reverse the process, the tokens are destroyed and the bitcoin released.","The majority of the tokens have been turned into <a href=\"https:\/\/www.theblockcrypto.com\/post\/9617\/bitgos-wrapped-bitcoin-has-launched-and-now-the-firm-is-eyeing-new-tokenization-opportunities\" data-v-f87c67ca=\"\">wrapped bitcoin<\/a> (WBTC). WBTC accounts for 80% of the tokens wrapped onto Ethereum, and these tokens alone represent 1% of Bitcoin’s circulating supply.","Other tokenized versions of bitcoin include HBTC, renBTC, imBTC, sBTC and tBTC. HBTC is crypto exchange Huobi’s version of tokenized bitcoin. The other four are run through protocols that enable users to transfer to their versions of tokenized bitcoin and back again.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"The Block’s Data Dashboard","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"1.3%","content":"PERCENT"},{"type":"1%","content":"PERCENT"},{"type":"1.1%","content":"PERCENT"}],"hashtag":["BITCOIN","ETHEREUM","TOKENS"],"authors":["Tim Copeland","The Block"]}