{"summary":"Stephan Lutz, acting CEO of 100x Group, thinks crypto exchanges should by now have phased out internal market making teams.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235881\/crypto-exchanges-market-makers-bitmex","publishDate":"2023-06-22T03:56:39","id":7731,"type":null,"title":"Crypto exchanges should phase out internal market makers, says BitMEX boss","category":["COMPANIES"],"content":["Who better to weigh in on alleged trading desk shenanigans at Crypto.com than BitMEX, the derivatives exchange that <a href=\"https:\/\/www.singlelunch.com\/wp-content\/uploads\/2021\/07\/BitMEX-BMA-Second-Amend.-Consolidated-Complaint-June-5-2021-As-Filed-1.pdf\" data-v-f87c67ca=\"\">faced similar accusations<\/a> — which it denied — several years ago?","Stephan Lutz, CEO and group CFO at BitMEX’s parent company, 100x Group, thinks crypto exchanges that make money from proprietary trading should by now have phased out internal market making teams.","“It’s not needed anymore,” Lutz said in an interview. “You have critical mass.”","“You have enough HFTs (High Frequency Traders) out there and prop shops that can perform that function,” he added, referring to the job of liquidity providers plugging gaps in the market when there aren’t enough buyers or sellers.","The Financial Times <a href=\"https:\/\/www.ft.com\/content\/b5d2bf4b-225c-4f30-9f1c-cbe8dc762fa8\" data-v-f87c67ca=\"\">reported earlier this week<\/a> that Singapore-based Crypto.com, the exchange, runs internal proprietary trading and market making teams that trade tokens for a profit, raising concerns about potential conflicts of interest. Crypto.com told the FT that the teams in question are treated the same as any other third party and exist to facilitate tight spreads and efficient markets on its platform.","“Crypto.com’s main business is serving as a counterparty for purchases and sales of cryptocurrency to 80 million retail users via our mobile application. As such, the Crypto.com trading team ensures that Crypto.com is risk neutral by hedging these positions on a number of venues, including the Crypto.com Exchange. Crypto.com does not rely on proprietary trading as a source of revenue,” said a Crypto.com spokesperson.","BitMEX, at one time the world’s largest crypto derivatives exchange, employs internal traders too. They work for a separate legal entity named Arrakis Capital that was at one time a major internal market maker for the BitMEX exchange. Today, Arrakis plays a far more limited role, which Lutz describes as that of a “treasury desk.”","It’s a transition he sees as natural for crypto exchanges in a market with more mature companies and a greater number of institutional liquidity providers.","With just a handful of staff, Arrakis is both “technologically” and “organizationally” separated from BitMEX, according to Lutz.","It currently performs a narrow range of functions, including converting commission fees earned in bitcoin into fiat currency in order to pay salaries and rent; hedging BitMEX’s exposure to tokens held as inventory for the purpose of quoting prices on its platform, via BitMEX itself, as well as on rival exchanges; and making markets for BitMEX’s token BMEX, which <a href=\"https:\/\/www.theblock.co\/post\/184038\/bitmex-to-launch-trading-of-its-bmex-token-on-friday\" data-v-f87c67ca=\"\">launched in November last year<\/a>, because the token has too little liquidity for external market makers to take on.","Asked whether the desk makes money, Lutz said it earns “very minor returns” of up to $100,000 a month from holding T-Bills. Last year, it lost money.&nbsp;","Arrakis wasn’t always so constrained, however.","“Arrakis stopped basically market making on a broader scale in 2020,” said Lutz.&nbsp;In BitMEX’s heyday, before the business and its founders were rocked by charges that they had operated an unregistered trading platform brought by the U.S. Department of Justice and Commodities Futures Trading Commission, things were different.","As the chart below shows, BitMEX once dominated the crypto futures market. Of the $183.63 billion in bitcoin futures trading volume recorded in July 2019, BitMEX accounted for a staggering $143.9 billion. The platform clocked just $15 billion of a far larger bitcoin futures market in May this year.","It was around that time and earlier that BitMEX faced accusations that the company traded against its customers. Former CEO Arthur Hayes and economist Nouriel Roubini <a href=\"https:\/\/twitter.com\/Nouriel\/status\/1051144538432200705?s=20\" data-v-f87c67ca=\"\">exchanged barbs<\/a> on the subject over Twitter. It was the stuff of <a href=\"https:\/\/twitter.com\/ppogodin\/status\/1424822815115599877?s=20\" data-v-f87c67ca=\"\">memes<\/a>. Lutz didn’t join the business until 2021, but said he’s dug through the data and is satisfied the trading desk was always segregated.","“Arrakis for a while — which is long gone already — but for a while was pretty big because they were providing market making services to the platform,” Lutz said, adding that designated market makers like Jump Crypto, Jane Street and Hudson River Trading weren’t around back then. “All the other exchanges did it, maybe not the same way, but it was basically the market practice. If you wanted to have reliable liquidity in your order book, you needed to do something yourself. There was no service provider.”","Recently, regulatory pressure has pushed certain market making firms, <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-05-09\/jane-street-jump-pull-back-crypto-trading-amid-us-crackdown\" data-v-f87c67ca=\"\">including Jump and Jane Street<\/a>, offshore.","BitMEX weighed a rebuild of Arrakis as recently as mid-2022, before the drama of Sam Bankman-Fried’s Alameda Research and FTX that engulfed the sector. The tech team at Arrakis were eager to re-enter the market making game, but after some testing BitMEX’s founders and management ultimately decided against it, according to Lutz. &nbsp;","Lutz said that exchanges with trading teams have drawn more scrutiny since the fall of FTX last year.","But he points out that most if not all large companies employ traders as part of a treasury function. There is a distinction to be drawn, he feels, between that setup and internal teams that operate more like a hedge fund, <a href=\"https:\/\/www.cnbc.com\/2022\/11\/13\/sam-bankman-frieds-alameda-quietly-used-ftx-customer-funds-without-raising-alarm-bells-say-sources.html\" data-v-f87c67ca=\"\">as Alameda allegedly did<\/a>.","But how do draw it? Lutz identified several red flags.","“Is there a separation of client funds and house funds? Number one. Second one is do you have access to data?” he said. “Do you have access to the positions and the positioning and the strategy of clients that enable you then to front-run? And the third one is are you big enough to move the markets on your own exchange?”","Another key factor in separating Alameda-like operations from more benign internal trading teams, according to Lutz, is fee structure. Exchanges charging little to no transaction fees could also be seen as a red flag, signaling that their role is primarily to attract trading flow for a market maker.","“Where does the economic interest sit?” Lutz said. “Where is the money to be earned?”","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/volume-of-bitcoin-futures-monthly\/embed\" title=\"Volume of Bitcoin Futures\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<em data-v-f87c67ca=\"\">This article has been updated to include a comment from Crypto.com.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Stephan Lutz","content":"PERSON"},{"type":"100x Group","content":"ORGANIZATION"},{"type":"U.S. Department of Justice and Commodities Futures Trading Commission","content":"ORGANIZATION"},{"type":"Lutz","content":"PERSON"},{"type":"May this year","content":"DATE"},{"type":"Jane Street","content":"PERSON"},{"type":"November last year","content":"DATE"},{"type":"$183.63 billion","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"July 2019","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Fried’s Alameda Research","content":"ORGANIZATION"},{"type":"Hudson River Trading","content":"LOCATION"},{"type":"Twitter","content":"LOCATION"},{"type":"$143.9 billion","content":"MONEY"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"$100,000","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"$15 billion","content":"MONEY"},{"type":"Nouriel Roubini","content":"ORGANIZATION"},{"type":"2020","content":"DATE"}],"hashtag":["BITMEX"],"authors":["Ryan Weeks","The Block"]}