{"summary":"Aave Companies has proposed launching the decentralized stablecoin GHO as an ERC-20 token on the Ethereum mainnet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238838\/aave-gho-stablecoin-ethereum-launch","publishDate":"2023-07-11T06:38:12","id":7737,"type":null,"title":"Aave set to vote on launching GHO stablecoin on Ethereum mainnet","category":["GOVERNANCE"],"content":["Aave Companies, a key contributor to the Aave DeFi lending protocol, has proposed launching the decentralized stablecoin GHO as an ERC-20 token on the Ethereum mainnet.","The proposal seeks to introduce GHO through Facilitators, allowing users of Aave version 3 (V3) to mint GHO against their collateral, according to the <a href=\"https:\/\/app.aave.com\/governance\/proposal\/?proposalId=268\" data-v-f87c67ca=\"\">Aave Improvement Proposal<\/a>.","Stablecoin borrowing on Aave would become more competitive and generate additional revenue for the DAO if the proposal is approved implemented, Aave Companies said. “If approved, the introduction of GHO would make stablecoin borrowing on the Aave Protocol more competitive and generate additional revenue for the Aave DAO by providing to the DAO treasury 100% of the interest payments made on GHO borrows,” it wrote.","The Aave DAO will also have the ability to adjust GHO's interest rate through decentralized governance.","The proposal is currently pending, with voting set to commence later today until July 14. The proposed launch follows extensive community discussions through multiple phases of governance and months of <a href=\"https:\/\/www.theblock.co\/post\/210092\/aaves-gho-stablecoin-goes-live-on-ethereums-goerli-testnet\" data-v-f87c67ca=\"\">testing<\/a> on Ethereum's Goerli testnet.","Facilitators are used to generate and burn GHO tokens, with the proposal combining two previously approved Facilitators: the Aave V3 Ethereum Pool Facilitator and the FlashMinter Facilitator.","The Aave V3 Ethereum Pool Facilitator will allow users to borrow GHO using collateral deposited in the V3 Ethereum mainnet pool. The FlashMinter Facilitator enables users to flash mint GHO without collateral, providing it is repaid in a single transaction, enhancing GHO's ability to maintain its peg through efficient arbitrage.","The proposal includes a plan to use Staked Aave (stkAAVE) tokens as a mechanism to reduce the borrowing cost for GHO stablecoin users. stkAAVE represents a staked version of the Aave token.","Aave Companies is also considering a <a href=\"https:\/\/www.theblock.co\/post\/233419\/aave-companies-gho-stablecoin-proposal-ethereum\" data-v-f87c67ca=\"\">multi-chain strategy<\/a> following the proposed GHO launch on Ethereum.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"100%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"July 14","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Aave Improvement Proposal","content":"ORGANIZATION"},{"type":"Aave Companies","content":"ORGANIZATION"},{"type":"GHO","content":"ORGANIZATION"},{"type":"20","content":"DATE"}],"hashtag":["AAVE","ETHEREUM","GOVERNANCE VOTES"],"authors":["James Hunt","The Block"]}