{"summary":"The total value locked in Solana’s liquid staking protocols, such as Marinade, Lido, and Jito, has surged by 91% year-to-date.\nMarinade Finance is leading the liquid staking niche on Solana with a 62% market share, followed by Lido with a 27% market share.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237686\/value-locked-in-solanas-liquid-staking-protocols-surged-by-91-in-h1","publishDate":"2023-07-04T08:37:29","id":774,"type":null,"title":"Value locked in Solana&#x27;s liquid staking protocols surged by 91% in H1","category":["Crypto Ecosystems"],"content":["The Solana ecosystem has recorded an increase in the value of assets staked into liquid staking protocols, marking a 91% rise year-to-date.","By the end of June, a combination of liquid staking protocols, including Marinade Finance, Lido, Jito, JPool, and Socean, had cumulatively held <a href=\"https:\/\/www.theblock.pro\/research\/layer-by-layer-solana-ecosystem-carries-on-through-regulatory-pressure-237358\" data-v-f87c67ca=\"\">$187 million<\/a> in staked Solana (SOL) tokens, according to The Block Research. This represents a substantial growth from the initial $98 million staked at the beginning of the year. Currently, these protocols constitute 69% of the total value locked within the network, estimated to be around <a href=\"https:\/\/defillama.com\/chain\/Solana\" data-v-f87c67ca=\"\">$270 million<\/a>.","Kevin Peng, a research analyst at The Block, suggests that the rise in inflows into Liquid Staking Derivatives (LSDs) within the Solana ecosystem could be a result of the considerable growth seen in this niche across the broader crypto space. Specifically, the liquid staking <a href=\"https:\/\/www.theblock.co\/post\/226879\/lido-deposits-surpass-12-billion-as-ethereums-shapella-boosts-liquid-staking\" data-v-f87c67ca=\"\">growth<\/a> on Ethereum following the Shapella upgrade may have spurred a ripple effect that extended to Solana.","“Overall, LSDs have grown as a category across crypto in 2023 in large part due to the new <a href=\"https:\/\/www.theblock.pro\/research\/layer-by-layer-state-of-the-ethereum-ecosystem-after-shapella-231287\" data-v-f87c67ca=\"\">dynamics<\/a> around staking on Ethereum, though demand for these products has trickled into the Solana ecosystem as well,” Peng wrote.","So far this year, about 1.66 million SOL, equating to $31 million, has been deposited into LSD protocols, which shows that increased inflows are partly responsible for the jump in liquid staking TVL. Another key factor propelling this trend is the increase in the price of Solana’s native token, SOL, which has soared by about 60%. This price appreciation has contributed to enhancing the value of SOL deposits in liquid staking.&nbsp;","<a href=\"https:\/\/www.theblock.co\/post\/205374\/marinade-finance-announces-rewards-to-boost-liquid-staking-on-solana\" data-v-f87c67ca=\"\">Marinade Finance<\/a> has continued to dominate as the leading liquid staking project within the Solana ecosystem, boasting a formidable 62% market share and hosting approximately <a href=\"https:\/\/defillama.com\/protocol\/marinade-finance\" data-v-f87c67ca=\"\">$120 million<\/a> in total value locked (TVL), per The Block Research. Lido Finance, while leading the Ethereum ecosystem as its largest liquid staking protocol, only claims a 27% market share within Solana’s sphere.","<a href=\"https:\/\/www.theblock.pro\/news\/post\/222207\/jito-labs-client-software-for-solana-now-manages-16-of-validator-stakes\" data-v-f87c67ca=\"\">Jito Labs<\/a>, which operates a client software on the Solana network, has made a breakthrough in liquid staking as well. Utilizing its staking product, the project has managed to increase its share in liquid staking from 1.9% to 6.9% year-to-date."],"hashtag":["SOLANA"]}