{"summary":"Horizen will discontinue support for shielded transactions on its mainnet, to stop its native token Zen being labelled as a privacy coin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236861\/grayscale-backed-horizen-to-change-blockchain-to-drop-privacy-coin-label","publishDate":"2023-06-28T06:47:57","id":7745,"type":null,"title":"Grayscale-backed Horizen to change blockchain to drop &#x27;privacy coin&#x27; label","category":["CRYPTO ECOSYSTEMS"],"content":["Horizen, a blockchain backed by Digital Currency Group (DCG) subsidiary Grayscale Investments, said it would remove support for shielded transactions on its mainnet in an effort to alter the status of its native cryptocurrency, Zen (previously ZenCash), from a privacy coin to a more general digital asset.","This change is slated to take effect with the mandatory software upgrade, Zen 4.1, scheduled for release on the mainnet in September 2023.","Horizen’s shift away from privacy features on its main chain is outlined in the recently approved <a href=\"https:\/\/github.com\/HorizenOfficial\/ZenIPs\/commit\/4b34d67914d3cf76eb773a9d43949fae23f32f60\" data-v-f87c67ca=\"\">ZenIP 42204<\/a>. This proposal targets the elimination of support for shielding — a process transforming transactions from transparent addresses to shielded addresses — at the consensus level, which includes the mempool and blocks.","The Horizen team emphasized that this change signifies its intention to alter the status of Horizen’s native asset. “ZEN will no longer be considered a privacy coin after the deprecation of the mainchain shielded pools. We are actively working with our exchange partners to keep ZEN accessible for our global users,” the team <a href=\"https:\/\/twitter.com\/horizenglobal\/status\/1673822809431179265\" data-v-f87c67ca=\"\">said<\/a>.","This decision came in response to a global trend in which many privacy-focused cryptocurrencies are facing regulatory scrutiny and being excluded from major exchanges. In September 2022, Huobi Global <a href=\"https:\/\/decrypt.co\/109513\/crypto-exchange-huobi-delist-7-privacy-coins-citing-latest-financial-regulations\" data-v-f87c67ca=\"\">announced<\/a> it was delisting multiple privacy assets, Zen being among them. Just last month, Binance <a href=\"https:\/\/www.theblock.co\/post\/232751\/binance-privacy-coins-delisting-europe\" data-v-f87c67ca=\"\">indicated<\/a> it was planning to remove privacy-focused cryptocurrencies, including Zen, from its markets in certain European countries, but later partially <a href=\"https:\/\/www.theblock.co\/post\/236340\/binance-privacy-coins\" data-v-f87c67ca=\"\">reversed<\/a> this decision. Furthermore, in regions like South Korea, trading of privacy coins on exchanges is already prohibited.","By removing the privacy features, the goal is to make Zen an asset that can be listed on a wider range of exchanges.","Zen is employed to reward network participants, cover transaction fees, and act as a stake for running a node within the Horizen ecosystem.","The project is backed by Grayscale, a digital currency firm that provides investors with exposure to digital currencies, such as Bitcoin and Ethereum, through traditional investment vehicles. Grayscale offers a product called <a href=\"https:\/\/grayscale.com\/products\/grayscale-horizen-trust\/\" data-v-f87c67ca=\"\">Grayscale Horizen Trust<\/a> for investors interested in Horizen.","Notably, Horizen’s privacy strategy is not completely waning. The focus will be shifting away from privacy transactions on its main chain. At the same time, the network plans to use a sidechain that will support privacy features.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"Huobi Global","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"Horizen","content":"PERSON"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"Horizen","content":"LOCATION"},{"type":"Grayscale Horizen Trust","content":"ORGANIZATION"},{"type":"September 2022","content":"DATE"},{"type":"September 2023","content":"DATE"},{"type":"last month","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}