{"summary":"he Bahamian regulator said it &quot;took the action of directing the transfer of all digital assets of FTX Digital Markets to a digital wallet controlled by the Commission&quot; on Nov. 12.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188239\/bahamas-seized-ftx-digital-markets-assets-on-nov-12-regulator-now-says","publishDate":"2022-11-17T20:11:56","id":7746,"type":null,"title":"Bahamas seized FTX Digital Markets&#x27; assets on Nov. 12, regulator now says","category":["LEGAL"],"content":["The Securities Commission of the Bahamas on Nov. 12 transferred FTX Digital Markets' assets to a digital wallet it controls, the regulator said on <a href=\"https:\/\/twitter.com\/SCBgov_bs\/status\/1593395137786171393?s=20&amp;t=TcYoPg62JGr-3-abediEmw\" data-v-f87c67ca=\"\">Twitter<\/a> Nov. 17, further complicating a legal struggle between the company and disgraced former CEO Sam Bankman-Fried.&nbsp;&nbsp;","The Bahamian regulator, in a 7 p.m. press release, said it, \"took the action of directing the transfer of all digital assets of FTX Digital Markets to a digital wallet controlled by the Commission,\" on Nov. 12. Assets began mysteriously moving out of FTX accounts late on Nov. 11, with the company itself appearing unsure of what was going on. \"Urgent interim regulatory action was necessary to protect the interests of clients and creditors of [FTX DM],\" the Securities Commission's release continues.&nbsp;","The Bahamian regulator did not answer a call placed to its contact number shortly after the release.&nbsp;","FTX DM <a href=\"https:\/\/www.theblock.co\/post\/187481\/ftxs-bahamas-unit-files-for-chapter-15-bankruptcy-protection\" data-v-f87c67ca=\"\">filed<\/a> for Chapter 15 bankruptcy protection — a <a href=\"https:\/\/www.theblock.co\/post\/187099\/bahamas-approves-provisional-liquidators-for-ftx-assets?utm_source=policy&amp;utm_medium=rss\" data-v-f87c67ca=\"\">relief<\/a> available to companies that operate mainly outside the U.S. — on Nov. 15 in the U.S. Bankruptcy Court for the Southern District of New York. FTX, Alameda, and more than 100 related entities sought Chapter 11 bankruptcy protection on Nov. 11 in federal bankruptcy court in Delaware.&nbsp;","But in a filing today, FTX's lawyers called the Chapter 15 filing — and the choice of the Southern District of New York —\"distressing\" while a Chapter 11 case <a href=\"https:\/\/www.theblock.co\/post\/188187\/the-ftx-bankruptcy-filings-are-a-doozy-we-bring-you-the-highlights\" data-v-f87c67ca=\"\">unfolds<\/a> in Delaware.&nbsp; &nbsp;","\"The filing of the Chapter 15 Case without advance notice and in the SDNY is a blatant attempt to avoid the supervision of this Court and to keep FTX DM isolated from the administration of the rest of the Debtors, which constitute the vast majority of the remainder of the FTX group,\" FTX's filing said. \"Under normal circumstances, that would be inappropriate and grounds for transfer to this Court. But these are not normal circumstances.\"","According to bankruptcy attorneys hired by the embattled company last week, Bankman-Fried is attempting to hamstring the U.S. Chapter 11 case by tying assets up in the Bahamas. \"Mr. Bankman-Fried, the co-founder, and controlling owner of all of the Debtors and of FTX DM, appears to be supporting efforts ... to expand the scope of the FTX DM proceeding in the Bahamas, to undermine these Chapter 11 Cases, and to move assets from the Debtors to accounts in the Bahamas under the control of the Bahamian government,\" the filing said.&nbsp;","\"In verified messages posted through Twitter, Mr. Bankman-Fried just yesterday expressed profane disdain for regulators, his regrets at these Chapter 11 Cases having been filed, and disclosed his goal that 'we win a jurisdictional battle vs. Delaware' to have any proceedings occur in the Bahamas.\"","The emergency filing continues: \"The Debtors thus have credible evidence that the Bahamian government is responsible for directing unauthorized access to the Debtors’ systems for the purpose of obtaining digital assets of the Debtors — that took place after the commencement of these cases.\"","The Bahamas' securities regulator shrugged off these concerns in its statement. \"It is not the understanding of the Commission that [FTX DM] is a party to the U.S. Chapter 11 bankruptcy proceedings,\" the Securities Commission said.&nbsp;","\"The Commission will engage with other regulators and authorities, in multiple jurisdictions, to address matters affecting the creditors, clients and shareholders of [FTX DM] globally to obtain the best possible outcome.\"","<em data-v-f87c67ca=\"\">Update: Additional quotes added from FTX's emergency filing.<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Nov. 17","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Delaware","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"7 p.m.","content":"TIME"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Securities Commission","content":"ORGANIZATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Southern District of New York —","content":"ORGANIZATION"},{"type":"SDNY","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"Nov. 12","content":"DATE"},{"type":"Nov. 11","content":"DATE"},{"type":"FTX Digital Markets","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"},{"type":"Nov. 15","content":"DATE"}],"hashtag":["COURT HEARINGS","FTX"],"authors":["Madhu Unnikrishnan","The Block"]}