{"summary":"Investment bank TD Cowen anticipates that the SEC will not approve a spot Ethereum ETF until late 2025 or early 2026.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274853\/spot-ethereum-etf-approval-2025-2026-td-cowen","publishDate":"2024-01-29T09:27:11","id":7748,"type":null,"title":"Spot Ethereum ETF approval &#x27;unlikely until late 2025 or early 2026,&#x27; says TD Cowen","category":["FUNDS"],"content":["<span data-v-f87c67ca=\"\">Investment bank TD Cowen has provided a clearer timeline for when it thinks a spot <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.40%\n    <\/span><\/a> <!----><\/span><\/span> exchange-traded fund will be approved in the United States — late 2025 or early 2026. Earlier this month, the bank <\/span><a href=\"https:\/\/www.theblock.co\/post\/272514\/sec-spot-ethereum-etf-td-cowen\" data-v-f87c67ca=\"\">said<\/a> the approval could come after the November 2024 election.","\"We do not expect the SEC in 2024 to approve a spot Ethereum ETF,\" TD Cowen Washington Research Group, led by Jaret Seiberg, wrote in a note on Monday. \"This is a political call. We believe there is no upside for SEC Chair Gary Gensler to approve a spot Ethereum ETF given how upset progressive Democrats were over the agency's approval of a spot bitcoin ETF earlier this month.\"","Gensler needs the support of progressives to push forward his agenda in this election year, according to TD Cowen. Also, if Gensler pursues a different role, such as Treasury secretary, in the event of President Joe Biden winning a second term, he will still need the backing of progressives, the bank said.","So, \"there is no reason to provoke a needless fight,\" TD Cowen said. \"We say needless, as our view remains that Gensler is in no hurry to approve an Ethereum ETF as he would first like more experience with the performance of the recently approved spot Bitcoin ETFs. This is consistent with his broader approach to crypto, which is to move incrementally and slowly when it comes to providing regulatory approvals or clarity.\"","More than half a dozen companies, including BlackRock and Fidelity, have applied for a spot Ethereum ETF. Last week, the SEC <a href=\"https:\/\/www.theblock.co\/post\/274547\/sec-delays-decision-on-grayscales-proposal-for-spot-ethereum-etf-again-with-order-to-institute-proceedings-and-seek-public-comment\" data-v-f87c67ca=\"\">again postponed<\/a> its decision on Grayscale Investments' proposal for a spot Ethereum ETF, following delays on other applications earlier this month.","The SEC can take its time reviewing spot Ethereum ETF applications, according to TD Cowen. \"It can eventually reject the rule change, which either will lead to a new application or litigation. Either will take another year or two to play out,\" the bank said.","The expected late 2025 or early 2026 approval deadline is possible even if Congress fails to enact broader crypto market structure legislation in 2025, TD Cowen said. Gensler's term ends in June 2026.","Crypto <a href=\"https:\/\/www.theblock.co\/post\/274312\/crypto-experts-predict-whether-a-spot-ethereum-etf-will-get-approved-in-2024\" data-v-f87c67ca=\"\">experts<\/a> have been both optimistic and pessimistic that a spot ether ETF approval is on the horizon. Some think such an approval could come as early as May — the initial deadline for approving such funds.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Joe Biden","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Ethereum ETF","content":"ORGANIZATION"},{"type":"2025","content":"DATE"},{"type":"2026","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"November 2024","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"TD Cowen Washington Research Group","content":"ORGANIZATION"},{"type":"TD Cowen","content":"ORGANIZATION"},{"type":"-0.40%","content":"PERCENT"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"June 2026","content":"DATE"},{"type":"Jaret Seiberg","content":"PERSON"}],"hashtag":["ETHEREUM","INVESTMENT FIRMS","SPOT BITCOIN ETF","SPOT ETHEREUM ETF","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}