{"summary":"As the clock ticks on the current Congress, Democrats have become increasingly vocal about pushing forward on a digital dollar.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154972\/congressional-democrats-plot-path-forward-on-digital-dollar-while-they-have-the-majority","publishDate":"2022-06-29T19:50:12","id":7755,"type":null,"title":"Congressional Democrats plot path forward on digital dollar while they have the majority","category":["CONGRESS"],"content":["As the clock ticks on the current Congress, Democrats have become increasingly vocal about pushing forward on a digital dollar.","A proposal from <a href=\"https:\/\/www.theblock.co\/linked\/153602\/congressman-jim-himes-puts-out-white-paper-for-digital-dollar\" data-v-f87c67ca=\"\">Congressman Jim Himes last week<\/a> is thus far the most concrete effort to do so — establishing core principles and parameters for a CBDC.","That proposal remains, however, a white paper rather than a bill. As Himes described it to The Block, “We put a marker down in terms of general objectives.”","Himes sits on the House Financial Services Committee, chairing the subcommittee on National Security, International Development, and Monetary Policy. The approval of full committee chair Maxine Waters will be critical to the current proposal.","“Depending on what her plans are, we might start writing authorizing legislation in this Congress. I mean, we can’t wait forever,” Himes said.","For her part, Waters indicated at least general support for a CBDC at a <a href=\"https:\/\/financialservices.house.gov\/events\/eventsingle.aspx?EventID=409519\" data-v-f87c67ca=\"\">hearing<\/a> with Fed Chair Jerome Powell the next day. “Now more than ever, the Federal Reserve must work with other regulators to properly oversee the cryptocurrency market and provide guidance on a more stable alternative to volatile cryptocurrencies,” Waters said, concluding her opening remarks.","The prospect of Himes’ proposal passing into law this Congress is highly unlikely given the current legislative calendar. However, if the Democrats’ vision can woo Republicans, who seem on track to retake the majority in one or both houses of Congress, maybe a CBDC based on such a vision is still in reach.","But a central bank digital currency has increasingly become a subject of political football. Partially, this seems to coincide with inflation becoming one of the GOP’s favorite rallying calls going into midterm elections, as a result of which the Federal Reserve’s name is mud.","Himes’ role here is critical. A former vice president at Goldman Sachs, he’s a political moderate. He formerly chaired the New Democrats, a coalition of centrist Democrats, and his campaign <a href=\"https:\/\/www.himesforcongress.com\/about\/\" data-v-f87c67ca=\"\">touted<\/a> an approach “to ensure both sides of the aisle work together.”","“There’s probably a diverse range of thinking on the Republican side,” Himes assured The Block regarding reception to his CBDC proposal. The most conspicuous Republican leaders in Congress have, however, come out in no uncertain terms against the idea of a CBDC. .","Senator Ted Cruz recently <a href=\"https:\/\/www.theblock.co\/linked\/148387\/ted-cruz-bitcoin-earth\" data-v-f87c67ca=\"\">called<\/a> a CBDC “a horrific idea,” while identifying anti-crypto sentiment among progressives as Senator Elizabeth Warren “wants her sticky little socialist fingers to be able to control every penny in every one of our bank accounts.\"","Senator Pat Toomey leads the Republicans on the Banking Committee, in which role he has emerged as a major crypto advocate in the last year of his term. He has been more restrained than Cruz in his suspicion towards a CBDC, but still not favorable. Speaking to The Block back in January, he was clearly more interested in <a href=\"https:\/\/www.theblock.co\/post\/129944\/fed-chair-and-us-senator-agree-on-core-principles-and-limits-for-a-potential-digital-dollar\" data-v-f87c67ca=\"\">protecting private stablecoins<\/a> than advancing a public digital dollar.","It was an opinion that Jerome Powell previously seemed more favorable toward. But in his remarks last week, he seemed to disagree.","“One question around CBDCs is: Do we want a private stablecoin to wind up being the digital dollar? I think the answer is no,” he said. “If we're going to have a digital dollar, it should be government-guaranteed money, not private money.”","Senator Sherrod Brown, meanwhile, <a href=\"https:\/\/www.theblock.co\/linked\/97455\/sen-sherrod-brown-letter-fed-cbdc\" data-v-f87c67ca=\"\">encouraged Jerome Powell and Lael Brainard<\/a> — vice-chair of the Federal Reserve — to “lead the way on CBDCs and other digital payments” in a March letter.","Brainard spent her first appearance before the Financial Services Committee as vice-chair defending the <a href=\"https:\/\/www.theblock.co\/post\/149040\/fed-vice-chair-brainard-defends-cbdcs-against-republican-attacks-in-first-hearing-since-confirmation\" data-v-f87c67ca=\"\">idea of a CBDC<\/a> from the GOP. Led by Patrick McHenry, committee Republicans prefaced the hearing by sending Brainard an extensive <a href=\"https:\/\/republicans-financialservices.house.gov\/news\/documentsingle.aspx?DocumentID=408345\" data-v-f87c67ca=\"\">list<\/a> of questions doubtful as to whether a CBDC would solve anything.","During that hearing, Republicans hammered on the need for the Fed to get authorizing legislation from Congress. “It seems like they’re obsessed with the notion that the Federal Reserve should not move forward without Congressional authorization,” Himes said.","“The federal reserve system was created by Democrats,” Paul Kupiec, a senior fellow at the American Enterprise Institute, told The Block. “Democrats are the ones that try to use it for all kinds of things. Climate change, regulation, now equity and inclusion — Democrats love to use the Fed for basically everything. Which means that it’s not an independent institution.”","Among contentious issues are direct retail access to the Fed and the ability of a CBDC to offer interest-bearing accounts. Both potentially threaten private banks and offer the Fed a greater role in the day-to-day life of citizens.","A striking possibility that some <a href=\"https:\/\/bpi.com\/the-benefits-and-costs-of-a-central-bank-digital-currency-for-monetary-policy\/\" data-v-f87c67ca=\"\">commentators<\/a> <a href=\"https:\/\/bpi.com\/the-benefits-and-costs-of-a-central-bank-digital-currency-for-monetary-policy\/\" data-v-f87c67ca=\"\">floated<\/a> last year is that CBDCs would allow central banks to charge negative interest — giving them a powerful tool to control inflation by disempowering account holders from taking their money out.","Himes’ proposal both maintains the need for private businesses to intermediate between the Fed and retail users, and defuses the interest rate threat.","“We explicitly say that the Fed couldn’t charge interest and therefore couldn’t pay negative interest,” he said.","Another core concern is privacy, a feature that is inevitably controversial. Himes’ proposal notes that it is promoting an account-based rather than token-based system, opening itself up to the ability to subpoena financial intermediaries.","“A CBDC is not going to be appealing to somebody who is privacy obsessed, and therefore will only use hard cash,” said Himes. “The flip side of that is of course that a CBDC is not going to be used for child trafficking, drug dealing and sanctions evasion.”","Jennifer Lassiter, the executive director of the Digital Dollar Project, which explores a U.S. CBDC, called the proposal “a fantastic well-thought-out paper.” But when it came to the specific provisions like the account or token-based systems, she was less inclined to endorse, identifying the proposal as “a starting point.”","“If that is the end-all-be-all then it really closes the door on exploring solutions to other problems that we’re looking to solve,” said Lassiter of the account-based system. “For example, we lose our ability to talk about financial inclusion, because part of that inclusion is digital identity and the ability to onboard.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"GOP","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Pat Toomey","content":"PERSON"},{"type":"Jennifer Lassiter","content":"PERSON"},{"type":"Banking Committee","content":"ORGANIZATION"},{"type":"Financial Services Committee","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"International Development","content":"ORGANIZATION"},{"type":"Lael Brainard","content":"PERSON"},{"type":"American Enterprise Institute","content":"ORGANIZATION"},{"type":"Sherrod Brown","content":"PERSON"},{"type":"Monetary Policy","content":"ORGANIZATION"},{"type":"Ted Cruz","content":"PERSON"},{"type":"National Security","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"Digital Dollar Project","content":"ORGANIZATION"},{"type":"Himes","content":"PERSON"},{"type":"Maxine Waters","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Patrick McHenry","content":"PERSON"},{"type":"Lassiter","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Paul Kupiec","content":"PERSON"},{"type":"Jerome Powell","content":"PERSON"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Brainard","content":"PERSON"},{"type":"Cruz","content":"PERSON"},{"type":"Jim Himes","content":"PERSON"}],"hashtag":[],"authors":["Kollen Post","The Block"]}