{"summary":"With the release of Connect, the Aztec team wants to position Connect as a privacy-preserving alternative to competing Layer 2s.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/151085\/aztec-updates-its-layer-2-network-to-introduce-privacy-focused-defi-on-ethereum","publishDate":"2022-06-09T09:25:11","id":7756,"type":null,"title":"Aztec to update its Layer 2 network to introduce privacy-focused DeFi on Ethereum","category":["LAYER 2S AND SCALING"],"content":["Aztec Network will update its Layer 2 rollup solution on Ethereum to a new version called Connect.","The new update, which focuses on smart contract data privacy, will go live in the coming days.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPreviously, <a href=\"https:\/\/www.theblockcrypto.com\/post\/80495\/aztec-ethereum-layer-2-unveil\" data-v-f87c67ca=\"\">Aztec<\/a> has offered a private money protocol called <a href=\"https:\/\/zk.money\/\" data-v-f87c67ca=\"\">zkmoney<\/a>, that allowed users to shield data on Ethereum transactions. However, it worked as a standalone solution that didn't allow Ethereum apps to integrate data privacy.","With the release of Connect, the Aztec team is aiming to position Connect as a privacy-preserving alternative to competing Layer 2s like <a href=\"https:\/\/www.theblock.co\/post\/149414\/optimism-op-token-to-hit-market-today-centralized-exchanges-say\" data-v-f87c67ca=\"\">Optimism<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/116148\/ethereum-scaling-solution-arbitrum-launches-mainnet-raises-120-million-funding\" data-v-f87c67ca=\"\">Arbitrum<\/a> and StarkWare.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/scaling-overview\/value-locked-of-ethereum-zk-rollups\/embed\" title=\"Value Locked of Ethereum ZK Rollups\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Popular DeFi apps such as Lido, Aave, Compound, Ribbon, Uniswap have agreed to launch on Aztec. These apps will soon be able onboard their smart contracts to Aztec Connect through a bridge, according to Jonathan Wu, head of growth at Aztec.","\"Aztec Connnect will create private apps on Ethereum by offering software development kit (SDK) for bridge contracts for permissionless privacy,\" Wu stated. He further that said unlike other Layer 2s, Aztec Connect will encrypt user activity, from the browser all the way to the processing of transactions on the network.","Aztec Connect is a precursor to Aztec 3, a future version of its Layer 2 rollup that will enable the native deployment of smart contracts. When that happens later this year, Aztec will launch a Rust-based smart contract development language called Noir.","<em data-v-f87c67ca=\"\">Update: Aztec <a href=\"https:\/\/twitter.com\/aztecnetwork\/status\/1535024615969263616\" data-v-f87c67ca=\"\">stated<\/a> on Twitter it had to postpone the launch of Connect due to some technical issues. Still, the team plans to release Connect in the \"immediate term.\"<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"SDK","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"Aztec Connnect","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Aztec Connect","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Jonathan Wu","content":"PERSON"},{"type":"Ribbon","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}