{"summary":"Women at Revolut, the $33 billion British neobank, are paid 69p for every £1 earned by their male employees in the United Kingdom.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119291\/revolut-trails-rival-neobanks-gender-pay-gap-report","publishDate":"2021-10-01T11:10:47","id":7759,"type":null,"title":"Revolut trails rival neobanks in gender pay","category":["THE BLOCK"],"content":["Women at Revolut, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/111469\/revolut-raises-800-million-33-billion-valuation\" data-v-f87c67ca=\"\">the $33 billion British neobank<\/a>, are paid 69p for every £1 earned by their male colleagues in the United Kingdom.","That’s the headline finding from Revolut’s <a href=\"https:\/\/gender-pay-gap.service.gov.uk\/Employer\/kAA4Rege\/2021\" data-v-f87c67ca=\"\">first ever gender pay gap report<\/a>, which gives a snapshot of gender pay disparity at the startup as of April 5, 2020.","The 69p figure (a gap of 31.3%) trails results filed by Monzo and Starling Bank – Revolut’s main U.K. rivals – in recent years. As of the same date in 2020, women at Starling Bank were paid 84p for every £1 (15.6%) earned by men. Monzo is yet to file its latest report, but women at the neobank were paid 80p for every £1 (20.4%) earned by men in 2019.","These headline figures reflect the companies’ median hourly pay gaps – a metric that highlights the typical situation faced by staff. U.K. firms with more than 250 employees must report these metrics on an annual basis.","Qualifying companies must also report mean gender pay gaps, which offer another way of assessing pay disparity. Revolut compares more favourably with its peers in this field. At Revolut, women’s mean hourly pay is 23.1% lower than men’s. The most recent available figures for Starling Bank and Monzo, respectively, are 21.3% and 19.3%","Revolut’s maiden gender pay gap report also reveals that women occupy 13.9% of the highest paid jobs and 45.5% of the lowest paid jobs across the company.","The pay disparity is also evident in bonuses. Women at Revolut earn 40p for every £1 earned by men when comparing median bonus pay (60.2% less), and women’s mean bonus pay is 97.2% less.","A spokesperson for Revolut told The Block: \"While women are not paid less for the same job, these results reflect the higher concentration of men in upper pay bands in the UK. We want to increase the proportion of women in our leadership and upper management and to encourage and recruit more women into higher paid roles.\"","\"We have a Women in Leadership programme to help accelerate our female talent and we're reviewing where and how to recruit to attract more women,\" the rep continued.","The advent of gender pay gap reporting in the U.K. in 2017 has <a href=\"https:\/\/www.fnlondon.com\/articles\/we-blew-it-fintech-gender-pay-gap-worse-than-investment-banks-20190415\" data-v-f87c67ca=\"\">highlighted the extent of gender pay disparity<\/a> within the fintech sector. Numerous initiatives, including the trade body Innovate Finance’s <a href=\"https:\/\/www.innovatefinance.com\/womeninfintech\/\" data-v-f87c67ca=\"\">Women in Fintech program<\/a>, have been rolled out to try to combat the situation.&nbsp;","<em data-v-f87c67ca=\"\">This report has been updated with comment from Revolut.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"15.6%","content":"PERCENT"},{"type":"13.9%","content":"PERCENT"},{"type":"Monzo","content":"PERSON"},{"type":"19.3%","content":"PERCENT"},{"type":"2017","content":"DATE"},{"type":"45.5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"U.K.","content":"LOCATION"},{"type":"Innovate Finance’s <a href=\"https:\/\/www.innovatefinance.com\/womeninfintech\/\" data-v-f87c67ca=\"\">Women","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"$33 billion","content":"MONEY"},{"type":"April 5, 2020","content":"DATE"},{"type":"31.3%","content":"PERCENT"},{"type":"UK","content":"ORGANIZATION"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"Starling Bank","content":"ORGANIZATION"},{"type":"97.2%","content":"PERCENT"},{"type":"60.2%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"20.4%","content":"PERCENT"},{"type":"21.3%","content":"PERCENT"},{"type":"United Kingdom","content":"LOCATION"},{"type":"23.1%","content":"PERCENT"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}