{"summary":"The Bank of Korea plans to begin a wholesale central bank digital currency pilot in partnership with the Bank for International Settlements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254665\/bank-of-korea-announces-plan-to-test-wholesale-cbdc","publishDate":"2023-10-04T07:06:49","id":7760,"type":null,"title":"Bank of Korea announces plan to test wholesale CBDC","category":["POLICY"],"content":["The Bank of Korea (BoK) plans to begin a wholesale central bank digital currency (CBDC) test in partnership with the Bank for International Settlements (BIS) and other institutions.","On Wednesday, South Korea's central bank <a href=\"http:\/\/www.bok.or.kr\/portal\/bbs\/P0000559\/view.do?nttId=10079835&amp;menuNo=200690&amp;pageIndex=\" data-v-f87c67ca=\"\">announced<\/a> details of the experiment, with its primary focus being the feasibility of a future monetary system built upon wholesale CBDCs.","The <a href=\"http:\/\/www.bok.or.kr\/viewer\/skin\/doc.html?fn=202310041214300802.pdf&amp;rs=\/webview\/result\/P0000559\/202310\" data-v-f87c67ca=\"\">pilot<\/a> will test whether a wholesale CBDC can be used as a settlement asset for commercial bank tokenized deposits. The scheme will also experiment with the programmability of tokenized deposits.","The collaborative initiative will involve BIS researchers partnering with South Korea's central bank, with oversight provided by South Korean financial regulators, the Financial Services Commission (FSC), and the Financial Supervisory Service (FSS).","\"The BoK has persistently pursued technological research related to CBDCs. This test, building upon past achievements, represents a significant step towards creating a prototype for the future monetary system,\" FSS First Deputy Governor Lee Myung-soon said in a statement on Wednesday.","The BoK has already conducted retail CBDC trials but determined that a retail CBDC is not currently necessary due to the efficiency of the Korean payment landscape. \"While there is no immediate need to issue [a] CBDC in Korea, we believe that there is a strong case for us to be prepared for the potential introduction of [a] CBDC in the future,\" Bank of Korea Deputy Governor Bae Joon-Suk said in a BIS <a href=\"https:\/\/www.bis.org\/publ\/bppdf\/bispap123_m.pdf\" data-v-f87c67ca=\"\">paper<\/a>.","Wednesday's announcement confirms the central bank is still willing to explore the technology. The difference between wholesale and retail CBDCs is their target audience and use cases, with wholesale CBDCs serving financial institutions and retail CBDCs being accessible to the general public.","The BoK's wholesale CBDC pilot comes amid the development of the BIS's <a href=\"https:\/\/www.theblock.co\/post\/235800\/bis-makes-case-for-unified-ledger-but-describes-crypto-as-a-flawed-system\" data-v-f87c67ca=\"\">unified ledger<\/a> concept. In June, the BIS unveiled a blueprint for this concept, which integrates CBDCs, digital money from commercial banks, and tokenized assets into a single programmable network.","According to the BIS's unified ledger blueprint, the concept will utilize smart contracts to eliminate free-riding and contribute to the stability of bank funding. “A smart contract could specify that each participant contributes only a certain amount to a joint venture if all other participants also contribute, this way, free-riding is eliminated,” the BIS <a href=\"https:\/\/www.bis.org\/publ\/arpdf\/ar2023e3.pdf\" data-v-f87c67ca=\"\">report<\/a> stated.","The Unified Ledger concept aims to transform supply chain financing, which currently suffers from challenges like delayed payments and the necessity for pre-production financing for suppliers. The BIS report on the concept added that a unified ledger could provide real-time information incorporated into smart contracts, thereby addressing these persistent issues.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"FSS","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"Financial Supervisory Service","content":"ORGANIZATION"},{"type":"Suk","content":"PERSON"},{"type":"\" Bank of Korea","content":"ORGANIZATION"},{"type":"BIS","content":"ORGANIZATION"},{"type":"Bae Joon","content":"PERSON"},{"type":"Bank of Korea (BoK)","content":"ORGANIZATION"},{"type":"Lee Myung","content":"PERSON"},{"type":"the Financial Services Commission (FSC","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Bank for International Settlements (BIS","content":"ORGANIZATION"}],"hashtag":["ASIAN REGULATION","CBDCS"],"authors":["Brian McGleenon","The Block"]}