{"summary":"Belgium’s Financial Services and Markets Authority ordered Binance to cease all offers of virtual currency services in the country — immediately. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236239\/belgium-regulator-orders-binance-to-stop-services-in-country","publishDate":"2023-06-23T13:21:54","id":7761,"type":null,"title":"Belgium regulator orders Binance to stop services in country","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Belgium’s Financial Services and Markets Authority ordered Binance to cease all offers of virtual currency services in the country —&nbsp;immediately.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">“The FSMA has noted that Binance is offering and providing exchange services in Belgium between virtual currencies and legal currencies, as well as custody wallet services, from countries that are not members of the European Economic Area<\/span>,” the regulator said in a statement on Friday.","<span class=\"s2\" data-v-f87c67ca=\"\">\"The FSMA has therefore ordered Binance to cease, with immediate effect, offering or providing any and all such services in Belgium,\" the regulator added.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">People and firms governed in Belgium and not a member of the European Economic Area cannot offer exchange services between virtual currencies and legal currencies or custody wallet services, the regulator added. Failing to comply could mean criminal sanctions, FSMA said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">FSMA said Binance did not dispute that it offered those services in Belgium.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">“There are apparently 27 such companies involved in the operational and\/or technical aspects of the provision of these services, of which 19 appear to be based outside the European Economic Area,” FSMA said.&nbsp;<\/span>","A Binance spokesperson said the exchange was disappointed by the news.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">\"We are disappointed to learn that the FSMA has come to this decision despite our ongoing conversations. We are reviewing the details of their notice and will continue to work collaboratively with regulators in Belgium and around the world in compliance with our obligations,\" the spokesperson said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Binance is also facing heat from regulators in the U.S. Earlier this month, the Securities and Exchange Commission sued Binance and its CEO Changpeng Zhao for allegedly operating an unregistered exchange and misleading customers.&nbsp;<\/span>","Updated to add Binance response.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Belgium’s Financial Services and Markets Authority","content":"ORGANIZATION"},{"type":"European Economic Area","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"FSMA","content":"ORGANIZATION"},{"type":"Binance spokesperson","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"U.S","content":"LOCATION"},{"type":"Belgium","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}