{"summary":"The Polkadot Council is voting on a proposal to loan 50,000 Kusama (KSM) tokens from its treasury to the liquid staking platform Bifrost.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155900\/bifrost-finance-seeks-2-5-million-loan-from-kusama-treasury","publishDate":"2022-07-05T14:34:19","id":7763,"type":null,"title":"Bifrost Finance seeks $2.5 million loan from Kusama treasury","category":["GOVERNANCE"],"content":["Bifrost Finance, a liquid staking protocol on Kusama (KSM), has requested a 50,000 KSM ($2.5 million) loan from the Kusama treasury.","The request is currently up for a <a href=\"https:\/\/kusama.polkassembly.io\/referendum\/212\" data-v-f87c67ca=\"\">vote<\/a> by both <a href=\"https:\/\/www.theblock.co\/post\/154838\/polkadot-to-scrap-its-council-body-in-new-governance-system\" data-v-f87c67ca=\"\">the Council<\/a> — the Polkadot and Kusama governing body — and the general community.","Bifrost users receive “vtokens,” a staking derivative token, in exchange for coins staked on the platform. These vtokens can be deployed on decentralized finance protocols in the DotSama ecosystem, enabling users to enjoy staking rewards and DeFi yield at the same time. \"Dotsama is a portmanteau of Polkadot and Kusama.","The project won the fifth Kusama parachain auction in July 2021. These auctions were to determine the projects that will earn slots on the Kusama parachain which is a canary network for Polkadot.","According to the <a href=\"https:\/\/kusama.polkassembly.io\/post\/1606\" data-v-f87c67ca=\"\">proposal<\/a> from Bifrost, the loan will be used to bootstrap liquidity for the platform’s staked KSM derivative called vKSM (similar to staked ETH on Ethereum). This liquidity is to enable Bifrost to incentivize vKSM utilization across DotSama DeFi protocols.","The requested loan has a one-year tenure at an interest rate of 19%. Bifrost will split the loan equally between Solarbeam and Taiga Protocol. Solarbeam is a decentralized exchange in the Moonriver parachain network. Moonriver was also one of the earliest winners of <a href=\"https:\/\/www.theblock.co\/post\/107548\/polkadot-says-its-ready-to-begin-auctioning-off-its-parachain-slots\" data-v-f87c67ca=\"\">last year’s Kusama parachain auction<\/a>. Taiga is a derivatives liquidity protocol similar to Synthetix on Ethereum.","The 25,000 KSM split between both platforms will be used to provide liquidity for the KSM\/vKSM trading pair. Bifrost says it is not expecting any impermanent loss when repaying the loan since vKSM can always be redeemed 1:1 for KSM.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last year","content":"DATE"},{"type":"19%","content":"PERCENT"},{"type":"Kusama","content":"PERSON"},{"type":"$2.5 million","content":"MONEY"},{"type":"’s Kusama","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bifrost Finance","content":"ORGANIZATION"},{"type":"Council","content":"ORGANIZATION"},{"type":"Taiga Protocol","content":"ORGANIZATION"},{"type":"KSM","content":"LOCATION"},{"type":"July 2021","content":"DATE"},{"type":"Bifrost","content":"LOCATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}