{"summary":"Uniswap’s proposed deployment on BNB Chain took a slight detour as the DAO had to vote to select a single crypto bridge provider.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207013\/uniswap-on-bnb-chain-wormhole-wins-bridge-selection-vote","publishDate":"2023-01-31T06:59:33","id":7765,"type":null,"title":"Uniswap on BNB Chain: Wormhole wins bridge selection vote","category":["CRYPTO ECOSYSTEMS"],"content":["Wormhole has won a temperature check vote on the Uniswap DAO as the preferred crypto bridge provider for the proposed deployment of Uniswap v3 on the BNB Chain, according to the details of an off-chain vote concluded on Tuesday.","Wormhole was among a list of four crypto bridge protocols in the vote. The others were LayerZero, Celer, and deBridge. Wormhole <a href=\"https:\/\/snapshot.org\/#\/uniswap\/proposal\/0x6b8df360fdf73085b21fdf5eef9f85916fbde95621a3d454cb20fbe545ffc852\" data-v-f87c67ca=\"\">secured<\/a> 62% of the votes to win the polls, according to data from Snapshot. Wormhole will now be included in the final governance proposal for the deployment of Uniswap v3 on the BNB Chain.","The bridge selection vote came as a late addition to the process. The Uniswap community had recently <a href=\"https:\/\/www.theblock.co\/post\/204577\/early-vote-shows-strong-support-for-deploying-uniswap-on-bnb-chain\" data-v-f87c67ca=\"\">finished a preliminary vote<\/a> to deploy its decentralized exchange protocol on the BNB Chain. This preliminary vote had Celer as the bridge protocol.","Some crypto bridge builders, however, <a href=\"https:\/\/gov.uniswap.org\/t\/rfc-update-deploy-uniswap-v3-1-0-3-0-05-0-01-on-bnb-chain-binance\/19734\/82\" data-v-f87c67ca=\"\">argued<\/a> against the use of a single bridge provider. Participants like deBridge co-founder Alex Smirnov and Celer co-founder Mo Dong argued against the use of only one bridge protocol for Uniswap’s multi-chain expansion. They stated that such an approach would see the emergence of a vendor lock-in for Uniswap — resulting in Uniswap being tied to a single cross-chain messaging service. They stated that such an approach could create a single-point-of-failure risk for the protocol.","Dong went a step further and <a href=\"https:\/\/gov.uniswap.org\/t\/rfc-update-deploy-uniswap-v3-1-0-3-0-05-0-01-on-bnb-chain-binance\/19734\/82\" data-v-f87c67ca=\"\">proposed<\/a> a multi-bridge implementation for Uniswap governance. The solution allows for other bridge protocols to be included via adapters on Celer.","Despite these points, Uniswap is going with only one bridge provider for its planned BNB Chain deployment. This is because the protocol cannot presently support a bridge-agnostic approach. Such an architecture would also require significant engineering hours to develop, as noted on the DAO forum.","Uniswap’s business source license expires on Apr. 1. The business source license is a type of trademark that acts as a time delay against other projects copying its code for their own business ideas. The document is supposed to prevent vampire attacks like the one SushiSwap launched against Uniswap in 2020.","DAO participants like a16z Deal Partner Porter Smith argued for Uniswap to deploy on other chains before the expiration of the license. Potter, however, echoed statements from the Uniswap Foundation calling for a more formal approach to selecting bridge providers for future deployments.","The Uniswap community eventually had to choose one out of four bridges. Variant Fund Founder Jesse Walden <a href=\"https:\/\/gov.uniswap.org\/t\/rfc-update-deploy-uniswap-v3-1-0-3-0-05-0-01-on-bnb-chain-binance\/19734\/75\" data-v-f87c67ca=\"\">described<\/a> the situation as “suboptimal” adding, “Protocol design needs to adapt for a multi-chain world, to reap the benefits of competition through standardization, not voting.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Porter Smith","content":"PERSON"},{"type":"Uniswap Foundation","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Jesse Walden","content":"PERSON"},{"type":"Mo Dong","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Alex Smirnov","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"62%","content":"PERCENT"},{"type":"Uniswap governance","content":"ORGANIZATION"}],"hashtag":["BNB CHAIN","CROSS-CHAIN SWAPS","DAOS","DEXS","GOVERNANCE VOTES","UNISWAP"],"authors":["Osato Avan-Nomayo","The Block"]}