{"summary":"John Reed Stark shared his opinion on X that the current Securities and Exchange Commission will not approve a spot bitcoin ETF.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244597\/sec-bitcoin-etf-john-reed-stark","publishDate":"2023-08-13T09:35:18","id":7766,"type":null,"title":"Current SEC won&#x27;t approve a spot Bitcoin ETF, former office chief says","category":["U.S. POLICYMAKING"],"content":["The U.S. Securities and Exchange Commission will not approve a spot Bitcoin exchange-traded fund — at least, that's the opinion of the agency's former Office of Internet Enforcement chief, John Reed Stark.","\"My take is that the current SEC will NOT approve a bitcoin spot ETF application for a range of compelling reasons,\" Stark <a href=\"https:\/\/twitter.com\/johnreedstark\/status\/1690707913789112320?s=46&amp;t=yoL7WJcO9vZ3TjSE2j6FRQ\" data-v-f87c67ca=\"\">wrote<\/a> today on X (formerly Twitter).","However, Stark shared that if a Republican wins the White House in 2024, the SEC will likely decrease its crypto-enforcement efforts and \"become far more receptive to approving a bitcoin spot ETF and far more likely to take other significant crypto-friendly regulatory actions.\"","Stark also claims that if the next President is a Republican, current SEC chair Gary Gensler \"would likely resign,\" and Hester Peirce — known as \"Crypto Mom\" in the industry — could become acting chair, and \"crypto-related SEC disruption would grind to a screeching halt.\"","The SEC has, in recent history, stepped up crypto-enforcement efforts.","Earlier this week, crypto exchange Bittrex <a href=\"https:\/\/www.theblock.co\/post\/244309\/bittrex-settles-with-the-sec-for-24-million\" data-v-f87c67ca=\"\">settled<\/a> with the agency for $24 million after being charged for operating as an unregistered exchange in April.","The SEC also <a href=\"https:\/\/www.theblock.co\/post\/244036\/sec-files-letter-with-sdny-seeking-leave-for-interlocutory-appeal-in-ripple-case\" data-v-f87c67ca=\"\">filed<\/a> a letter with the Southern District of New York on Wednesday seeking leave for an interlocutory appeal in the summary judgment order in the Ripple Labs case — widely seen as a partial defeat for the agency.","To date, the SEC has approved no spot Bitcoin ETF after years of attempts.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hester Peirce","content":"PERSON"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"John Reed Stark","content":"ORGANIZATION"},{"type":"White House","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$24 million","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"April","content":"DATE"}],"hashtag":["SEC"],"authors":["Adam James","The Block"]}