{"summary":"SBF&#x27;s attorneys are urging a district court to grant him temporary release from jail to review documents ahead of his upcoming trial.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247689\/sam-bankman-frieds-lawyers-ask-for-temporary-release-from-jail","publishDate":"2023-08-28T10:35:43","id":7768,"type":null,"title":"Sam Bankman-Fried&#x27;s lawyers ask for temporary release from jail","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Sam Bankman-Fried's attorneys are urging a district court to grant the former FTX CEO's temporary release from jail to review documents ahead of his upcoming trial, or at least allow him to meet with them five days a week.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Bankman-Fried is currently able to meet with his lawyers in a room at the courthouse two days a week, which lawyers say is a far cry from the seven days a week he used to be able to work on preparing for the October trial.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“In order to meaningfully prepare his defense, Mr. Bankman-Fried needs constant access to an internet-enabled computer that allows him to review documents from discovery, look up relevant context for the evidence online, draft and edit work product analyzing the documents and data, and share these documents and analyses with his attorneys,” his lawyers said on Aug. 25 in a <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.590940\/gov.uscourts.nysd.590940.228.0.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">letter<\/span><\/a>.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">His lawyers also argued that the laptop Bankman-Fried was given has a limited battery life, that there is no power outlet in the cell block to charge it and that the internet connection has been weak for half of the sessions.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Before Bankman-Fried was placed in jail after his bail was revoked, he was able to spend 80-100 hours a week working on his defense, his lawyers said. The former billionaire was sent to await trial in jail <a href=\"https:\/\/www.theblock.co\/post\/244540\/ftx-judge-says-hes-revoking-bail-for-bankman-fried-inner-city-press\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">earlier<\/span><\/a> this month after prosecutors accused him of witness tampering by leaking the private diary of former colleague and ex-girlfriend Caroline Ellison to the New York Times and using an encrypted message app to contact a potential witness.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Bankman-Fried <a href=\"https:\/\/www.theblock.co\/post\/236735\/judge-denies-motion-to-dismiss-most-charges-against-sam-bankman-fried\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">faces<\/span><\/a><\/span><span class=\"s5\" data-v-f87c67ca=\"\"> over 100 years in prison if he is convicted on a slew of charges including fraud over allegations that he and other FTX executives used billions of customer assets to make their own failed investments. FTX filed for bankruptcy protection late last year.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Judge Lewis Kaplan <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.590940\/gov.uscourts.nysd.590940.230.0.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">ordered<\/span><\/a> the government on Monday to respond to Bankman-Fried's Aug. 25 letter by 5 p.m. on Tuesday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lawyers for Bankman-Fried also said they objected to the government's release of four million pages of documents they received last week.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Even if Mr. Bankman-Fried were out on bail and had unlimited time to review these documents, it would likely be impossible for him to finish reviewing them by the time of trial. This is yet another example of the Government dumping a huge volume of discovery on the defense months after the discovery deadlines that the Government represented to the Court. This is fundamentally unfair and should not be permitted,\" the lawyers said.&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aug. 25","content":"DATE"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Government","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"5 p.m.","content":"TIME"},{"type":"October","content":"DATE"},{"type":"Lewis Kaplan","content":"PERSON"}],"hashtag":["FTX"],"authors":["Sarah Wynn","The Block"]}