{"summary":"Poly Network is a decentralized and trustless interoperability protocol for heterogenous blockchains. Interoperability between different classes of applications, assets and consensus mechanisms is realized via coordination with the Poly Relay Chain. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152567\/poly-network-interoperability-made-easy","publishDate":"2022-06-20T09:00:29","id":777,"type":null,"title":"Poly Network: Interoperability Made Easy","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Poly Network is a decentralized and trustless interoperability protocol for heterogenous blockchains. Interoperability between different classes of applications, assets and consensus is realized via coordination by the Poly Relay Chain. Compared to existing cross-chain solutions, Poly Network is more inclusive and offers more advanced security. It is sustainable for end-users in that multiple blockchains come together to create a shared ecosystem, where decentralized applications communicate with one another through their interactions and liquidity is reliably secured. In this capacity, Poly Network offers a systematic development framework for developers of all tiers, e.g., infrastructure, smart contracts, applications etc., to participate in the establishment of the ecosystem. Please check <\/span><a href=\"https:\/\/dev-docs.poly.network\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/dev-docs.poly.network<\/span><\/a><span data-v-f87c67ca=\"\"> for more details.<\/span><\/span>","<span data-v-f87c67ca=\"\">Typical interoperations for cross-chain assets enabled by Poly Network include:<\/span>","<span data-v-f87c67ca=\"\">Poly Network implements an open design, not only for crypto assets but for general infrastructure as well. Developers can include any type of assets, e.g., fungible\/non-fungible, native cryptocurrency\/token, etc., into Poly Network simply by specifying the smart contract of a specific asset and the core messages that essentially describe activities related to the token (usually blockchain events signaled by the contract). In practice, the compatibility of Poly Network with diverse crypto assets means&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Poly Network’s infrastructure is fully open-sourced and is based on:&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The design of the infrastructure is open to the entire ecosystem so that any developer can implement new components to the infrastructure by the general design. This feature enables the development community of Poly Network to be highly decentralized, with potential contributions from developers all over the world. Furthermore, Poly Network allows developers to interface their infrastructure to other applications through well-defined interoperation APIs. Specifically, applications from other ecosystems can delegate interoperation services to Poly Network via calling the APIs instead of having to implement the service from scratch. To sum up, Poly Network offers an open design which<\/span>","<span data-v-f87c67ca=\"\"><\/span>","","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Poly Network provides developers with a systematic development framework and tool support (specified in detail in the open document center <\/span><a href=\"https:\/\/dev-docs.poly.network\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/dev-docs.poly.network<\/span><\/a><span data-v-f87c67ca=\"\">). The framework supports the development of both the infrastructure of Poly Network and the services enabled by it. We use the following use cases to explain the development experience with Poly Network.<\/span><\/span>","<span data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">Integration with a new blockchain<\/b><span data-v-f87c67ca=\"\">. To integrate a new blockchain into Poly Network’s ecosystem, e.g., Polygon, developers need roughly 4 steps for the implementation:<\/span><\/span>","<span data-v-f87c67ca=\"\"><\/span>","","<span data-v-f87c67ca=\"\">Furthermore, Poly Network plans to release a toolchain for developers to not only implement but also design, validate, audit, and upgrade Poly Network as well. We believe that systematic development support is the core contributor to a prosperous developer community and therefore the whole ecosystem.<\/span>","<span data-v-f87c67ca=\"\">Cross-chain capabilities have always been at the center of the discussion on blockchain interoperability. While we believe that cross-chain is a common and popular use case for blockchain interoperations, the concept of interoperability means much more than that in a multi-chain space. In addition to supporting the circulation of crypto assets across heterogeneous blockchains, Poly Network defines standard smart contract interfaces for developers to implement general-purpose business logic, rather than simply the management of tokens. This flexibility enables Poly Network to further benefit from blockchain composability by bridging itself to other applications via the general-purpose interfaces, while those applications stay unchanged. The idea of universal interoperability also indicates the atomicity for blockchain state transitions in general, as opposed to mere asset transfers. Upcoming upgrades to Poly Network will focus on providing more development capabilities for the realization of universal interoperability and its potential applications too.<\/span>","<span data-v-f87c67ca=\"\">Poly Network is a global cross-chain protocol for implementing blockchain interoperability and building Web3.0 infrastructure. Poly Network has integrated almost 30 blockchains, including Ethereum, Polygon, Avalanche, Fantom, BNB Chain, Arbitrum, Optimism, HECO, OKC, Neo, Ontology, Zilliqa, Harmony, Metis, etc. Since its launch, the protocol has enabled cross-chain asset transfers of more than USD 16 billion.<\/span>","<span data-v-f87c67ca=\"\"><\/span>","","<span data-v-f87c67ca=\"\"><\/span>","","&nbsp;","<span data-v-f87c67ca=\"\">With the help of Poly Network, whether you wish to expand the market reach of an existing dApp or build a brand new dApp, implementation becomes simple. So far, Poly Network has provided underlying support for dApps including Poly Bridge, Chainswap, Demex, Flamingo, MDEX, O3 Swap, Wing and ZilBridge. <\/span>","<span data-v-f87c67ca=\"\"><\/span>","","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Poly Network is actively looking for dApp partners to build a Web3.0 interoperability ecosystem together with. Poly Network provides a variety of technical support for partners, see <\/span><a href=\"https:\/\/dev-docs.poly.network\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/dev-docs.poly.network\/<\/span><\/a><span data-v-f87c67ca=\"\"> for details. If you are interested in joining the Poly Network ecosystem, please contact us via Discord.<\/span><\/span>","&nbsp;","<span data-v-f87c67ca=\"\">Poly Network official links:&nbsp;<\/span>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Poly Network <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USD 16 billion","content":"MONEY"},{"type":"Demex","content":"LOCATION"},{"type":"Polygon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Zilliqa","content":"LOCATION"},{"type":"Flamingo","content":"ORGANIZATION"},{"type":"Chainswap","content":"LOCATION"},{"type":"OKC","content":"LOCATION"},{"type":"Poly Relay Chain","content":"ORGANIZATION"},{"type":"Fantom","content":"PERSON"},{"type":"Arbitrum","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Metis","content":"ORGANIZATION"},{"type":"Neo","content":"PERSON"},{"type":"Poly Network","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}