{"summary":"Bitpanda told staff via Slack message that there would be no mass layoffs, three weeks before cutting its workforce by a third. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155398\/no-mass-layoffs-said-bitpanda-three-weeks-before-axing-third-of-staff","publishDate":"2022-07-01T09:03:42","id":7771,"type":null,"title":"No mass layoffs said Bitpanda, three weeks before axing third of staff","category":["STARTUPS"],"content":["Cryptocurrency and commodities trading platform Bitpanda told its employees it would not resort to mass layoffs amid the economic downturn, just three weeks before a big employee cull.","According to a Slack screenshot obtained by The Block dated May 31, the company's chief product officer, Lukas Enzersdorfer-Konrad, tried to dispel rumors that the company would downsize and halt hiring.&nbsp;","\"There will not be any kind of massive layoffs within Bitpanda,\" Enzersdorfer-Konrad said. \"We have not yet reached our limit and will continue hiring until all the positions we need are filled.\"&nbsp;","He said the company was \"very well funded\" with no liquidity problems. While he noted that its 2022 financial results were \"below budget,\" he said that this had been caused by macroeconomic conditions, including a supply crisis and the Ukraine conflict. The executive urged employees to focus on product and tech infrastructure improvements in preparation for the \"next bull run.\"","<span data-v-f87c67ca=\"\">When reached for comment today, a company spokesman said: \"Three weeks before the day of the announcement we didn’t plan to do a restructuring and we have always transparently communicated our plans to our people.\" He added: \"We only took this tough decision days before the official announcement when, due to legal restrictions, we couldn’t openly communicate about it.\"&nbsp;<\/span>","Bitpanda said it was doing its best to support those affected by the restructuring.&nbsp;","Since <a href=\"https:\/\/www.theblock.co\/post\/154137\/investment-platform-bitpanda-lays-off-730-employees\" data-v-f87c67ca=\"\">cutting its workforce by a third<\/a> and rescinding offers of employment last Friday, Bitpanda has no jobs currently <a href=\"https:\/\/boards.eu.greenhouse.io\/bitpanda\" data-v-f87c67ca=\"\">advertised on its careers page.<\/a> In a<a href=\"https:\/\/blog.bitpanda.com\/en\/way-forward\" data-v-f87c67ca=\"\"> statement,<\/a> the company said that it had made a necessary decision in order to navigate out of the current market downturn. The company said that it may have expanded too quickly, after having previously committed to a <a href=\"https:\/\/www.theblockcrypto.com\/news+\/116795\/from-uber-to-revolut-to-bitpanda-inside-irina-scarlats-formula-for-hyper-growth\" data-v-f87c67ca=\"\">\"hyper-growth\" strategy.<\/a>","Last August, the company <a href=\"https:\/\/www.theblock.co\/post\/114660\/crypto-bitpanda-263-million-series-c\" data-v-f87c67ca=\"\">raised $263 million<\/a> to fund its plan for fast growth as it looked to attract top talent and expand product lines. This included <a href=\"https:\/\/www.theblock.co\/linked\/122230\/bitpanda-hires-jpmorgan-fintech-executive\" data-v-f87c67ca=\"\">hiring a JP Morgan executive<\/a> to lead its institutional platform, snapping up its <a href=\"https:\/\/www.theblock.co\/post\/134994\/crypto-unicorn-bitpanda-acquires-trustology\" data-v-f87c67ca=\"\">first acquisition in February of this year<\/a> and launching new products including its <a href=\"https:\/\/www.theblock.co\/linked\/128218\/bitpanda-bitcoin-etc\" data-v-f87c67ca=\"\">Bitcoin-backed ETN.<\/a>","Bitpanda is not the only company to suffer amid market volatility. In the last week, The Block reported that <a href=\"https:\/\/www.theblock.co\/post\/155209\/abra-becomes-latest-crypto-firm-to-cut-jobs\" data-v-f87c67ca=\"\">crypto trading platform Abra<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/155026\/osl-layoffs-crypto-exchange-hong-kong\" data-v-f87c67ca=\"\">exchange OSL<\/a> have cut jobs. Last month, <a href=\"https:\/\/www.theblock.co\/post\/152059\/crypto-firms-have-laid-off-more-than-1500-people-in-the-last-two-months-as-downturn-fears-persist\" data-v-f87c67ca=\"\">more than 1,500 people were laid off<\/a> by crypto firms including Coinbase, Crypto.com and Gemini.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lukas Enzersdorfer","content":"PERSON"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Konrad","content":"LOCATION"},{"type":"Konrad","content":"PERSON"},{"type":"last week","content":"DATE"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"Bitpanda","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Bitpanda","content":"LOCATION"},{"type":"May 31","content":"DATE"},{"type":"Ukraine","content":"LOCATION"},{"type":"August","content":"DATE"},{"type":"$263 million","content":"MONEY"}],"hashtag":["HIRING","LAYOFFS"],"authors":["Tom Matsuda","The Block"]}