{"summary":"Andrew Bailey, governor of the Bank of England, has questioned the business model behind Diem, the Facebook-backed stablecoin initiative.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/90391\/boe-bailey-governor-facebook-diem","publishDate":"2021-01-07T11:26:48","id":7772,"type":null,"title":"Bank of England governor on Facebook-backed Diem: &#x27;Where’s the business model?&#x27;","category":["CENTRAL BANKS"],"content":["Andrew Bailey, governor of the Bank of England, has publicly questioned the business model of stablecoin project Diem.","During questioning from MPs as part of a Treasury Committee panel on January 6, Bailey was asked by Conservative MP Steve Baker about privacy concerns relating to central bank digital currencies, or digital currencies that are backed in some fashion by central bank reserves. Bailey answered by turning the focus to Diem.","“One of the things that’s obviously been doing the rounds in the last year or so is this proposal that was called Libra, it’s now called Diem, which has been associated with Facebook,” he said, adding:","“And that’s caused quite a few reactions obviously. But one of the issues in that of course is where’s the business model in this thing? And is it actually in the privacy of information, in terms of access to information? Which would not be central banks of course, this would be private sector access to information.”","The proposed stablecoin, formerly known as Libra and initially bootstrapped by social media giant <a href=\"https:\/\/www.theblockcrypto.com\/linked\/14638\/facebook-faces-criticism-for-handling-of-phone-numbers-required-for-2fa\" data-v-f87c67ca=\"\">Facebook<\/a>, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/86342\/libra-diem-stablecoin-rebrand\" data-v-f87c67ca=\"\">was rebranded to Diem<\/a> in December, a name the Diem Association’s chief executive Stuart Levey said the move signaled the project’s “growing maturity and independence”.","It is <a href=\"https:\/\/uk.reuters.com\/article\/uk-britain-boe-bailey-stablecoins\/bank-of-england-s-bailey-says-stablecoins-do-not-meet-grade-for-broad-use-idUSKBN27S2TO\" data-v-f87c67ca=\"\">not the first time<\/a> Bailey has appeared to pour cold water on Diem's designs. In November, speaking as part of a European Central Bank panel discussion, the Bank of England governor said, “the bar is set very high for private stablecoins, and I don’t think they have met that bar”.","Earlier in the Treasury Committee hearing on January 6, Anil Kashyap, external member of the Financial Policy Committee, which monitors systemic risk to the U.K. financial system, said the Bank of England is planning to publish a discussion paper in March which will lay out the central bank's thinking on CBDCs. &nbsp;","“I think our March paper hopefully will put us in a leadership position vis-à-vis lots of other countries,” he said.","Kashyap also said he doesn’t think it is inevitable that the emergence of retail digital currencies, issued and backed by central banks, will spell the demise of private banking – which was another area of questioning.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bailey","content":"PERSON"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Anil Kashyap","content":"PERSON"},{"type":"Stuart Levey","content":"PERSON"},{"type":"January 6","content":"DATE"},{"type":"Steve Baker","content":"PERSON"},{"type":"U.K.","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"Treasury Committee","content":"ORGANIZATION"},{"type":"Andrew Bailey","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"March","content":"DATE"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"Diem Association","content":"ORGANIZATION"},{"type":"Financial Policy Committee","content":"ORGANIZATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}