{"summary":"The SEC was granted an additional week to respond to a federal judge who ordered the regulator to explain &quot;false or misleading&quot; statements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266811\/judge-grants-sec-another-week-to-explain-misrepresentations","publishDate":"2023-12-08T12:46:44","id":7773,"type":null,"title":"Judge grants SEC another week to explain alleged &#x27;misrepresentations&#x27; in Utah crypto case","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">The Securities and Exchange Commission has another week to tell a federal judge in Utah why it made a series of possibly \"false or misleading\" statements in its case against a crypto startup called DEBT Box.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Judge Robert J. Shelby, <\/span><span data-v-f87c67ca=\"\">Chief United States district judge for the District of Utah,<\/span><span data-v-f87c67ca=\"\"> granted the regulator's request for the additional time to respond to the court's order. It now has until Dec. 21.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Shelby last week <\/span><a href=\"https:\/\/www.theblock.co\/post\/265778\/utahs-top-judge-threatens-sec-lawyers-with-sanctions-over-misrepresentations-in-crypto-case\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ordered<\/span><\/a><span data-v-f87c67ca=\"\"> the SEC to explain statements it made while trying to implement and maintain a temporary restraining order against DEBT Box. The SEC has claimed the company was trying to move assets overseas in order to escape the regulator's jurisdiction, but the judge said last week that some of the evidence cited may have been \"<\/span><span data-v-f87c67ca=\"\">materially false and misleading.\"<\/span>","<span data-v-f87c67ca=\"\">Shelby ordered the SEC to explain why sanctions should not be imposed upon its lawyers and laid out several questions for the agency regarding the evidence it used to support its assertions.<\/span>","<span data-v-f87c67ca=\"\">The SEC said in a Dec. 7 statement to the court that it needed more time to prepare its response.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"The Commission takes very seriously the concerns expressed by the Court in the Order to Show Cause and has undertaken a process to provide the Court with a thorough response to the Court's questions,\" lawyers for the regulator wrote.<\/span>","<span data-v-f87c67ca=\"\">\"As part of that process, a new team of attorneys, including attorneys from the Commission's Office of the General Counsel (\"OGC\"), has been assigned to review the events that gave rise to the Court's concerns and prepare the response to the Order to Show Cause. To allow the new team sufficient time to review the facts and prepare the response to the Court, the Commission is seeking a brief, seven-day extension of time to submit its response,\" they continued. <\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chief United States","content":"LOCATION"},{"type":"Dec. 21","content":"DATE"},{"type":"the Court","content":"ORGANIZATION"},{"type":"Court","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Dec. 7","content":"DATE"},{"type":"Utah","content":"LOCATION"},{"type":"Robert J. Shelby","content":"PERSON"},{"type":"last week","content":"DATE"},{"type":"General Counsel","content":"ORGANIZATION"}],"hashtag":[],"authors":["Anna Baydakova","The Block"]}