{"summary":"The co-founder filed his own lawsuit in response, alleging the CEO used the company to enrich himself, including a corporate jet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248897\/gala-games-ceo-sues-co-founder-alleging-130-million-theft-pattern-of-deception","publishDate":"2023-09-03T13:28:56","id":7776,"type":null,"title":"Gala Games CEO sues co-founder alleging $130 million theft, pattern of deception","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Two top executives at Web3 gaming startup Gala Games are now in litigation against each other — a turn of events that has dropped the <a href=\"https:\/\/www.coingecko.com\/en\/coins\/gala\" data-v-f87c67ca=\"\">price<\/a> of its token by 13%.<\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Web3 gaming startup Gala Games CEO Eric Schiermeyer recently sued the company’s co-founder Wright Thurston, alleging that Thurston stole 8.6 billion <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248424\/gala-gala-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/GALA-COINGECKO.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">GALA<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.67%\n    <\/span><\/a> <!----><\/span> tokens in early 2021 and managed to sell them for $130 million before the company could stop him. Schiermeyer’s <\/span><\/span><a href=\"https:\/\/drive.google.com\/file\/d\/1qpsaRIPB80aQqtf72aHUbKBinbvzWt6s\/view\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">suit<\/span><\/a><span data-v-f87c67ca=\"\">, filed August 31, also accuses Thurston of a pattern of founding companies that end up insolvent, bankrupt, or tied up in litigation.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Thurston, in his own <\/span><a href=\"https:\/\/drive.google.com\/file\/d\/1PQH9lEWnT0JjIWJbkMycp2Ip13SYJv27\/view\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">lawsuit<\/span><\/a><span data-v-f87c67ca=\"\"> filed on the same day, alleges that Schiermeyer took control of Gala Games for himself in order to use company funds for personal purchases, including the financing of a private jet.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Gala Games, a Web3 GameFi startup, was co-founded by Thurston and Schiermeyer in early 2019, with each receiving 50% ownership. Michael McCarthy, who is listed by some publications as Gala’s third co-founder, is not mentioned in either lawsuit. The company recently launched Champions Arena, a turn-based RPG game for mobile devices, and also has ventures in blockchain-based music, film, and digital collectibles.<\/span>","<span data-v-f87c67ca=\"\">In his lawsuit, Schiermeyer alleges that Thurston “​​has founded numerous companies, most of which have ended up in litigation, insolvent, bankrupt, and\/or sued by the SEC,” and claims Gala Games is the only legitimate enterprise in which Thurston has an interest.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Schiermeyer’s main allegation is that Thurston stole 8.6 billion GALA tokens in February 2021, more than 100% of the total amount of GALA in circulation at the time as reported by market aggregators. Schiermeyer claims Thurston effectively held the company hostage, as exposing the token theft would cause him to liquidate his holdings, collapsing the GALA ecosystem as a result.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As a partial solution, in May 2023, the company issued Gala v2 tokens that were <\/span><a href=\"https:\/\/blog.gala.games\/introducing-gala-v2-a-new-era-for-the-gala-games-ecosystem-e1ca2e09608b\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">advertised<\/span><\/a><span data-v-f87c67ca=\"\"> as bringing “a host of improvements to the table, including enhanced burn mechanisms, security enhancements, and future upgradeability.” Only Schiermeyer claims the real purpose of the tokens was to make the GALA tokens in Thurston-controlled wallets obsolete while leaving the rest of the ecosystem unaffected.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">By the time of the upgrade, the lawsuit claims approximately half of Thurston’s GALA tokens ended up at centralized exchanges, where Thurston sold them for over $130 million in profit. When Schiermeyer demanded that Thurston stop selling the stolen GALA, the lawsuit claims, “Thurston first responded that he was selling some of the GALA tokens in order to purchase ammunition for firearms. Then he stopped responding.”<\/span>","<span data-v-f87c67ca=\"\">The lawsuit names several companies that Schiermeyer alleges were multi-level marketing schemes and quotes a former associate of Thurston who claims his actions “ruined the lives of thousand[s] of young people as well as seasoned investors.” The filing also includes a separate lawsuit filed by the crypto company Blox against Thurston for alleged damages of $200 million related to equipment Thurston promised to provide the company and never delivered. That lawsuit also alleges Thurston engaged in Paycheck Protection Program fraud through his entity Block Brothers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Schiermeyer also alleges that Thurston has been largely absent from the operations of Gala, even being “virtually unreachable for many months at a time,” according to his complaint.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Thurston, in his lawsuit, agrees that he hasn’t been running the company, but complains that Schiermeyer “caused [Gala] to operate without notice to or input from [Thurston], thus eliminating Thurston’s ability to help guide [Gala] to the benefit of the company and its shareholders.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Thurston’s lawsuit claims “Schiermeyer’s malfeasance, mismanagement, and self-dealing have resulted in hundreds of millions of dollars in damage to [Gala]’s reputation and company and shareholder assets.”<\/span>","<span data-v-f87c67ca=\"\">Gala Games did not immediately reply to The Block’s request for comment .&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Thurston was also <\/span><a href=\"https:\/\/www.sec.gov\/litigation\/litreleases\/lr-25659\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">sued by the SEC<\/span><\/a><span data-v-f87c67ca=\"\"> earlier this year in relation to a different company he founded, Green United LLC, which the SEC alleges misled investors into putting $18 million into a fraudulent green crypto enterprise.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to the SEC, investors in Green United were told by the company and by a promoter also named in the suit, Kristoffer A. Krohn, that they were purchasing miners and nodes associated with a “public global decentralized power grid” powered by the ERC-20 GREEN token.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In reality, the SEC <\/span><a href=\"https:\/\/www.sec.gov\/files\/litigation\/complaints\/2023\/comp25659.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">alleges<\/span><\/a><span data-v-f87c67ca=\"\">, the GREEN token did not exist and the software sold by Thurston either mined bitcoin, which the users did not receive, or seemingly did nothing at all. GREEN tokens were distributed to users not as the result of mining but rather at the discretion of Thurston, according to the agency.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Both defendants <\/span><a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.utd.138270\/gov.uscourts.utd.138270.23.0.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filed<\/span><\/a> <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.utd.138270\/gov.uscourts.utd.138270.28.0.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">motions<\/span><\/a><span data-v-f87c67ca=\"\"> to dismiss the SEC’s lawsuit in May on jurisdictional grounds, alleging that the agency doesn’t have the jurisdiction to oversee cases involving digital assets.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Block Brothers","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"-1.67%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"20","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"$130 million","content":"MONEY"},{"type":"Thurston]","content":"PERSON"},{"type":"Green United","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Thurston","content":"PERSON"},{"type":"13%","content":"PERCENT"},{"type":"February 2021","content":"DATE"},{"type":"Kristoffer A. Krohn","content":"PERSON"},{"type":"Thurston","content":"LOCATION"},{"type":"$200 million","content":"MONEY"},{"type":"Schiermeyer","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"May 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$18 million","content":"MONEY"},{"type":"Wright Thurston","content":"PERSON"},{"type":"Green United LLC","content":"ORGANIZATION"},{"type":"Thurston’s GALA","content":"ORGANIZATION"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"August 31","content":"DATE"},{"type":"Thurston","content":"ORGANIZATION"},{"type":"Michael McCarthy","content":"PERSON"},{"type":"Eric Schiermeyer","content":"PERSON"}],"hashtag":[],"authors":["Zack Abrams","The Block"]}