{"summary":"A new Solana-based memecoin presale project called Slerf accidentally burnt funds raised from presale investors, worth $10 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283025\/solana-memecoin-slerf-burn","publishDate":"2024-03-18T05:11:12","id":7777,"type":null,"title":"Solana memecoin Slerf accidentally burns $10 million in presale funds","category":["CRYPTO ECOSYSTEMS"],"content":["A new Solana-based memecoin, Slerf, has faced significant challenges after the project’s developer accidentally burnt a major portion of the token supply — effectively losing $10 million, or the entirety, of presale participants’ money.","\"Guys I f—ed up,\" the project's official X account <a href=\"https:\/\/twitter.com\/slerfsol\" data-v-f87c67ca=\"\">wrote<\/a>. \"I burned the LP and the tokens that were set aside for the airdrop. Mint authority is already revoked so I can not mint them. There is nothing I can do to fix this. I am so f—ing sorry.\"","The Slerf team later went to an X Spaces to elaborate further on the situation. \"I'm sick to my stomach,\" developer @Slerfsol said in a Space on X. \"I'm literally about to throw up.\"","\"I'm lost for words,\" they added. \"I don't know what to do.\"","After the developer called the Slerf project a \"side quest,\" a Spaces participant chimed in: \"Losing $10 million on a side quest is crazy.\"","The price of SLERF has <a href=\"https:\/\/birdeye.so\/token\/7BgBvyjrZX1YKz4oh9mjb8ZScatkkwb8DzFx7LoiVkM3?chain=solana\" data-v-f87c67ca=\"\">pumped approximately 242%<\/a> over the past hour off the back of the news, with various participants in the X Space claiming the best course of action moving forward is to \"send it to $1 billion.\" According to on-chain data <a href=\"https:\/\/twitter.com\/lookonchain\/status\/1769647961192239295\" data-v-f87c67ca=\"\">highlighted<\/a> by Lookonchain, one trader made over $3 million in 12 minutes trading SLERF.","The latest mishap follows <a href=\"https:\/\/www.theblock.co\/post\/282993\/solana-memecoin-volume-fees-highs\" data-v-f87c67ca=\"\">a weekend rife with Solana-based memecoin presales<\/a>, during which various random projects emerged and received significant funding, often amounting to millions of dollars.","<em data-v-f87c67ca=\"\">This article has been updated with additional information. Furthermore, because multiple X accounts spoke simultaneously and due to the nature of X's user interface, this article incorrectly attributed quotes to user @SlorgoftheSlugs instead of @Slerfsol.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"LP","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$3 million","content":"MONEY"},{"type":"242%","content":"PERCENT"},{"type":"Slerf","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"Lookonchain","content":"LOCATION"}],"hashtag":["SOLANA"],"authors":["Adam James","The Block"]}