{"summary":"The Luno cryptocurrency exchange plans to pause crypto investments for some UK customers ahead of new FCA regulations, CoinDesk reported.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250325\/luno-halting-some-uk-client-trades-ahead-of-new-fca-rules-coindesk","publishDate":"2023-09-11T16:58:03","id":7778,"type":null,"title":"Luno halting some UK client trades ahead of new FCA rules: CoinDesk","category":["POLICY"],"content":["The <a href=\"https:\/\/www.theblock.co\/post\/160844\/luno-granted-digital-asset-license-in-france\" data-v-f87c67ca=\"\">Luno<\/a> cryptocurrency exchange plans to halt the ability of some UK customers to trade on its platform, CoinDesk <a href=\"https:\/\/www.coindesk.com\/business\/2023\/09\/11\/luno-to-halt-some-uk-clients-from-investing-in-crypto-as-regulation-looms\/?utm_medium=referral&amp;utm_source=rss&amp;utm_campaign=headlines\" data-v-f87c67ca=\"\">reported<\/a>, citing a statement from the company.","The move comes ahead of the Financial Conduct Authority's new cryptocurrency <a href=\"https:\/\/www.theblock.co\/post\/240231\/fca-crypto-memes-breach-financial-promotion-rules\" data-v-f87c67ca=\"\">promotion regulations<\/a> set to take effect on Oct. 8.","Luno Head of Public Policy Nick Taylor said the FCA's impending rules have prompted \"all compliant crypto firms with UK customers to make several changes to their platforms.\"","“For Luno, this includes pausing the ability to invest through the platform for some customers for the time being,\" and affected Luno customers will still be able to sell and withdraw their funds, Taylor said.","He added the company would adopt \"a phased approach to reintroducing investment opportunities to our customers.\"","A Luno customer service email reviewed by CoinDesk indicated clients would be unable to buy or trade crypto as of Oct. 6, two days prior to the enforcement of the FCA's new crypto promotion regulations.","In June, the FCA <a href=\"https:\/\/www.fca.org.uk\/news\/press-releases\/fca-introduces-tough-new-rules-marketing-cryptoassets\" data-v-f87c67ca=\"\">announced<\/a> \"tough new rules for marketing cryptoassets.\" The new regulations require cryptocurrencies to be classified as \"restricted mass market investments,\" and any advertisement or promotion must contain \"clear risk warnings.\"","Promotional language that could be interpreted as an incentive to invest such as \"refer a friend\" or \"new joiner bonuses\" will be banned, the regulator said. Crypto promotions must also put in place clear risk warnings and ensure adverts \"are clear, fair and not misleading.\"&nbsp;&nbsp;","In a June statement, FCA Executive Director of Consumers and Competition Sheldon Mills said that it's \"up to people to decide whether they buy crypto. But research shows many regret making a hasty decision. Our rules give people the time and the right risk warnings to make an informed choice.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Oct. 6","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Sheldon Mills","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Nick Taylor","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Oct. 8","content":"DATE"},{"type":"Taylor","content":"PERSON"}],"hashtag":["FCA"],"authors":["Brian McGleenon","The Block"]}