{"summary":"The Department of Energy was sued in a Texas court after the Energy Information Administration said in February that it would begin surveying crypto mining firms. \nThe parties involved in the lawsuit said they came to an agreement, according to a notice filed on Friday.","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280257\/emergency-bitcoin-miner-survey-off-the-table-after-parties-agree-to-end-lawsuit","publishDate":"2024-03-01T15:38:45","id":778,"type":null,"title":"Emergency bitcoin miner survey off the table after parties agree to end lawsuit","category":["Policy"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A government survey to get data on cryptocurrency mining companies' electricity usage has been tabled, according to a court document filed on Friday.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Department of Energy was sued in a Texas court after the Energy Information Administration —&nbsp;a statistical and analytical agency within the department <\/span><span class=\"s2\" data-v-f87c67ca=\"\">&nbsp;— <a href=\"https:\/\/www.theblock.co\/post\/275622\/us-to-collect-crypto-miner-energy-data\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">announced<\/span><\/a> in February that it would begin surveying crypto mining firms following an \"emergency collection of data request.\" The Texas Blockchain Council and bitcoin mining company Riot Platforms then sued the Department of Energy last week and said the <\/span><span class=\"s1\" data-v-f87c67ca=\"\">survey was a product of \"sloppy government process.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The parties involved in the lawsuit said they came to an agreement, according to a notice filed on Friday. As part of that <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.txwd.1172776308\/gov.uscourts.txwd.1172776308.24.0.pdf\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">agreement<\/span><\/a>, EIA has to \"destroy any information\" it received already and withdraw the survey. The EIA will post a new notice on the survey, which will allow for public comments, according to the filing.&nbsp;<\/span>","The EIA said it hoped to work with crypto mining companies in the future, in an emailed statement to The Block.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">\"We’re hopeful we can work with companies in the cryptocurrency mining industry to provide the American public with a clear understanding of energy use from cryptocurrency mining operations in the United States, much in the same way we do with other industries,\" the EIA said.&nbsp;<\/span>","The Texas Blockchain Council and Riot Platforms applauded the end of the emergency survey in a statement released on Friday.","<span class=\"s1\" data-v-f87c67ca=\"\">“The administration engaged in a targeted misuse of government emergency authority to attack a <\/span><span class=\"s1\" data-v-f87c67ca=\"\">legitimate industry for political purposes,” said TCE President Lee Bratcher, in the statement. “The government <\/span><span class=\"s1\" data-v-f87c67ca=\"\">demanding—and promising to publish—sensitive business information, in the face of criminal penalties, <\/span><span class=\"s1\" data-v-f87c67ca=\"\">is a threat to free enterprise everywhere. We are glad to now have an enforceable order that prevents <\/span><span class=\"s1\" data-v-f87c67ca=\"\">them from doing so.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Chamber of Digital Commerce called Friday's agreement a \"monumental victory\" for crypto mining.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">\"Today marks a significant triumph for the cryptocurrency mining sector as the U.S. Energy Information Administration (EIA) has <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.txwd.1172776308\/gov.uscourts.txwd.1172776308.24.0.pdf\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">retracted<\/span><\/a> its emergency survey targeting cryptocurrency miners,\" the group said in a <a href=\"https:\/\/digitalchamber.org\/a-landmark-victory-for-cryptocurrency-mining-overturning-the-eias-emergency-survey\/\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">statement<\/span><\/a>.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">Majority Whip Tom Emmer, R-Minn., who had <a href=\"https:\/\/www.theblock.co\/post\/278879\/republican-rep-tom-emmer-calls-government-agencys-bitcoin-miner-survey-an-abuse-of-power\" data-v-f87c67ca=\"\"><span class=\"s6\" data-v-f87c67ca=\"\">previously<\/span><\/a> written to the U.S. Office of Management and Budget over concerns about the OMB's use of its emergency approval authority, also cheered the news.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">\"The OMB cannot abuse its 'emergency' authorities to allow agencies like the EIA to ridiculously claim bitcoin miners are a threat to public safety and subject this industry to new, unvetted rules and regulations,\" Emmer <a href=\"https:\/\/twitter.com\/GOPMajorityWhip\/status\/1763650324017868808\" data-v-f87c67ca=\"\"><span class=\"s6\" data-v-f87c67ca=\"\">said<\/span><\/a> on X on Friday.&nbsp;<\/span>","<span class=\"s7\" data-v-f87c67ca=\"\">The Sierra Club, <\/span><span class=\"s2\" data-v-f87c67ca=\"\">one of the nation's largest grassroots environmental organizations, <a href=\"https:\/\/www.theblock.co\/post\/279722\/sierra-club-says-accurate-insight-into-crypto-mining-firms-energy-use-is-urgently-needed-in-support-of-federal-survey\" data-v-f87c67ca=\"\"><span class=\"s6\" data-v-f87c67ca=\"\">filed<\/span><\/a> an amicus brief in support of the Department of Energy on Wednesday.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">In a statement, Holly Bender, the Sierra Club's Chief Energy Officer, compared the energy usage of crypto mining to that required for lighting every home in the U.S., and said it generates more pollution than seven million cars. Bender also referenced the severe winter and ice storm that struck Texas in February 2021, underscoring the potential impacts of high energy consumption during extreme weather events.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Their operations in Texas and across the country are driving higher energy prices and threatening grid reliability,\" Bender said in the <a href=\"https:\/\/www.sierraclub.org\/press-releases\/2024\/02\/sierra-club-files-amicus-brief-addressing-data-collection-cryptocurrency\" data-v-f87c67ca=\"\"><span class=\"s8\" data-v-f87c67ca=\"\">statement<\/span><\/a>. \"Following the devastating impact of Winter Storm Uri, which led to hundreds of deaths in Texas due to power failures, it's particularly reprehensible for Texan cryptocurrency miners to obstruct basic efforts to gather essential data energy regulators need to deliver reliable, affordable power.”<\/span>","<em data-v-f87c67ca=\"\">Updated at 4:55 p.m. ET to include statements from EIA and TBC<\/em>"],"hashtag":["LAWSUITS"]}