{"summary":"Bagel plans to use the funding to grow its team and further develop its data platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274016\/bagel-network-raises-3-1-million-to-develop-data-marketplace","publishDate":"2024-01-23T08:59:29","id":7786,"type":null,"title":"Bagel secures $3.1 million to develop decentralized marketplace for ML datasets","category":["DEALS"],"content":["Bagel Network, a decentralized data platform aiming to support machine learning (ML) models, raised $3.1 million in a pre-seed round led by CoinFund.","Protocol Labs, Borderless Capital, Maven 11 Capital, Graph Paper Capital, and Breed VC participated in the round, which closed in December 2023 — though a valuation was not disclosed.","Machine learning, a subfield of artificial intelligence (AI), is fed with large amounts of data and algorithms to identify patterns and relationships within that data. Bagel Network argues that a disproportionate amount of data in the machine learning niche is owned and controlled by large entities, making it more difficult for smaller organizations to create high-quality ML models.","The project plans to resolve this by creating a marketplace where data scientists and AI engineers can collaboratively exchange and license verifiable datasets in a cost-effective and privacy-preserving manner, according to a statement.","“At Bagel Network, we envision a future where high-quality, machine learning data is trustlessly accessible to both humans and artificial intelligence,” Bagel Network founder Bidhan Roy said in the statement. Roy has over a decade of experience as a software engineer for major tech companies, specifically in data and machine learning, and previously worked as a project lead for Amazon’s Alexa machine learning team.","Bagel Network plans to use the funds to bolster operations, grow its current team of five, continue its research and development efforts, and further expand its data ecosystem, Roy told The Block.","Roy identified Bagel Network’s main competitors as web2 incumbents like HuggingFace, Kaggle, and Pinecone — aiming to utilize blockchain and zero-knowledge cryptography to target the mainstream machine learning and AI space. While Bagel Network has already begun onboarding data partners, Roy mentioned it was unable to reveal them at this time due to legal aspects still in progress.","The platform is being designed to operate as a standalone chain. Data providers post zero-knowledge commitments to the on-chain marketplace, which verifies the integrity of the initial dataset and tracks changes — similar to how GitHub works, Roy told The Block. The quality of the datasets is determined by a combination of the free market and Bagel Network’s reputation mechanisms, backed by staked tokens, he said.","“The platform's trustless mechanisms and horizontal scalability allow autonomous AI agents to join and learn specific skills for task performance,” Roy said. “We anticipate that activity from these agents will constitute a substantial portion of the platform's overall activity.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bagel Network","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Kaggle","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$3.1 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Amazon’s Alexa","content":"ORGANIZATION"},{"type":"CoinFund","content":"ORGANIZATION"},{"type":"Borderless Capital","content":"ORGANIZATION"},{"type":"Roy","content":"PERSON"},{"type":"December 2023","content":"DATE"},{"type":"Bidhan Roy","content":"PERSON"}],"hashtag":["DATA PROVIDERS","SEED &AMP; PRE-SEED"],"authors":["James Hunt","The Block"]}