{"summary":"Sindri, a zero-knowledge infrastructure platform, secured $5 million in a seed round led by CoinFund.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266492\/sindri-seed-round-coinfund","publishDate":"2023-12-07T08:05:02","id":7789,"type":null,"title":"Zero-knowledge platform Sindri closes $5 million seed round led by CoinFund","category":["DEALS"],"content":["Sindri, a zero-knowledge infrastructure platform, has closed a $5 million seed financing round led by CoinFund.&nbsp;The latest funding will be used by Sindri to scale its team, expand its developer network and build a comprehensive zero-knowledge-based developer stack. It follows a $2 million pre-seed funding in June 2022.","Sindri enables developers to verify data with zero-knowledge proofs, and use them for research use cases and in blockchain applications.","ZK proofs have gained significant traction in recent years, offering two types of use cases: enabling parties to verify cryptographic statements without disclosing specifics about the statement itself and improving the scalability of blockchains through efficient verification. Besides their use in blockchain, ZK proofs can also be used to verify data in <a href=\"https:\/\/www.theblock.co\/post\/251178\/nil-foundation-taceo-ethereum\" data-v-f87c67ca=\"\">machine learning<\/a> or AI models — a concept called zkML.","“Zero-knowledge proofs are finding product market fit within the blockchain space in the form of blockchain scalability and interoperability technology, the intersection of web3 and AI, as well as off-chain computation for blockchains broadly,” said Jake Brukhman, CEO of CoinFund, regarding the investment in Sindri.","The platform is used by a diverse user base, including blockchain Layer 2s, zkML projects, ZK researchers and other organizations.","“We’re building in collaboration with some of the most forward-thinking teams and protocols in and outside of blockchain, and we’re excited to see them push the capabilities of their applications using Sindri,” said Stasia Carson, co-founder of Sindri.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2022","content":"DATE"},{"type":"CoinFund","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Sindri","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Stasia Carson","content":"PERSON"},{"type":"$2 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Jake Brukhman","content":"PERSON"},{"type":"$5 million","content":"MONEY"}],"hashtag":["DEVELOPER TOOLS"],"authors":["Vishal Chawla","The Block"]}