{"summary":"MoonPay has closed a $555 million raise led by Coatue and Tiger Global. Existing investor Blossom Capital and new investors NEA, Paradigm and Thrive also participated in the round. \nThe fund will be used to scale up its crypto payment ambitions, driving mainstream adoption of digital assets and NFTs. ","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124980\/moonpay-raise","publishDate":"2021-11-22T08:30:27","id":779,"type":null,"title":"MoonPay raises $555 million from Coatue and Tiger","category":["Payments and Banking"],"content":["<span data-v-f87c67ca=\"\">Crypto payments infrastructure service MoonPay has announced that it has raised a monster $555 million from Coatue and Tiger Global, hitting a $3.4 billion valuation<\/span><span data-v-f87c67ca=\"\">.<\/span><span data-v-f87c67ca=\"\"> The company was previously bootstrapped and profitable, generating $150 million in net revenue this year.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Today’s announcement confirms <\/span><a href=\"https:\/\/www.theinformation.com\/articles\/crypto-startup-moonpay-valued-at-3-4-billion-in-first-vc-funding\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">an earlier report<\/span><\/a><span data-v-f87c67ca=\"\"> from The Information.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">MoonPay allows users to pay for crypto and digital assets via card, Apple Pay and even <\/span><a href=\"https:\/\/www.theblockcrypto.com\/news+\/92950\/europe-open-banking-uk-crypto-wallet-payments\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">open banking.<\/span><\/a><span data-v-f87c67ca=\"\"> Since its inception in 2019, the company has facilitated transactions in over 90 cryptocurrencies, building a user base of over 7 million.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The company recently received a shout out from talk show host Jimmy Fallon during his interview with <\/span><a href=\"https:\/\/www.youtube.com\/embed\/AXC-_kWqZXo?start=83&amp;end=113\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">digital artist Beeple<\/span><\/a><span data-v-f87c67ca=\"\">. Fallon used the company’s services to buy his first NFT.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">I was lucky enough to sit down for coffee with Jimmy,” says co-founder and CEO Ivan Soto-Wright. “A friend of mine introduced me to him last week during NFT.NYC and, organically, he was like, let me shout it out on the show.”<\/span>","<span data-v-f87c67ca=\"\">Fallon described the company as “PayPal for crypto.” Asked if he agreed with this assessment, Soto-Wright said that although he aspires for MoonPay to be its own brand, he sees the payment tool becoming the “passport” to Web3 as PayPal was to e-commerce.<\/span>","<span data-v-f87c67ca=\"\">But for now, the company doesn’t plan to go into other product lines to become a crypto super-app. Instead, it’s focused on tapping into the appetite for NFTs in the entertainment industry and further increasing mainstream adoption of crypto.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">”We've connected millions of people to billions of dollars worth of digital assets. Now, the ambition is to connect billions of people to trillions of dollars worth of digital assets,” says Soto-Wright.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Describing his path to founding MoonPay, Soto-Wright talks of how he was fascinated about how crypto enabled anybody with an internet connection to access financial services and send money across the world.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I think the media spent a lot of time talking about price movements of bitcoin or price movements of these digital assets,” he says. “Whereas for me, it's a story about billions of people around the world who didn't have access to a bank account.”<\/span>","<span data-v-f87c67ca=\"\">MoonPay is taking on venture capital money as a way to fund recruiting and to enable the company to pursue mergers and acquisitions. Its priorities are increasing security private key security and enabling even more localized payment methods in Latin America and Asia, according to Soto-Wright.<\/span>","<span data-v-f87c67ca=\"\">Another reason the company pursued funding from Tiger and Coatue was to stay competitive, from a valuation standpoint, in a sector where unicorn status has become commonplace.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“In the VC founder community recently, you're seeing incredible fundraises,” says Soto-Wright, adding that he and his co-founder Victor Faramond maintain “majority control” of the business.&nbsp;<\/span>"],"hashtag":["FINTECH","PAYMENTS","TIGER GLOBAL"]}