{"summary":"The announcement comes following a rapid rise in the CryptoPunk collection&#x27;s floor price.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152994\/christies-nft-maven-joins-yuga-labs-to-steward-cryptopunks","publishDate":"2022-06-19T16:17:56","id":7791,"type":null,"title":"Christie&#x27;s NFT maven joins Yuga Labs to steward CryptoPunks","category":["NFTS"],"content":["Christie's head of non-fungible tokens (NFTs) announced on Sunday that he would be joining industry heavyweight Yuga Labs as brand leader for its recently-acquired collection CryptoPunks.&nbsp;","Noah Davis <a href=\"https:\/\/twitter.com\/NonFungibleNoah\/status\/1538584141419143168\" data-v-f87c67ca=\"\">wrote on Twitter<\/a>: \"I really can’t overstate how incredible this journey out of the old Art World and into Web3 has been and I can’t wait to see where the road ahead leads… I only know it will continue to be wild and weird. And I like it that way.\"","At Christie's, Davis was responsible for bringing Beeple’s piece 'The First 5,000 Days' to auction. The sale made headlines at the time in March 2021 for its <a href=\"https:\/\/www.theblock.co\/linked\/98047\/christies-beeple-auction-ends-digital-art\" data-v-f87c67ca=\"\">$69 million price tag<\/a>, a figure which&nbsp; put Beeple “among the top three most valuable living artists.”","Until recently, Yuga Labs' headline asset was the Bored Ape Yacht Club (BAYC). But in March this year, the company <a href=\"https:\/\/www.theblock.co\/linked\/137631\/bored-apes-creator-yuga-labs-acquires-ip-for-cryptopunks-and-meebits\" data-v-f87c67ca=\"\">bought out CryptoPunks intellectual property rights<\/a> – a move which many believed would mean turning over commercial rights to NFT holders. This prompted speculation about what changes Yuga would make to the way people could use their NFTs. At the time, Yuga pledged that it would not look to emulate the club model it had created for BAYC and would look to add utility in other ways for Punk holders.&nbsp;","In his announcement, Davis pledged not to \"fuck with\" CryptoPunks, adding that he would not be emblazoning the pixelated characters on lunchboxes or making \"cringe TV shows\/shitty movies.\"","BAYC co-founder Garga <a href=\"https:\/\/twitter.com\/CryptoGarga\/status\/1538583334930075649\" data-v-f87c67ca=\"\">wrote on Twitter<\/a> on Sunday that new terms for Punks would be rolled out in the next couple of weeks.&nbsp;","\"Why the hold up on that?,\" he added. \"These were frankly too significant to rush, and too impactful for the NFT community at large to risk developing them in silo.\"","\"We’re committed to a slow and thoughtful approach to Punks that takes into account the community’s involvement and support. We’re humbled to be the stewards of this historic IP, and we have the utmost confidence in Noah and the Punk community.\"","The announcement of the hire comes amid a rapid rise in the CryptoPunk collection's floor price and trading volume. According to data provider <a href=\"https:\/\/cryptoslam.io\/cryptopunks\" data-v-f87c67ca=\"\">Cryptoslam<\/a>, CryptoPunks sales volume had hit $10.4 million in the last 24 hours, a more than 230% increase from yesterday.&nbsp;","What's more, the floor price for the collection had <a href=\"https:\/\/twitter.com\/venturecoinist\/status\/1538559138166411264?s=21&amp;t=c5s0zlZkAGe7-L0GZGkyfQ\" data-v-f87c67ca=\"\">begun to spike<\/a> even before the announcement went out on Twitter, according to <a href=\"https:\/\/www.coingecko.com\/en\/nft\/cryptopunks\" data-v-f87c67ca=\"\">data from Coingecko<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"last 24 hours","content":"DATE"},{"type":"Coingecko","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Yuga","content":"PERSON"},{"type":"Davis","content":"PERSON"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Cryptoslam","content":"PERSON"},{"type":"March 2021","content":"DATE"},{"type":"Garga","content":"PERSON"},{"type":"$69 million","content":"MONEY"},{"type":"Christie's","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"230%","content":"PERCENT"},{"type":"Noah","content":"LOCATION"},{"type":"Noah Davis","content":"PERSON"},{"type":"March this year","content":"DATE"},{"type":"$10.4 million","content":"MONEY"}],"hashtag":["CRYPTOPUNKS","YUGA LABS"],"authors":["Lucy Harley-McKeown","The Block"]}