{"summary":"Experienced traders are accumulating dYdX governance tokens, according to Nansen data.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247160\/smart-money-traders-seemingly-increasing-dydx-token-holdings-nansen","publishDate":"2023-08-24T07:32:09","id":7795,"type":null,"title":"&#x27;Smart money&#x27; traders seemingly increasing dYdX token holdings: Nansen","category":["GOVERNANCE"],"content":["Experienced traders have seemingly been accumulating dYdX’s governance token, according to data from Nansen.","“Smart Money” wallets, which Nansen associates with skilled traders, have been steadily increasing their holdings of dYdX tokens, the analytics firm said, based on the on-chain data it aggregated. According to Nansen, these wallets likely include notable players such as top DEX traders, liquidity providers, and venture funds. These 80-odd smart money wallets hold over 47 million tokens ($103 million) — a 30% increase in their holdings since the year’s start.&nbsp;","“While the number of Smart Money wallets holding dYdX tokens has been flat since June 23, these wallets have been steadily increasing their exposure. Holdings have hit an all-time high of over 47.8 million tokens,” Nansen analyst Martin Lee said in a statement shared with The Block.&nbsp;“We’re also seeing net outflows of the token from exchanges over the last 30 days,” he added, which potentially hints at increased holdings by traders.","Still, this is only a small portion of the total 1 billion dYdX token supply. Notably, there are also 6.5 million dYdX tokens that may be scheduled to unlock by the end of August, according to <a href=\"https:\/\/token.unlocks.app\/dydx\" data-v-f87c67ca=\"\">data<\/a> from Token Unlocks.","<span data-v-f87c67ca=\"\">dYdX tokens held by 'smart money' wallets | Image: Nansen<\/span>","The finding comes ahead of dYdX's plan to launch a Cosmos-based blockchain and version 4 release, currently in testnet.","Recently, the dYdX Foundation also <a href=\"https:\/\/dydx.foundation\/blog\/exploring-the-future-of-dydx\" data-v-f87c67ca=\"\">discussed<\/a> the possibility of conducting a governance vote to decide whether to migrate dYdX tokens from Ethereum to become the native asset on the planned Layer 1 on Cosmos.&nbsp;","dYdX Foundation CEO Charles d’Haussy told The Block that users will not pay gas fees to trade on the new chain. They will pay \"trading fees which will accrue to validators and their stakers.\"","\"The dYdX Chain will be a proof-of-stake blockchain network and, as such, if and when deployed on mainnet, it will require a Layer 1 protocol token for staking to validators in order to secure the chain and for stakers of the Layer 1 token to govern the network,\" d'Haussy added.","The dYdX governance token changed hands for around $2.19 at 7 a.m. ET — up over 9% in the past 24 hours, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/dydx\" data-v-f87c67ca=\"\">CoinGecko<\/a>.","Founded in 2018, dYdX is currently the largest decentralized derivatives exchange, with a trading <a href=\"https:\/\/www.coingecko.com\/en\/exchanges\/dydx_perpetual\" data-v-f87c67ca=\"\">volume<\/a> of almost $590 million over the last 24 hours, according to CoinGecko data.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"9%","content":"PERCENT"},{"type":"last 24 hours","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"7 a.m.","content":"TIME"},{"type":"2018","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Martin Lee","content":"PERSON"},{"type":"Charles d’Haussy","content":"PERSON"},{"type":"$590 million","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Token Unlocks","content":"ORGANIZATION"},{"type":"Nansen","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"$103 million","content":"MONEY"},{"type":"last 30 days","content":"DATE"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"$2.19","content":"MONEY"},{"type":"June 23","content":"DATE"},{"type":"August","content":"DATE"},{"type":"dYdX Foundation","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ASSETS","DAOS","DERIVATIVES","DEXS","ETHEREUM","SMART CONTRACTS"],"authors":["Brian McGleenon","The Block"]}