{"summary":"&quot;The AMLR is not a ban of self-custody payments, self-custody wallets or P2P transfers,&quot; Circle’s EU Policy Director Patrick Hansen said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284442\/no-the-eu-is-not-banning-self-custodial-crypto-transactions-or-wallets","publishDate":"2024-03-25T10:25:44","id":78,"type":null,"title":"No, the EU is not banning self-custodial crypto transactions or wallets","category":["POLICY"],"content":["The crypto community erupted into panic over the weekend amid incorrect reports that the EU was banning anonymous crypto wallets and self-custodial payments.","The reports seemingly misinterpreted <a href=\"https:\/\/x.com\/echo_pbreyer\/status\/1770853127798861868?s=20\" data-v-f87c67ca=\"\">comments<\/a> from Patrick Breyer, a member of the European Parliament, on Thursday, confirming its economic and monetary policy committee's approval of the new EU Anti Money Laundering Regulation (AMLR) and its final <a href=\"https:\/\/www.europarl.europa.eu\/meetdocs\/2014_2019\/plmrep\/COMMITTEES\/CJ12\/AG\/2024\/03-19\/1297044EN.pdf\" data-v-f87c67ca=\"\">text<\/a>.","The misinformation went <a href=\"https:\/\/x.com\/JoeNakamoto\/status\/1771472999700484393?s=20\" data-v-f87c67ca=\"\">viral<\/a>, warning that “payments to self-custody bitcoin and crypto wallets are now illegal.” However, others were quick to respond to the overreaction. “This needs to be taken seriously but, as always, it's crucial to read the text of the actual legislation. TLDR self-custody is not illegal,” Freddie New, Head of Policy at Bitcoin Policy UK, <a href=\"https:\/\/x.com\/freddienew\/status\/1771492593676714091?s=20\" data-v-f87c67ca=\"\">said<\/a>.","“Fake news isn't it? I read the article and it says if you're hosting wallets for other people they need KYC (which is the same in America),” crypto influencer Jordan Fish, aka Cobie, <a href=\"https:\/\/twitter.com\/cobie\/status\/1771551283591492042\" data-v-f87c67ca=\"\">added<\/a>. “Seems maybe they're also ‘banning’ you sending from a CEX to self-hosted without identifying who it is. But since self-custody to self-custody is unaffected, and self-custody still allowed, just withdraw from CEX to your own self-custody?”","Circle’s EU Strategy and Policy Director Patrick Hansen also moved to swiftly <a href=\"https:\/\/x.com\/paddi_hansen\/status\/1771597759923073237?s=20\" data-v-f87c67ca=\"\">debunk<\/a> the reports. “Self custody wallets are not banned. Payments to\/from self custody wallets are not banned. P2P transfers are explicitly excluded from AMLR, as are self custody software and hardware wallets,” he said. “However, paying with crypto (for example to merchants) with a non KYC’d self custody wallet will be more difficult\/banned depending on the merchants set up. This change, as well as the lower thresholds for anonymous cash payments, has unfortunately been agreed months ago,” he added.","Hansen explained that the AMLR is not a crypto regulation — it is a broad anti-money laundering\/counter-terrorist financing framework that applies to institutions classified as “obliged entities” or “OEs.” These include all financial institutions, as well as the so-called “CASPs” (crypto-asset service providers), but also other institutions like gambling services that could be prone to AML\/CFT risk.","However, the AMLR explicitly excludes providers of hardware and software, like Ledger, as well as self-custody wallets, like MetaMask, that do not have access to or control over users’ crypto assets.","All CASPs, such as centralized crypto exchanges and custodial wallet providers regulated under Markets in Crypto-Assets legislation (MiCA), will need to follow standard KYC\/AML procedures like customer due diligence. Yet they are already subject to these obligations under current AMLD5 legislation, Hansen explained.","MiCA is a <a href=\"https:\/\/www.theblock.pro\/mica-european-unions-attempt-at-unified-regulation-230196\" data-v-f87c67ca=\"\">regulatory framework<\/a> proposed by the European Union to govern digital assets and their markets that came into force in June 2023 and will be fully applicable from Dec. 30, 2024.","“The AMLR (Art. 58) now explicitly prohibits CASPs to provide anonymous accounts, meaning a custodial crypto business cannot provide services for anonymous users. This is already prohibited under existing AML rules anyway, so nothing new,” Hansen said. However, others <a href=\"https:\/\/x.com\/TheDesertLynx\/status\/1771626766974451954?s=20\" data-v-f87c67ca=\"\">warned<\/a>, this could impact non-KYC custodial Bitcoin Lightning wallets like Wallet of Satoshi.","Additionally, CASPs will not be able to provide accounts for privacy coins, though such practice is already widespread, and MiCA already prohibits crypto assets with built-in anonymization.","As for transfers between CASPs and self-custody wallets, AMLR requires “risk-mitigating” measures, Hansen continued, including blockchain analytics or collecting additional data about their origin or destination. It brings the transactions in line with the Transfer of Funds Regulation (TFR), the EU's implementation of the FATF (Financial Action Task Force) travel rule, but this is nothing new either, Hansen added.","Regarding merchant payments, AMLR also limits cash payments to €10,000 ($10,830). There are no restrictions on using self-custodial wallets for buying goods or services in the EU. However, should customers want to use a CASP such as <a href=\"https:\/\/support.bitpay.com\/hc\/en-us\/articles\/15651807101325-BitPay-s-New-KYC-Threshold-for-European-Customers\" data-v-f87c67ca=\"\">BitPay<\/a> to buy goods or services with crypto, the CASP will need to verify users’ identity and implement additional KYC\/AML measures if the transaction (single or combined) is worth more than €1,000 ($1,083).","“The AMLR is not a ban of self-custody payments, self-custody wallets or P2P transfers,\" Hansen concluded. “It mostly reiterates AML\/CFT rules for CASPs and other OEs, but for the most part, these rules were already mandatory and common business practice anyway (from AMLD5, MiCA, TFR).”","It also could have been worse, with Hansen describing the final version as a “great outcome” for the crypto industry. “Previous versions of the proposed AMLR proposed a way stricter approach that would have meant a KYC on the self-custody originator\/beneficiary, but also thanks to industry efforts a risk-based approach with various options was finally agreed on.”","Parliament proposed limiting merchant payments from a self-custody wallet to €1,000, which was removed from the final version. It also previously proposed including DAOs, DeFi, NFT platforms and even developers under AMLR’s scope, Hansen said, arguing the impact from the legislation would now be “extremely limited.”","The approved AMLR text only needs to pass final, purely formal, approval in the European Parliament, likely at the end of April, and in the Council of the EU. It would then enter application three years after publication, around summer 2027, according to Hansen.","The European Securities and Markets Authority (ESMA) advanced its efforts to implement the Markets in Crypto Assets regulation by <a href=\"https:\/\/www.esma.europa.eu\/press-news\/esma-news\/esma-finalises-first-rules-crypto-asset-service-providers\" data-v-f87c67ca=\"\">publishing<\/a> its first report and launching a third consultation on Monday.&nbsp;","The report outlines draft requirements for firms seeking authorization under MiCA, aiming to standardize the regulatory landscape for crypto assets within the EU. Additionally, the ESMA seeks feedback on rules to combat market abuse and ensure proper service delivery in the crypto sector, with the MiCA framework set to be fully enforced by December.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"summer 2027","content":"DATE"},{"type":"EU Strategy and Policy","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"weekend","content":"DATE"},{"type":"ESMA","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Transfer of Funds Regulation (TFR","content":"ORGANIZATION"},{"type":"Hansen","content":"PERSON"},{"type":"Dec. 30, 2024","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"FATF (Financial Action Task Force","content":"ORGANIZATION"},{"type":"$10,830","content":"MONEY"},{"type":"AMLR","content":"ORGANIZATION"},{"type":"TFR","content":"ORGANIZATION"},{"type":"Patrick Hansen","content":"PERSON"},{"type":"AML","content":"ORGANIZATION"},{"type":"MiCA","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Crypto","content":"LOCATION"},{"type":"European Parliament","content":"ORGANIZATION"},{"type":"European Union","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Freddie New","content":"ORGANIZATION"},{"type":"CFT","content":"ORGANIZATION"},{"type":"Crypto Assets","content":"ORGANIZATION"},{"type":"Satoshi","content":"PERSON"},{"type":"Patrick Breyer","content":"PERSON"},{"type":"America","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"EU Anti Money Laundering Regulation (AMLR","content":"ORGANIZATION"},{"type":"Bitcoin Policy UK","content":"ORGANIZATION"},{"type":"$1,083","content":"MONEY"},{"type":"European Parliament","content":"LOCATION"},{"type":"European Securities and Markets Authority (ESMA","content":"ORGANIZATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["ANTI-MONEY LAUNDERING","EUROPEAN COMMISSION","EUROPEAN COUNCIL","EUROPEAN PARLIAMENT","EUROZONE REGULATION","WALLET MAKERS"],"authors":["James Hunt","The Block"]}