{"summary":"China’s bitcoin mining crackdown is forcing crypto miners to dump GPUs on the secondhand market.\nBut at least two mining facility owners are still advertising their mining farms, claiming they’re still operational within Sichuan.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110638\/chinese-crypto-miners-dump-gpu","publishDate":"2021-07-07T04:45:48","id":78,"type":null,"title":"Chinese crypto miners are dumping GPUs on secondhand trading site","category":["China"],"content":["Chinese crypto miners have started dumping used graphic processing units (GPUs) on the secondhand market following China's bitcoin mining crackdown.","Over the past one and half months, there has been an increasing number of new posts for selling stacks of GPUs on Xianyu, which is one of the largest marketplace apps in China for secondhand goods and is owned by Alibaba.","The screen recording made by The Block <a href=\"https:\/\/twitter.com\/wolfiezhao\/status\/1412697516940967945?s=21\" data-v-f87c67ca=\"\">shows<\/a> one such post along with dozens of similar ads recommended at the end of the page, most of which have been put up since mid-May.&nbsp;","Although the Chinese State Council's crackdown comment was specifically about bitcoin trading and mining activities, provincial governments have targeted the broader crypto mining sector by ordering power plants to cut their supplies to \"virtual currency mining\" farms. (Here's a <a href=\"https:\/\/www.theblockcrypto.com\/daily\/110499\/a-timeline-of-chinas-bitcoin-mining-crackdown-and-how-it-goes-beyond-environmental-concerns\" data-v-f87c67ca=\"\">timeline<\/a> of the series of regulatory events that resulted in a <a href=\"https:\/\/www.theblockcrypto.com\/post\/109301\/secondhand-bitcoin-miner-supply-spiking-bitmain\" data-v-f87c67ca=\"\">spiking supply<\/a> of bitcoin ASIC miners in the secondhand market.)","As a result, GPU mining farms have also been affected even though they are less energy-intensive than bitcoin mining facilities. Most notably, <a href=\"https:\/\/www.theblockcrypto.com\/post\/109629\/ethereum-hash-rate-sink-china-mining-shutdown\" data-v-f87c67ca=\"\">Ethereum's hash rate<\/a> has also dropped by over 20% since China's crackdown comment in May as mining firms went offline. A lot of the hashing power on the Ethereum network relied on GPUs in addition to the Ethash ASIC miners.","While not every seller on Xianyu said they were crypto miners, the images of shelves of GPUs do betray their mining operations.&nbsp;","The prices quoted in these sales can vary significantly from each other as they are all used GPUs. But they come as a total reversal to the market situation in February when the supply of desktop GPUs was running so low that it forced Ethereum miners to turn to <a href=\"https:\/\/www.theblockcrypto.com\/daily\/94414\/ethereum-miners-gaming-laptops-gpu-shortage\" data-v-f87c67ca=\"\">gaming laptops<\/a> with built-in GPUs (causing prices to rise across the board).&nbsp;","For instance, one owner tried selling a batch of RTX 3060 GPUs from various brands with an initial price range between 2,200 and 2,899 yuan ($336 to $450) for each. But the owner has further lowered it down to 1,760 yuan ($270) after over 60 potential buyers posted bids at much cheaper quotes.&nbsp;","\"Can only accept in-person transaction for a large bulk buy and can be traded once after the facility is fully cleared out,\" the owner said in the post, with a photo of the mining farm facility.&nbsp;","","","Another GPU owner who posted an ad within the past 30 days also said the RTX 30 series GPUs are on sale with 50% off but buyers have to pick them up at a power station along the Yarlung Tsangpo river.","","","A third seller posted an ad a month ago trying to liquidate a shelf of gaming laptops with built-in 3060 GPUs for around $1,000 each.","But multiple users commented on the thread that even half of the ask price was too high and they would only consider if the owner can sell at below $461 for each.","","","At the same time, there is a sign that some smaller bitcoin mining farms in Sichuan are still operational with directly supplied energy from hydropower plants.","Within the past 30 days, there have been at least two owners advertising their bitcoin mining hosting services on Xianyu with an electricity ask price of 0.37 yuan (or $0.057) per kWh.","\"The power supply is available as long as you can still see this ad,\" the owner wrote in the description. \"It's directly supplied from power plants. Look for equipment better than Bitmain's AntMiner S9, like T17, WhatsMiner M20, M21s, InnoSilicon's T2 etc.\"","","","A second hosting service provider that is looking for mining customers also said the facility is built within their hydropower plant.&nbsp;","As The Block <a href=\"https:\/\/www.theblockcrypto.com\/post\/108916\/sichuan-orders-state-power-grid-to-cut-supply-for-26-bitcoin-mining-farms\" data-v-f87c67ca=\"\">explained<\/a>, this direct supply model has always been a common but grey area practice in China's hydro provinces of Sichuan and Yunnan because it bypasses China's State Grid as the energy distribution middleman.&nbsp;","Since Sichuan handed down the order for the State Grid to cut off power supplies to regulated bitcoin mining facilities in the province, some private power plant owners have started <a href=\"https:\/\/www.scmp.com\/tech\/policy\/article\/3139053\/hydropower-plants-go-sale-china-amid-mining-crackdown-and-bitcoin-slump\" data-v-f87c67ca=\"\">offering to sell<\/a> their infrastructure on Xianyu."],"hashtag":["BITCOIN"]}