{"summary":"The Financial Services Commission today proposed an amendment to prohibit citizens from purchasing crypto using credit cards.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270264\/south-korea-proposes-ban-on-credit-card-payments-for-crypto","publishDate":"2024-01-03T20:49:25","id":7806,"type":null,"title":"South Korea proposes ban on credit card payments for crypto","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">South Korea’s Financial Services Commission, the country’s top financial regulator, today proposed an amendment to its credit finance act, which aims to effectively prohibit local citizens from purchasing cryptocurrencies using credit cards.<\/span>","<span data-v-f87c67ca=\"\">The main reason for this new amendment is to limit its crypto traders from buying crypto on foreign crypto exchanges, the regulator said. The FSC noted in its <\/span><a href=\"https:\/\/www.fsc.go.kr\/po040301\/view?noticeId=3954&amp;curPage=&amp;srchKey=&amp;srchText=&amp;srchBeginDt=&amp;srchEndDt=\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">legislative notice<\/span><\/a><span data-v-f87c67ca=\"\"> that concerns have emerged over the illegal outflow of domestic funds, money laundering and the encouragement of speculative behavior, which led to the decision.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The regulator plans to collect public feedback on the amendment proposal until Feb. 13. It’s expected to be reviewed and voted on with the aim of implementation in the first half of 2024, according to <\/span><a href=\"https:\/\/www.yna.co.kr\/view\/AKR20240103152100002\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Yonhap News Agency<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Under a 2021 amendment to the financial reporting law, South Korean crypto users are required to trade using withdrawal and deposit accounts on local exchanges, verified with their real names. Local trading platforms are also required to undertake rigorous licensing preparations to provide fiat-to-crypto services, including securing a partnership with a local bank.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"’s Financial Services Commission","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"FSC","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"the first half of 2024","content":"DATE"},{"type":"Yonhap News Agency","content":"ORGANIZATION"},{"type":"Feb. 13","content":"DATE"}],"hashtag":["ASIAN REGULATION"],"authors":["Danny Park","The Block"]}