{"summary":"Blockchain infrastructure firm QuickNode is adding support for the XRP Ledger, making it available to developers that use its platform. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237173\/quicknode-adds-support-for-xrp-ledger","publishDate":"2023-06-30T10:00:17","id":7809,"type":null,"title":"QuickNode adds support for XRP Ledger","category":["CRYPTO ECOSYSTEMS"],"content":["Blockchain infrastructure firm QuickNode is adding support for the XRP Ledger, making it available to developers that use its platform.&nbsp;","\"Since its inception, XRPL has transformed the landscape of international and domestic payments, making them more streamlined and efficient,\" the company said in a statement on Friday. \"It uses proven crypto and blockchain technology to offer users enterprise-grade financial solutions faster, more transparent, and more cost-effective than traditional financial services.\"","XRPL has a wide range of uses across including tokenization, CBDCs, DeFi and stablecoins, QuickNode said.","In January of this year, QuickNode secured <a href=\"https:\/\/www.theblock.co\/post\/205028\/quicknode-reaches-800-million-valuation-in-series-b-round\" data-v-f87c67ca=\"\">$60 million<\/a> in Series B funding, netting the firm a valuation of $800 million. Leading the round was Dan Tapiero's 10T Holdings, with Tapiero also joining QuickNode's board of directors. Additional Series B supporters included Reddit founder Alexis Ohanian's Seven Seven Six, Protocol Labs, Tiger Global and QED Investors, The Block previously reported.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dan Tapiero","content":"PERSON"},{"type":"Tapiero","content":"PERSON"},{"type":"Reddit","content":"LOCATION"},{"type":"Tiger Global","content":"ORGANIZATION"},{"type":"$60 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"QuickNode","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"Alexis Ohanian","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"$800 million","content":"MONEY"},{"type":"10T Holdings","content":"ORGANIZATION"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}