{"summary":"P2P crypto exchange Paxful now allows users to trade physical gold with bitcoin \nPaxful co-founder and CEO Ray Youssef told The Block: “With the recent economic downturn, people still prefer gold as a safe investment, with some already reporting shortages of supply.”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61110\/p2p-crypto-exchange-paxful-now-allows-users-to-trade-gold-with-bitcoin","publishDate":"2020-04-07T09:00:33","id":781,"type":null,"title":"P2P crypto exchange Paxful now allows users to trade gold with bitcoin","category":["Bitcoin"],"content":["Peer-to-peer (P2P) bitcoin exchange Paxful has added physical gold as a payment option, at a time when the yellow metal is in short supply.","The new feature allows Paxful users to <a href=\"https:\/\/paxful.com\/support\/en-us\/articles\/360012879139-Buying-bitcoins-with-gold\" data-v-f87c67ca=\"\">buy bitcoin with gold<\/a>, and <a href=\"https:\/\/paxful.com\/support\/en-us\/articles\/360012787300-Selling-bitcoins-for-gold\" data-v-f87c67ca=\"\">sell bitcoin for gold<\/a>.","“With the recent economic downturn, people still prefer gold as a safe investment, with some already reporting <a href=\"https:\/\/www.theblockcrypto.com\/linked\/60587\/gold-coins-and-bars-in-short-supply-premiums-exploding\" data-v-f87c67ca=\"\">shortages of supply<\/a>. In a way, it's even symbolic to trade the gold with virtual gold, aka bitcoin,” Paxful co-founder and CEO Ray Youssef told The Block.","Buying gold with bitcoin in the current situation can be understandable. But who will sell gold for bitcoin now? “There are areas in the world where gold is abundant, but bitcoin is scarce. So, people in these areas can now be part of the crypto economy too,” Youssef told The Block.","Paxful claims to be the only P2P marketplace that provides gold as a payment method. “We assessed the demand for buying and selling bitcoin with gold, and it's surprisingly high. So, adding gold was the next natural step for us,\" said Youssef.","Paxful is accepting \"any form\" of physical gold, Youssef told The Block, adding that the new service is available for clients across the world.","Bitcoin will remain in the Paxful escrow during a trade, and the physical delivery of gold must be completed within 21 days of completion of a transaction, said the exchange.","Notably, there are no minimum and maximum transaction limits for trading gold and bitcoin and vice versa. Still, users will be required to meet Paxful’s know-your-customer (KYC) verification requirements at certain thresholds, said Youssef.","Looking ahead, Paxful plans to add more “goods and services” as a payment method, said Youssef, without disclosing specific details.","Paxful currently already supports over 300 types of payment methods for purchasing bitcoin, including online wallets, bank transfer, mobile recharge, and cash in-person, among other options."],"hashtag":[]}