{"summary":"A Telegram channel has been spreading know-you-customer (KYC) information including photos, passports, IDs, which it claims is of Binance users. Thousands","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/35046\/binance-responds-to-an-alleged-kyc-breach-on-telegram-saying-there-are-inconsistencies-involved","publishDate":"2019-08-07T03:08:09","id":7814,"type":null,"title":"Binance responds to an alleged KYC breach on Telegram, saying it is &#x27;false&#x27; and there are &#x27;inconsistencies&#x27; involved","category":["EXCHANGES"],"content":["A Telegram <a href=\"https:\/\/t.me\/kycisimportant\" data-v-f87c67ca=\"\">channel<\/a> has been spreading know-you-customer (KYC) information including photos, passports, IDs, which it claims is of Binance users. Thousands of people have already joined the channel today. The Block reached out to Binance to confirm whether the KYC documents are a result of an internal leak or whether the documents originate from phishing attacks or a KYC account selling service.","Leah Li, global PR manager at Binance, told The Block:","\"There are inconsistencies when comparing this data to the data in our system. At the present time, no evidence has been supplied that indicates any KYC images have been obtained from Binance, as these images do not contain the digital watermark imprinted by our system.”","“With that said, our security team is hard at work pursuing all possible leads in an attempt to identify the source of these images, as it remains unclear where they were obtained,” she added.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBinance CEO Changpeng Zhao (“CZ”) also <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1158978929803182080?s=21\" data-v-f87c67ca=\"\">tweeted<\/a> earlier today: “Don't fall into the \"KYC leak\" FUD. We are investigating, will update shortly.”","After the publication of this story, Binance <a href=\"https:\/\/www.binance.com\/en\/blog\/365766157488967680\/Statement-on-False-KYC-Leak\" data-v-f87c67ca=\"\">issued<\/a> an official statement on the leak, saying it is \"false,\" adding: \"An unidentified individual has threatened and harassed us, demanding 300 BTC in exchange for withholding 10,000 photos that bear similarity to Binance KYC data.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe exchange further said that the photos appear to be dated from Feb. 2018, and at that time it had contracted “a third-party vendor” for KYC verification in order to “handle the high volume of requests at that time.” The exchange, therefore, is also investigating with the third-party vendor for more information.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBinance is also rewarding \"up to 25 BTC\" to those who will help it identify the individual and allow it to take legal action against them.","This is not the first time such&nbsp;alleged leaks have hit Binance. Earlier this year, a darknet vendor was reportedly selling <a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/21\/a-darknet-vendor-is-allegedly-selling-images-and-data-associated-with-crypto-exchange-identity-verification-processes\/\" data-v-f87c67ca=\"\">100,000 personal documents<\/a> that were used to pass KYC on several cryptocurrency exchanges, including Binance.","Binance responded similarly to The Block at the time, saying that it investigated the photos in question, but there was no evidence that the leak was from Binance.","The world’s largest cryptocurrency exchange, for its part, has been taking several initiatives to up its compliance game. In recent months, Binance has partnered with various compliance and investigation software providers such as <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/binance-teams-up-with-identitymind-to-up-compliance\/\" data-v-f87c67ca=\"\">IdentityMind<\/a>, <a href=\"https:\/\/www.prnewswire.com\/news-releases\/chainalysis-partners-with-binance-to-tackle-global-cryptocurrency-money-laundering-300732667.html\" data-v-f87c67ca=\"\">Chainalysis<\/a>, <a href=\"https:\/\/www.elliptic.co\/our-thinking\/binance-partners-with-elliptic-video\" data-v-f87c67ca=\"\">Elliptic<\/a> and <a href=\"https:\/\/www.refinitiv.com\/en\/media-center\/press-releases\/2018\/november\/refinitiv-provides-kyc-automation-for-cryptocurrency-exchange-binance\" data-v-f87c67ca=\"\">Refinitiv<\/a>, formerly the financial and risk business division of Thomson Reuters.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">This story has been updated with Binance’s official statement.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thomson Reuters","content":"ORGANIZATION"},{"type":"Binance","content":"LOCATION"},{"type":"KYC","content":"ORGANIZATION"},{"type":"earlier today","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Chainalysis","content":"LOCATION"},{"type":"Feb. 2018","content":"DATE"},{"type":"Leah Li","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Yogita Khatri","The Block"]}