{"summary":"Gensyn, a blockchain-based marketplace protocol connecting buyers and sellers of compute power, today announced a $43 million Series A fundraise.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234092\/blockchain-compute-power-gensyn-raise","publishDate":"2023-06-11T19:00:33","id":7817,"type":null,"title":"Blockchain-based marketplace for compute power Gensyn raises $43 million","category":["DEALS"],"content":["London-based Gensyn, a blockchain-based marketplace protocol connecting buyers and sellers of compute power, today announced a $43 million Series A fundraise.","A16z Crypto led the round, alongside CoinFund, Canonical Crypto, Protocol Labs, Eden Block, Maven 11 and various angel investors. No valuation was disclosed.","The backdrop to the mammoth Series A raise, as pointed out in a press release, is the AI boom driven by ChaptGPT’s success and the subsequent spike in demand it has driven for GPUs, the compute processors that enable such systems to absorb information.","Gensyn is a blockchain-based marketplace protocol that enables developers to build AI systems using connected hardware while paying on-demand. It uses a cryptographic verification system to give users confidence that the machine learning work sent via the protocol has been completed correctly.","“Artificial Intelligence is laying a foundation for the next industrial revolution, and the realisation of its potential requires huge computational power,” Ben Fielding, Gensyn’s co-founder, said in a written statement.","“We believe the key to useful, aligned AI is allowing everyone in the world to contribute to its development. The best way to mitigate bias and misalignment is to allow more people to build models that reflect their views. In order to do that we need open infrastructure that connects models to the core resources, crucially computational hardware, that make them function.”","Gensyn&nbsp;<a href=\"https:\/\/techcrunch.com\/2022\/03\/21\/gensyn-applies-a-token-to-distributed-computing-for-ai-developers-raises-6-5m\/\" data-v-f87c67ca=\"\">closed a $6.5 million seed round<\/a> led by Eden Block in March 2022. The startup’s latest capital injection will be used to speed on its launch as well as for hiring.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$6.5 million","content":"MONEY"},{"type":"Crypto","content":"PERSON"},{"type":"Eden Block","content":"ORGANIZATION"},{"type":"Ben Fielding","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Gensyn","content":"ORGANIZATION"},{"type":"$43 million","content":"MONEY"},{"type":"London","content":"LOCATION"},{"type":"Artificial Intelligence","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"Canonical Crypto","content":"ORGANIZATION"}],"hashtag":["SERIES A"],"authors":["Ryan Weeks","The Block"]}