{"summary":"This vesting contract, designed to incrementally release the funds to the Arbitrum Foundation over a four-year period, is viewed as a major stride toward accountability and transparent governance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238336\/arbitrum-dao-locks-up-770-million-in-arb-tokens-into-vesting-contract","publishDate":"2023-07-07T09:45:20","id":7818,"type":null,"title":"Arbitrum DAO locks up $770 million in ARB tokens into vesting contract","category":["CRYPTO ECOSYSTEMS"],"content":["Arbitrum's decentralized autonomous organization has locked up 700 million ARB tokens worth $770 million into a vesting <a href=\"https:\/\/arbiscan.io\/address\/0x15533b77981cDa0F85c4F9a485237DF4285D6844#code\" data-v-f87c67ca=\"\">contract<\/a>. The funds will be released incrementally to the Foundation over a four-year period in a major step for the DAO toward accountability and transparent governance.","The move came after the approval of the AIP 1.1 <a href=\"https:\/\/www.tally.xyz\/gov\/arbitrum\/proposal\/70545629960586317780628692755032548222173912190231545322320044688071893662480\" data-v-f87c67ca=\"\">proposal<\/a> that came amid a controversial governance period within the Arbitrum ecosystem. Earlier this year, the project faced significant backlash over a \"special grants\" program in the <a href=\"https:\/\/snapshot.org\/#\/arbitrumfoundation.eth\/proposal\/0x3be7368a662d1cf12fa4da768d626edbc013be0dc7b994fef2e24d9a54e4033a\" data-v-f87c67ca=\"\">plan<\/a> that initially sought to allocate over 700 million ARB tokens directly to the Arbitrum Foundation. The Foundation stated the funds would be used to support initiatives built on Arbitrum’s technology.","However, the immense scale of the allocation, which was worth over $1 billion at the time, prompted fears over transparency in a project that’s designed to make collective decisions. That led to a subsequent proposal to return the funds from the Foundation back to the DAO which was <a href=\"https:\/\/www.theblock.co\/post\/226561\/arbitrum-proposal-return-funds-failed\" data-v-f87c67ca=\"\">rejected<\/a>.","Arbitrum is a Layer 2 scalability solution for Ethereum, developed by Offchain Labs, that aims to offer scalable and low-cost smart contract capabilities. Its governing DAO makes decisions by proposing and voting on various initiatives, known as Arbitrum Improvement Proposals.","A proposal known as AIP-1.1 sought to address the community’s concerns by implementing stringent control measures on the allocation of the DAO’s treasury. It provides the DAO with the power to modify the vesting period, an authority that could be exercised to extend, shorten, or even halt the vesting process, the Arbitrum team <a href=\"https:\/\/twitter.com\/arbitrum\/status\/1677011772148965379\" data-v-f87c67ca=\"\">said<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Foundation","content":"ORGANIZATION"},{"type":"AIP","content":"ORGANIZATION"},{"type":"$770 million","content":"MONEY"},{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"}],"hashtag":["ASSETS"],"authors":["Vishal Chawla","The Block"]}