{"summary":"Morgan Stanley’s European mutual fund says it may gain exposure to bitcoin ETFs — but it could also be mitigating risk.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279650\/morgan-stanley-fund-opens-door-to-investment-in-spot-bitcoin-etfs","publishDate":"2024-02-28T13:46:26","id":7823,"type":null,"title":"Morgan Stanley fund&#x27;s filing adds language on investment in spot bitcoin ETFs","category":["THE BLOCK"],"content":["Morgan Stanley’s Europe Opportunity Fund has added language in a recent filing to allow for investing in spot bitcoin ETFs.","The fund may gain exposure to spot bitcoin ETFs, according to a <a href=\"https:\/\/www.sec.gov\/ixviewer\/ix.html?doc=\/Archives\/edgar\/data\/860720\/000113322824001282\/mseof-html7287_485bpos.htm\" data-v-f87c67ca=\"\">form N-1A<\/a> filed on Tuesday, although this must remain less than 25% of the fund’s assets. The core purpose of the fund is to invest primarily in companies in Europe, though the fund has <a href=\"https:\/\/www.theblock.co\/linked\/109930\/morgan-stanley-fund-holds-more-than-28000-shares-of-gbtc\" data-v-f87c67ca=\"\">held shares<\/a><span data-v-f87c67ca=\"\"> of the Grayscale <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.038%\n    <\/span><\/a> <!----><\/span><\/span> Trust (GBTC) in the past. In January, GBTC received approval by the Securities and Exchange Commission to become a spot bitcoin ETF. Thus, adding such language would keep its paperwork in line with such an investment.&nbsp;<\/span>","Eric Balchunas, senior ETF analyst at Bloomberg, said that the fund may be adding this disclosure language as a risk mitigation strategy in case the fund ever got any exposure to bitcoin ETFs. “They're playing preventative defense. They'd rather not make any mistakes,” he said.","However, Balchunas noted that the fund has had low inflows over the last few years and while its performance was good, it has underperformed compared to the S&amp;P 500. As a result, he said it’s possible this could be part of a growth strategy.","“So it is interesting if you're running this fund it's got to be tough, because Europe doesn't really have some of these names that you find in the U.S. that have just been the growth story. And, so it might be this one just trying to look for a little kick, a little edge,” he said.","In terms of exposure, he said he would be shocked if it was more than 2% of the fund’s assets. He referenced the Appleseed mutual fund, which has invested 1.1% in bitcoin, as a plausible amount.","Balchunas noted that mutual funds are regulated under the 1940 act, which is very strict and requires hefty disclosures. As a result, he said this is why mutual funds — three of them <a href=\"https:\/\/twitter.com\/EricBalchunas\/status\/1755264537438163063\/photo\/1\" data-v-f87c67ca=\"\">so far<\/a> — are the first ones to have disclosed exposure to bitcoin.&nbsp;","“So over the next couple of months, then we'll see a bigger group of holders. Right now the mutual funds make sense to see first,&nbsp;not because they added it first but because they have to report first,” he said.","Balchunas added that while bitcoin exposure wouldn’t make sense for some niche funds, most fund managers would want to have the option to gain access to this new raft of ETFs. He said, “So this is a part of, I guess, the ETFs making their way through the gigantic machine known as TradFi.”","<em data-v-f87c67ca=\"\">Correction: This story has been updated with additional details about Morgan Stanley's GBTC holdings.&nbsp;<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"1940","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"1.1%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"Grayscale <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"Balchunas","content":"PERSON"},{"type":"-0.038%","content":"PERCENT"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}