{"summary":"Galaxy Digital reported a $1 billion loss for the 2022 financial year. It also made a net loss of $288 million in the fourth quarter.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223206\/michael-novogratz-calls-2022-a-formative-year-as-galaxy-digital-reports-1-billion-loss","publishDate":"2023-03-28T07:51:05","id":7824,"type":null,"title":"Mike Novogratz calls 2022 a &#x27;formative year&#x27; as Galaxy Digital reports $1 billion loss","category":["MARKETS"],"content":["Canadian-listed crypto investment firm Galaxy Digital missed analyst expectations with the release of its fourth-quarter results.","The company,&nbsp;which trades in Toronto under the ticker <a href=\"https:\/\/finance.yahoo.com\/quote\/GLXY.TO\/\" data-v-f87c67ca=\"\">GLXY<\/a>, reported a net loss of $1 billion for 2022 compared with $1.7 billion in profit achieved in the prior year. It also reported a $288 million loss for the fourth quarter. The company attributed the loss to unrealized marks to market on its investments portfolio.","The firm's 2022 financial results are reflective of the turbulent year faced by the crypto industry, which witnessed the collapse of leading industry players and a decline in crypto asset prices alongside a challenging macro environment with rising interest rates and surging inflation. The firm <a href=\"https:\/\/www.theblock.co\/post\/184262\/galaxy-digital-reveals-ftx-exposure-in-q3-earnings-report\" data-v-f87c67ca=\"\">revealed<\/a> last quarter that it had $76.8 million exposure to failed crypto exchange FTX and experienced a net loss in its mining business, which is typically profitable, due to increased expenses.","\"2022 was a formative year for Galaxy, and while we and our industry faced unprecedented macroeconomic events, we succeeded in staying the course and were able to opportunistically take advantage of strategic opportunities to build our operating businesses for the future. I have never been more confident in our go-forward strategy, businesses and team,\" <span class=\"xn-person\" data-v-f87c67ca=\"\">Mike Novogratz<\/span>, founder and CEO of Galaxy, said in <a href=\"https:\/\/www.newswire.ca\/news-releases\/galaxy-announces-fourth-quarter-full-year-2022-financial-results-and-preliminary-results-for-the-first-quarter-to-date-897251950.html\" data-v-f87c67ca=\"\">the release<\/a>.","Analysts estimated that Galaxy would report an average net revenue of 674 million Canadian dollars ($492 million) for the financial year and CA$43 million ($31 million) for the quarter, according to <a href=\"https:\/\/ca.finance.yahoo.com\/quote\/GLXY.TO\/analysis\/\" data-v-f87c67ca=\"\">data<\/a> from Yahoo Finance. The firm achieved $419.4 million in revenue.&nbsp;The company's stock price is down around 85% over the past year.","Counterparty trading volumes increased by about 19% in the fourth quarter over the prior period, but decreased 65% year over year.","The company said it expects to record net profits for the first quarter of this year in its operating business. It reported a preliminary first quarter income before tax of $150 million through to March 24. It also highlighted that it managed to secure multiple redundant banking partners during this time despite the collapse of several crypto banking partners.","\"At this time, we're confident in our diversified U.S. banking relationships,\" the company said.","Galaxy Digital's operations span a number of different business lines from venture investing to bitcoin mining, trading and advisory services. Its trading arm reported an operational net revenue of $18 million for the fourth quarter and is focusing on the strategic build out of GalaxyOne, a prime-brokerage platform for digital assets, which will be released in beta form in the second quarter of this year.","\"Counterparty trading volumes increased by approximately 19% over the prior quarter while decreasing by just over 65% year over year,\" the company said.","\"GT [Galaxy Trading] ended the year with more than 930 total counterparties after onboarding over 20 new counterparties to our trading platform during the fourth quarter,\" the company added. \"We continue to provide liquidity in over 100 cryptocurrencies.\"","Meanwhile its investment banking arm saw a steady pace in its deal pipeline. In the fourth quarter it advised on Amberdata's purchase of Genesis Volatility and advised CoreWeave on its strategic investment from Magnetar Capital.","The company previously announced its intentions to reorganize to become a Delaware-incorporated company and list on the Nasdaq this year. The firm reported that it has filed an amendment to its registration statement responding to Securities and Exchange Commission comments, which is under review.","This comes as regulators in the U.S. ramp up their scrutiny of crypto companies operating in the U.S. Crypto exchange Coinbase recently <a href=\"https:\/\/www.theblock.co\/post\/222084\/sec-investigating-coinbase-for-its-earn-product-wallet-service-and-exchange-activity\" data-v-f87c67ca=\"\">received<\/a> a Wells notice from the SEC over its earn program, while Binance and its CEO, &nbsp;Changpeng \"CZ\" Zhao, are being <a href=\"https:\/\/www.theblock.co\/post\/223015\/cftc-sues-binance\" data-v-f87c67ca=\"\">sued<\/a> by the Commodity Futures Trading Commission (CFTC) for allegedly violating federal laws and not registering the exchange in the U.S.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;&nbsp;<\/span>&nbsp;","Galaxy has also acquired mining business Helios and self-custody business GK8 in recent months.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Delaware","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Yahoo Finance","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"March 24","content":"DATE"},{"type":"CA$43 million","content":"MONEY"},{"type":"Toronto","content":"LOCATION"},{"type":"19%","content":"PERCENT"},{"type":"Amberdata","content":"ORGANIZATION"},{"type":"fourth quarter","content":"DATE"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"last quarter","content":"DATE"},{"type":"$76.8 million","content":"MONEY"},{"type":"$1.7 billion","content":"MONEY"},{"type":"$492 million","content":"MONEY"},{"type":"$419.4 million","content":"MONEY"},{"type":"Magnetar Capital","content":"ORGANIZATION"},{"type":"second quarter of this year","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"$18 million","content":"MONEY"},{"type":"$31 million","content":"MONEY"},{"type":"$288 million","content":"MONEY"},{"type":"85%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"674 million Canadian dollars","content":"MONEY"},{"type":"$150 million","content":"MONEY"},{"type":"the fourth quarter","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["CRYPTO BANKS AND LENDERS","EARNINGS","INVESTMENT FIRMS"],"authors":["Kari McMahon","The Block"]}