{"summary":"Learn how to build a blockchain application on Lisk, gain insights into the latest Lisk SDK, and hear exclusively about Lisk’s interoperability solution at Lisk.js","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/103322\/lisk-unveils-agenda-for-annual-blockchain-developer-event-lisk-js-taking-place-may-21st-22nd","publishDate":"2021-04-30T09:04:44","id":7829,"type":null,"title":"Lisk Unveils Agenda for Annual Blockchain Developer Event Lisk.js, Taking Place May 21st-22nd","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Learn how to build a blockchain application on Lisk, gain insights into the latest Lisk SDK, and hear exclusively about Lisk’s interoperability solution at Lisk.js<\/em><\/span>","Lisk.js 2021 is the culmination of all the research and development efforts of the Lisk project and ecosystem since its inception. This year, the <a href=\"https:\/\/www.eventbrite.com\/e\/liskjs-2021-tickets-85756565195\" data-v-f87c67ca=\"\">annual blockchain developer event<\/a> will be held virtually on May 21st and 22nd, live-streamed from the Kühlhaus stage in Berlin. Lisk.js aims to update the Lisk community with highly-anticipated announcements, research, and development progress while attracting new developers and supporting the mass adoption of blockchain technology. The main focus of Lisk.js 2021 will be on Lisk’s interoperability specifications. Lisk’s main goal was to deliver a scalable and decentralized blockchain interoperability solution for its ecosystem. During the event, all interoperability LIPs (Lisk Improvement Proposals) will be unveiled, as well as the plans for research and development moving further forward into 2021.","The Lisk.js 2021 two-day event has been designed to cater to all levels of technical knowledge and experience, including newcomers into the Lisk ecosystem, as well as blockchain enthusiasts, and development&nbsp; professionals. The first day will be dedicated to showcasing Lisk’s interoperability solution, the latest development announcements, and the upcoming online hackathon. In addition, Max Kordek, CEO and co-founder of Lisk, will give a keynote speech about our achievements and a new era of Lisk, coupled with Lisk’s vision for the future. The second day of the event will consist of in-depth Lisk interoperability solution presentations, developer demos, and community talks.","Confirmed speakers include Lisk’s CEO and Co-Founder, Max Kordek; Lisk’s Head of Research, Jan Hacksfield; and Lisk’s Lead Backend Developers, Shusetsu Toda and Manu Nelamane Siddalingegowda.","<em data-v-f87c67ca=\"\">Key highlights of the Lisk.js 2021 agenda include:<\/em>","●<em data-v-f87c67ca=\"\"> May 21st (Day one)<\/em>","○A keynote speech from Max Kordek, CEO and Co-Founder of Lisk, highlighting the main updates and announcements, as well as showcasing the next steps for Lisk in 2021 and beyond.<br data-v-f87c67ca=\"\">\n○ An introduction to Lisk’s bespoke interoperability solution from Jan Hackfeld, Head of Research followed by explanations about cross-chain certification, cross-chain messages, and the lifecycle of a sidechain.<br data-v-f87c67ca=\"\">\n○ An overview of the next steps for Lisk’s research and development.","<em data-v-f87c67ca=\"\">● May 22nd (Day two)<\/em>","○ A deep dive into Lisk’s interoperability solution.<br data-v-f87c67ca=\"\">\n○ A first look at how to develop an interoperable blockchain application within the Lisk ecosystem.<br data-v-f87c67ca=\"\">\n○ Everything developers need to know about the added interoperability features of the LSK token and new NFT modules.<br data-v-f87c67ca=\"\">\n○ A look at the range of community-built blockchain applications on Lisk and their experience developing with the Lisk SDK.","Max Kordek, CEO and Co-Founder of Lisk said: “Lisk.js marks the first time the Lisk community will learn the details of Lisk’s interoperability solution. Blockchain interoperability is the answer to the wider adoption of blockchain technology and decentralized finance, and we at Lisk believe that our interoperability solution will pave the way for new innovations and breakthroughs in the space. At Lisk.js, developers will learn how to build applications that connect with the entire Lisk ecosystem, ensuring a level playing field for all.”","Ensure you don’t miss this informative event by subscribing to our channel and register&nbsp;<a class=\"c-link\" href=\"https:\/\/liskjs2021.eventbrite.com\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/liskjs2021.eventbrite.com\/\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">online<\/a> to get regular updates and see the full agenda."],"entity":[{"type":"Jan Hackfeld","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"May 21st (Day","content":"DATE"},{"type":"Max Kordek","content":"PERSON"},{"type":"Shusetsu Toda","content":"ORGANIZATION"},{"type":"May 21st","content":"DATE"},{"type":"Jan Hacksfield","content":"LOCATION"},{"type":"Lisk SDK","content":"PERSON"},{"type":"Manu Nelamane Siddalingegowda","content":"PERSON"},{"type":"May 22nd (Day","content":"DATE"},{"type":"Berlin","content":"LOCATION"},{"type":"Lisk’s Head of Research","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Lisk SDK","content":"ORGANIZATION"},{"type":"Backend Developers","content":"ORGANIZATION"},{"type":"Head of Research","content":"ORGANIZATION"},{"type":"Lisk","content":"ORGANIZATION"},{"type":"Lisk","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}