{"summary":"Steve Cohen’s Point72 is poised to enter the crypto market, according to sources.\nThe firm is set to take a holistic approach, investing across venture and its hedge fund business.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/104522\/steve-cohen-point72-crypto-market","publishDate":"2021-05-13T09:06:07","id":783,"type":null,"title":"Steve Cohen&#x27;s Point72 is poised to make a &#x27;big&#x27; crypto market entrance: sources","category":["Institutional Investors"],"content":["Point72, the hedge fund founded by billionaire Steve Cohen, is set to make a sizable entrance into the crypto market, according to several people familiar with the firm's business.&nbsp;","Point72 — which managed as much as $22 billion as recently as of April 1 — is said to be taking a very holistic approach to the $2 trillion crypto market, investing from both its venture capital arm, Point72 Ventures, and deploying long\/short strategies on the hedge fund side. The fund is among several large investment firms currently eyeing the market.&nbsp;","Millennium, a $40 billion fund, has been dabbling in the crypto market via exposure from Grayscale's Bitcoin Trust, according to <a href=\"https:\/\/www.thestreet.com\/crypto\/bitcoin\/hedge-fund-millennium-traded-gbtc\" data-v-f87c67ca=\"\">TheStreet<\/a>. Ray Dalio's Bridgewater, meanwhile, has <a href=\"https:\/\/www.bridgewater.com\/research-and-insights\/our-thoughts-on-bitcoin\" data-v-f87c67ca=\"\">warmed up to the market<\/a>, although it has not publicly made any sort of allocation on behalf of its clients.&nbsp;","As for Point72, the firm is poised to \"get big in crypto,\" according to one source who spoke with Cohen. Another source corroborated that view, noting the firm is trying to bring on the right talent.&nbsp;","Outside of the crypto market, Point72 raised $1.5 billion after suffering losses from its stake in Melvin Capital, which found itself on the losing end of the surge in GameStop. At the time, Business Insider <a href=\"https:\/\/markets.businessinsider.com\/news\/stocks\/steve-cohen-point72-raises-money-gamestop-saga-melvin-capital-2021-2-1030039224\" data-v-f87c67ca=\"\">reported<\/a> the new capital would help the firm \"take advantage of new opportunities in the market.\"","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Editor's Note: <\/strong>This report has been updated with a more recent AUM figure from Point72's website.<\/em>"],"hashtag":["HEDGE FUNDS"]}