{"summary":"CEO Simon Seojoon Kim tells Bloomberg that Hashed had bought 30 million luna tokens in the blockchain project&#x27;s early days.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161168\/crypto-vc-hashed-confirms-luna-loss-3-billion","publishDate":"2022-08-03T06:48:22","id":7835,"type":null,"title":"Crypto VC firm Hashed confirms losing more than $3 billion in luna crash: Bloomberg","category":["VENTURE CAPITAL"],"content":["Crypto venture capital firm Hashed lost more than $3 billion from its investment in the Terra ecosystem's luna token following its crash in early May, CEO and managing partner Simon Seojoon Kim has confirmed.","In an interview with Bloomberg <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-08-02\/early-investor-in-defunct-luna-token-plans-to-raise-another-fund?utm_source=google&amp;utm_medium=bd&amp;cmpId=google\" data-v-f87c67ca=\"\">published<\/a> on Wednesday, Kim said Hashed had bought 30 million luna tokens in the blockchain project's early days, which were worth as much as $3.6 billion when luna’s price peaked in early April.","This is the first time Hashed has officially confirmed the extent of its loss in the luna crash. In May, CoinDesk, citing on-chain data, <a href=\"https:\/\/www.coindesk.com\/learn\/the-fall-of-terra-a-timeline-of-the-meteoric-rise-and-crash-of-ust-and-luna\/\" data-v-f87c67ca=\"\">reported<\/a> that Hashed had staked a total of nearly 50 million luna tokens and that its losses appeared to have been over $3.5 billion.","A Hashed official told The Block that the investments in luna were made through \"proprietary capital.\"","\"Hashed operates two segregated vehicles: equity investments through Hashed Venture Fund I &amp; II managed by Hashed Ventures, a registered GP in South Korea, and token investments through proprietary capital,\" the official said. \"Terra\/Luna seed investment was made through the latter, so Hashed Venture Fund I &amp; II remain unaffected. In fact, they boast robust portfolio companies such as Dune Analytics, Mythical Games, Republic and dYdX.\"","The Terra ecosystem began to collapse on May 7 when the price of its algorithmic stablecoin TerraUSD (UST) lost its peg to the US dollar. UST's sister token, luna, crashed in tandem — dropping from around $80 to just a few cents. Terra's implosion wiped out more than $40 billion in investor wealth in a matter of days.","But despite facing heavy losses in luna, Hashed hasn't lost faith in crypto. The firm, in fact, plans to raise a third fund in the first half of next year, Kim told Bloomberg.","It isn't clear how much money Hashed would hope to raise for its new fund and Kim didn't respond to The Block's request for comment.","Hashed has previously <a href=\"https:\/\/www.theblock.co\/linked\/125991\/south-korean-crypto-vc-hashed-launches-new-200-million-fund\" data-v-f87c67ca=\"\">raised<\/a> at least $320 million in two venture funds. If and when the firm is able to raise a new fund, it will focus on investing in blockchain-based gaming startups, according to Kim.","<em data-v-f87c67ca=\"\">Updated on August 4 to add response from Hashed.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"$320 million","content":"MONEY"},{"type":"$3 billion","content":"MONEY"},{"type":"few cents","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"August 4","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Kim","content":"PERSON"},{"type":"May 7","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Simon Seojoon Kim","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$3.6 billion","content":"MONEY"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Terra\/Luna","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Terra","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"April","content":"DATE"},{"type":"$3.5 billion","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"},{"type":"$80","content":"MONEY"},{"type":"Hashed Ventures","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}