{"summary":"HashKey Capital is granted a lisence to manage a portfolio made up entirely of virtual assets by the Hong Kong Securities and Future Commission.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169204\/hashkey-venture-arm-authorized-to-manage-portfolio-made-entirely-of-digital-assets","publishDate":"2022-09-12T21:00:01","id":7836,"type":null,"title":"HashKey venture arm authorized to manage portfolio made entirely of digital assets","category":["ASIA"],"content":["The venture capital arm of Hong Kong-based HashKey Group, a financial firm focused on digital assets, can now shift up to 100% of its portfolio into cryptocurrency-related projects, following receiving regulatory approval from the Hong Kong Securities and Future Commission (SFC).","“HashKey Group was among the first enthusiasts and advocates of the crypto industry,” HashKey Group Chairman Dr. Xiao Feng said in a release. “We are dedicated to the development of the blockchain and crypto ecosystem, and it has long been our goal to actively support regulation while aiding the industry's sustainable growth.”","HashKey’s venture subsidiary, HashKey Capital, received the change to its Type 9 asset management license.&nbsp;","HashKey Capital was founded in 2018, and claims to have managed over $1 billion in assets since its inception.","<strong data-v-f87c67ca=\"\">Correction:&nbsp;<\/strong><em data-v-f87c67ca=\"\">A previous version of this story stated that HashKey Group, rather than HashKey Capital, was founded in 2018 and claims to have managed over $1 billion in assets since its inception.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"100%","content":"PERCENT"},{"type":"Xiao Feng","content":"PERSON"},{"type":"Hong Kong Securities and Future Commission (SFC","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"HashKey Group","content":"ORGANIZATION"},{"type":"HashKey Capital","content":"ORGANIZATION"}],"hashtag":["HASHKEY"],"authors":["Inbar Preiss","The Block"]}