{"summary":"The lawsuit accuses Coinbase of failing to disclose the risks inherent to TerraUSD.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152942\/coinbase-sued-in-relation-to-promotion-of-terrausd-cryptocurrency","publishDate":"2022-06-18T12:10:59","id":784,"type":null,"title":"Coinbase sued in relation to promotion of TerraUSD cryptocurrency","category":["LEGAL"],"content":["Coinbase, a digital currency wallet and trading platform, faces a class action lawsuit filed on Thursday in California Northern District Court in relation to its promotion of cryptocurrency TerraUSD, according to court documents <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2022\/06\/1-main.pdf\" data-v-f87c67ca=\"\">accessed by The Block<\/a> and published on its server.","The lawsuit accuses Coinbase of failing to disclose the risks inherent to TerraUSD and misleading the plaintiffs and class into believing that they were purchasing a “reserve-backed stablecoin,” a type of cryptocurrency that is generally less volatile than its counterpart.","Because TerraUSD was purportedly pegged to the US government-issued currency, specifically the world’s reserve currency, it was marketed as a type of investment that could “virtually eliminate volatility,” the filing said, adding that “in reality, TerraUSD is not backed by actual US dollars or any other tangible assets held in reserve.”","The complaint also contends that investors lost about $18 billion in a matter of days in May from the <a href=\"https:\/\/www.theblock.co\/post\/146444\/terra-luna-and-ust-how-we-got-here\" data-v-f87c67ca=\"\">devaluation of TerraUSD<\/a>.","The lawsuit was filed by the Milberg Coleman Bryson Phillips Grossman law firm.","A message sent to a Coinbase representative seeking comment was not returned by time of publication.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$18 billion","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"California Northern District Court","content":"ORGANIZATION"},{"type":"Milberg Coleman Bryson Phillips Grossman","content":"PERSON"}],"hashtag":["COINBASE"],"authors":["Mike Millard","The Block"]}