{"summary":"The firm behind South Korea’s largest crypto exchange booked $22.7 million in net profit in the third quarter of this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264929\/upbits-parent-firm-dunamu-reports-81-net-profit-shrink-for-q3-y-o-y","publishDate":"2023-11-28T07:24:17","id":7847,"type":null,"title":"Upbit&#x27;s parent firm Dunamu reports 81% net profit shrink for Q3 Y-o-Y","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Dunamu, the parent company of Upbit, South Korea’s largest crypto exchange, reported an 81% decrease in net profit for the third quarter year-on-year.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a <a href=\"https:\/\/www.dunamu.com\/news\/901\" data-v-f87c67ca=\"\">statement<\/a> released today, Dunamu announced a net profit of 29.5 billion won (US$22.7 million) for the third quarter, a decrease of 81% from 159.9 billion won in the same period last year, according to its <a href=\"https:\/\/dart.fss.or.kr\/dsaf001\/main.do?rcpNo=20231128000996\" data-v-f87c67ca=\"\">earnings report<\/a> submitted to the country's Financial Supervisory Service. The report attributed<\/span><span data-v-f87c67ca=\"\"> the drop in net profit to a downturn in crypto market prices.<\/span>","<span data-v-f87c67ca=\"\">Furthermore, Dunamu reported an operating profit of 101.8 billion won ($78.5 million), marking a 39.6% decline from last year.<\/span>","“The decline in sales appears to have been influenced by continued interest rate increases and a sluggish investment market due to the economic downturn,” Dunamu said in the statement. “The decline in net profit was largely due to virtual asset valuation losses due to a decline in virtual asset prices compared to the previous quarter.”","In October, Upbit, the crypto exchange operated by Dunamu, <a href=\"https:\/\/www.theblock.co\/post\/256581\/upbit-initial-approval-digital-asset-license-singapore\" data-v-f87c67ca=\"\">received<\/a> preliminary approval from the Monetary Authority of Singapore to offer a broader range of digital payment services with crypto tokens.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"39.6%","content":"PERCENT"},{"type":"Upbit","content":"LOCATION"},{"type":"South Korea","content":"LOCATION"},{"type":"81%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"$78.5 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"US$22.7 million","content":"MONEY"},{"type":"Financial Supervisory Service","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Dunamu","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"third quarter","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Dunamu","content":"ORGANIZATION"}],"hashtag":["CRYPTO"],"authors":["Timmy Shen","The Block"]}