{"summary":"Galaxy&#x27;s Michael Ashe says there is more &quot;receptivity&quot; to M&amp;A amid the crypto market slump.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156813\/galaxy-anticipates-ramp-up-in-ma-activity-despite-chilled-market","publishDate":"2022-07-17T16:52:39","id":7849,"type":null,"title":"Crypto market downturn could lead to new M&amp;A opportunities, according to Galaxy&#x27;s top deal maker","category":["MERGERS & ACQUISITIONS"],"content":["The market downturn might actually be a good thing for deal-making in crypto, according to Galaxy Digital's top advisory executive.&nbsp;","\"Overall, there is a lot more receptivity to the idea of M&amp;A in this market environment,\" Galaxy's head of investment banking Michael Ashe said in an email to The Block. &nbsp;","That's striking considering market down turns typically result in a pull back in M&amp;A and initial public offerings. In Ashe's view, the down turn has forced certain participants to more seriously consider being acquired relative to last year when crypto prices were surging and valuations for private crypto firms were frothy.&nbsp;","\"The effective closing of the capital markets has forced companies to reassess their strategic goals,\" Ashe — previously a director at Oppenheimer &amp; Co. — added. \"As part of that, many are contemplating acquisitions and even moving forward with M&amp;A in situations where they haven’t contemplated selling. This is a big change from last year’s environment, where companies and founders were dissuaded from M&amp;A because there was effectively a control discount, meaning companies could raise money at valuations greater than what they could sell their businesses for.\"","Indeed, a plunge in prices precipitated significant liquidity issues for some firms, from lenders like Celsius and Voyager to funds like Three Arrows Capital.&nbsp;","Against this backdrop, crypto lender Nexo has agree to acquire Singapore-based rival Vauld. Sam Bankman-Fried's firm FTX.US also announced its own plan to snap up BlockFi. Binance's Changpeng Zhao said the crypto exchange was looking at around 50 to 100 investment and acquisition deals in an interview with Yahoo Finance.&nbsp;","\"Our expectation is there will continue to be distressed assets as companies run out of runway and capital,\" Ashe said. \"In terms of potential buyers, I expect private equity firms and traditional shops to use distressed assets as a means of entering the space.\"","The heightened activity would continue the first half of the year's hot streak. New data from merger and acquisition advisory firm Architect Partners shows the M&amp;A market was red-hot in the first half of 2022.","In its recently released snapshot for the first half of 2022, the firm said that deal-making activity in the first half of 2022 surpassed last year's \"record pace\" with \"bridge\" transactions — those linking legacy and crypto firms — making up 49% of M&amp;A activity during the period. The firm, which has advised companies like Diem and FairX, expects the number of such deals to increase.&nbsp;","Still, Architect takes a different position than Galaxy's Ashe. The pace of M&amp;A in the first half of 2022 exceeded last year's record pace, according to Architect Partners, but recent volatility might lead to a dip in that activity.","It's expecting distressed M&amp;A to be prevalent in the upcoming quarter due to the market events seen in Q2.","Architect Partners says exchanges, exchange infrastructure, mining and data remain the most mature sub-sectors of the industry and are slated to see the most M&amp;A activity through the end of 2022. Valuations are taking a hit, but those of healthy companies \"remain high&nbsp;relative to general technology and fintech sectors due to growth potential and capital&nbsp;dedicated to crypto,\" according to the firm.&nbsp;&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ashe","content":"LOCATION"},{"type":"Ashe","content":"PERSON"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"the first half of 2022","content":"DATE"},{"type":"Yahoo Finance","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Michael Ashe","content":"PERSON"},{"type":"Three Arrows Capital","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"49%","content":"PERCENT"},{"type":"Galaxy","content":"ORGANIZATION"},{"type":"Architect Partners","content":"ORGANIZATION"},{"type":"Oppenheimer &amp; Co.","content":"ORGANIZATION"},{"type":"first half of 2022","content":"DATE"}],"hashtag":["CRYPTO"],"authors":["Aislinn Keely","Frank Chaparro","The Block"]}