{"summary":"MetaMask has expanded its partnership with web3 payment company MoonPay in Nigeria to enable users to buy crypto tokens directly from their wallets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221384\/metamask-moonpay-nigeria-crypto","publishDate":"2023-03-21T05:00:40","id":7854,"type":null,"title":"MetaMask and MoonPay partner to let Nigerians buy crypto via bank transfer","category":["COMPANIES"],"content":["MetaMask has expanded its partnership with web3 payment company MoonPay in Nigeria to enable users to buy crypto tokens directly from their wallets, ConsenSys announced on Tuesday.","MetaMask users in Nigeria can purchase crypto using local bank transfers. They can select Nigeria as their region when buying crypto and selecting the MoonPay quote associated with their purchase amount. The purchased tokens can then be stored in their MetaMask wallets.","ConsenSys says the integration is to make it easier for Nigerians to buy crypto. MoonPay already <a href=\"https:\/\/twitter.com\/moonpay\/status\/1636359225004703745?s=20\" data-v-f87c67ca=\"\">offers<\/a> localized peer-to-peer crypto purchases for users in the country. This offering also relies on local bank transfers, with MoonPay <a href=\"https:\/\/www.theblock.co\/post\/171019\/yellow-card-crypto-exchange-raises-40-million-in-series-b-round\" data-v-f87c67ca=\"\">partnering<\/a> with African fintech outfit Yellow Card.","Despite being a center of significant crypto transaction volume, Nigerians are not easily able to purchase cryptocurrencies. This is due to a ban by the country's central bank that <a href=\"https:\/\/www.theblock.co\/post\/93975\/nigeria-central-bank-crypto-exchanges-warning\" data-v-f87c67ca=\"\">prohibits<\/a> commercial banks from servicing crypto exchanges. Many Nigerian banks have also suspended using their debit cards on international websites, thus making it more difficult for users to pay for crypto on centralized exchanges.","These restrictions have forced Nigerians to rely on peer-to-peer transactions for crypto purchases. This avenue is not without its disadvantages, as it opens the door for scammers to defraud unsuspecting victims, as well as the possibility of bank account <a href=\"https:\/\/www.theblock.co\/linked\/123527\/nigerias-central-bank-freezes-accounts-of-suspected-crypto-traders\" data-v-f87c67ca=\"\">closures<\/a> by the central bank.","MoonPay's chief product and strategy officer, Zeeshan Feroz, says the integration solves this problem. \"We have rolled out an innovative document-less KYC solution, leveraging governmental databases,\" Feroz told The Block.&nbsp;\"This will allow users to onboard faster and more safely with MoonPay, by providing their Bank Verification Number.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tuesday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Bank Verification Number","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nigeria","content":"LOCATION"},{"type":"Zeeshan Feroz","content":"PERSON"}],"hashtag":["CRYPTO BANKS AND LENDERS","WALLETS"],"authors":["Osato Avan-Nomayo","The Block"]}