{"summary":"Ethereum’s next major upgrade — called &quot;Dencun,&quot; in short — might be delayed due to concerns about the deployment timeline.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252476\/ethereum-dencun-upgrade","publishDate":"2023-09-22T06:36:58","id":7855,"type":null,"title":"Ethereum core developers discuss if Dencun upgrade may be deployed early next year","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.29%\n    <\/span><\/a> <!----><\/span><\/span>’s next anticipated upgrade, referred to as Deneb-Cancun or “Dencun,” might potentially face a delay to early next year, as discussed by core developers. The upgrade aims to address scalability issues within the Ethereum ecosystem by implementing an improvement proposal named <\/span><a href=\"https:\/\/www.theblock.co\/post\/189829\/ethereum-core-developers-signal-support-for-proto-danksharding\" data-v-f87c67ca=\"\">EIP-4844<\/a>.","The launch plan for Dencun was discussed in yesterday’s Ethereum consensus-layer <a href=\"https:\/\/www.youtube.com\/watch?v=7ob1JFbcwZo\" data-v-f87c67ca=\"\">meeting<\/a>. Tim Beiko from the Ethereum Foundation, who chaired the meeting, expressed concerns about a potential delay in Dencun's deployment on the mainnet. His concerns stemmed from the fact that the upgrade has not yet been introduced on public testnets such as Goerli, Sepolia, and Holesky.","He further pointed out that if the developer team doesn’t introduce Dencun on a public testnet before Devconnect, an Ethereum-centric developer conference slated for November 2023, the mainnet activation of Dencun might not occur this year — which would be a departure from earlier projections. “If we don’t launch a [public] testnet before DevConnect, it’s probably unlikely we can go live on the mainnet before the Christmas holidays,” Beiko <a href=\"https:\/\/www.youtube.com\/watch?v=7ob1JFbcwZo\" data-v-f87c67ca=\"\">said<\/a>, suggesting that the Dencun upgrade might only be realized in 2024 if not introduced on public testnet by November.","Dencun's mainnet deployment will depend on various elements, including the readiness of the software code across Ethereum’s execution and consensus layers and the preparedness of multiple client teams — all of which must be tested on public testnets and can demand significant time.","At present, the upgrade work is still in the “devnet phase,” with only three months remaining in the year. During the meeting, core developers mentioned a localized developer network, “Devnet 9,” set to test Dencun. This testing on Devnet 9 is anticipated next week before transitioning to the public testnet phase.","The upgrade will bring changes across Ethereum’s two mainnet layers: the execution layer, which oversees smart contract execution, and the consensus layer, centered on blockchain consensus via staking.","For clarity, the upgrade for the execution layer will be named Cancun, while the consensus layer upgrade will receive the moniker Deneb— together forming the upgrade's name, Deneb-Cancun (or Dencun).","The most anticipated feature in Ethereum’s Deneb-Cancun upgrade is the Ethereum Improvement Proposal 4844, also known as <a href=\"https:\/\/www.theblock.co\/post\/189829\/ethereum-core-developers-signal-support-for-proto-danksharding\" data-v-f87c67ca=\"\">proto-danksharding<\/a>. EIP-4844 strives to augment Ethereum’s scalability, surpassing the existing capabilities of Layer 2 solutions.","EIP-4844 is designed to enable temporary storage and retrieval of off-chain data by Ethereum nodes, catering to the data and storage needs of blockchain applications. Once activated, EIP-4844 is expected to reduce transaction costs on Layer 2 rollup solutions, such as Optimism and Arbitrum, compared to their current rates.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"-0.29%","content":"PERCENT"},{"type":"4844","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Cancun","content":"LOCATION"},{"type":"Sepolia","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Holesky","content":"ORGANIZATION"},{"type":"Goerli","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"Tim Beiko","content":"PERSON"},{"type":"Dencun","content":"LOCATION"},{"type":"Beiko","content":"PERSON"},{"type":"Deneb","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}