{"summary":"Crypto exchange Huobi has incurred losses for the past four quarters and anticipates breaking even this quarter, Justin Sun told The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242767\/justin-sun-huobi-profit-loss","publishDate":"2023-08-02T10:24:12","id":7857,"type":null,"title":"Justin Sun says Huobi incurred losses in the last four quarters","category":["EXCHANGES"],"content":["Crypto exchange Huobi incurred losses for the past four quarters and anticipates breaking even this quarter, said its advisor and Tron founder Justin Sun.","Huobi did not post a profit from the third quarter of 2022 to the second quarter of this year, Sun told The Block, declining to comment on specific loss figures. Huobi spent \"too much\" on marketing, ads and payroll, Sun said, adding that expenses have now been curtailed and Huobi should return to profit in the fourth quarter.","Sun tweeted yesterday that Huobi has \"significantly improved\" its financial performance and is expected to reach break-even in Q3 and post \"a slight profit\" in Q4 based on \"conservative estimates.\" Earlier this year, Huobi cut its employee base by 20% amid the bear market.","Overall, the Sun-related crypto group, Huobi and Tron, seems to be doing well. The group posted a profit of $85 million combined, with $193 million of revenues and $108 million of expenses, Sun <a href=\"https:\/\/twitter.com\/justinsuntron\/status\/1686371227089436672?s=20\" data-v-f87c67ca=\"\">tweeted<\/a> yesterday. The Q2 profit is 183% higher than the group's Q1 profit of $30 million, Sun said. \"It is conservatively forecasted that the third quarter revenue will be $200 million, the expenditure will be $100 million, and the quarterly profit will be $100 million. This data does not include investment gains and losses,\" according to Sun.","Huobi was founded in 2013 and had been \"always profitable\" since then except for the last four quarters, Sun said, who has been representing the company publicly for the past few months.","Last October, Huobi announced its stake sale, saying that \"the controlling shareholder\" of the company had agreed to sell its stake to Hong Kong-based investment company About Capital Management's M&amp;A fund. Reports at the time said Sun is the core investor of the M&amp;A fund and, thus Huobi's real buyer, but Sun has <a href=\"https:\/\/www.theblock.co\/post\/175867\/justin-sun-denies-being-real-buyer-of-huobi-stake-sale-exclusive\" data-v-f87c67ca=\"\">denied<\/a> those reports, proclaiming he is simply an advisor to Huobi.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"second quarter of this year","content":"DATE"},{"type":"$108 million","content":"MONEY"},{"type":"third quarter of 2022","content":"DATE"},{"type":"this quarter","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"$85 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"$193 million","content":"MONEY"},{"type":"$30 million","content":"MONEY"},{"type":"About Capital Management","content":"ORGANIZATION"},{"type":"Huobi","content":"ORGANIZATION"},{"type":"183%","content":"PERCENT"},{"type":"Tron","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"third quarter","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Huobi","content":"PERSON"},{"type":"the fourth quarter","content":"DATE"}],"hashtag":["HTX","JUSTIN SUN"],"authors":["Yogita Khatri","The Block"]}