{"summary":"A hacker compromised the website of an NFT whitelisting platform called Premint and stole $375,000 worth of NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158147\/a-hacker-stole-375000-from-users-of-premint-nft-platform","publishDate":"2022-07-18T12:48:26","id":7858,"type":null,"title":"A hacker stole $375,000 from users of Premint NFT platform","category":["HACKS"],"content":["<span data-v-f87c67ca=\"\">On Sunday, a hacker compromised the official website of an NFT whitelisting platform called Premint to steal $375,000 worth of NFTs.<\/span>","<span data-v-f87c67ca=\"\">According to security firm CertiK, a black hat hacker injected a malicious piece of JavaScript code on premint.xyz, instructing users to sign a malicious transaction through a wallet pop-up. <\/span><span data-v-f87c67ca=\"\">A total of six users signed the code, giving <\/span><span data-v-f87c67ca=\"\">the hacker full control to spend funds.<\/span>","<span data-v-f87c67ca=\"\">\"Last night, a file was manipulated on PREMINT by an unknown third party that led to users being presented with a wallet connection that was malicious,\" the Premint team <a href=\"https:\/\/twitter.com\/PREMINT_NFT\/status\/1548732974769655808\" data-v-f87c67ca=\"\">stated<\/a>.<\/span>","<span data-v-f87c67ca=\"\">Before the exploit could be discovered, the hacker was able to steal 314 different NFTs. These included NFTs from collections like Bored Ape Yacht Club, Otherside, Moonbirds Oddities, and Goblintown. <\/span>","<span data-v-f87c67ca=\"\">The stolen assets were sold for 270 ETH ($375,000) around 07:30 a.m. ET on Sunday. <\/span><span data-v-f87c67ca=\"\">The hacker transferred the proceeds to this <a href=\"https:\/\/etherscan.io\/address\/0x99aeb028e43f102c5776f6b652952be540826bf4#tokentxns\" data-v-f87c67ca=\"\">address<\/a> and routed them through Tornado Cash, a popular transaction mixer on the Ethereum network.<\/span>","The exploit continues the growing trend of hackers leveraging vulnerabilities in traditional web infrastructure to carry out security exploits on web3 projects.","Last month, hackers exploited websites operated by decentralized finance projects Ribbon Finance and <a href=\"https:\/\/www.theblock.co\/linked\/153964\/curve-staking-platform-convex-announces-website-dns-hijacking\" data-v-f87c67ca=\"\">Convex Finance<\/a> to execute phishing attacks. In other incidents, <a href=\"https:\/\/www.theblock.co\/linked\/140102\/bored-ape-yacht-club-confirms-its-discord-was-hacked\" data-v-f87c67ca=\"\">Discord<\/a> servers, Twitter and Instagram accounts have been exploited to circulate phishing links aimed at stealing cryptocurrency and NFTs.&nbsp;","“It’s clear from this that the web3 ecosystem needs to take into account the interconnects with web2 technologies, particularly at points where its reliance on them becomes a vulnerability,” a spokesperson for CertiK told The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"07:30 a.m.","content":"TIME"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Moonbirds Oddities","content":"PERSON"},{"type":"Convex Finance","content":"ORGANIZATION"},{"type":"Last night","content":"TIME"},{"type":"Ribbon Finance","content":"ORGANIZATION"},{"type":"Discord<\/a> servers","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$375,000","content":"MONEY"},{"type":"Goblintown","content":"PERSON"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}