{"summary":"Previously, crypto trading on DDEx was limited to corporate and institutional investors, family offices and clients of DBS Private Bank and DBS Treasures Private Clients.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172348\/singapore-banking-giant-dbs-builds-out-crypto-trading-services-for-wealth-clients","publishDate":"2022-09-23T06:00:21","id":786,"type":null,"title":"Singapore banking giant DBS builds out crypto trading services for wealth clients","category":["INSTITUTIONAL INVESTORS"],"content":["Singapore bank DBS said today that it has introduced a crypto trading product for its wealth clients who are accredited investors.&nbsp;","This will allow them to trade crypto at their convenience, it said in a news release, adding that it will also provide \"hassle-free access to DDEx, one of the world’s first bank-backed digital exchanges.\"","Previously, crypto trading on DDEx was limited to corporate and institutional investors, family offices and clients of DBS Private Bank and DBS Treasures Private Clients.","With this latest initiative, the service is now available to accredited investors in the DBS Treasures segment as well. For a start, about 100,000 of these clients in Singapore will be able to access the services offered by the DBS digital asset ecosystem.","\"As a trusted partner that helps our clients to grow and protect their wealth, we believe in staying ahead of the curve and providing access to the solutions they seek,\" Sim S. Lim, group executive of consumer banking and wealth management, DBS Bank, said in a statement.","DBS first announced its intention to launch crypto trading services for institutional investors <a href=\"https:\/\/www.theblock.co\/post\/82411\/singapore-biggest-bank-dbs-crypto-exchange\" data-v-f87c67ca=\"\">in 2020<\/a>. It said <a href=\"https:\/\/www.theblock.co\/linked\/134113\/dbsbank-trading-desk\" data-v-f87c67ca=\"\">earlier this year<\/a> that it would look to launch a digital assets trading desk for retail customers by the end of 2022.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DBS Treasures","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"DBS Treasures Private Clients","content":"ORGANIZATION"},{"type":"DBS Bank","content":"ORGANIZATION"},{"type":"DBS","content":"ORGANIZATION"},{"type":"DBS Private Bank","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"earlier this year","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Sim S. Lim","content":"PERSON"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}