{"summary":"BlackRock Head of U.S. iShares Product Rachel Aguirre said both retail and new investors are interested in the firm&#x27;s spot bitcoin ETF.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273346\/blackrock-spot-bitcoin-etf-flows","publishDate":"2024-01-18T07:31:16","id":7860,"type":null,"title":"BlackRock says its spot bitcoin ETF is attracting a diverse investor base","category":["FUNDS"],"content":["Speaking with Bloomberg TV on Wednesday, BlackRock Head of U.S. iShares Product Rachel Aguirre said the firm was seeing inflows into its new spot bitcoin ETF product (IBIT) from all kinds of investors.","Asked whether the flows into IBIT were coming from Grayscale’s GBTC product, Aguirre <a href=\"https:\/\/www.bloomberg.com\/news\/videos\/2024-01-17\/ibit-inflows-coming-from-different-directions-aguirre-video\" data-v-f87c67ca=\"\">replied<\/a> the firm is seeing \"interest from both retail and self-directed investors,\" adding that there were investors \"who were ready to invest on day one.”","“But we're also focused on those investors who are just now beginning to look at this new asset class. And we're very excited about that,” she added.","Aguirre didn't comment on whether BlackRock’s model portfolios would include bitcoin allocations in the weeks and months ahead. However, the firm is focused on educational efforts for clients and financial advisors about bitcoin.","“What I will say is we're focused on, again for our clients, understanding what education needs there are supporting them along their investing journey and empowering them to make the financial decisions that are right for them,” Aguirre said.","Yesterday, the newly-launched U.S. spot bitcoin ETFs crossed the <a href=\"https:\/\/www.theblock.co\/post\/273147\/cumulative-spot-bitcoin-etf-volume-crosses-10-billion-on-fourth-day-of-trading\" data-v-f87c67ca=\"\">$10 billion<\/a> mark in cumulative trading volume in just four days, reaching $11.8 billion by the end of the trading day, according to Yahoo Finance data compiled by The Block. Grayscale, BlackRock and Fidelity continue to dominate, collectively accounting for about 90% of the total volume.","Yesterday's trading volume for the spot bitcoin ETFs hit nearly $2.2 billion, following the $1.8 billion registered on Tuesday — below the $3 billion seen last Friday and the $4.6 billion on day one of trading.&nbsp;","BlackRock and Fidelity's ETFs also lead in terms of fresh capital flowing into the instruments, according to Bloomberg ETF analyst Eric Balchunas. BlackRock recorded a total of $710 million worth of inflows and Fidelity $524 million in the first three days of trading, Balchunas <a href=\"https:\/\/x.com\/EricBalchunas\/status\/1747591085189128329?s=20\" data-v-f87c67ca=\"\">said<\/a>. Grayscale, on the other hand, registered $1.2 billion in outflows for its converted fund in the period, with total net flows across all the new spot bitcoin ETFs at $782.5 million.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"$3 billion","content":"MONEY"},{"type":"$2.2 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Yahoo Finance","content":"ORGANIZATION"},{"type":"$1.8 billion","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"$782.5 million","content":"MONEY"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"Bloomberg TV","content":"ORGANIZATION"},{"type":"$10 billion<\/a> mark","content":"MONEY"},{"type":"Bloomberg ETF","content":"ORGANIZATION"},{"type":"Aguirre","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"$11.8 billion","content":"MONEY"},{"type":"Rachel Aguirre","content":"PERSON"},{"type":"$524 million","content":"MONEY"},{"type":"$4.6 billion","content":"MONEY"},{"type":"Balchunas","content":"PERSON"},{"type":"$710 million","content":"MONEY"},{"type":"$1.2 billion","content":"MONEY"}],"hashtag":["BITCOIN","BLACKROCK","SPOT BITCOIN ETF"],"authors":["James Hunt","The Block"]}