{"summary":"Mayor Eduardo Paes is set to establish a working group and the city may also offer an additional discount if property taxes are paid in BTC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/130311\/rio-de-janeiro-mayor-bitcoin-btc-1-treasury","publishDate":"2022-01-14T07:31:30","id":7862,"type":null,"title":"Rio de Janeiro mayor plans to invest 1% of the city&#x27;s treasury in bitcoin","category":["BITCOIN"],"content":["Eduardo Paes, mayor of Rio de Janeiro, intends to invest 1% of the city's treasury reserves in cryptocurrency.","Brazil's top newspaper O Globo <a href=\"https:\/\/oglobo.globo.com\/economia\/eduardo-paes-quer-aplicar-parte-do-tesouro-do-rio-em-criptomoeda-dar-desconto-para-iptu-pago-em-bitcoin-25353018\" data-v-f87c67ca=\"\">reported<\/a> the news on Thursday, citing Paes's comments made at the Rio Innovation Week event. Paes was speaking on a panel alongside Miami mayor Francis Suarez and said: \"We are going to launch Crypto Rio and invest 1% of the treasury in cryptocurrency.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPaes is also set to establish a working group in that regard, per the report.","Rio de Janeiro may also offer a discount on property taxes if paid with bitcoin.","Pedro Paulo, secretary of finance and planning of the city, at the event said: \"We are studying the possibility of paying taxes with an additional discount if you pay with bitcoins. You take the discount of the single quota of 7% (of the IPTU) , it becomes 10% if you pay in bitcoin,\" said Paulo. \"Let's study the legal framework to do this.\"","IPTU is a property tax in Brazil charged by a local municipality. It is paid every year by the owner of a house, building, or land plot.","If Rio succeeds with its plan, it will become the first Brazilian city to hold bitcoin on its balance sheet.","Last year, the Miami mayor also <a href=\"https:\/\/www.theblockcrypto.com\/post\/91405\/miami-mayor-bitcoin-btc-investment-plan-city-treasury-reserves\" data-v-f87c67ca=\"\">announced<\/a> his intention to invest the city's treasury reserves in bitcoin. But he is yet to take a plunge. In October, Suarez said it is \"a major priority\" for the city to invest a portion of their funds in bitcoin.","Last year, El Salvador became the first nation to buy bitcoin on its balance sheet. The central American country currently <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-01-12\/bitcoin-trading-president-likely-loses-money-for-el-salvadorans\" data-v-f87c67ca=\"\">holds<\/a> around 1,390 bitcoins, worth over $58 million at current prices.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Correction: This story and its headline have been updated to mention cryptocurrency in place of bitcoin when referring to Rio’s planned investment from its treasury reserves.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"Paulo","content":"LOCATION"},{"type":"El Salvador","content":"LOCATION"},{"type":"$58 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"Brazil","content":"LOCATION"},{"type":"Crypto Rio","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Suarez","content":"PERSON"},{"type":"Rio de Janeiro","content":"ORGANIZATION"},{"type":"Pedro Paulo","content":"PERSON"},{"type":"Francis Suarez","content":"PERSON"},{"type":"1%","content":"PERCENT"},{"type":"October","content":"DATE"}],"hashtag":["BITCOIN"],"authors":["Yogita Khatri","The Block"]}