{"summary":"Co:Create, a crypto startup building an infrastructure protocol for NFT projects, has raised $25 million in a seed round led by a16z.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/146041\/nft-infra-cocreate-crypto-raises-seed-funding-a16z","publishDate":"2022-05-10T11:00:21","id":7865,"type":null,"title":"A16z leads $25 million seed round for NFT infrastructure startup Co:Create","category":["VENTURE CAPITAL"],"content":["Co:Create, a crypto startup building an infrastructure protocol to help NFT projects launch tokens and manage DAOs, has raised $25 million in a seed round led by Andreessen Horowitz (a16z).","Other investors include Tom Brady's NFT platform Autograph, Packy McCormick's Not Boring Capital, FTX Ventures' Amy Wu, Gary Vaynerchuk's VaynerFund and the teams behind NFT fractionalization platform Fractional.art and Nike-acquired NFT studio <a href=\"https:\/\/www.theblockcrypto.com\/linked\/127417\/nike-buys-nft-collectables-startup-rtfkt\" data-v-f87c67ca=\"\">RTFKT<\/a>, the company announced on Tuesday.","Co:Create says its protocol, currently under development, aims to help NFT projects \"go beyond the drop,\" meaning beyond just creating digital collectibles and selling them.","\"We want to support decentralized brands of the future,\" Tara Fung, co-founder and CEO of Co:Create, told The Block in an interview. \"The combination of NFT plus fungible native token and DAO will just unlock the full potential of NFT projects and web3 brands.\"","Fung said NFTs are more than just digital collectibles. They are \"programmable assets\" that can be used to unlock certain benefits, such as a game, an event, an experience or other goods and services.","She went on to say that if an NFT project launches its own token, it can grow its community in addition to its NFT holders. Fung gave an example of the recent launch of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/138156\/apecoin-tied-to-bored-ape-nft-ecosystem-debuts-with-planned-community-airdrop\" data-v-f87c67ca=\"\">ApeCoin<\/a>, which has helped expand the Bored Ape ecosystem beyond its collection holders since anyone can buy ApeCoin and be part of the Bored Ape community.","The Co:Create protocol will essentially provide a smart contracts platform that projects can use to mint NFTs and control royalties to be paid in their native token.","The initial version of the protocol will launch this fall, said Fung, adding that the mainnet will follow later.","Fung declined to comment on beta launch partners of Co:Create, but she said if \"blue-chip projects\" want to join, the platform will decide to onboard them.","Co:Create also plans to support big fashion brands that are exploring web3, such as Nike and Gucci. Fung said the firm is already in talks with several such brands. She believes that \"eventually there will be no such thing as web3 company, just as there's no longer an internet company,\" as every web2 company will adopt web3 tools and technologies.","Co:Create is currently focused on its development. With fresh funding in place, the project also plans to double its current team of 10 people and sign partnerships with brands and creators for its protocol, said Fung.","Eventually, Co:Create itself plans to convert into a DAO and launch its own native token, known as CO, to hand over the protocol's governance to a community of its NFT projects. Co:Create is currently part of Gesso Labs (pronounced “Jesso”, the Italian word for chalk).","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Amy Wu","content":"PERSON"},{"type":"fall","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tara Fung","content":"PERSON"},{"type":"CO","content":"ORGANIZATION"},{"type":"Tom Brady","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Packy McCormick","content":"PERSON"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Nike","content":"ORGANIZATION"},{"type":"$25 million","content":"MONEY"},{"type":"Gary Vaynerchuk","content":"PERSON"},{"type":"Gucci","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}