{"summary":"Fed chairman Jerome Powell said Tuesday that &quot;we are working hard&quot; on investigating central bank digital currencies, or CBDCs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55522\/fed-chair-powell-says-facebooks-libra-really-lit-a-fire-on-the-question-of-a-digital-dollar","publishDate":"2020-02-11T12:18:54","id":7866,"type":null,"title":"Fed chair Powell says Facebook&#x27;s Libra &#x27;really lit a fire&#x27; on the question of a digital dollar","category":["FACEBOOK"],"content":["\"<span data-v-f87c67ca=\"\">We’re working hard on it, we have a lot of projects going on, lot of efforts going on on that right now.\"<\/span>","That's according to Jerome Powell, the current chairman of the U.S. Federal Reserve when asked by Rep. Bill Foster of Illinois about the progress being made on the topic of central bank digital currencies, or CBDC.","The back and forth between Foster and Powell focused on the viability of a so-called digital dollar, the competitive pressures the Fed would face from China's central banks as well as private companies like Facebook, and how such a roll-out might take place.","In what might be called the most notable line from the exchange, Powell acknowledged that Libra – launched last year by the social media giant and backed by a group of companies – \"<span data-v-f87c67ca=\"\">really lit a fire\" under the bank's work.<\/span>","<span data-v-f87c67ca=\"\">“It was a bit of a wakeup call that this is coming fast, and could come in a way that is quite, you know, widespread and systemically important fairly quickly if you use one of these big tech networks like Libra did,\" Powell remarked.<\/span>&nbsp;","Powell was asked about the competitive pressures posed by China's efforts to create a digital yuan, and how aware the Fed is aware of the work being done by the Chinese central bank. It was in response to that query that he notably remarked that a wholly public ledger wouldn't be a good fit for such a system within the United States, if built.&nbsp;","<span data-v-f87c67ca=\"\">\"Yes. We certainly have that -- but, you know, there are completely different institutional context. There are things that -- for example, the idea of having a ledger where you know everybody’s payments – that’s not something that would be particularly attractive in the United States context. It’s not a problem in China,\" he said.<\/span>","But Powell stressed that the Fed has not officially embarked on the creation or launch of a digital dollar.&nbsp;","<span data-v-f87c67ca=\"\">\"We have not decided to do this,\" he told Foster. \"It is not -- there are many questions that need to be answered around a digital currency for the United States, including issues of, cyber issues, privacy issues, many many operational alternatives present themselves. And so we’re going to be working through all of that and doing that work thoroughly and responsibly.<\/span>","That conservative approach echoes past comments from Powell, who said last fall that consumers are not \"<a href=\"https:\/\/www.theblockcrypto.com\/linked\/38819\/fed-chair-jerome-powell-consumers-are-not-clamoring-for-central-bank-backed-cryptocurrencies\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">clamoring<\/a>\" for central bank-backed digital currencies.","Steven Mnuchin, the U.S. Treasury secretary, <a href=\"https:\/\/www.theblockcrypto.com\/post\/49491\/mnuchin-powell-see-no-need-to-issue-digital-dollar-in-the-next-5-years\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">said in December<\/a> that he sees little reason to aggressively push for a digital dollar.","“Chair Powell and I have discussed this at length- we both agree that in the near future, in the next five years, we see no need for the Fed to issue a digital currency,” Mnuchin told the same committee at the time.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fed","content":"ORGANIZATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"Mnuchin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Bill Foster","content":"PERSON"},{"type":"last fall","content":"DATE"},{"type":"Powell","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Illinois","content":"LOCATION"},{"type":"Jerome Powell","content":"PERSON"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"Libra","content":"PERSON"},{"type":"Steven Mnuchin","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}