{"summary":"Coinbase’s international strategy is gathering momentum but it’s unclear if the U.S.-based exchange can eventually generate significant revenue outside its key market.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254111\/coinbase-push-abroad-gaining-steam-but-plenty-of-uncertainty-remains","publishDate":"2023-10-03T11:06:52","id":787,"type":null,"title":"Coinbase push abroad gaining steam but plenty of uncertainty remains","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">With Coinbase’s <a href=\"https:\/\/www.theblock.co\/post\/253755\/coinbase-granted-full-license-in-singapore\" data-v-f87c67ca=\"\">announcement<\/a> this week that it secured a key <\/span><span data-v-f87c67ca=\"\">regulatory license in Singapore, the U.S.-based crypto exchange’s international push appears to be gaining steam.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But while the company’s drive to secure regulatory approval to operate in international markets is widely viewed as an intelligent move, some analysts simultaneously view Coinbase’s recent gains as somewhat symbolic rather than substantive, at least for the time being.<\/span>","<span data-v-f87c67ca=\"\">“While it makes sense for Coinbase to lean into international initiatives given the still-heightened regulatory risk in the U.S., we think it remains an open question whether the company will be able to execute what appears to be a very difficult pivot,” <\/span><span data-v-f87c67ca=\"\">Berenberg Capital Markets analyst Mark Palmer told The Block. <\/span><span data-v-f87c67ca=\"\">“There is a lot of competition in the markets it is targeting, and it would have to gain a great deal of traction to make up for the net revenue to which it could lose access in the U.S.”<\/span>","<span data-v-f87c67ca=\"\">Coinbase’s new license in Singapore <\/span><span data-v-f87c67ca=\"\">is expected to allow the company to offer a wider range of Digital Payment Token services to both retail and institutional customers in the region. <\/span>","<span data-v-f87c67ca=\"\">The approval follows a string of other announcements coming as a result of Coinbase’s push abroad, a strategy it calls “Go Broad, Go Deep.” Last week, the company not only <a href=\"https:\/\/www.theblock.co\/post\/253326\/coinbase-perpetual-futures-retail-users\" data-v-f87c67ca=\"\">gained approval<\/a> to offer non-U.S. retail users perpetual futures, it also <a href=\"https:\/\/www.theblock.co\/post\/252840\/coinbase-secures-bank-of-spain-registration-as-part-of-global-expansion\" data-v-f87c67ca=\"\">secured registration<\/a> as a cryptocurrency exchange and custodian wallet provider with the Bank of Spain.<\/span>","<span data-v-f87c67ca=\"\">With Coinbase’s battle with U.S. regulators ongoing — by far its biggest market — the company has been working hard to establish a footprint in international markets. It <a href=\"https:\/\/www.theblock.co\/post\/250375\/coinbase-to-push-for-global-consensus-on-crypto-rules-through-g20-in-brazil\" data-v-f87c67ca=\"\">has said<\/a> its strategy involves f<\/span><span data-v-f87c67ca=\"\">ocusing on 24 countries, including G20 members like Brazil, plus Hong Kong, Switzerland, and the United Arab Emirates.<\/span>","<span data-v-f87c67ca=\"\">“The reality is that vast majority of Coinbase’s net revenue is still generated in the U.S., and we estimate that more than 36% of the net revenue that the company generated during the second quarter may be at risk due to regulatory actions that have been initiated or, in the case of stablecoins, could be on the horizon,” added Palmer.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Given market conditions, Needham &amp; Company Senior Research Analyst John Todaro is supportive of Coinbase’s international efforts, but also expressed skepticism about how lucrative the strategy will prove to be.<\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">With [trading] volumes being this tepid, you have to look abroad. It does not require much additional spend too, so there should be some operational leverage from it,” he told The Block. “That being said, it is too early in our view to see how much revenue ultimately comes from these new markets and globally the volume picture looks muted still.”<\/span>","<span data-v-f87c67ca=\"\">For some industry experts, the fact that Coinbase is keen to diversify and displaying a willingness to remain nimble amid an ever-evolving regulatory landscape should pay dividends. And if Binance, the world’s largest cryptocurrency exchange, continues to <a href=\"https:\/\/www.theblock.co\/post\/253132\/binance-market-share-non-usd-exchanges\" data-v-f87c67ca=\"\">lose market share<\/a>, naturally rival exchanges will have an opportunity to grow.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“At the end of the day, you will need regulatory approval if you want to create a global brand so might as well start now,” said Rayne Steinberg, CEO at crypto hedge fund Arca.<\/span><span data-v-f87c67ca=\"\"> “<\/span><span data-v-f87c67ca=\"\">This is a space that is so new and changing so fast, that to go too far down one path is very risky. This applies to regulatory regimes as well. Ones that appear to be friendly can still change rather quickly. Better to have approaches in several if you have the resources.”<\/span>","<span data-v-f87c67ca=\"\">While the regulatory situation in the U.S. lags behind other regions, especially Europe, adoption of blockchain and cryptocurrency continues to trend in the right direction, argued <\/span><span data-v-f87c67ca=\"\">Gartner Senior Blockchain Industry Analyst Avivah Litan. Companies and exchanges people can trust will clearly benefit.<\/span>","<span data-v-f87c67ca=\"\">“Coinbase is right on the mark by focusing more on non-U.S. markets, where regulators are borderline dysfunctional in their approach,\" she told The Block.<\/span><span data-v-f87c67ca=\"\"> \"Singapore has always been at the front of the class in this regard and it’s good to see Coinbase licensed there.\"<\/span>"],"hashtag":["COINBASE"]}