{"summary":"The former FTX CEO spoke publicly, weeks after FTX filed for bankruptcy protection and Bankman-Fried resigned from his role at the company.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191141\/sam-bankman-fried-set-to-speak-at-new-york-times-event-a-live-look","publishDate":"2022-11-30T16:57:10","id":787,"type":null,"title":"Sam Bankman-Fried tries to defend FTX collapse, apologizes (again)","category":["BANKRUPTCY"],"content":["Sam Bankman-Fried just wrapped up an interview with Andrew Ross Sorkin at the New York Times DealBook Summit. The Block tuned in and kept a running tally of what he had to say. Thanks for sticking with us, or checking in to catch up.&nbsp;","The comments are in reverse chronological order. Be sure to check back in for more coverage.&nbsp;&nbsp;","SBF: \"I don't know what my far future is. When I look at the near, medium term, what am I thinking? I don't know what's going to happen.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSBF: \"A lot is not in my hands at this point ... I want to be helpful wherever I can. I don't know where that will lead.\"","SBF: \"I can't promise anyone anything.\"","Asked about other exchanges, SBF said he does not know what's going on, but gave advice on what to look for.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSBF: \"Look for the things that I wish FTX had been able to supply. Look for proof of reserves, regulatory reporting.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSBF: \"There's a diffusion of responsibility ... There needed to be, I think, a single, or small set, of entities. boards, people, responsible parties.\"","Asked about how much money he has left, he said: \"To my knowledge, close to nothing.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSBF: \"Everything was in the companies.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSBF: He said that he \"didn't put away money anywhere,\" and has one working credit card.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSBF: \"I'd put everything I had into FTX.\"","SBF: \"So, it's funny hearing this. I had my first sip of alcohol after my 21st birthday.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSBF: \"There were no wild parties here ... When we had parties; we played board games.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSBF: \"I didn't see any illegal drug use around me.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSBF: \"I can't talk about anyone else ... For me, I dunno, like, I've been prescribed various things at various times to help with concentration.\"","Ross Sorkin asks for Bankman-Fried's view on the idea that FTX was \"a bunch of kids on Adderall having a sleepover.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSBF:&nbsp;\"Look, I screwed up. We messed up big.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAsked if there were people telling them they needed more compliance, SBF said \"there were.\"&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSBF said a lot of licensing requirements may have taken away energy they could have focused on risk.","SBF: \"We lost track of really important part of the business.\"","SBF: \"So many things we should have had in place ... a lot of it was on the risk management side.\"","SBF: \"So, I mean, lawmakers were not ruling on FTX. FTX didn't have an application before Congress for anything.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSBF: \"My donations were mostly for pandemic prevention.\"","SBF: \"That was the primary thing that I was supporting with those contributions.\"","Asked where the money for the donations came from, SBF said: \"Basically, profits.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSBF: \"It was substantially smaller than the amount of trading profits that Alameda had made over the\" prior years.","SBF: \"It was not meant to be a public interview.\" He says he \"stupidly\" forgot the \"longtime friend\" was a reporter.","Asked about his comments about regulators and how he behaved around them, SBF said: \"There's a bunch of bullshit that regulated companies do to trend good.\"","SBF: \"Everyone who does them basically knows that they're kind of dumb.\"","When Ross Sorkin asked if he participated in greenwashing, Bankman-Fried said: \"Yeah, we all did.\"","SBF: \"I wish the world didn't work this way.\"","Ross Sorkin asks what Bankman-Fried's lawyers are telling him, prompting laughter from the audience.","SBF: \"They are very much not\" suggesting he should be talking.","SBF: \"It's not who I am. It's not who I want to be. I have a duty to explain what happened.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSBF: \"I don't see what good is accomplished by me, just sitting locked in a room, pretending that the outside world doesn't exist.\"","He says he's in the Bahamas, and has thought about going to the U.S.","SBF: \"I would not be surprised if sometime I am up there talking about what happened to our representatives.\"","SBF: \"I don't personally think that I have ... the real answer. It sounds weird to say. That's not what I'm focusing on. There's going to be a time and place for me to think about myself and my future.\"","So far, Bankman-Fried has answered many of the questions while glancing at the floor, with eyes downcast, visibly shaking his legs.","SBF: \"November 6, that was the date that the tweet about FTT came out.\"","SBF: \"By late on November 6 we were putting together all the information.\"","SBF: \"When I started to think a bit more about this. um, you know, I was nervous that that would lead to substantial losses for Alameda and that it would be a bit messy.\"","SBF: \"By late November 6 ... I'm starting to think about emergency scenarios.\"","SBF: \"On November 7, I was feeling quite uneasy about that.\"","Note: He's only said \"sorry,\" once thus far.","SBF: \"I wasn't running Alameda. I didn't know exactly what was going on.\"","SBF: \"I didn't know the size of their position.\"","SBF: \"I was nervous because of the conflict of interest about being too involved\" with Alameda.","SBF: \"FTX had been a profitable, growing business. And that was more than a full-time job.\"","SBF: \"I was nervous about a conflict of interest\" says he was intentional about not being too involved.","SBF: \"I was failing to pay nearly enough attention.\"","Bankman-Fried opened by saying: “I mean, I’m deeply sorry about what happened.”","Ross Sorkin asked a question posed by a former FTX user via email, leading SBF to say that “To my knowledge, that’s fully funded” speaking on the U.S. platform.","SBF: “I didn’t knowingly co-mingle funds” and \"I wasn't trying to co-mingle funds.\"","SBF: \"What it seems like happened: It seems like Alamenda had margin positions opened with them (FTX).\"","SBF also said that he's had limited access to data while trying to reconstruct what happened.&nbsp;","Sam Bankman-Fried’s crypto empire just collapsed. Now he wants to explain himself (again).","The former FTX CEO will soon speak publicly, 19 days after FTX filed for bankruptcy protection and Bankman-Fried resigned from his role at the company.","Bankman-Fried will appear at The New York Times’s DealBook summit. It’s the latest unusual move for an embattled ex-CEO who has made plenty of them. Bankman-Fried has posted on Twitter and spoken to several media outlets in the wake of the FTX crash, blaming himself for the collapse, throwing shade at regulators, suggesting he was a secret Republican megadonor and even saying he regrets filing for bankruptcy protection in the first place.","Stay with The Block for live coverage of Bankman-Fried’s appearance at the summit. We’ll be listening closely to Bankman-Fried’s comments — and even keeping a running count of how many times he says he’s sorry.","Take what Bankman-Fried says with a grain of salt: The executive who just took over at FTX says the firm’s situation is the worst he’s ever seen — and he cleaned up Enron’s epic bankruptcy.","<em data-v-f87c67ca=\"\">(Updates with comments from Sam Bankman-Fried.)<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Enron","content":"ORGANIZATION"},{"type":"November 7","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"November 6","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"The New York Times","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Alamenda","content":"PERSON"},{"type":"New York Times DealBook Summit","content":"ORGANIZATION"},{"type":"Andrew Ross Sorkin","content":"PERSON"},{"type":"SBF","content":"ORGANIZATION"},{"type":"Ross Sorkin","content":"PERSON"}],"hashtag":["FTX","SAM BANKMAN-FRIED"],"authors":["Stephanie Murray","Nathan Crooks","RT Watson","The Block"]}