{"summary":"For compliance officers at global crypto firms, the stakes are high: they must decode complex KYC regulations in different markets and ensure users complete signups without jumping ship. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254803\/the-emerging-need-for-new-kyc-solutions-that-dont-push-users-away","publishDate":"2023-10-06T09:01:04","id":7870,"type":null,"title":"The emerging need for new KYC solutions that don&#x27;t push users away","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">For compliance officers at global crypto firms, the stakes are high: they must decode complex KYC regulations in different markets and ensure users complete signups without jumping ship.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">What's the key? Advancements in KYC technology are reshaping and enhancing the entire customer onboarding experience. Let's delve into the reasons<\/span>","<span data-v-f87c67ca=\"\">To protect against anti-money laundering schemes and identity thefts, compliance officers must bake lengthy KYC checks into their platform signup process. A myriad of third-party KYC solutions exists, from data collection forms to document scanning, to help solve parts of this puzzle. However, sourcing, negotiating, and implementing these disparate solutions usually takes months, leading to downtimes, errors, and lost revenue.<\/span>","<span data-v-f87c67ca=\"\">Expanding to new markets adds more complexity as different regions have their own regulations, thousands of unique ID types, and additional third-party services that have to be connected.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For crypto companies active in multiple markets, this means thousands of dollars in testing, implementation, and maintenance costs. Innovative KYC software providers are solving this challenge head-on using AI, biometry, and machine learning to combine the best third-party integrations and create a seamless experience, catering to global needs. With the right technology in place, crypto companies can achieve full KYC compliance in global markets rapidly.<\/span>","<span data-v-f87c67ca=\"\">While compliance is a given, conversions are equally critical. Asking too many questions during the onboarding process can frustrate users, and if they don’t know how to complete the checks, it can lead to drop-offs and poor conversion rates.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Take Binance for example. In 2019, the crypto-giant lost <\/span><a href=\"https:\/\/cryptoslate.com\/crypto-exchnage-binance-lost-3-of-its-customers-due-to-kyc-demands\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">3% of its global customers<\/span><\/a><span data-v-f87c67ca=\"\"> due to rigorous KYC checks. Yet, Binance <\/span><a href=\"https:\/\/beincrypto.com\/binance-exchange-and-ceo-sued\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">was sued<\/span><\/a><span data-v-f87c67ca=\"\"> by the US authorities earlier this year for “purported lax KYC\/AML procedures”.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The key to balancing compliance and conversions lies in localisation and smart technology, such as <\/span><a href=\"https:\/\/checkin.com\/id-scanner\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">AI-driven ID scanning<\/span><\/a><span data-v-f87c67ca=\"\">, liveness checks via cameras, and face matching and automatic data extraction. Industry leaders like Checkin.com recognise this and have invested heavily in AI and smart technology to <\/span><a href=\"https:\/\/checkin.com\/blog\/kyc-software-comparison\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">simplify the verification process at scale<\/span><\/a><span data-v-f87c67ca=\"\">. Reducing friction in the signup process increases the likelihood that users will complete it and become customers.<\/span>","<span data-v-f87c67ca=\"\">Asking for sensitive customer data also comes with a heavy responsibility to keep it safe. Data breaches can cost your company millions of dollars and severely tarnish trust.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">End-to-end KYC solutions not only streamline compliance and improve conversions but also come with built-in security features to protect sensitive customer data. But crypto firms must also do their due diligence and inquire about data storage, ISO\/IEC certification, encryption methods, data access, and jurisdictional processing restrictions when choosing a KYC partner.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">In the volatile world of cryptocurrency, striking the right balance between compliance and conversions is a high-wire act. Comprehensive KYC solutions offer the safety net that crypto firms need to grow faster and stay fully compliant in any market. With robust compliance measures and optimized user onboarding, innovative KYC solutions solving these challenges at scale are the linchpin for success in today's crypto market.<\/span>","<br data-v-f87c67ca=\"\">\n<b data-v-f87c67ca=\"\">If you would like to try the optimal KYC flow with your own branding adapted for any market you currently target - <\/b><a href=\"https:\/\/meet.checkin.com\/crypto-kyc\/?utm_campaign=Crypto%20KYC%202023&amp;utm_source=The%20Block&amp;utm_medium=Article&amp;utm_content=Link\" data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">submit your website to Checkin.com<\/b><\/a><b data-v-f87c67ca=\"\"> for an interactive demo!<\/b>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"IEC","content":"ORGANIZATION"},{"type":"KYC","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"ISO","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"millions of dollars","content":"MONEY"},{"type":"AML","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Binance","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}