{"summary":"Ethereum co-founder Vitalik Buterin looked at the potential ways crypto and AI can overlap, noting the use cases and the corresponding risk.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275089\/vitalik-buterin-cryptocurrency-ai-use-cases","publishDate":"2024-01-30T06:48:02","id":7871,"type":null,"title":"Vitalik Buterin details four ways cryptocurrency and AI can overlap","category":["CRYPTO ECOSYSTEMS"],"content":["Ethereum co-founder Vitalik Buterin broke down four ways that cryptocurrency and artificial intelligence may overlap, finding some potential use cases and noting some corresponding risks.","Buterin examined the use of AI as an actor, as an interface, as the rules themselves, and an end objective in itself in a <a href=\"https:\/\/vitalik.eth.limo\/general\/2024\/01\/30\/cryptoai.html\" data-v-f87c67ca=\"\">blog post<\/a> published Tuesday. He noted that the use of AI as an actor within a protocol had the highest viability, while the use of AI as an interface to a protocol has high potential but carries some risk.","\"In general, use cases where the underlying mechanism continues to be designed roughly as before, but the individual players become AIs, allowing the mechanism to effectively operate at a much more micro scale, are the most immediately promising and the easiest to get right,\" he said.","Buterin noted that the most challenging use of cryptocurrency and AI to get right would be applications that try to create a single, decentralized, trusted AI for other applications to rely on.","\"These applications have promise, both for functionality and for improving AI safety in a way that avoids the centralization risks associated with more mainstream approaches to that problem,\" he said. \"But there are also many ways in which the underlying assumptions could fail; hence, it is worth treading carefully, especially when deploying these applications in high-value and high-risk contexts.\"","Buterin said he is looking forward to seeing more attempts at constructive use cases of AI in each of these four areas to find out which of them works at scale.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"}],"hashtag":["CRYPTO","VITALIK BUTERIN"],"authors":["Tim Copeland","The Block"]}