{"summary":"Binance is under investigation by local authorities in France, one of its regional hubs, according to local media.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235129\/binance-is-under-investigation-in-france-for-alleged-money-laundering-le-monde","publishDate":"2023-06-16T07:24:55","id":7876,"type":null,"title":"Binance is under investigation in France for alleged money laundering: Le Monde","category":["COMPANIES"],"content":["Crypto exchange Binance is under investigation by local authorities in France over the alleged illegal provision of crypto services and “aggravated money laundering.”","The news <a href=\"https:\/\/www.lemonde.fr\/pixels\/article\/2023\/06\/16\/binance-principale-plate-forme-mondiale-d-echange-de-cryptomonnaies-visee-par-une-enquete-en-france_6177876_4408996.html\" data-v-f87c67ca=\"\">was first reported by Le Monde<\/a> this morning. The report states that Binance has been under “preliminary investigation” by the financial judicial investigation service under the direction of authorities in Paris since February 2022. Paris’s public prosecutor’s office confirmed the report, Le Monde wrote.","The investigation concerns the alleged “illegal exercise of the function of service provider on digital assets (PSAN), and on the other hand facts of aggravated laundering, by competition with investment operations, concealment, conversion, the latter being carried out by perpetrators of offences who have generated profits,” the report stated.","Binance, which is also suspected of breaching KYC rules, has been registered as a PSAN in France since 2022. It counts Paris, alongside Dubai, as one of its regional hubs — and a considerable number of its thousands of staff are based in the area.&nbsp;","Binance said it had an on-site visit last week by local authorities. It claimed this was part of standard regulatory obligations.","\"Binance invests considerable time and resources into cooperating with law enforcement globally. We abide by all laws in France, just as we do in every other market we operate. We will not comment on the specifics of law enforcement or regulatory investigations except to say that information about our users is held securely and only provided to government officials upon receipt of documented appropriate justification,\" said a Binance spokesperson.","The news comes with the exchange also facing multiple lawsuits in the United States. Binance was <a href=\"https:\/\/www.theblock.co\/post\/233206\/sec-binance-showdown-sends-shockwaves-through-crypto\" data-v-f87c67ca=\"\">sued by the Securities and Exchange Commission<\/a> earlier in June for allegedly lying to customers and misdirecting capital. It had earlier been sued by the Commodity Futures Trading Commission, the derivatives regulator.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"this morning","content":"TIME"},{"type":"France","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Paris","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"February 2022","content":"DATE"},{"type":"Dubai","content":"LOCATION"},{"type":"Monde","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}