{"summary":"Authorities in Dalian alerted investors about illegal fundraising scams disguised as crypto or metaverse investment opportunities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278148\/china-crypto-scams-warning-crackdown-dalian","publishDate":"2024-02-20T04:27:00","id":7884,"type":null,"title":"Chinese local authorities warn public of crypto-related scams amid broader crackdown","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Chinese financial watchdogs and police in a city in the Liaoning province released a notice urging investors to beware of \"illegal fundraising activities\" disguised as lucrative investment opportunities involving cryptocurrency and the metaverse as China continues its crackdown on crypto-related fraud amid a ban on crypto trading.<\/span>","<span data-v-f87c67ca=\"\">In the joint <\/span><a href=\"http:\/\/www.csrc.gov.cn\/dalian\/c104245\/c7463692\/content.shtml\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">notice<\/span><\/a><span data-v-f87c67ca=\"\">, Dalian's securities regulator and six other authorities stated that \"unscrupulous individuals\" have orchestrated scams through online platforms such as WeChat groups to lure investors into downloading illegal apps and purchasing illegitimate cryptocurrencies. Such behaviors could lead to suspected illegal fundraising, fraud and other criminal activities, according to the authorities.<\/span>","<span data-v-f87c67ca=\"\">The public warning from Dalian’s authorities came after several previous notices from the nation’s regulatory bodies, including the People’s Bank of China, detailing the illegal nature of token issuance, financing and trading.<\/span>","<span data-v-f87c67ca=\"\">In September 2021, the PBOC, the Supreme People’s Court and several other central authorities issued a notice banning all crypto trading activities on the mainland. The ban clarified that services provided by overseas crypto exchanges to Chinese residents on the mainland are considered illegal financial activities.<\/span>","<span data-v-f87c67ca=\"\">Unlike its neighboring Chinese mainland’s broader crackdown on crypto trading and mining, Hong Kong <\/span><a href=\"https:\/\/www.theblock.co\/post\/277767\/hong-kong-crypto-etf-reach-peak-performances\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">rolled out the welcome mat for crypto firms<\/span><\/a><span data-v-f87c67ca=\"\"> last year. <\/span><span data-v-f87c67ca=\"\">In June 2023, Hong Kong officially started its crypto licensing regime for virtual asset trading platforms, allowing licensed exchanges to offer retail trading services. Hong Kong has granted licenses to two platforms — HashKey and OSL.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"PBOC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"OSL","content":"ORGANIZATION"},{"type":"Liaoning","content":"LOCATION"},{"type":"People’s Bank of China","content":"ORGANIZATION"},{"type":"the Supreme People’s Court","content":"ORGANIZATION"},{"type":"Dalian","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}