{"summary":"Mantle and Ondo Finance have launched USDY — a yield token backed by real-world assets on the Ethereum Layer 2 Mantle Network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261943\/mantle-ondo-finance-launch-rwa-backed-usdy","publishDate":"2023-11-07T06:44:06","id":7888,"type":null,"title":"Mantle and Ondo Finance launch RWA-backed USDY yield token","category":["DEFI"],"content":["Decentralized autonomous organization-led web3 ecosystem Mantle partnered with tokenized financial products platform Ondo Finance to launch USDY, a yield-generating token backed by real-world assets.&nbsp;","The yield-bearing token is being introduced to the Mantle Network following the launch of the Ethereum Layer 1 to Mantle Layer 2 bridge for USDY, according to a statement. USDY is an upgradeable Ethereum ERC-20 token — available at Mantle decentralized exchanges, such as Agni Finance and FusionX Finance.","Ondo Finance is the leader in tokenized securities with approximately <a href=\"https:\/\/dune.com\/steakhouse\/tokenized-securities\" data-v-f87c67ca=\"\">50% market share<\/a>, according to a Steakhouse Financial Dune Analytics dashboard, and has legally structured USDY as a tokenized bearer instrument. Users can also onboard directly into USDY on Mantle via Ondo Finance’s mint and bridging mechanism.","Offering an alternative to stablecoins like Tether’s USDT and Circle’s USDC, USDY is a tokenized note secured by short-term U.S. treasuries and bank demand deposits. Holders receive a yield generated via the underlying assets in the form of accumulating token value, according to the team.&nbsp;","Rebasing counterpart mUSD — a wrapped version of USDY designed to maintain a peg to $1 with interest distributed via new tokens — is also expected to be issued by Ondo Finance in the coming weeks, the team added.","“RWA is expected to play a key role in helping bring sustainable yield into Mantle’s broader DeFi ecosystem, and USDY and mUSD are crucial pieces of the puzzle,” Mantle Chief Alchemist Jordi Alexander said. “We are thrilled to work with Ondo Finance to build a highly liquid and easily accessible ecosystem for USDY and mUSD to be used and traded just like any stablecoin, but with the added benefit of tapping into real world U.S. Treasury yield right from the crypto wallet.”&nbsp;","“We are delighted to partner with Mantle to bring USDY to market with deep secondary market liquidity,” Ondo founder and CEO Nathan Allman added.","Mantle Network unveiled its <a href=\"https:\/\/www.theblock.co\/post\/239904\/ethereum-layer-2-mantle-network-mainnet-alpha-ethcc\" data-v-f87c67ca=\"\">mainnet alpha<\/a> at EthCC in July. Following a previous merger with backer <a href=\"https:\/\/www.theblock.co\/post\/231557\/ethereum-layer-2-mantle-network-merges-with-backer-bitdao\" data-v-f87c67ca=\"\">BitDAO<\/a> in May — amalgamating BitDAO’s governance framework and treasury with the network — Mantle is now backed by one of the largest treasuries in crypto, worth around <a href=\"https:\/\/etherscan.io\/address\/0x78605Df79524164911C144801f41e9811B7DB73D\" data-v-f87c67ca=\"\">$2 billion<\/a>.","Mantle’s governance proposal <a href=\"https:\/\/snapshot.org\/#\/bitdao.eth\/proposal\/0x26884fce58b66e82fa74735a2e255f76654618278432897f4ca2430702e95dcd\" data-v-f87c67ca=\"\">MIP-26<\/a> — approved by the Mantle community in September — provided seed liquidity for a combined allowance of up to 60 million RWA-yield-backed USD stablecoins, 30,000 ether ($56 million) and 20 million <a href=\"https:\/\/www.theblock.co\/price\/248383\/mantle-mnt\" data-v-f87c67ca=\"\">MNT<\/a> ($8.2 million), with significant liquidity now set to be deployed to Mantle DEXs for USDY and mUSD.","Beyond accessibility, potential use cases for the tokens in the Mantle ecosystem include collateral for derivatives and lending protocols, yield-bearing stablecoins in DEXs to enhance the economic incentives of liquidity provision, payments and settlement, the team said.&nbsp;","“RWA on blockchain has emerged as one of the use cases with the greatest potential to bring significant benefits for users thanks to its ability to supply sustainable native yield,\" it added. \"Mantle’s foray into RWA is executed with a focus to bring the best product experience to its community, having conducted careful research and significant due diligence.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Nathan Allman","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"” Mantle Chief Alchemist Jordi Alexander","content":"ORGANIZATION"},{"type":"26","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Mantle Network","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"$1","content":"MONEY"},{"type":"FusionX Finance","content":"ORGANIZATION"},{"type":"Agni Finance","content":"ORGANIZATION"},{"type":"Steakhouse Financial Dune Analytics","content":"ORGANIZATION"},{"type":"Mantle","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"$8.2 million","content":"MONEY"},{"type":"$56 million","content":"MONEY"},{"type":"Ondo Finance","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"},{"type":"USDY","content":"ORGANIZATION"}],"hashtag":["DEXS","ETHEREUM"],"authors":["James Hunt","The Block"]}