{"summary":"More staff are leaving the Securities and Exchange Commission than at any point in the last 10 years, according to an annual report from the inspector general’s office.\nAttrition rates across the federal government are on the rise, as workers quit their jobs during the so-called Great Resignation.","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178394\/government-report-great-resignation-hit-sec-in-2022","publishDate":"2022-10-19T14:30:42","id":789,"type":null,"title":"Government report: ’Great resignation’ hit SEC in 2022 ","category":["The Block"],"content":["The Securities and Exchange Commission saw its highest attrition rate in a decade this year, according to an <a href=\"https:\/\/www.sec.gov\/files\/inspector-generals-statement-sec-mgmt-and-perf-challenges-october-2022.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">annual report<\/span><\/a> from the inspector general’s office.","The commission’s attrition rate jumped to 6.4% in fiscal year 2022, up from 3.8% in fiscal year 2020, according to the report. The attrition rate for senior officers was even higher — 20.8% this year — which the report deemed “most concerning.” The attrition rate for attorney positions was also relatively high at 8.4%. The numbers for fiscal year 2022 cover up to Sept. 20 of this calendar year. The federal fiscal year runs from Oct. 1 to Sept. 30.&nbsp;","“The SEC is not alone in facing a crisis to retain mission-critical talent during what has been dubbed ‘The Great Resignation,’” wrote Acting SEC Inspector General Nicholas Padilla, Jr. “Critical elements of the federal workforce are in a state of stress.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Warnings about the SEC's turnover come as part of a regular annual report from the internal watchdog on the agency's operations. The 27-page document also addresses meeting regulatory oversight responsibilities, protecting systems and data and improving contract management.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“The federal government is facing stiff competition from the private sector as increased wages and workforce engagement make private sector positions attractive to both new and seasoned professionals,” the report said.&nbsp;","The commission is not alone when it comes to staff retention, the report notes. Government-wide attrition rates are also on the rise. The average attrition rate was 6.1%, though that number is higher for women and executives. The staff moves also come amid a change in presidential administrations last year.&nbsp;","Even as turnover increases, the SEC requested 454 new positions for fiscal year 2023, bringing its total to 5,261 staff members. The agency lost approximately 289 positions in fiscal year 2022, which could pose a challenge in filling its roles for next year, according to the inspector general.","The commission could address its attrition issues by planning for succession, through employee development and via performance management, the report suggested. The SEC could also streamline its hiring process — nearly 50% of the commission’s hiring actions took 100 business days or more to complete."],"hashtag":["GARY GENSLER"]}