{"summary":"Jump Trading’s crypto arm weighed in on the FTX crisis and its impact on Jump Crypto.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/186403\/jump-crypto-says-it-remains-well-capitalized-following-ftx-downfall","publishDate":"2022-11-12T19:42:01","id":7892,"type":null,"title":"Jump Crypto says it remains &#x27;well capitalized&#x27; following FTX downfall","category":["EXCHANGES"],"content":["Jump Trading’s cryptocurrency arm said it remains \"well capitalized\" after FTX and Alameda Research filed for Chapter 11 bankruptcy protection earlier this week.","On Saturday afternoon, Jump Crypto <a href=\"https:\/\/twitter.com\/jump_\/status\/1591545851603988481?s=20&amp;t=chTURKdTntuNR-0xw0GjZw\" data-v-f87c67ca=\"\">tweeted,<\/a>&nbsp;\"We, like all of you, were shocked by the events that unfolded over the past week. Jump's exposure to FTX was managed in accordance with our risk framework and we remain well capitalized.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nJump Trading operates one of the largest high-frequency trading operations in the world; its crypto arm Jump Crypto focuses on infrastructure and crypto venture investments.","\"This is a massive blow to the industry, but we continue to believe in this space and work alongside others building towards its future,\" Jump said in a follow-up tweet. Its total exposure, potential losses and capitalization amount remain unknown.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"Jump Crypto","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"afternoon","content":"TIME"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}