{"summary":"With the partnership, Com2uS is planning to launch two Web3 games in Japan that are based on globally popular IPs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277103\/com2us-partners-oasys-blockchain-for-japan-expansion","publishDate":"2024-02-12T19:00:03","id":7893,"type":null,"title":"South Korean firm Com2uS to develop web3 games on Oasys blockchain","category":["COMPANIES"],"content":["South Korean game publisher Com2uS announced its collaboration with the Oasys blockchain project on Monday.","The partnership is expected to enhance the game company’s web3 gaming infrastructure for its expansion into the Japanese market.","Oasys is a game-centric blockchain network that has previously worked with SoftBank, Sega, and Ubisoft. The network's core team will offer technical support to Com2uS and its blockchain subsidiary XPLA to establish a new layer 2 network in compliance with local regulations in Japan.","“In partnership with Oasys, XPLA will make a significant move into the world’s third largest gaming market, Japan,” said XPLA Team Lead Paul Kim, who added that Com2uS plans to launch two Web3 games in Japan based on “globally recognized” IPs within the first half of 2024.","With the collaboration, the Seoul-based game developer is also expected to onboard its staple game franchises onto the Oasys network, including ‘Summoners War: Chronicle’ and ‘The Walking Dead: All Stars.’","Com2uS, founded in 1998, has over 605 billion Korean won ($454 million) in market capitalization as of Monday in Asia.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Sega","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SoftBank","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Japan","content":"LOCATION"},{"type":"1998","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Oasys","content":"ORGANIZATION"},{"type":"Ubisoft","content":"ORGANIZATION"},{"type":"$454 million","content":"MONEY"},{"type":"within the first half of 2024","content":"DATE"},{"type":"Paul Kim","content":"PERSON"},{"type":"Seoul","content":"LOCATION"}],"hashtag":["ASIA","GAME"],"authors":["Danny Park","The Block"]}