{"summary":"CoinFLEX - the world’s first physically delivered cryptocurrency futures exchange - announced the launch of AMM+, an automated market making product for passive capital investors and traders. The highly dynamic and customizable AMM+ product allows passive liquidity providers (LPs) to compete with professional traders, and offers users an opportunity to earn even higher returns than those found on traditional DeFi platforms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/105979\/coinflex-launches-amm-announces-us-derivatives-access","publishDate":"2021-06-01T08:59:26","id":7894,"type":null,"title":"CoinFLEX Launches AMM+ &amp; Announces US Derivatives Access","category":["SPONSORED"],"content":["<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Bridges the gap Between DeFi and CeFi by offering Automated Market Making platform (AMM+) for passive capital investors and traders<\/em><\/strong>","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Plans to give US residents access to 100x leveraged derivatives trading through decentralized custody and physical delivery&nbsp; <\/em><\/strong>","<strong data-v-f87c67ca=\"\">[SEYCHELLES] – May 31, 2021 – <\/strong>CoinFLEX – the world’s first physically delivered cryptocurrency futures exchange – announced the launch of AMM+, an automated market making product for passive capital investors and traders. The highly dynamic and customizable AMM+ product allows passive liquidity providers (LPs) to compete with professional traders, and offers users an opportunity to earn even higher returns than those found on traditional DeFi platforms.","On the CoinFLEX AMM+, traders have the option to use leverage and benefit from significantly cheaper taker fees in comparison to other platforms. The exchange also offers more scalable orderbook trade volumes, as it bypasses the high gas fees on Ethereum and is not exposed to the risks of onchain front-running.","CoinFLEX has also started the technology rollout to merge the best-in-class of DeFi and CeFi by decentralizing the custody side of the platform while still using the highly efficient and scalable CeFi matching engines on the order books. Decentralized custody ensures that CoinFLEX is only a single signer in an “n of m” multisig structure. This is achieved by using zero-proof knowledge via SGXs (software guard extensions) that enable multiple distributed nodes to act as verifiers and signers on funds transfers.","“The creation of the AMM+ product is a direct response to market demand for fair, transparent, and flexible trading for all market participants and not just high-frequency firms,” said Mark Lamb, Chief Executive Officer of CoinFLEX. “The success of DeFi swap pools has shown us the demand for this product. CoinFLEX’s deliverable perpetual futures give passive capital traders access to highly liquid, leveraged derivatives with the option to choose delivery of the assets. AMM+ will become a new yield generation tool for investors.”","He continued: “By decentralizing the custody side, we are mitigating concerns of customers on all centralized exchanges, which are about counterparty risk from a safety or seizure of funds perspective. Combining this with physical delivery under the CFTC’s 28-day rule allows us to give US residents the first opportunity to directly access leveraged derivatives trading. The US has been mostly ignored as a market in derivatives trading, and is extremely underserviced in crypto derivatives today.”","<strong data-v-f87c67ca=\"\">About CoinFLEX<\/strong>","Launched in early 2019 by Mark Lamb and Sudhu Arumugam, CoinFLEX caters to individual traders as well as the commercial hedging market, which includes mining firms, OTC trading desks and global proprietary trading firms. CoinFLEX was the first to launch centralized repo trading – which has traded almost $5bn since inception – and flexUSD, the first interest bearing stablecoin. Over $100m flexUSD has been minted since launch. The platform has traded hundreds of millions of contracts per day over the last twelve months, and its’ success has led to widespread investor support totaling over $10 million in funding from Polychain Capital, Digital Currency Group, Dragonfly Capital, B2C2 and Grapefruit Trading.&nbsp;","Prospective traders &amp; investors can access CoinFLEX by registering online at <a href=\"https:\/\/coinflex.com\/\" data-v-f87c67ca=\"\">https:\/\/coinflex.com\/<\/a>.&nbsp;","CoinFLEX AMM+:<a href=\"https:\/\/coinflex.com\/amm\" data-v-f87c67ca=\"\"> https:\/\/coinflex.com\/amm<\/a>","<strong data-v-f87c67ca=\"\">Media Contact<\/strong>","<a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"e19193849292a1828e888f878d8499cf828e8c\">[email&nbsp;protected]<\/a>"],"entity":[{"type":"SEYCHELLES","content":"LOCATION"},{"type":"Sudhu Arumugam","content":"PERSON"},{"type":"May 31, 2021","content":"DATE"},{"type":"Mark Lamb","content":"ORGANIZATION"},{"type":"$5bn","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Mark Lamb","content":"PERSON"},{"type":"$100m","content":"MONEY"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"Dragonfly Capital","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}