{"summary":"The chairman of the Subcommittee on Investor Protection and Capital Markets is the latest to join calls for crypto regulation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/186538\/rep-brad-sherman-asks-for-increased-regulation-calls-out-billionaire-crypto-bros","publishDate":"2022-11-13T13:53:08","id":7896,"type":null,"title":"Rep. Brad Sherman asks for increased regulation, calls out &#x27;billionaire crypto bros&#x27;","category":["REGULATION"],"content":["Congressman Brad Sherman, D-Calif., is the latest politician to call for <a href=\"https:\/\/www.theblock.co\/post\/185575\/white-house-is-monitoring-ftx-implosion-calls-for-more-crypto-regulation\" data-v-f87c67ca=\"\">increased regulation<\/a> of the cryptocurrency market in the wake of FTX's multibillion-dollar downfall.","\"The sudden collapse this week of one of the largest cryptocurrency firms in the world has been a dramatic demonstration of both the inherent risks of digital assets and the critical weaknesses in the industry that has grown up around them,\" Sherman said.","FTX, one of the world's largest crypto exchanges, <a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">filed for Chapter 11 bankruptcy protection<\/a> Friday. The firm is also <a href=\"https:\/\/www.theblock.co\/post\/185750\/ftx-faces-sec-and-cftc-investigation-bloomberg\" data-v-f87c67ca=\"\">facing an investigation<\/a> by the U.S. Securities and Exchange Commission (SEC) and Commodity Futures Trading Commission (CFTC) into its mismanagement of customer funds and relationships with FTX.US and Alameda Research.","Sherman, who is chairman of the Subcommittee on Investor Protection and Capital Markets, said he supports \"the efforts of U.S. regulators and law enforcement to investigate this situation and make sure those responsible are held accountable.\"","Sherman has advocated for Congress and federal regulators to take an \"aggressive approach\" in confronting any societal threats posed by cryptocurrencies and plans to examine options for federal legislation in the coming weeks.","“To date, efforts by billionaire crypto bros to deter meaningful legislation by flooding Washington with millions of dollars in campaign contributions and lobbying spending have been effective,\" Sherman said.","He pointed out the attention given to now-former FTX CEO Sam Bankman-Fried’s political donations to Democrats, as well as Ryan Salame, the co-CEO of Bahamas-based FTX Digital Markets, who has donated over $23 million to Republican candidates and campaign groups in 2022.","\"When you examine FTX efforts to influence Washington, you have to look at both CEOs, not just the eccentric guy wearing the shorts,\" Sherman concluded.","Amid questions about his whereabouts following news of the <a href=\"https:\/\/www.theblock.co\/post\/186175\/criminal-charges-against-sbf-on-the-table-after-ftxs-epic-collapse\" data-v-f87c67ca=\"\">SEC and DOJ investigations<\/a>, Bankman-Fried <a href=\"https:\/\/www.reuters.com\/technology\/ftx-founder-bankman-fried-says-he-is-bahamas-2022-11-12\/\" data-v-f87c67ca=\"\">told Reuters<\/a> on Saturday he was in the Bahamas. One <a href=\"https:\/\/cointelegraph.com\/news\/sam-bankman-fried-is-under-supervision-in-bahamas-looking-to-flee-to-dubai\" data-v-f87c67ca=\"\">report<\/a> says Bankman-Fried and two former FTX associates are&nbsp; “under supervision” by Bahamian authorities.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Subcommittee on Investor Protection and Capital Markets","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$23 million","content":"MONEY"},{"type":"millions of dollars","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"},{"type":"Brad Sherman","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"Ryan Salame","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Calif.","content":"LOCATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Sherman","content":"PERSON"},{"type":"FTX Digital Markets","content":"ORGANIZATION"}],"hashtag":["CONGRESS"],"authors":["Jason Shubnell","The Block"]}