{"summary":"Ripple CEO Brad Garlinghouse was one of the richest people on earth back in January when his company’s cryptocurrency, XRP, was trading as high as $3.36","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248\/ripple-ask-me-anything-but-i-may-tell-you-nothing","publishDate":"2018-08-24T17:04:00","id":7897,"type":null,"title":"Ripple: Ask me anything, but I may tell you nothing","category":["RIPPLE"],"content":["Ripple CEO Brad Garlinghouse was&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.forbes.com\/sites\/laurashin\/2018\/01\/02\/meet-the-crypto-billionaires-getting-rich-from-ripples-xrp\/#3427234c3289\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.forbes.com\/sites\/laurashin\/2018\/01\/02\/meet-the-crypto-billionaires-getting-rich-from-ripples-xrp\/#3427234c3289\" data-v-f87c67ca=\"\">one of the richest people on earth back in January<\/a>&nbsp;when his company’s cryptocurrency, XRP, was trading as high as $3.36 per token. Like many cryptos, XRP has been hit hard in 2018, though, now trading around 10% of that high. Still don’t cry for Garlinghouse. Based on those January estimates he might still be in the&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.youtube.com\/watch?v=xzMUrB-Um1Y\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.youtube.com\/watch?v=xzMUrB-Um1Y\" data-v-f87c67ca=\"\">three comma club<\/a>&nbsp;and he’s most certainly still CEO of Ripple.","These days, instead of counting his riches, that top job means he’s focused on getting financial institutions to support his company’s technology to move money — ideally replacing the SWIFT system, which links more than 11,000 banks in 200 countries. But banks were skeptical of using XRP, the company’s cryptocurrency, to move money and while&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.bloomberg.com\/news\/articles\/2018-01-25\/ripple-wants-xrp-to-be-bitcoin-for-banks-if-only-the-banks-wanted-it\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.bloomberg.com\/news\/articles\/2018-01-25\/ripple-wants-xrp-to-be-bitcoin-for-banks-if-only-the-banks-wanted-it\" data-v-f87c67ca=\"\">some have tested<\/a>&nbsp;“RippleNet” as a SWIFT replacement \/ complement, XRP has less traction. (That could change later this year if the xRapid system leaves the beta test stage and is used for cross-border transfers.)","While the company’s success in breaking into the stolid banking industry remains worth watching, most of the short-term story has been around XRP and it’s unusual characteristics. First,&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.businessinsider.com\/ripple-link-xrp-explained-2018-3\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.businessinsider.com\/ripple-link-xrp-explained-2018-3\" data-v-f87c67ca=\"\">Ripple owns about 60%<\/a>&nbsp;of all the XRP in the world. Second, that equals around 60&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">billion<\/em>&nbsp;tokens. Third, even with XRP trading at a fraction of all-time highs the total value of Ripple’s XRP is approaching $20 billion. Fourth, the company periodically sells some XRP to fund itself and also build its war chest.","The controversy surrounding all that XRP led Ripple to place most of it in escrow, but each quarter it can sell some tokens. And despite the drop in value, Ripple did just that in Q2 of this year. Those tokens were worth&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/ripple.com\/insights\/q2-2018-xrp-markets-report\/\" target=\"_blank\" rel=\"noopener nofollow noopener\" data-href=\"https:\/\/ripple.com\/insights\/q2-2018-xrp-markets-report\/\" data-v-f87c67ca=\"\">$73.5 million<\/a>&nbsp;and the proceeds go straight to the company. If you’re new to this, it’s almost what it sounds:&nbsp;<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"56f89f949263 anon\" data-v-f87c67ca=\"\">Ripple owns a printing press for money. Because they sell the XRP in the open market, without coercion, to what by all accounts are willing buyers&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">this is all legal.<\/em><\/span>","But that doesn’t mean everything is copacetic. The idea that a company can generate tens of millions in cash each quarter by parceling out its own “currency” is unsettling at best and terrifying at worst. When Ripple was trading north of $3 per token, the company had around $200 billion in potential resources sloshing about. It’s fair to note that the&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">market<\/em>&nbsp;was setting the price and therefore the value but it’s equally reasonable to point out that XRP is essentially an invention of a six year old company, isn’t particularly useful at this point, and is pretty much under the control of its creator.","Two days ago,&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.youtube.com\/watch?v=axi1_VwFRRc\" target=\"_blank\" rel=\"noopener nofollow\" data-href=\"https:\/\/www.youtube.com\/watch?v=axi1_VwFRRc\" data-v-f87c67ca=\"\">Garlinghouse participated in an “Ask Me Anything”<\/a>conversation with former&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Bloomberg<\/em>&nbsp;journalist Cory Johnson as the host \/ guy who filtered the questions. Johnson no longer works as a journalist but instead now serves as Ripple’s own Chief Market Strategist so it should come as little surprise he ran the AMA to avoid any of the controversial issues surrounding the company.&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">BitcoinExchangeGuide<\/em>&nbsp;did a nice job of highlighting some of Garlinghouse’s answers to questions and to say it&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/bitcoinexchangeguide.com\/ripple-ceo-brad-garlinghouse-ama-2018-crypto-market-ice-and-decentralization-recap\/\" target=\"_blank\" rel=\"noopener nofollow\" data-href=\"https:\/\/bitcoinexchangeguide.com\/ripple-ceo-brad-garlinghouse-ama-2018-crypto-market-ice-and-decentralization-recap\/\" data-v-f87c67ca=\"\">reads like corporate PR<\/a>&nbsp;is hardly a stretch.","When we at The Block heard this event was going to happen, we hypothesized a really fun version of the conversation:","<em data-v-f87c67ca=\"\">JOHNSON: So the company can print money almost at will, isn’t that a bad thing?<\/em>","<em data-v-f87c67ca=\"\">GARLINGHOUSE: Let’s be honest <\/em>Cory,<em data-v-f87c67ca=\"\"> if you had a legal way to just conjure money, wouldn’t you use it too? I mean c’mon!<\/em>","Alas, that moment never occurred and Johnson even admitted during the AMA that “some of the questions were really mean” and glossed over them. They did, however, find time to talk about Garlinghouse’s socks! (See 19:05 or so in the&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.youtube.com\/watch?v=axi1_VwFRRc\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.youtube.com\/watch?v=axi1_VwFRRc\" data-v-f87c67ca=\"\">video of the AMA<\/a>)","What that meant was the most insightful moment came when Garlinghouse highlighted another piece of corporate PR, this time from Ripple CTO David Schwartz. Titled “<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/ripple.com\/insights\/the-inherently-decentralized-nature-of-xrp-ledger\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/ripple.com\/insights\/the-inherently-decentralized-nature-of-xrp-ledger\/\" data-v-f87c67ca=\"\">The Inherently Decentralized Nature of XRP Ledger<\/a>” it attempts to demonstrate that XRP isn’t controlled by Ripple. Schwartz argued that despite being the “gold standard” for decentralization both bitcoin and Ethereum actually have far more concentrated control than XRP does.","But this claim has little meaning, even if it correctly notes that a handful of mining pools do have a lot of power over bitcoin. Note that a CTO for bitcoin couldn’t respond to Schwartz because — of course — there is no “Bitcoin Inc.” Ripple argues that control of the XRP Ledger requires 80% of the so-called “validators” on the network to support the change over a two-week span.","Because Ripple controls just 10 of the 150 validators, the claim goes, it has no special control over XRP and can’t effect changes to the network without support. But is that really true?&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/developers.ripple.com\/run-rippled-as-a-validator.html\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/developers.ripple.com\/run-rippled-as-a-validator.html\" data-v-f87c67ca=\"\">Here’s how you can become a validator<\/a>&nbsp;on the XRP Ledger. Now, you have to earn trust of other validators but the process for doing that is mostly by&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/ripple.com\/dev-blog\/validator-registry\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/ripple.com\/dev-blog\/validator-registry\/\" data-v-f87c67ca=\"\">being recognizable and performing well<\/a>. Given Ripple’s nearly unlimited resources and credibility as an XRP validator, it could surely rapidly roll out additional validators. At first, perhaps just a few to not raise too much suspicion: “We need more performance in certain regions as we expand xRapid, so Ripple is adding validators in 14 countries today.” With cloud computing so readily accessible, it wouldn’t take much to make this happen.","By then quietly doubling that footprint, Ripple could nearly overnight have enough validators to start validating its own adds to the network without any support. Or it could win over other validators, say, by providing a bounty in XRP — or US dollars for that matter.","The design in place&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">seems<\/em>&nbsp;to turn over control of the XRP Ledger to the community, but Ripple is somewhat uniquely equipped to seize control of the network anytime it sees fit. That’s a much harder feat to perform with bitcoin, if for no other reason than the high compute power require. Schwartz highlights that as a “bug” of bitcoin though it’s arguably a feature: “Those using XRP and the XRP Ledger are able to make progress without mining, saving&nbsp;<a class=\"markup--anchor markup--blockquote-anchor\" href=\"https:\/\/arstechnica.com\/tech-policy\/2018\/05\/new-study-quantifies-bitcoins-ludicrous-energy-consumption\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/arstechnica.com\/tech-policy\/2018\/05\/new-study-quantifies-bitcoins-ludicrous-energy-consumption\/\" data-v-f87c67ca=\"\">significant compute power and time<\/a>.”","But even he admits that Ripple has disproportionate influence over the validation process — even without the obvious manipulation method proposed above: Users on the XRP Ledger select a Unique Node List (UNL), a list of validators trusted by that user to order transactions… The network has a number of recommended UNLs,&nbsp;<strong class=\"markup--strong markup--blockquote-strong\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--blockquote-em\" data-v-f87c67ca=\"\">including one list Ripple recommends<\/em><\/strong>, and users can choose whichever one they prefer or create their own.","So basically there’s a central authority that tells you who to trust. You can trust others instead of it, but why would anyone?","Schwartz goes further: \"Nevertheless, to increase the resiliency and diversity of the network, more than half of the validators on Ripple’s recommended UNL are operated by people or groups external to the company, and Ripple continues to add even more independent validators to the list.\"","So there’s a list of validators that Ripple trusts, but don’t confuse this with all the validators out there apparently (again, Ripple runs 10 of 150 it says, but here it recommends just “more than half” externally — presumably nowhere near the other 140). Fundamentally, belief that Ripple won’t manipulate its own list to favor its own validators is a belief that the company likes enough of what’s going on to leave it all be.","But, again, let’s look back to January and the $200 billion of XRP the company once held. Even though the money printing press still works for Ripple, its output is a lot lower at today’s prices. And while it’s pointless speculation to guess where the price of Ripple will go from here, it’s certainly possible the tokens will again be so valuable that Ripple can’t risk XRP control falling into unfriendly hands.","After all, if you had a machine that could print money, wouldn’t you go to almost any length to protect it? We’ll try to submit a question like that to the next Ripple AMA. Maybe they won’t find it too “mean” and give us a straight answer.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"$200 billion","content":"MONEY"},{"type":"60%","content":"PERCENT"},{"type":"Brad Garlinghouse","content":"PERSON"},{"type":"$73.5 million","content":"MONEY"},{"type":"$3","content":"MONEY"},{"type":"AMA","content":"ORGANIZATION"},{"type":"$20 billion","content":"MONEY"},{"type":"UNL","content":"ORGANIZATION"},{"type":"Schwartz","content":"PERSON"},{"type":"Bitcoin Inc.","content":"ORGANIZATION"},{"type":"David Schwartz","content":"PERSON"},{"type":"XRP","content":"ORGANIZATION"},{"type":"Cory Johnson","content":"PERSON"},{"type":"Cory","content":"PERSON"},{"type":"Ripple AMA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Garlinghouse","content":"PERSON"},{"type":"Johnson","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$3.36","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"CTO","content":"ORGANIZATION"}],"hashtag":["XRP"],"authors":["John Biggs","The Block"]}