{"summary":"The CFPB has set its sights on crypto-focused gaming in its report warning of scams among video games and virtual worlds. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286732\/cfpb-report-calls-out-crypto-warns-of-financial-risks-in-video-games-and-virtual-worlds","publishDate":"2024-04-05T13:25:37","id":79,"type":null,"title":"CFPB report calls out crypto, warns of financial risks in video games and virtual worlds","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Consumer Financial Protection Bureau has set its sights on crypto-focused gaming in its report warning of scams and reduced consumer protections in video games and virtual worlds.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Crypto may have a smaller sliver in the realm of virtual gaming worlds, but interest is growing among gaming creators for taking virtual items into the real world, the CFPB said in a <a href=\"https:\/\/www.consumerfinance.gov\/data-research\/research-reports\/issue-spotlight-video-games\/#1\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">report<\/span><\/a> titled \"Banking in Video Games and Virtual Worlds,\" released on Thursday. The report mainly was focused on virtual games in general.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"While these crypto-asset virtual worlds are significantly less popular than virtual gaming worlds like Roblox, Second Life, or Fortnite, they are important to note because of the prevalence of third-party crypto-asset trading platforms, users can convert a virtual world’s native crypto-asset to fiat currency, making them even more porous than typical gaming markets,\" the agency said. \"Notably, some of the largest virtual gaming world publishers have expressed growing interest in positioning their virtual items as crypto-assets that have the ability to be traded outside of the game’s economy.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Crypto assets within worlds such as Decentraland and The Sandbox can be traded on other crypto platforms for the dollar, the agency added.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The CFPB has honed in a bit on crypto and recently proposed a rule called the <\/span><span class=\"s3\" data-v-f87c67ca=\"\">\"Defining Larger Participants of a Market for General-Use Digital Consumer Payment Applications,\" that would give the agency the ability to supervise \"larger nonbank companies\" that offer services like digital wallets and payment apps and would require nonbank financial companies handling more than five million transactions a year to follow the same rules as large banks and credit unions.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The 62-page rule mentions crypto a handful of times. Some <a href=\"https:\/\/www.theblock.co\/post\/282299\/house-panel-spars-over-whether-crypto-should-be-a-part-of-a-proposed-cfpb-rule\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">critics<\/span><\/a> have argued that the rule \"inappropriately claims jurisdiction over crypto.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Reports like the one posted on Thursday by the CFPB can be a \"precursor to rulemakings,\" said Alexander Grieve, government affairs lead at Paradigm, in a <a href=\"https:\/\/twitter.com\/AlexanderGrieve\/status\/1776214028370530462\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">post<\/span><\/a> on X. <\/span><span class=\"s5\" data-v-f87c67ca=\"\">\"The <\/span><span class=\"s1\" data-v-f87c67ca=\"\">@CFPB<\/span><span class=\"s5\" data-v-f87c67ca=\"\">, like seemingly every federal agency, is trying to find their regulatory nexus to crypto. This could be one—especially if\/when their Larger Participants wallet rule gets cut back.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The CFPB said online video games and virtual worlds are increasingly resembling more traditional banking without the protections consumers might expect under federal law.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The agency said it has received consumer complaints about hacking attempts, stealing accounts, and losing access to assets within the games. According to the report, consumers say they don't receive much support from gaming companies in those situations.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Americans of all ages are converting billions of dollars into currencies used on virtual reality and gaming platforms,” said CFPB Director Rohit Chopra in a <a href=\"https:\/\/www.consumerfinance.gov\/about-us\/newsroom\/cfpb-report-identifies-financial-and-privacy-risks-to-consumers-in-video-gaming-marketplaces\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">statement<\/span><\/a>. “As more banking and payments activity takes place in video games and virtual worlds, the CFPB is looking at ways to protect consumers from fraud and scams.”<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Alexander Grieve","content":"PERSON"},{"type":"Rohit Chopra","content":"PERSON"},{"type":"CFPB","content":"ORGANIZATION"},{"type":"Decentraland","content":"LOCATION"},{"type":"Second Life","content":"ORGANIZATION"},{"type":"General","content":"ORGANIZATION"},{"type":"Consumer Financial Protection Bureau","content":"ORGANIZATION"}],"hashtag":["GAME"],"authors":["Sarah Wynn","The Block"]}