{"summary":"The Maker Foundation has outlined its framework for a self-sustainable DAO, with MakerDAO founder, Rune Christensen, suggesting that the foundation will start dissolving two years from now\nThe new framework features elected paid contributors and domain teams, Maker Improvement Proposals, and vote delegates\nThe foundation will release an initial set of 13 Maker Improvement Proposals next Monday to cover the core governance structure and the collateral onboarding process","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/60702\/maker-foundation-reveals-its-design-for-a-self-governing-dao-to-replace-its-role-in-the-ecosystem","publishDate":"2020-04-02T15:33:01","id":79,"type":null,"title":"Maker Foundation reveals its design for a self-governing DAO to replace its role in the ecosystem","category":["Layer 1s"],"content":["<span data-v-f87c67ca=\"\">The Maker Foundation has revealed its plan to start transferring its governance power to the community in the next two years and is set to release an initial draft of the new community-based governance paradigm next Monday.<\/span>","<span data-v-f87c67ca=\"\">During Thursday’s Governance &amp; Risk meeting, MakerDao founder Rune Christensen outlined the foundation’s envisioned framework for a self-sustaining DAO. <\/span>","<span data-v-f87c67ca=\"\">According to Christensen, the ecosystem’s current reliance on the foundation is not sustainable in the long term. <\/span><span data-v-f87c67ca=\"\">In light of Maker's troubles on Black Thursday — where a 5.3 million DAI system deficit emerged after a series of collateral liquidation mishaps — Christensen believes the foundation needs to accelerate its dissolution and start transferring its risk management capacity to the community.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The proposed framework contains three key elements: elected paid contributors and domain teams, Maker Improvement Proposals, and vote delegates. <\/span>","<span data-v-f87c67ca=\"\">To kick start the process, the Maker Foundation has drafted an initial set of proposals outlining the core governance structure and the collateral onboarding process, a draft of which will be released on April 6. The community can then proceed to vote on them, offer new inputs, or propose alternative processes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It could take years before the Maker Foundation completely dissolves, Christensen said. Before that, the foundation will facilitate and oversee the governance design and knowledge transfer process to ensure that its eventual dissolution will not have a negative impact on the system’s performance.<\/span>","<span data-v-f87c67ca=\"\">The new, community-based governance system will feature elected paid contributors (EPCs) and domain teams. They will function as the ecosystem’s “public servants,” offering expertise ranging from security maintenance to the protocol’s long-run development. A protocol will be in place to elect and pay them.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Domain teams, as a subset of EPCs, will hold special authority over certain processes depending on their specialty. For instance, the risk team will have authority over the risk management process and will offer sanity checks for relevant proposals before the community votes on them.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While risk management constitutes the most crucial work, Christensen said, there could be a wide range of work delegated to EPCs including marketing, human resources, and legal research. But the community would have to decide the exact structure and responsibilities of EPCs later on through formal proposals.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Christensen also added that it is crucial to first transfer the foundation’s technical knowledge to the EPCs before the former can safely dissolve.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Following the design of many other decentralized communities, the Maker Foundation proposed using Maker Improvement Proposals (MIPs) as a formal process to decide and revise the system’s governance paradigm. These MIPs will dictate the system’s day-to-day operation from overall governance design to engineering.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">MIPs will be especially important in the short run, Christensen said, since the community needs to agree upon the initial design of all processes. With risk management, for example, relevant MIPs will first need to be put in place before the responsible domain team can come in and build the risk construct.<\/span>","<span data-v-f87c67ca=\"\">As a starting point, the Maker Foundation will publish an initial set of 13 MIPs for the community to review. These MIPs, set to be published on April 6, will cover the overall core governance framework as well as the collateral onboarding process.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Speaking to the potential politicization of the proposal-making process, which, within the context of ProgPow, has emerged as a problem within the Ethereum community, Christensen contended that politicization is inevitable and the community has to use the system’s “check-and-balances” to deter polarizing behaviors.<\/span>","<span data-v-f87c67ca=\"\">“If Maker becomes a global actor, it is unavoidable that there will be a lot of political proxy wars of public figures fighting against each other for influence,” he said. “That dynamic is always gonna happen. We just need a system that is resilient enough to deal with these non-optimal behaviors.”<\/span>","<span data-v-f87c67ca=\"\">According to Christensen, the main difference between MIPs and other processes like Ethereum Improvement Proposals (EIPs) or Bitcoin Improvement Proposal (BIPs) lies in the former’s emphasis on organization and structure. While EIPs and BIPs almost exclusively focus on technical implementation, MIPs’ main purpose is to standardize governance processes. This early emphasis on governance, he said, could also mitigate the politicization problem and allow the community to bootstrap a constructive political climate from the start.<\/span>","<span data-v-f87c67ca=\"\">“With EIPs, where politicization is an issue, the governance aspect wasn’t considered at the very beginning,” said Christensen. “With Maker, governance is the defining concept from this very moment.”<\/span>","<span data-v-f87c67ca=\"\">While the EPCs are the “public servants” in the new system, vote delegates will act as the “politicians” making decisions on behalf of community members who have delegated their MKR to them.<\/span>","<span data-v-f87c67ca=\"\">Vote delegates can be self-identified and chosen independently by voters. According to Christensen, their roles are crucial to making sure that the community can effectively keep MIPs and EPCs in check.<\/span>","<span data-v-f87c67ca=\"\">“Vote delegates serve as a bridge between voting and public discussion, ultimately bringing governance to a healthy state where decisions are made based on publicly available reasoning,” he said in the presentation. <\/span>"],"hashtag":["DAI"]}