{"summary":"Upstart NFT marketplace x2y2 has launched an airdrop to attract users from OpenSea — following in LooksRare’s path.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/134450\/another-nft-marketplace-x2y2-begins-vampire-attack-on-opensea","publishDate":"2022-02-16T11:03:06","id":7906,"type":null,"title":"Another NFT marketplace, x2y2, begins vampire attack on OpenSea","category":["NFTS"],"content":["NFT marketplace x2y2 has launched a vampire attack on the market leader OpenSea, airdropping millions of tokens to its user base. It follows in the footsteps of <a href=\"https:\/\/www.theblockcrypto.com\/news+\/132031\/why-two-nft-nerds-built-looksrare-and-where-they-want-to-take-it-next\" data-v-f87c67ca=\"\">LooksRare<\/a>, which did a <a href=\"https:\/\/www.theblockcrypto.com\/post\/129677\/nft-marketplace-looksrare-goes-live-with-vampire-attack-on-opensea\" data-v-f87c67ca=\"\">similar launch<\/a> last month, but has a different strategy that it hopes won't end up resulting in persistent wash trading.","A vampire attack is where a project hands out tokens to users of a pre-existing blockchain project. The goal is to incentivize the target audience of a similar project to try out the new project and elect to use it instead, particularly if it continues to hand out rewards on an ongoing basis.","To initiate the vampire attack, x2y2 is carrying out an airdrop for OpenSea users. The project is handing out 120 million tokens, 12% of the total supply of X2Y2 (the project’s native token).","The airdrop has, however, hit a few roadblocks. On Wednesday, x2y2 paused the airdrop due to complaints about difficulties experienced while claiming the tokens. The team has <a href=\"https:\/\/twitter.com\/the_x2y2\/status\/1493898383471300612\" data-v-f87c67ca=\"\">promised<\/a> to resume the airdrop within the next 48 hours. Before the process was halted, just 7% of the 120 million airdropped tokens had been claimed.","There have also been some alarms raised over potentially problematic sections of the airdrop claiming contract. Some observers <a href=\"https:\/\/twitter.com\/YannickCrypto\/status\/1493780252635525121\" data-v-f87c67ca=\"\">say<\/a> that approving the airdrop claim could leave users’ wallets vulnerable to having their NFTs stolen.","In response, the x2y2 team provided proof that it had sorted out the issue by revoking its ability to drain user wallets. According to the <a href=\"https:\/\/etherscan.io\/tx\/0x6453205f4269f0919ce45234f0b93d8ee2158e5ebe9bc22a1fad9655909a2bee\" data-v-f87c67ca=\"\">Etherscan link<\/a> provided by the team, it also transferred ownership of the contract to a multisig wallet stored on Gnosis Safe to reduce further risk.","According to its <a href=\"https:\/\/mirror.xyz\/x2y2.eth\/HyyViU7Ir7fW5cch0DozBD8_Qkak5FiLEi0bmx1cmgA\" data-v-f87c67ca=\"\">Litepaper<\/a> published in January, x2y2 differs from LooksRare in many ways. For one, the airdrop is for all 861,417 wallets that have traded on OpenSea before January 2022. In the LooksRare airdrop, only wallets that had traded at least 3 ETH ($9,000) on OpenSea between mid-June and mid-December 2021 were eligible for the airdrop.","Another difference highlighted by the x2y2 team was the absence of a private sale for early backers. Instead, x2y2 held an initial liquidity offering (ILO) to raise the funds needed to provide liquidity for the project on Uniswap (something that encourages a healthy market).","The project sold 15 million X2Y2 tokens to investors. These ILO tokens were divided into 1,000 shares valued at 1.5 ETH per share, thereby raising 1,500 ETH ($4.5 million) from the token sale. This means that ILO investors bought X2Y2 for $0.25 per token.","X2y2 paired the 1,500 ETH with 10 million X2Y2 tokens to create the coin’s liquidity pool on Uniswap.","In another departure from the LooksRare model, traders on x2y2 will not receive rewards connected to their trading volumes. The only rewards on the platform will come from staking X2Y2.&nbsp;","Stakers, however, will earn a portion of the trading fees from the platform. The marketplace charges 2% on all NFT trades.","By limiting rewards to staking, x2y2 says it wants to eliminate “trade mining” that leads to <a href=\"https:\/\/www.theblockcrypto.com\/news+\/132031\/why-two-nft-nerds-built-looksrare-and-where-they-want-to-take-it-next\" data-v-f87c67ca=\"\">wash trading<\/a>, as is very common on LooksRare. Because LooksRare tied rewards to trading activity, traders were incentivized to buy and sell NFTs to themselves in order to game the system —&nbsp;which is exactly what they did.","This emphasis on staking is also indicated by the fact that 650 million tokens&nbsp; — 65% of the total token supply (1 billion tokens)&nbsp; — has been earmarked for staking rewards.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/t.me\/the_block_crypto\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"January 2022","content":"DATE"},{"type":"1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"12%","content":"PERCENT"},{"type":"$4.5 million","content":"MONEY"},{"type":"ILO","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$0.25","content":"MONEY"},{"type":"$9,000","content":"MONEY"},{"type":"mid-December 2021","content":"DATE"},{"type":"Wednesday","content":"DATE"}],"hashtag":["OPENSEA"],"authors":["Osato Avan-Nomayo","The Block"]}