{"summary":"DEBT Box asked a judge to deny the SEC&#x27;s move to dismiss its case after the agency admitted inaccurate statements were made in court.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277567\/debt-box-asks-judge-to-deny-sec-move-to-dismiss-case","publishDate":"2024-02-14T15:37:22","id":7911,"type":null,"title":"DEBT Box asks judge to deny SEC move to dismiss case","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">DEBT Box asked a judge to deny the Securities and Exchange Commission's move last month to dismiss its case after the agency admitted inaccurate statements were made in court.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Digital Licensing Inc., doing business as DEBT Box, was sued by the SEC last year over an alleged fraud scheme.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The SEC wants a double standard--it wants to be treated differently before federal courts than those that it regulates or attempts to regulate,\" DEBT Box said in a filing on Wednesday. \"When an individual or entity is suspected of making materially false and misleading statements in the securities market, the SEC brings charges under the anti-fraud provisions of the federal securities laws and seeks the heaviest monetary and non-monetary sanctions that it believes it can obtain in court.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">DEBT Box's pushback comes after the SEC <a href=\"https:\/\/www.theblock.co\/post\/269087\/sec-admits-it-made-inaccurate-statements-in-utah-crypto-case\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">admitted<\/span><\/a><\/span><span class=\"s4\" data-v-f87c67ca=\"\"> in late December that it made inaccurate statements. Utah U.S. District Court Judge Robert Shelby criticized the agency's lawyers and ordered the SEC to explain \"false or misleading\" statements after it claimed the company was trying to move assets overseas in order to escape the regulator's jurisdiction.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">The SEC then said it planned to dismiss the lawsuit without prejudice last month, meaning the regulator can still refile its case.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">The SEC <a href=\"https:\/\/www.theblock.co\/post\/269087\/sec-admits-it-made-inaccurate-statements-in-utah-crypto-case\" data-v-f87c67ca=\"\"><span class=\"s6\" data-v-f87c67ca=\"\">previously<\/span><\/a> told the court that it <\/span><span class=\"s4\" data-v-f87c67ca=\"\">\"fell short\" of expectations to be accurate and candid in the court, made representations that were inaccurate, failed to correct them and \"make clear that certain representations were inferences from the facts… rather than directly supported factual assertions.\"<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">The SEC also said it took measures to correct its mistakes, such as assigning senior attorneys from the regulator's Denver Regional Office to supervise the case going forward.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Apologies from an individual or entity do little to mitigate. Promises to 're-staff' a team or to provide additional ethics training do not lead the SEC to just walk away from a case. Undoubtedly, the SEC does not permit any defendants a 'do-over' to fix their wrongdoings, consequence-free,\" DEBT Box said on Wednesday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">DEBT Box also asked that a March 7 hearing be held as planned despite the SEC asking for it to be deserted. &nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">The SEC's suit against DEBT Box alleged it defrauded thousands of investors of at least $49 million by offering customers so-called \"node licenses\" to receive revenue from mining 11 tokens.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Digital Licensing Inc.","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"$49 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Robert Shelby","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Utah U.S. District Court","content":"ORGANIZATION"},{"type":"March 7","content":"DATE"},{"type":"Denver Regional Office","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}