{"summary":"Robinhood has rolled out its cryptocurrency wallet to Android users globally, expanding access to millions of potential crypto users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283483\/robinhood-crypto-wallet-android-launch","publishDate":"2024-03-20T09:00:04","id":7912,"type":null,"title":"Robinhood rolls out crypto wallet to Android users globally","category":["COMPANIES"],"content":["Robinhood has officially rolled out its cryptocurrency wallet for Android users, expanding access to millions of potential crypto users worldwide.","The Android expansion comes a year after Robinhood Wallet was <a href=\"https:\/\/www.theblock.co\/post\/216194\/robinhood-rolls-out-wallet-to-ios-customers-globally\" data-v-f87c67ca=\"\">launched<\/a> to iOS users globally. The Android app was in beta until now, with a public waitlist open for registrations. Now with the general release, all customers who previously joined the waitlist can now download the Android wallet and get started, Robinhood said Wednesday.","The Android launch marks a \"big step forward\" in Robinhood's commitment to making crypto more accessible and integrated into daily life for millions of people worldwide, said Johann Kerbrat, general manager of Robinhood Crypto, in a statement.","Last month, Robinhood announced its fourth quarter 2023 results and said its crypto business grew. Specifically, its crypto revenue increased 10% year over year to $43 million in Q4, and its notional crypto trading volume rose 89% in Q4 compared to the previous quarter, driven by increased customer activity. Robinhood recently also <a href=\"https:\/\/www.theblock.co\/post\/266452\/robinhood-launches-crypto-trading-app-in-europe\" data-v-f87c67ca=\"\">launched<\/a> its crypto trading app in the European Union.","The self-custodial wallet was launched last year and has since been downloaded \"hundreds of thousands of times\" globally, the company said. According to the Robinhood website, the wallet supports crypto send, receive and store functions on the Ethereum, Bitcoin, Dogecoin, Arbitrum, Polygon, Optimism and Base networks. It also supports <a href=\"https:\/\/www.theblock.co\/post\/279943\/robinhood-wallet-arbitrum-token-swaps\" data-v-f87c67ca=\"\">token swaps<\/a> on Ethereum, Polygon and Arbitrum via decentralized exchange aggregators 0x API and LI.FI. Its users are not charged service fees on token swaps, although blockchain transaction fees apply.","The Android rollout is \"just the beginning\" for Robinhood Wallet, the company said, adding that it will continue to add new features based on customer feedback over the coming months.","\"We are actively working to provide Robinhood Wallet users access to cross-chain swaps via decentralized exchange aggregators soon and on-ramps that lower barriers to entry in web3,\" Seong Lee, head of product at Robinhood Crypto, told The Block in a statement. \"By working with organizations like Arbitrum, LI.FI and 0x, we will help users do even more with their crypto.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"European Union","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"Robinhood website","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"$43 million","content":"MONEY"},{"type":"Dogecoin","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"Seong Lee","content":"PERSON"},{"type":"89%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"fourth quarter 2023","content":"DATE"},{"type":"Johann Kerbrat","content":"PERSON"},{"type":"Arbitrum","content":"LOCATION"},{"type":"Robinhood Wallet","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Arbitrum","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["ROBINHOOD"],"authors":["Yogita Khatri","The Block"]}