{"summary":"Left your crypto taxes until the last second? Here’s how to get your crypto taxes done by April 18 with the least amount of friction possible. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141867\/last-minute-crypto-tax-help-is-at-hand-with-tax-tools-you-need-now","publishDate":"2022-04-14T09:00:58","id":7914,"type":null,"title":"Last Minute Crypto Tax? Help is at Hand with Tax Tools you Need Now","category":["SPONSORED"],"content":["<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Left your crypto taxes until the last second? Here’s how to get your crypto taxes done by April 18 with the least amount of friction possible.&nbsp;<\/span><\/i>","<span data-v-f87c67ca=\"\">Let’s just cut to the chase. The IRS has been really clear that cryptocurrency is definitely taxed - and that they’re able to track crypto investments through various channels.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In brief, crypto is subject to Capital Gains Tax and sometimes Income Tax. You’ll pay long-term Capital Gains Tax between 0% to 20% or you’ll pay short-term Capital Gains Tax or Income Tax between 10% to 37%, depending on your Income Tax bracket.<\/span>","<span data-v-f87c67ca=\"\">With that out of the way, let’s look at the steps you need to take to report your crypto in your tax return by April 18.<\/span>","<span data-v-f87c67ca=\"\">Getting your complete crypto transaction history if you're an active investor using multiple wallets, exchanges and blockchains is no easy feat. To do this manually, you'd need to download CSV files of your transaction history from every exchange, wallet or blockchain you use. Then you'd need to identify your transfers from your taxable transactions, identify which kind of tax you'd need to apply for each taxable transaction and calculate your subsequent capital gains or losses, as well as the fair market value of any crypto income. Quite a mouthful!<\/span>","<span data-v-f87c67ca=\"\">Fortunately, aggregating your transaction history with <\/span><a href=\"https:\/\/koinly.io\/?utm_source=theblockcrypto.com&amp;utm_medium=guestpost\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Koinly<\/span><\/a><span data-v-f87c67ca=\"\"> is simple. <\/span><span data-v-f87c67ca=\"\">Koinly has been supporting crypto investors with a fully IRS-compliant tax reporting system since day 1, so if you’re looking for a solution right now - it can be as simple as jumping onto Koinly and connecting all your wallets, exchanges and blockchains. Koinly supports more than 650 exchanges, wallets and blockchains - all you need to do is connect via API or by importing a CSV file of your transaction history. Let’s take a look at how.<\/span>","<span data-v-f87c67ca=\"\">Koinly supports all the major crypto exchanges like Binance, Coinbase, FTX, Kraken and KuCoin. To automatically get your transaction data, you can use the API. Just head into your exchange and create a read-only API key - you’ll normally find this under API management or settings. Once you’ve created your key, copy your API key and API secret and head over to Koinly. Select the exchange you want to add, then the set up auto-sync option&nbsp; and enter your API details and your transaction data with that exchange will be automatically imported into Koinly.<\/span>","<span data-v-f87c67ca=\"\">If you’d rather use CSV to import your transaction data - no worries, you can do that with Koinly too. Just download a CSV file of your transaction data from your exchange. This needs to be your complete transaction history - for however long you’ve used that exchange for - so you may need multiple CSV files. Once you’ve got your complete transaction history, select the exchange you want to add in Koinly, then the import from file option and upload your CSV file(s). Koinly will then go through your CSV file data and calculate your crypto taxes.<\/span>","<span data-v-f87c67ca=\"\">If you’re using non-custodial wallets like MetaMask, Trust Wallet, Exodus or Yoroi, Koinly supports these too. In most instances, Koinly supports these wallets via API. All you need to do is go into your wallet and find the public address. If you’re using a wallet to interact with multiple blockchains, you’ll need to grab the public address for each blockchain you interact with using that wallet. For example, if you were using Trust Wallet to interact with the BNB, ETH and BTC - you'd need your public address for each. Once you’ve got your public address, head over to Koinly, select the wallet you want to add, then set up auto-sync and then enter your public address. Again, if you’d rather use CSV file(s), you can often download these from your wallet and upload them to Koinly instead.<\/span>","<span data-v-f87c67ca=\"\">For blockchains like BTC, ETH, AVAX, ADA and many more - you can connect to Koinly using your public address or key. The steps are similar to above. Just head into the wallet (or wallets) you use to interact with your blockchain and grab your public address. Then head over to Koinly, select add a new wallet, find your blockchain and enter your public address. Koinly will then fetch your transaction history - straight from the blockchain.<\/span>","<span data-v-f87c67ca=\"\">If you ever get stuck on how to connect Koinly with a specific exchange, wallet or blockchain - don’t panic, Koinly has done the digging for you. Our integration pages feature step by step guides on how to get connected with Koinly.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Once you’ve got all your exchanges, wallets and blockchains connected with Koinly - Koinly does the hard work of converting all your crypto into the fiat currency value for you. This saves you hours of crawling through historical crypto price data on price aggregator sites.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Koinly sets the market price for your transaction in a couple of different ways. First, it'll try to determine the market price using data available from your transaction history. For example, if you bought ETH using USD on a given day, Koinly will set this as the market price.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">If you bought crypto using a different fiat currency to your base currency in Koinly, Koinly will use Forex rates for the day of your transaction to identify the market price.<\/span>","<span data-v-f87c67ca=\"\">Finally, for transactions that don't involve any fiat currency - like income or crypto to crypto trades - Koinly uses market price aggregators like CoinMarketCap or CoinGecko to identify the market price for your crypto. Koinly may also fetch market rates directly from certain exchanges if you've used the API integration method.<\/span>","<span data-v-f87c67ca=\"\">Now you’ve got everything in dollars - you can move onto calculating your crypto taxes.<\/span>","<span data-v-f87c67ca=\"\">Capital what now? If you’re new to <\/span><a href=\"https:\/\/koinly.io\/cryptocurrency-taxes\/?utm_source=theblockcrypto.com&amp;utm_medium=guestpost\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">crypto tax<\/span><\/a><span data-v-f87c67ca=\"\"> - it’s confusing, but Koinly can help by identifying your taxable transactions from your non-taxable transactions, calculating your capital gains and losses, as well as any crypto income for you.<\/span>","<span data-v-f87c67ca=\"\">For capital gains - Koinly will identify each time you’ve sold, traded or spent crypto and calculate your subsequent capital gain or loss for you. It even separates out your short-term capital gains from your long-term capital gains in your report, so you can rest easy knowing you’re not paying too much.<\/span>","<span data-v-f87c67ca=\"\">For income like mining, staking rewards and interest - Koinly identifies the fair market value of any crypto income in USD on the day you received it. This is separated out in your crypto tax report, and even broken down into the different types of income if you need to report each separately.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">DeFi is a particular challenge for investors when the tax season rolls around, but not with Koinly. Koinly supports a wide range of popular web wallets used to interact with DeFi protocols - so whether you’re providing liquidity on Uniswap or staking CAKE on PancakeSwap - Koinly can handle it. Koinly is evolving just as quickly as the DeFi market, so we’re always adding support for new tokens and protocols.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With your crypto taxes calculated, there’s one thing left to do… bring it all together in an IRS-compliant report.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However you prefer to file, Koinly has the report you need. There are three main ways to file, so let’s take a quick look at each.<\/span>","<b data-v-f87c67ca=\"\">Filing yourself<\/b>","<span data-v-f87c67ca=\"\">Though it’s probably too late to file with paper forms unless you have an extension - we’ll cover it anyway.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">You’ll need to report each disposal of crypto (any time you sold, traded or spent crypto) on Form 8949, as well as your net capital gain and loss on Schedule D. Koinly has this exact form, available to download, pre-filled with your transactions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">You’ll also need to report your crypto income on Schedule 1, generally under the ‘other income’ section - although if you’re self-employed this would go on Schedule C instead. Koinly can help with this too, download either the Complete Tax Report or Income Tax Report which will include all your crypto income totals in USD, ready to add to your forms.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Once you’ve completed your additional forms, fill out your Form 1040 and attach your Schedule D, Form 8949 and Schedule 1 (or C) and you’re done!<\/span>","<b data-v-f87c67ca=\"\">Filing with an accountant<\/b>","<span data-v-f87c67ca=\"\">Got an accountant last minute? Koinly makes their job much easier!<\/span>","<span data-v-f87c67ca=\"\">You can give your accountant access to Koinly. Just log into your Koinly account, go to settings, then team and invite your accountant, CPA or tax agent. They can then view your Koinly account and do your crypto taxes for you.<\/span>","<b data-v-f87c67ca=\"\">Filing with a tax app<\/b>","<span data-v-f87c67ca=\"\">Filing with a tax app like TurboTax or TaxAct? Koinly can generate specific reports for these tax apps too.<\/span>","<span data-v-f87c67ca=\"\">For TurboTax, just download the TurboTax Online or Desktop Report from Koinly (depending on the version of TurboTax you’re using) and then upload this to TurboTax when you’re filing your investments and savings.&nbsp; If you’ve got income, add the total income figure from your Koinly Complete Tax Report (or Income Tax Report) as miscellaneous income. Done!<\/span>","<span data-v-f87c67ca=\"\">For TaxAct,&nbsp; you'll download your Form 8949 and Schedule D from Koinly (as well as your Complete Tax Report or Income Tax Report if you have any crypto income). You can upload this to TaxAct when filing your capital gains, and you can report any crypto income as other income in TaxAct.<\/span>","<b data-v-f87c67ca=\"\">And that’s it! Another tax year done and dusted with Koinly. <\/b><a href=\"https:\/\/app.koinly.io\/signup?utm_source=theblockcrypto.com&amp;utm_medium=guestpost\" data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">Sign up<\/b><\/a><b data-v-f87c67ca=\"\"> free today.<\/b>","<span data-v-f87c67ca=\"\">Disclosures<\/span>","<span data-v-f87c67ca=\"\">This post is commissioned by Koinly. This report is for informational purposes only and should not be relied upon as a basis for investment decisions, nor is it offered or intended to be used as legal, tax, investment, financial or other advice. You should conduct your own research and consult independent counsel on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CSV","content":"ORGANIZATION"},{"type":"Koinly","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Koinly","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"TurboTax","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Coinbase","content":"LOCATION"},{"type":"TaxAct","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"8949","content":"DATE"},{"type":"IRS","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"USD","content":"LOCATION"},{"type":"April 18","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"37%","content":"PERCENT"},{"type":"D. Koinly","content":"PERSON"},{"type":"0%","content":"PERCENT"},{"type":"ADA","content":"ORGANIZATION"},{"type":"PancakeSwap","content":"ORGANIZATION"},{"type":"API","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}