{"summary":"Using the Avalanche blockchain, startup Blockticity has minted NFTs which aim to certify the authenticity of psychedelic mushrooms, hemp and kratom.\nThe plan is to authenticate a large batch of cannabis products using the same NFTs.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255041\/magic-mushrooms-hemp-and-kratom-can-now-be-certified-with-avalanche-blockchain","publishDate":"2023-10-05T14:30:16","id":792,"type":null,"title":"Magic mushrooms, hemp and kratom can now be certified with Avalanche blockchain","category":["Companies"],"content":["Thousands of certificates proving the authenticity of roughly $275 million worth of <span data-v-f87c67ca=\"\">psychedelic mushrooms, hemp and kratom have been minted as NFTs, according to a statement.<\/span>","Using the <a href=\"https:\/\/www.theblock.co\/post\/240989\/avalanche-foundation-creates-50-million-incentive-program-to-purchase-tokenized-assets\" data-v-f87c67ca=\"\">Avalanche<\/a> blockchain, goods certification startup <span data-v-f87c67ca=\"\">Blockticity said it has minted NFTs designed to certify the authenticity of products tested by ACS Laboratory, the companies said in a statement. ACS Laboratory is the largest hemp and cannabis lab in the eastern U.S., it also said.<\/span>","Kratom has been <a href=\"https:\/\/www.nytimes.com\/2023\/07\/26\/well\/mind\/kratom-health-risks.html\" data-v-f87c67ca=\"\">considered<\/a> an herbal medicine that some claim to possess opioid-like properties.","So far, <span data-v-f87c67ca=\"\">ACS Laboratory and Blockticity have minted a total of nearly 37,000 non-fungible tokens which each act as a Certificate of Analysis, or COA, for the products, the companies announced. The plan is to mint another 120,000 COAs for mostly cannabis products, they also said. <\/span>","<span data-v-f87c67ca=\"\">The process involved ACS Laboratory first testing the products and then issuing a COA. Then Blockticity created a QR code of the COA which it minted as an NFT using Avalanche's C-Chain. <\/span>","<span data-v-f87c67ca=\"\">The idea is that Blockticity's COA NFTs will make both the tracking and verifying of products' authenticity more efficient and trustworthy.<\/span>","Blockticity's business strategy is predicated on the idea that fraud is rampant in the \"<span data-v-f87c67ca=\"\">certification industry,\" and the issue is exacerbated by ineffective methods of tracking goods across multiple supply chains. \"Fraudsters can exploit laboratory COAs through QR code tampering, visual modifications, and data alterations,\" the companies said. \"Blockticity's solution aims for COAs to have consistent, verifiable proof by anchoring them to Avalanche.\"<\/span>","<span data-v-f87c67ca=\"\">The aim is to expand beyond this particular initiative with ACS Laboratory and expand to \"<\/span><span data-v-f87c67ca=\"\">consumer electronics, apparel, agriculture, seafood, and other sectors,\" according to Blockticity, which said additional projects are expected to debut later this year.<\/span>","<span data-v-f87c67ca=\"\">\"Blockticity's primary goal is to harness web3 for tracking products across the global supply chain,” the company's CEO Mike Coner, said in the statement. “We use Avalanche because it enables on-chain product authentication while safeguarding client metadata and offering a scalable solution for the worldwide economy.\"<\/span>"],"hashtag":[]}