{"summary":"A big player in crypto investing is taking its first big leap into the stock trading world.  Abra, the firm known for its bitcoin investment platform,","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/10441\/abra-launches-new-stock-trading-service-that-turns-your-btc-into-fb","publishDate":"2019-02-06T08:29:51","id":7920,"type":null,"title":"Abra launches new stock trading service that turns your $BTC into $FB","category":["BITCOIN"],"content":["A big player in crypto investing is taking its first big leap into the stock trading world.&nbsp;","Abra, the firm known for its bitcoin investment platform, will soon offer a service that will allow its clients to buy stock in companies with bitcoin. Well, sort of.&nbsp;","\"We're enabling something like stock investing,\" Abra CEO Bill Barhydt said in an interview with The Block. To start, it will offer exposure to 50 assets including Facebook, Apple, Amazon, and Google. Instead of purchasing actual stock in a company, Abra's platform allows users to buy a bitcoin representation of a stock.","Here's an example. Let's say a user wants to buy a share of Apple stock through the Abra platform. That user would fund her account with the necessary cash to buy Apple for its current price. Immediately, Abra's so-called C3 system converts that cash to bitcoin. Then, Abra — using the magical power of smart contracts — keeps that bitcoin's notional value tied to the price of Apple's stock.&nbsp;","In the background of all of this, Abra is hedging, shorting, and has algos firing on all cylinders. But the technological wizardry behind the scenes is not what's important, according to Barhydt. Since Abra doesn't <em data-v-f87c67ca=\"\">technically<\/em> own any of the stock, nor would its users, it doesn't have to subscribe to the same regulatory requirements as a Robinhood or TDAmeritrade. That means its services can be available globally across 150 countries.&nbsp;","\"Our vision for Abra is to create a single app that serves as the go-to investing app for the globe,\" Barhydt said. \"This is just our first announcement, over time you will see other services in the banking arena to democratize access to financial service.\"","Democratize finance. A darling phrase of financial-technology CEOs that's trite to most veteran financial-technology journalists. But Barhydt says his firm's model, because of bitcoin, is unique from the slew of democratizing financial firms (Stash, Acorns, Robinhood, et al).&nbsp;","First, most of those apps don't let users in far-flung regions in the world invest. Also, since it's based on bitcoin it allows users to invest anonymously. \"If you deposit crypto into Abra to buy SPDR's ETF, I don't need to know who you are.\"","To skeptics who might not be convinced that Abra will be able to keep their bitcoin pegged to their stock, Barhydt points to the firm's track record. This isn't C3's first rodeo. The firm has already provided bitcoin representations of different alternative cryptocurrencies. Bardhydt notes since that service was launched, bear market and all, the firm has been able to maintain the pegs.&nbsp;","\"Last year was a great use case,\" he said. \"The price of bitcoin fell 80% and our hedging system worked perfectly.\"","Still, skeptics have pointed out that Abra's offering bears some resemblance to a contract for difference, or CFD, which is a derivative contract that is banned in the U.S. \"CFDs are illegal here,\" said Larry Tabb, founder of consultancy Tabb Group, to The Block. \"I think they get a letter from both the SEC and CFTC.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"SPDR","content":"ORGANIZATION"},{"type":"Amazon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Bill Barhydt","content":"PERSON"},{"type":"Abra","content":"ORGANIZATION"},{"type":"Barhydt","content":"PERSON"},{"type":"Tabb Group","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Larry Tabb","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}