{"summary":"The defense argued that his global recognizability, willingness to plead guilty and family base in the UAE means he is not a flight risk.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264659\/changpeng-zhao-defense-seeks-denial-of-motion-to-stay-in-us-says-he-poses-no-flight-risk","publishDate":"2023-11-24T13:24:20","id":7929,"type":null,"title":"Changpeng Zhao&#x27;s defense seeks denial of motion to stay in US, says he poses &#x27;no flight risk&#x27;","category":["LEGAL"],"content":["Former Binance CEO Changpeng Zhao's legal defense team has requested the court to deny the prosecutors' recent <a href=\"https:\/\/www.theblock.co\/post\/264457\/prosecutors-seek-to-keep-cz-in-the-u-s-until-february-sentencing\" data-v-f87c67ca=\"\">motion<\/a> to keep him in the U.S. until February sentencing.","Zhao <a href=\"https:\/\/www.theblock.co\/post\/253681\/changpeng-cz-zhao-steps-down-as-binance-ceo\" data-v-f87c67ca=\"\">pleaded guilty<\/a> in a Seattle court on Tuesday to violating, and causing a financial institution to violate, the Bank Secrecy Act. He also agreed to pay a $50 million fine. The U.S. Department of Justice <a href=\"https:\/\/www.theblock.co\/post\/264010\/justice-department-set-to-announce-settlement-with-binance-bloomberg\" data-v-f87c67ca=\"\">settled<\/a> the connected criminal case with Binance, which probed into alleged money laundering, fraud and sanctions violations. The crypto exchange will pay a $4.3 billion fine, marking one of the largest corporate settlements in U.S. history.","The defense argued against the motion on the basis of legal standards and Judge Brian Tsuchida previously finding Zhao wasn’t a flight risk, according to a court <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/11\/zhao.pdf\" data-v-f87c67ca=\"\">filing<\/a> yesterday. It also claimed the government had insufficient grounds for appeal.","Arguing against the motion, Zhao’s legal team said a defendant awaiting sentencing must be released if they are not a flight risk or a danger to the community. The defense claimed Zhao met this criteria, highlighting that Judge Tsuchida previously found he wasn’t a flight risk at his bail hearing and reiterating his lack of prior criminal history, the non-violent nature of the crimes and his willingness to plead guilty. Zhao is a recognizable figure in the global spotlight, making evasion of the U.S. justice system impossible, the defense added.","Furthermore, Zhao's defense also argued that since he could be eligible to serve half of any term of imprisonment — potentially up to <a href=\"https:\/\/www.theblock.co\/post\/264283\/jpmorgan-binance-settlement-positive-crypto\" data-v-f87c67ca=\"\">18 months<\/a>, in a non-jail setting, such as home detention or community confinement — there was no incentive to flee that would risk additional charges. They also argued that Zhao’s home and his family being in the UAE did not make him a flight risk and preventing him from returning would be punitive. “To return, however, would be to potentially serve a brief or possibly no prison term and then return to his family with this matter behind him,” they said.","The defense contended that the prosecutors provided no substantial evidence to challenge Judge Tsuchida’s decision to allow Zhao to reside in the UAE pending sentencing, arguing that the government's suggestion that Zhao's wealth and foreign citizenship make him a flight risk is unfounded. The defense also addressed the prosecutors' concerns about the lack of an extradition treaty between the U.S. and the UAE, noting that Zhao voluntarily returned to the U.S. to plead guilty.","Zhao’s legal team reiterated that his bail conditions were substantial, agreeing to a <a href=\"https:\/\/www.theblock.co\/post\/264191\/binance-ex-ceo-cz-released-on-175-million-bond-after-u-s-criminal-charges\" data-v-f87c67ca=\"\">$175 million<\/a> personal recognizance bond. His return is also secured by two guarantors pledging cash amounts of $100,000 and $250,000, and a third guarantor offering real property in the U.S. valued at over $5 million, which they said was further evidence of Zhao’s commitment to arrive in the U.S. two weeks before his sentencing in February.","“For these reasons, Mr. Zhao respectfully requests that the Court deny the government’s motion and allow him to return to the UAE pending sentencing,” the defense concluded.","In a filing on Wednesday, prosecutors <a href=\"https:\/\/www.theblock.co\/post\/264457\/prosecutors-seek-to-keep-cz-in-the-u-s-until-february-sentencing\" data-v-f87c67ca=\"\">had said<\/a> that Zhao, a citizen of the United Arab Emirates and Canada, should not be permitted to return to his home in the UAE before sentencing on Feb. 23 next year, given “the substantial risk of flight posed by Zhao.”","“Zhao’s significant assets and strong ties to the UAE, as well as the government’s inability to extradite him from the UAE, favor a ruling from this court that he be required to remain in the United States until his sentencing on Feb. 23, 2024,” the prosecutors said in the filing.","Magistrate Judge Brian Tsuchida previously ruled that Zhao would be allowed to return to the UAE on the appearance bond — unless the court determines it will review the decision before 5 p.m. Pacific Standard Time on Nov. 27. The judge required Zhao to return to the U.S. by Feb. 9, 2024.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Tsuchida","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Feb. 23, 2024","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$175 million","content":"MONEY"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Zhao","content":"PERSON"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"United Arab Emirates","content":"ORGANIZATION"},{"type":"Feb. 23 next year","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"5 p.m.","content":"TIME"},{"type":"Zhao’s","content":"PERSON"},{"type":"Seattle","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"$5 million","content":"MONEY"},{"type":"Pacific Standard Time","content":"ORGANIZATION"},{"type":"$250,000","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Feb. 9, 2024","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Brian Tsuchida","content":"PERSON"},{"type":"$100,000","content":"MONEY"},{"type":"$4.3 billion","content":"MONEY"},{"type":"Nov. 27","content":"DATE"},{"type":"$50 million","content":"MONEY"},{"type":"UAE","content":"ORGANIZATION"}],"hashtag":["BINANCE","COURT HEARINGS","CZ"],"authors":["James Hunt","The Block"]}