{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/16087\/onecoin-indictment-include-securities-fraud-charge","publishDate":"2019-03-17T11:00:25","id":793,"type":null,"title":"OneCoin indictment includes securities fraud charge","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\". This week’s guest post by Preston Byrne is “PJB”","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]U.S. v. Ignatov et al. [PJB]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","As my friends and usual authors of this column Palley and Nelson can attest, long have attorney observers of the cryptocurrency space wondered how the U.S. Department of Justice would deal with allegedly fraudulent ICO schemes.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nTo date, prosecutions of these schemes have been thin on the ground. With perhaps the exception of U.S. v. Homero Joshua Garza, which concerned a late 2014-early 2015 fraudulent bitcoin mining Ponzi scheme that also happened to have a “pegged stablecoin” called PayCoin attached to it, the DOJ has been remarkably quiet throughout the crypto boom and a perceived slew of what many practitioners argue are major, multibillion-dollar violations of U.S. securities laws. Where the DOJ has gotten involved, usually the charges are limited to garden-variety wire fraud, as in the Garza case, or money laundering, as with Liberty Reserve.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nRarely, if ever, has the DOJ sought to use securities law to restrain allegedly unlawful ICO conduct. With the OneCoin indictments, those days may be over.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nFirst, a bit of background. The OneCoin scheme is alleged to have started at some point in 2014 amid the great altcoin boom (a boom that also led to, inter alia, Dogecoin, Litecoin, and Ethereum). Among crypto enthusiasts, OneCoin quickly attracted skepticism, for, among other things, the lack of an actual blockchain, the use of MLM-style compensation schemes, and the production of quite obviously fake events on YouTube that made preposterous claims for OneCoin. These claims included a description of the scheme’s founder — a Bulgarian national named Ruja Ignatova — as “the founder of cryptocurrency,” despite appearing to know nothing about cryptography, or a representation that OneCoin’s technology — on a slow-ass blockchain — “can do more transactions than Visa and Mastercard,” which is plainly absurd.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<a href=\"https:\/\/www.youtube.com\/watch?v=638_Jpp2Rq8\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">https:\/\/www.youtube.com\/watch?v=638_Jpp2Rq8<\/a><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIt appears the federal government agrees with most of Cryptoland’s assessment, as the DOJ now alleges that the entire scheme was a massive (~$3 billion) fraud. Without going into too much detail, the indictments give us a pretty good idea of what we might expect to see in future prosecutions for unlawful coin offerings.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe scheme’s attorney was indicted in September with conspiracy to commit money laundering. The complaint and indictment against scheme organizers Ignatov and Ignatova, respectively, each include the expected single count of conspiracy to commit wire fraud, i.e. scheming to obtain “money and property by means of false and fraudulent pretenses, representations, and promises.” Such as that your blockchain has more throughput than Mastercard, for example.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIgnatova herself, however, is charged also with wire fraud, conspiracy to commit money laundering, i.e. concealing and disguising “the nature, location, source, ownership and control of the proceeds of specified unlawful activity,” and (here it is!) securities fraud, on the basis that, “in connection with the purchase and sale of securities,” Ignatova “did use and employ manipulative and deceptive devices and contrivances,” contrary to Rule 10b-5.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThis suggests that the DOJ thinks it can convince a judge that an ICO token, at least in the case of OneCoin, is a security, applying the ever-popular four-prong test from SEC v. W.J. Howey Co.. If Ignatova’s case goes to trial, we may expect some useful case law on this point. Note, however, that this does not necessarily mean that the DOJ takes the view that every cryptocurrency system is illegitimate or a security. I draw the reader’s attention to footnote 2 in the complaint against Konstantin Ignatov, which contrasts OneCoin with what the FBI describes as “a legitimate cryptocurrency,” in which “mining… [allows] the cryptocurrency’s nodes to reach a secure, tamper-resistant consensus.” Which is actually a pretty good description of what a cryptocurrency blockchain does.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLessons here? If the indictment’s allegations are proven to be true, it would mean that OneCoin is among one of the more outrageous, flagrant, and long-running alleged scams in the cryptocurrency business, and only now have the wheels of justice ground their way to an indictment. Yet it still is alleged to have taken in over $3 billion of investors’ money worldwide before those charges became known. Attorneys advising clients on the merits of particular schemes should advise conservatively and confirm that coin offerings have sought to comply with U.S. securities laws, and have fairly and fully disclosed the risks of investment to prospective investors, from day one.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part III of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$3 billion","content":"MONEY"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Garza","content":"PERSON"},{"type":"SEC v. W.J. Howey Co.","content":"ORGANIZATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Dogecoin","content":"LOCATION"},{"type":"Preston Byrne","content":"PERSON"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Liberty Reserve","content":"ORGANIZATION"},{"type":"FBI","content":"ORGANIZATION"},{"type":"Litecoin","content":"PERSON"},{"type":"Palley","content":"PERSON"},{"type":"Homero Joshua Garza","content":"PERSON"},{"type":"Konstantin Ignatov","content":"PERSON"},{"type":"Nelson","content":"PERSON"}],"hashtag":[],"authors":["Preston Byrne","The Block"]}