{"summary":"FTX teased a possible reopening with lawyers saying it it will file a reorganization plan in July. &quot;The dumpster fire is out,” Andy Dietderich of Sullivan &amp; Cromwell said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226021\/ftx-reopening","publishDate":"2023-04-12T15:04:07","id":7930,"type":null,"title":"Sam Bankman-Fried played FTX like a video game; exchange might have one life left","category":["COMPANIES"],"content":["FTX teased a possible reopening on Wednesday with its lawyers telling a court that it will file a reorganization plan in July that could be confirmed by the second quarter of next year.&nbsp;","\"The dumpster fire is out,” Andy Dietderich of Sullivan &amp; Cromwell said at a hearing in the ongoing bankruptcy of the collapsed crypto exchange. The company has collected assets that are currently worth $7.3 billion, he added. FTX filed for bankruptcy protection in November after customers started removing funds from the exchange.","When Judge John Dorsey of the U.S. Bankruptcy Court for the District of Delaware asked about a possible restart, there wasn't a totally clear answer, and the move would require raising \"significant capital\" or the use of estate funds, Dietderich said.&nbsp;","\"There are as many opinions on this, I think, as there are professionals involved in the case,\" he said, noting that one possible solution could see customers given the option to invest part of funds they are owed into equity in a future exchange.","A target plan timeline presented in court about the possible reopening sees an initial plan being filed in the third quarter. FTX CEO John Ray III brought up the idea in January, with lawyers representing FTX creditors <a href=\"https:\/\/www.theblock.co\/post\/222461\/ftx-sbf-clients-want-reboot-despite-scam\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">holding several<\/a> “reboot of exchange” meetings.&nbsp;","Former FTX head of institutional sales Zane Tackett <a href=\"https:\/\/www.theblock.co\/post\/225865\/ftx-zane-tackett-exchange-relaunch\" data-v-f87c67ca=\"\">floated the idea of a reopening<\/a> earlier in the day, telling The Block that the exchange should relaunch and offer trading in FTX bankruptcy claims.","Former CTO Gary Wang, who <a href=\"https:\/\/www.theblock.co\/post\/197573\/ellison-and-wang-guilty-pleas-unsealed-as-bankman-fried-granted-bail\" data-v-f87c67ca=\"\">pleaded guilty to criminal charges<\/a> late last year, is providing material assistance to FTX debtors, helping them locate additional assets, Dietderich said.","\"Mr. Bankman-Fried repeatedly, pervasively and often persuasively lied to stakeholders and customers and creditors in order to maintain a digital con game,\" he said, referring to former CEO and founder <a href=\"https:\/\/www.theblock.co\/post\/225799\/bankman-fried-ftx-insurance-legal-defense\" data-v-f87c67ca=\"\">Sam Bankman-Fried<\/a>.","\"Superficially, they appeared to process trades and information more quickly and conveniently than competitors,\" he said. \"The app worked beautifully, but in truth it was a facade. A digital Potemkin village, or perhaps more apt, a video game.”","The bankruptcy court judge, meanwhile, denied <a href=\"https:\/\/www.theblock.co\/post\/225799\/bankman-fried-ftx-insurance-legal-defense\" data-v-f87c67ca=\"\">Bankman-Fried’s motion<\/a> to access a $10 million insurance policy to fund his legal bills.","Bankman-Fried had asked the judge to lift a stay on FTX’s directors and officers liability insurance policy, which would have allowed insurance providers to assess his claims and possibly reimburse his legal costs. He did not provide evidence or establish cause, Dorsey said in denying the motion.","The former crypto boss has the option to come back with evidence at a later time, Dorsey added.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"John Dorsey","content":"PERSON"},{"type":"” Andy Dietderich of Sullivan &amp; Cromwell","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"July","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"$7.3 billion","content":"MONEY"},{"type":"John Ray III","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Zane Tackett","content":"PERSON"},{"type":"Gary Wang","content":"PERSON"},{"type":"Dorsey","content":"PERSON"},{"type":"third quarter","content":"DATE"},{"type":"second quarter","content":"DATE"},{"type":"Dietderich","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"the District of Delaware","content":"ORGANIZATION"}],"hashtag":["BANKRUPTCY FILINGS","COURT HEARINGS","FTX"],"authors":["Stephanie Murray","Nathan Crooks","The Block"]}