{"summary":"The Texas State Securities Board filed enforcement actions against various entities collectively known as Abra.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235020\/abra-ceo-face-enforcement-actions-from-texas-securities-board","publishDate":"2023-06-15T16:30:41","id":7931,"type":null,"title":"Abra, CEO face enforcement actions from Texas Securities Board","category":["COMPANIES"],"content":["The Texas State Securities Board said Thursday that it filed <a href=\"https:\/\/www.ssb.texas.gov\/sites\/default\/files\/2023-06\/ENF_23_CDO_1873_NOH_Actions.pdf\" data-v-f87c67ca=\"\">enforcement actions<\/a> against various entities collectively known as Abra and CEO Bill Barhydt.","The actions allege the respondents committed securities fraud and engaged in deception in connection with the offer and sale of investments in Abra Earn and Abra Boost, the state regulator said in a <a href=\"https:\/\/www.ssb.texas.gov\/news-publications\/abra-earn-and-abra-boost-warning\" data-v-f87c67ca=\"\">statement<\/a>.","Specifically, it alleges that the entities offered or sold Abra Earn to accredited and unaccredited investors and Abra Boost to accredited investors.&nbsp;","\"The alleged misconduct includes the intentional concealment of financial information reflecting the capitalization of parties, defaults on loans and the transfer of assets to Binance,\" the regulator said in the statement, adding that the actions also allege that the firms \"were or were nearly insolvent\" as of March 31.","The regulator noted that Abra has not yet had the opportunity to challenge the allegations. It said that the enforcement actions don't prevent the respondents from returning assets to clients.&nbsp;","The Texas regulator said the parties collectively had around $116.79 million of assets under management for U.S. Abra Earn and Abra Boost investors. The agency noted that it's been leading a working group of state securities regulators organized through the North American Securities Administrators Association.","A 30-page enforcement action <a href=\"https:\/\/www.ssb.texas.gov\/sites\/default\/files\/2023-06\/ENF_23_CDO_1873_NOH_Actions.pdf\" data-v-f87c67ca=\"\">document<\/a> notes exposure to failed crypto exchange FTX, in addition to Genesis, 3AC, Auros and Babel Finance. It also accuses Abra entities of \"secretly transferring assets to Binance.\"","Founded in 2014 by Barhydt, Abra provides a crypto platform for both individual and institutional clients with services such as trading, lending and borrowing. It cut jobs <a href=\"https:\/\/www.theblock.co\/post\/155209\/abra-becomes-latest-crypto-firm-to-cut-jobs\" data-v-f87c67ca=\"\">last year<\/a>, and in 2020 settled charges with the U.S. Securities and Exchange Commission and Commodity Futures Trading Commission.","The SEC had <a href=\"https:\/\/www.theblock.co\/linked\/71361\/crypto-app-abra-sec-cftc\" data-v-f87c67ca=\"\">accused<\/a> Abra of \"offering and selling security-based swaps to retail investors without registration and for failing to transact those swaps on a registered national exchange.\"","The company didn't immediately respond to a request for comment from The Block.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Binance","content":"LOCATION"},{"type":"U.S. Abra Earn","content":"ORGANIZATION"},{"type":"Abra Boost","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission and Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Texas State Securities Board","content":"ORGANIZATION"},{"type":"Babel Finance","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Bill Barhydt","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"March 31","content":"DATE"},{"type":"$116.79 million","content":"MONEY"},{"type":"Barhydt","content":"PERSON"},{"type":"North American Securities Administrators Association","content":"ORGANIZATION"},{"type":"Genesis","content":"LOCATION"},{"type":"2020","content":"DATE"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}