{"summary":"More than 70 financial services firms in China, including every state-owned bank and the biggest tech companies, are deploying blockchain-based financial applications.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/62691\/most-of-chinas-biggest-banks-are-already-using-blockchains","publishDate":"2020-04-22T12:32:32","id":7934,"type":null,"title":"Most of China&#x27;s biggest banks are already using blockchains","category":["ASIA"],"content":["More than 70 financial services firms in China, including every state-owned bank and the biggest tech companies, are deploying blockchain-based financial applications.","That's according to the Industrial and Commercial Bank of China (ICBC), one of the nation's largest state-owned banks.&nbsp;","In a new <a href=\"https:\/\/n0.sinaimg.cn\/finance\/9b213f90\/20200421\/QuKuaiLianJinRongYingYongFaZhanBaiPiShu.pdf\" data-v-f87c67ca=\"\">white paper<\/a>,&nbsp; the ICBC said Chinese banks are planning to use blockchains in areas like trade financing, supply chain management, settlement, digital invoices, and other applications.","Four of China's largest tech companies—Baidu, Alibaba, Tencent, and JD—are also working on their own blockchain-based financial service applications. As the paper notes, most of these blockchains will be permission-based.&nbsp;","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Source: ICBC blockchain financial application white paper<\/span><\/em>","The document also details some specific applications. For instance, ICBC itself has built a cross-border trade settlement platform between China and Europe that <a href=\"http:\/\/sc.people.com.cn\/n2\/2019\/1024\/c345167-33466797.html\" data-v-f87c67ca=\"\">uses distributed ledger technology<\/a> and smart contracts to authenticate and sync shipping information shared by companies, warehouses, customs, banks, and government agencies.&nbsp;","According to the white paper, banks and enterprises in China are using blockchains to manage funds, control supply chains, issue securities, and track customer loyalty points.","Around 420 blockchain companies – 17% of which are in finance. One hundred twenty blockchain-based financial services projects – were registered with the Cyberspace Administration of China at the end of 2019, says the ICBC.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"ICBC","content":"ORGANIZATION"},{"type":"17%","content":"PERCENT"},{"type":"Commercial Bank of China (ICBC","content":"ORGANIZATION"},{"type":"Alibaba","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Baidu","content":"LOCATION"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"Cyberspace Administration of China","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"Europe","content":"LOCATION"}],"hashtag":[],"authors":["Celia Wan","The Block"]}