{"summary":"Blockchain media site Decrypt is launching a user reward token.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57677\/crypto-media-decrypt-reward-token","publishDate":"2020-03-04T10:00:09","id":7937,"type":null,"title":"Crypto media site Decrypt is launching a reader reward token","category":["STARTUPS"],"content":["<span data-v-f87c67ca=\"\">Read news, earn tokens, and spend them on Amazon: t<\/span><span data-v-f87c67ca=\"\">his is the vision blockchain media startup Decrypt is selling to readers as it prepares to launch a reward token.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The company announced today that it has partnered with Ethereum-based token infrastructure provider OST to launch the new token, which users can earn by reading and sharing Decrypt's content. These tokens can then be exchanged for gift cards from services like Amazon, Airbnb, Starbucks, and others.&nbsp;&nbsp;<\/span>","\"Increasingly, especially with Web3, consumers become more aware that their attention has value, and this allows the value attribution to goes towards that,\" OST CEO Jason Goldberg told The Block.&nbsp;","The token is set to be launched in beta during the second quarter of 2020, according to Goldberg.","Goldberg said that each token will have a fixed value set by Decrypt, encoded on a smart contract, and cannot be traded. In the extreme case where Decrypt and OST shut down, users can still exchange these tokens for their underlying Ether (ETH).&nbsp;","Decrypt's shift from traditional advertising to an attention token model is, in part, due to the belief that the current advertising model is broken, according to&nbsp;<span data-v-f87c67ca=\"\">Decrypt editorial director and co-founder Josh Quittner. To pursue ad revenues, publishers are forced to compete for clicks and therefore compromising editorial integrity.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“By partnering with OST, we’ve been able to build out an innovative approach to sponsorship where users read the content they care about and advertisers don’t get in the way–they add real value,” said Quitter in a statement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, this does not mean that Decrypt will be completely advertiser-free. Tokens will be released in seasons, with each season sponsored by an advertiser.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The sponsorship model provides a unique opportunity for advertisers to align themselves with an audience that is notoriously wary of traditional advertising, while simultaneously putting themselves at the forefront of new technology,\" the companies said.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Amazon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"OST","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Josh Quittner","content":"PERSON"},{"type":"Goldberg","content":"PERSON"},{"type":"second quarter of 2020","content":"DATE"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"Jason Goldberg","content":"PERSON"},{"type":"Airbnb","content":"LOCATION"}],"hashtag":[],"authors":["Celia Wan","The Block"]}