{"summary":"A bottle of red, a bottle of white, remember that Merkle trees keep your chain size light. That&#x27;s right: wine is now on the blockchain. Vinsent, a new app","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/11804\/explore-wine-on-the-blockchain-with-your-tipsy-valentine","publishDate":"2019-02-14T11:45:02","id":794,"type":null,"title":"Explore wine on the blockchain with your tipsy Valentine","category":["LAYER 1S"],"content":["A bottle of red, a bottle of white, remember that Merkle trees keep your chain size light. That's right: wine is now on the blockchain.","<a href=\"https:\/\/www.vinsent.wine\" data-v-f87c67ca=\"\">Vinsent<\/a>, a new app that allows purchasers to pick up a bottle of fancy (mostly Israeli) vino, is turning to the blockchain to register wine futures purchases while ensuring that the bottles are authentic.","Vinsent came from <a href=\"https:\/\/www.forbes.com\/sites\/darrynpollock\/2018\/10\/04\/overstock-coms-medici-ventures-invests-in-vinx-to-create-blockchain-wine-market\/#2bff60142c40\" data-v-f87c67ca=\"\">VinX,<\/a> a Medici-funded company that sought out to create a&nbsp;digital wine futures platform similar to the Bordeaux model.","“Vinsent brings consumers in direct contact with wineries early in the winemaking cycle, giving early access to fine wine for consumers, and providing greater cash flow for wineries throughout the process,” said CEO Jacob Ner-David. “Simply said, we are reinventing the way wine is bought, owned, and experienced.”","The app tokenizes the bottles and allows for \"permission-less selling and trading of wine futures on a transparent and secure blockchain.\" This means you can buy and sell a bottle without a middleman and bottle registration ensures each bottle is authentic.","“The wine industry is ripe for blockchain disruption, as the technology solves significant problems with supply chains, transferring ownership and establishing provenance,” said Jonathan Johnson of Medici Ventures. “By building its platform with blockchain technology, Vinsent is establishing a secure marketplace for global audiences.”","The pickings are slim on the app right now and it's not even available on stores - perhaps they have to finely age the blockchain in new oak barrels before release? That said, connecting some bottles of the sweet nectar of Bacchus should be a good way to go, especially if you're trying to avoid a <a href=\"https:\/\/www.amazon.com\/Billionaires-Vinegar-Mystery-Worlds-Expensive-ebook\/dp\/B0013TRRSA\/ref=sr_1_2?ie=UTF8&amp;qid=1550161696&amp;sr=8-2&amp;keywords=billionaires+vinegar\" data-v-f87c67ca=\"\">Billionaire's Vinegar<\/a> kind of situation.","That said, until a nice bottle of Two Buck Chuck shows up on my cellar side chain I'm going to stay skeptical of current utility of this system.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Medici","content":"LOCATION"},{"type":"Medici Ventures","content":"ORGANIZATION"},{"type":"Merkle","content":"PERSON"},{"type":"Two Buck Chuck","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"David","content":"PERSON"},{"type":"Jacob Ner","content":"PERSON"},{"type":"Jonathan Johnson","content":"PERSON"},{"type":"Vinsent","content":"PERSON"},{"type":"Bordeaux","content":"LOCATION"}],"hashtag":[],"authors":["John Biggs","The Block"]}