{"summary":"Fidelity is said to be working toward a retail-focused crypto offering.\n\nJob posts in recent months offer clues to what the retail services will entail.","author":["Ryan Weeks","Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169733\/fidelitys-rumored-retail-crypto-plans-are-on-display-in-recent-job-ads","publishDate":"2022-09-13T14:19:45","id":794,"type":null,"title":"Fidelity&#x27;s rumored retail crypto plans are on display in recent job ads","category":["Companies"],"content":["Chatter around investment giant Fidelity’s plans to expand its crypto footprint to a broader, retail-centric customer base broke into the open this week.","Yet job ads posted in recent months by Fidelity itself offer clues about the investment firm’s retail crypto ambitions, including roles that would play a part in the development of crypto wallet services.","A query of Fidelity’s <a href=\"https:\/\/jobs.fidelity.com\/job-search-results\/?keyword=crypto%20wallet\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">careers portal<\/a> shows at least half a dozen roles with a specific focus on wallets.","One ad, for a Senior Java Engineer, Wallet Blockchain, highlights that “Fidelity Digital Assets, a Fidelity Investments Company, is developing a full-service enterprise-grade platform for storing, trading, and servicing digital assets, such as Bitcoin and Ethereum.”","The ad, posted in June, later positions the role as operating on a dedicated wallet team within the broader FDA organization:","Other listed roles touch on crypto wallet functionalities in addition to other responsibilities. For example, the description for a Principal Software Engineer\/Developer role posted this month calls for “performing crypto wallet optimization — lending and spot rates and social market analytics — in an Amazon Web Services (AWS) Cloud environment, using Java, Oracle, Spring Boot, and Docker”.","Another role, for a Principal Java Engineer on the Wallet Blockchain Foundations team, calls for “1+ year experience developing and maintaining smart contracts using Solidity” as a preferred skill area. Solidity is a coding language built for use on Ethereum.","In a since-removed job post for a Squad Leader, Crypto Data Analytics role, previously available on LinkedIn, Fidelity made specific reference to a retail clientele.","“Your team will be delivering to market, revenue generating decision support tools to help inform the trade decisions of Fidelity's retail crypto clients,” the post read. Despite its removal, the metadata remains visible in <a href=\"https:\/\/www.google.com\/search?q=fidelity+%22retail+crypto%22+linkedin&amp;rlz=1C5CHFA_enUS880US880&amp;sxsrf=ALiCzsZuCMVSQLpKsdoNsQM8SSimtcaG7g%3A1663091714488&amp;ei=AsQgY7WfHe6gptQPrZ-5kA8&amp;ved=0ahUKEwi1qPu2q5L6AhVukIkEHa1PDvIQ4dUDCA4&amp;uact=5&amp;oq=fidelity+%22retail+crypto%22+linkedin&amp;gs_lcp=Cgdnd3Mtd2l6EAMyBQgAEKIEMgcIABAeEKIEOgoIABBHENYEELADOgYIABAeEBY6BQgAEIYDOgUIIRCgAToFCCEQqwI6CAghEB4QFhAdOgcIIRCgARAKSgQIQRgASgQIRhgAUJkCWPkQYLcSaAJwAXgAgAGKAYgBigiSAQM0LjaYAQCgAQHIAQjAAQE&amp;sclient=gws-wiz\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a Google search<\/a>.","Sources with knowledge of the process tell The Block that the retail-focused plans have been in the works for some time, and these descriptions appear to track with details reported this week by the <a href=\"https:\/\/www.theblock.co\/post\/168603\/fidelity-to-offer-bitcoin-trading-to-retail-customers-reports\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Wall Street Journal<\/a>. To date, Fidelity’s crypto efforts have been geared toward institutional investors.","When reached for comment, a representative for the firm told The Block: “While we have nothing new to announce, expanding our offerings to enable broader access to digital assets remains an area of focus.”","Galaxy Digital chief executive Mike Novogratz stirred the rumor pot during a Monday conference appearance, commenting: \"A little bird told me Fidelity are going to shift retail customers into crypto soon.”"],"hashtag":[]}