{"summary":"Matrixport&#x27;s Bit.com exchange has launched bitcoin options.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/74641\/matrixport-exchange-bitcoin-options","publishDate":"2020-08-12T10:11:27","id":7940,"type":null,"title":"Bitmain spin-off&#x27;s crypto exchange to launch bitcoin options as pricing competition heats up","category":["EXCHANGES"],"content":["A new player in the crypto derivatives space is launching bitcoin options as that particular corner of the market continues to heat up.&nbsp;","Bit.com, the derivatives trading venue backed by Matrixport, told The Block Wednesday that its options product is set to launch next week. Bit.com went live at the beginning of August, as <a href=\"https:\/\/www.theblockcrypto.com\/post\/72970\/matrixport-crypto-derivatives-exchange\" data-v-f87c67ca=\"\">reported<\/a> by The Block's Yogita Khatri.&nbsp;","Matrixport spun out from crypto mining giant Bitmain in 2019 and was co-founded by its former CEO Jihan Wu.&nbsp;","The exchange will be the latest options platform to integrate with New York-based Paradigm, which provides a messaging platform for dealers to negotiate options trades. Already, traders on Paradigm have access to Deribit and CME Group. As for the wider market, a number of firms have debuted crypto options products over the course of the last year, including OkEX and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/52800\/binance-backed-derivatives-exchange-ftx-launches-bitcoin-options\" data-v-f87c67ca=\"\">FTX<\/a>.","In total, the size of the market soared above $2 billion in aggregate open interest, according to data from Skew.&nbsp;","","","As for Bit.com, the firm expects that burgeoning interest in trading options and structured products in Asia will be a tailwind for the new product. Yan estimates that structured flows in China stand at ~20,000 bitcoin on a weekly basis. He expects that to grow 10 to 30x over the next three years.&nbsp;","Paradigm chief executive Anand Gomes told The Block that interest in bitcoin options has exploded in China, noting the desire for yield among investors.","\"Structured products based on options have very strong demand from miners and financial institutions in general, what is the driving the demand is the need of hedging and also the need of asset management,\" Cynthia Wu, a representative of Bit.com, told The Block in a message. \"We reckon the demand from China contributes at least 40% of the overall option trading volume.\"","Naturally, the addition of new market participants is forcing players to become more competitive from a pricing standpoint. To start, Bit.com will offer traders the ability to trade options via Paradigm at no cost for their first 100 bitcoin traded. The firm will also offer a 25% fee discount for multi-leg strategies.&nbsp;","Meanwhile, Deribit said on Wednesday that it would lower options trading fees for its ether and bitcoin contracts by 25%","\"We have decided to lower the options trading fees to make the market more accessible to retail traders and to improve the efficiency of multi-leg options trading,\" the exchange said. \"We continue to grow our options segment and are seeing an influx of new traders with more evolved trading strategies. Due to this, we have decided to follow up with a fairer pricing model.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<em data-v-f87c67ca=\"\">This post was updated to clarify the timing of the options contract's launch.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Matrixport","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"Cynthia Wu","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"25%","content":"PERCENT"},{"type":"Deribit","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Anand Gomes","content":"PERSON"},{"type":"$2 billion","content":"MONEY"},{"type":"China","content":"LOCATION"},{"type":"August","content":"DATE"},{"type":"Yogita Khatri","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}