{"summary":"Polygon plans to overhaul its governance framework in the Polygon 2.0 roadmap for more decentralized control.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240439\/polygon-new-governance-model-ecosystem-council","publishDate":"2023-07-19T05:01:14","id":7942,"type":null,"title":"Polygon announces new governance model comprising of ‘ecosystem council’","category":["GOVERNANCE"],"content":["The Polygon team has unveiled its plans to create a new governance framework, aiming for more decentralized control over its ecosystem. The development comes in response to the team's new roadmap called <a href=\"https:\/\/www.theblock.co\/post\/234354\/polygon-2-zk\" data-v-f87c67ca=\"\">Polygon 2.0<\/a>, developing a network of zero-knowledge-powered Layer 2 chains.","The new governance model for Polygon will form “three governance pillars,” focusing on the governance of its core protocol, smart contracts and community treasury governance, the team said. Taking inspiration from Ethereum’s governance models, Polygon intends to assimilate its ethos and community-building techniques, it noted in a blog <a href=\"https:\/\/polygon.technology\/blog\/polygon-2-0-governance\" data-v-f87c67ca=\"\">post<\/a>","Other key features include the Polygon Improvement Proposal (PIP) framework expansion, the introduction of an “ecosystem council” for system smart contract upgrades and two-phase community treasury governance that will fund promising ecosystem projects.","The Polygon team said it’s inviting stakeholders, including validators, dApp developers and users, to participate in shaping its governance. “To make this possible, we are proposing a forward-looking framework for decentralized ownership and decision-making over all Polygon protocols and the ecosystem,” the team noted.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"}],"hashtag":["POLYGON"],"authors":["Vishal Chawla","The Block"]}