{"summary":"It’s full steam ahead from the Treasury while the more cautious Australian Prudential Regulation Authority sets out risk management expectations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142861\/australian-authorities-lay-out-guidelines-and-roadmaps-for-crypto-industry-regulation","publishDate":"2022-04-21T09:09:00","id":7944,"type":null,"title":"Australian authorities lay out guidelines and roadmaps for crypto industry regulation","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">The Australian Prudential Regulation Authority (APRA) set out initial risk management expectations for regulated entities dealing with crypto assets on Thursday, as well as a policy roadmap for introducing further standards over the next three years.<\/span>","<span data-v-f87c67ca=\"\">In a <\/span><a href=\"https:\/\/www.apra.gov.au\/crypto-assets-risk-management-expectations-and-policy-roadmap\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">letter<\/span><\/a><span data-v-f87c67ca=\"\"> from APRA Chair Wayne Byres, the authority, which supervises banking, insurance and pension institutions in Australia, emphasized the need for due diligence and risk assessments when dealing with crypto assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Its roadmap revealed plans to introduce operational risk standards by 2024, and, tentatively, crypto asset requirements and stored value facility standards by 2025.<\/span>","<span data-v-f87c67ca=\"\">It also advised that it would be looking at “possible approaches to the prudential regulation of payment stablecoins, among others.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Crypto has been growing in popularity in Australia. According to the Australian Taxation Office, more than 800,000 Australian taxpayers transacted in digital assets over the last three years, with an increase of 63% in 2021 over the previous year. Surveys from other companies, such as comparison site Finder, give estimates of the proportion of Australians holding crypto as high as 18%.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The regulatory moves are ramping up as more companies and products enter the market. FTX <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/138571\/ftx-announces-australian-expansion-as-government-sets-out-its-crypto-stall\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced plans<\/span><\/a><span data-v-f87c67ca=\"\"> to enter Australia last month, and last week The Block <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/142632\/asset-managers-set-to-launch-crypto-etfs-in-australia-next-week\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> that four ETF issuers have agreed to cover the margin requirements to list new crypto-related products on Cboe Australia.<\/span>","<span data-v-f87c67ca=\"\">Traditional finance institutions and government agencies have also been embracing blockchain technology.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Earlier this year, three of the country’s four major banks started issuing digital bank guarantees for retail property leases, according to the Treasury, while the country’s main clearinghouse ASX has also replaced its Clearing House Electronic Subregister System with distributed ledger technology.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In August last year, the Australian Border Force successfully <\/span><a href=\"https:\/\/www.customs.gov.sg\/news-and-media\/media-releases\/2021-08-18-Media-Release.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">concluded a trial<\/span><\/a><span data-v-f87c67ca=\"\"> using blockchain to digitize trade processes with partners in Singapore.<\/span>","<span data-v-f87c67ca=\"\">But APRA was not the only government body down under making crypto announcements today. The Australian Transaction Reports and Analysis Centre (AUSTRAC) — the country’s financial intelligence agency responsible for monitoring financial transactions linked to crime — also released <\/span><a href=\"https:\/\/www.austrac.gov.au\/sites\/default\/files\/2022-04\/AUSTRAC_FCG_PreventingCriminalAbuseOfDigitalCurrencies_FINAL.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">guidelines<\/span><\/a><span data-v-f87c67ca=\"\"> on preventing the criminal abuse of digital currencies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A consultation with the industry is also underway at the Treasury with regards to regulating “crypto asset secondary service providers” such as exchanges. The <\/span><a href=\"https:\/\/treasury.gov.au\/consultation\/c2022-259046\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">paper<\/span><\/a><span data-v-f87c67ca=\"\">, released on March 21, suggests regulators are leaning toward creating new frameworks for cryptocurrencies as opposed to bringing them under existing regulations.<\/span>","<span data-v-f87c67ca=\"\">However, the failure of previous attempts to regulate exchanges does still loom large in Australia. Melbourne-based exchange ACX.io suspended withdrawals in 2021 before falling into administration the following year. The fact that the company was a member of Blockchain Australia and held a digital currency license issued by AUSTRAC didn’t prevent investors from losing an estimated AUD10 million.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Many commentators have called for us to shoehorn crypto into the financial products regime. But crypto assets do not require the government to assure trust in the same way that financial products do… The Morrison Government wants to make sure that consumers can trust the exchanges they use to buy crypto,” the minister for superannuation, financial services and the digital economy, Jane Hume, <\/span><a href=\"https:\/\/ministers.treasury.gov.au\/ministers\/jane-hume-2020\/speeches\/address-blockchain-week-sydney\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> last month at Australian Blockchain Week 2022.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The Government will not be protecting consumers from market volatility. But Australian investors will be sure that if they use a licensed Australian exchange, they can trust that exchange to deliver on its commitments to its customers, and have appropriate protections.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jane Hume","content":"PERSON"},{"type":"ASX","content":"ORGANIZATION"},{"type":"Clearing House Electronic Subregister System","content":"ORGANIZATION"},{"type":"Australian Taxation Office","content":"ORGANIZATION"},{"type":"Australian Border Force","content":"ORGANIZATION"},{"type":"March 21","content":"DATE"},{"type":"Australia","content":"LOCATION"},{"type":"Melbourne","content":"LOCATION"},{"type":"2025","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Blockchain Australia","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Prudential Regulation Authority","content":"ORGANIZATION"},{"type":"63%","content":"PERCENT"},{"type":"August last year","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"18%","content":"PERCENT"},{"type":"Singapore","content":"LOCATION"},{"type":"Morrison Government","content":"ORGANIZATION"},{"type":"Cboe","content":"ORGANIZATION"},{"type":"Wayne Byres","content":"PERSON"},{"type":"Treasury","content":"ORGANIZATION"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}