{"summary":"Мaking a trade that involves leverage means one thing — higher risk with the possibility of higher return. For beginners, the mechanics of such a trade","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168276\/going-long-with-leverage-for-beginners","publishDate":"2022-09-07T08:23:22","id":7948,"type":null,"title":"Going Long with Leverage for Beginners","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Quick take:<\/span>","Мaking a trade that involves leverage means one thing — higher risk with the possibility of higher return. For beginners, the mechanics of such a trade may seem intimidating. Borrowing funds to execute a trade takes knowledge and time to master, but there’s a way to test the waters — all within a few clicks and with as much as 3x leverage thus exposing you to lower risk. The <a href=\"https:\/\/nexo.io\/booster?utm_source=theblock&amp;utm_medium=fixed&amp;utm_campaign=theblock_sponsored_post_aug22\" data-v-f87c67ca=\"\">Nexo Booster<\/a> is a tool that automatically executes a <a href=\"https:\/\/nexo.io\/borrow?utm_source=theblock&amp;utm_medium=fixed&amp;utm_campaign=theblock_sponsored_post_aug22\" data-v-f87c67ca=\"\">borrow<\/a> and <a href=\"https:\/\/nexo.io\/exchange?utm_source=theblock&amp;utm_medium=fixed&amp;utm_campaign=theblock_sponsored_post_aug22\" data-v-f87c67ca=\"\">exchange<\/a> transaction&nbsp; while opening a long position for you.","<b data-v-f87c67ca=\"\">The Long Leverage<\/b>","<span data-v-f87c67ca=\"\">Most crypto investors remain in the space because of their conviction that their asset will grow in value with time. Opening a long leveraged position means you are reinforcing that conviction. Whether you are sensing a short-term bullish case for your asset or want to fill your bags for the long run, with leverage you can acquire more and better position yourself in case price appreciates in time. The opposite of long would be the short leverage where you’re betting that the asset’s price will fall. In both cases, the bet you are willing to take is the assets you are ready to take a loan against.<\/span>","<b data-v-f87c67ca=\"\">Leverage Made Easy<\/b>","<span data-v-f87c67ca=\"\">The Nexo Booster allows you to open a long position with as little as 1.25x leverage. If you apply this amount for example you borrow $125 against your $100 worth of BTC. This in turn means that should the trade go your way and you exit your position at a profit, your potential return would be 1.25x higher than if you used your funds only.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Nexo Booster allows you to go as high as 3x. In other words, use one Bitcoin to borrow two more Bitcoins. Allowing you to go as far as 3x is done because the higher the leverage, the more sensitive your collateral (security for repayment) is to price movements. In an effort to provide a sustainable product, all loans issued by Nexo are given only to borrowers that meet the company’s strict collateralization requirements. As we’ve seen from this year’s events, this has proven to be a fundamental aspect when talking about any product that involves lending funds.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Now let’s see what happens to the two Bitcoins you’ve just added. They are automatically placed as collateral along with the one Bitcoin you used to initiate the transaction. The amount you need to repay is called outstanding credit. This is calculated as the value of the Bitcoin you borrowed against, plus interest (which on Nexo can go as low as 0%), plus a one-time Booster fee (as low as 1%). When you decide to exit the position you’re required to pay your outstanding credit first. You can do that by using the two Bitcoins you’ve borrowed. If their value has appreciated in time, you can sell them to pay the outstanding credit and pocket the difference. Another benefit of the Nexo Booster is that it allows you to <\/span><b data-v-f87c67ca=\"\">repay whenever you want, even in a year’s time. You can pay off your balance partially or fully with no fixed payment schedule.<\/b><span data-v-f87c67ca=\"\"> With the Nexo Booster, you can acquire any cryptocurrency on the platform and you get up to 0.5% back in rewards per transaction.<\/span>","<span data-v-f87c67ca=\"\">It’s important to know that in the event that the value of the crypto in your collateral depreciates drastically, liquidation — or automatic selling of your assets — can occur. To protect you from such an event, you receive a minimum of three margin calls (via SMS and email) prompting you to add more collateral and you can automatically transfer a small portion of your available assets to your credit line, thus keeping it in check.<\/span>","<span data-v-f87c67ca=\"\">Intuitive tools like the Nexo Booster make leverage trading more accessible. Bare in mind, that any form of leverage in crypto is considered risky. However, if it’s something you’d like to try it’s important to familiarize yourself with the term Loan-To-Value (LTV) ratio and how it’s calculated. You can do that and find out more about the Nexo Booster <\/span><a href=\"https:\/\/nexo.io\/booster?utm_source=theblock&amp;utm_medium=fixed&amp;utm_campaign=theblock_sponsored_post_aug22\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">here<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Nexo<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$125","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nexo","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"0.5%","content":"PERCENT"},{"type":"Nexo","content":"PERSON"},{"type":"0%","content":"PERCENT"},{"type":"LTV","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}