{"summary":"Tron had a critical vulnerability that put $500M at risk but it&#x27;s now &quot;resolved,&quot; according to the cybersecurity firm that found the bug.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232671\/tron-vulnerability-500-million-resolved","publishDate":"2023-05-31T07:02:11","id":7955,"type":null,"title":"Tron vulnerability put $500 million at risk; now &#x27;resolved&#x27;","category":["COMPANIES"],"content":["The Tron blockchain network had a critical vulnerability that put $500 million at risk but is now fixed — according to 0d — the cybersecurity research team at dWallet Labs that found the bug.","The critical zero-day vulnerability pertained to Tron's multisig accounts, which could have allowed any single signer to gain unrestricted access, potentially jeopardizing the digital assets held within, 0d <a href=\"https:\/\/0d.dwalletlabs.com\/game-of-tron-critical-0-day-in-tron-multi-signature-wallets-2c3e90668dc0\" data-v-f87c67ca=\"\">said<\/a> Tuesday. The vulnerability was reported on Feb. 19 by 0d to Tron via the latter's bug bounty program on HackerOne and fixed \"within days.\"","A Tron spokesperson confirmed to The Block that the network's team received a bug report from HackerOne, and the team then \"swiftly addressed the issue and applied necessary patches to ensure that the vulnerability could not be exploited.\"","\"We can confidently affirm that the identified problem has been effectively resolved, thereby securing the system,\" the spokesperson added.","The root cause of the vulnerability lied in an \"assumption behind the verification process,\" <a href=\"https:\/\/twitter.com\/omersadika\/status\/1663493096217116673\" data-v-f87c67ca=\"\">said<\/a> Omer Sadika, cofounder of Odsy Network, which manages 0d and dWallet Labs.","\"The verification process on Tron checked whether a specific signature was already tallied before it was tallied towards the threshold,\" Sadika said. \"So the assumption is that two different valid signatures for the same message can't be created by the same person.\"","While the vulnerability was critical, its solution was easy, according to 0d. \"Instead of checking the signature against the list of signatures, check the signed address against the list of addresses,\" it said.","Tron paid 0d $1,000 in bounty, the Tron spokesperson said, adding that \"both parties reached a consensus that it was a high-priority bug instead of a critical vulnerability.\"","Tron is the second-largest blockchain network behind Ethereum, in terms of total value locked and stablecoin circulation, <a href=\"https:\/\/defillama.com\/chains\" data-v-f87c67ca=\"\">according<\/a> to DefiLlama. The Tron TVL currently stands at around $6 billion and its circulation of stablecoins stands at over $45 billion.","<em data-v-f87c67ca=\"\">(Updates with a bounty amount)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Omer Sadika","content":"PERSON"},{"type":"Odsy Network","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$1,000","content":"MONEY"},{"type":"$500 million","content":"MONEY"},{"type":"Tron TVL","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$6 billion","content":"MONEY"},{"type":"Feb. 19","content":"DATE"},{"type":"Tron","content":"ORGANIZATION"},{"type":"Sadika","content":"PERSON"},{"type":"DefiLlama","content":"ORGANIZATION"},{"type":"$45 billion","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["JUSTIN SUN"],"authors":["Yogita Khatri","The Block"]}