{"summary":"Mark discusses his investing philosophy, bullishness on Bitcoin and blockchain, which economic theories best describe reality, the mistake of moving off of a gold standard, and why financial markets in 2019 may be a repeat of the dotcom bomb.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/21506\/mark-yusko-morgan-creek","publishDate":"2019-04-30T15:37:24","id":7958,"type":null,"title":"A Conversation with Mark Yusko, CEO and CIO of Morgan Creek Capital Management","category":["PODCASTS"],"content":["\n<style data-v-f87c67ca=\"\">\n\t.transcript {}\n\t.transcript .speaker {font-weight: bold;}\n<\/style>\n","<em data-v-f87c67ca=\"\">The following transcript is taken from episode two of The Scoop, The Block's new podcast. Listen below and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/a-conversation-with-mike-bodson-ceo-of-dtcc\/id1460134454?i=1000436159223\" data-v-f87c67ca=\"\">Apple<\/a>, <a href=\"https:\/\/open.spotify.com\/episode\/5vfblGUoYHykwZjYJJ9eQv\" data-v-f87c67ca=\"\">Spotify<\/a>, <a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" data-v-f87c67ca=\"\">Google Play<\/a>, <a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback to <a href=\"\/cdn-cgi\/l\/email-protection#a0d0cfc4c3c1d3d4e0d4c8c5c2cccfc3cbc3d2d9d0d4cf8ec3cfcd\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"abdbc4cfc8cad8dfebdfc3cec9c7c4c8c0c8d9d2dbdfc485c8c4c6\">[email&nbsp;protected]<\/span><\/a>. This transcript has been edited for clarity and length. <\/em>","<em data-v-f87c67ca=\"\">In this episode of The Scoop, Frank Chaparro and Matteo Leibowitz interview <a href=\"https:\/\/twitter.com\/MarkYusko\" data-v-f87c67ca=\"\">Mark Yusko<\/a>, CEO and CIO of Morgan Creek Capital Management. Mark is also Co-Founder &amp; Partner of Morgan Creek Digital, an asset management firm focussed on investing across the blockchain and digital assets industry. Over the course of an hour long conversation, Mark discusses his investing philosophy, bullishness on Bitcoin and blockchain, which economic theories best describe reality, the mistake of moving off of a gold standard, and why financial markets in 2019 may be a repeat of the dotcom bomb. As Mark says in the opening \"I'll give you the give you the short version, although I don't do short well.\"<\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK2780309330\" width=\"100%\" height=\"200\" frameborder=\"no\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span> I hope you enjoy the episode. So we are, I mean I'm very excited for this podcast. I was telling Teo before we came down here that I really think that this thing is made by the guests who are, I don't know if they're just gracious enough or thrill seekers but I'm the weakest link, Teo's the weaker link and we have the strongest link sitting next to me on my right -- Mark the Chief Investment Officer and CEO of <a href=\"https:\/\/morgancreekcap.com\/\" data-v-f87c67ca=\"\">Morgan Creek Capital<\/a>.","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark Yusko<\/span> Yeah. Morgan Creek Capital Management then we'll get to <a href=\"https:\/\/www.digitalassetindexfund.com\/\" data-v-f87c67ca=\"\">Morgan Creek Digital Assets<\/a> in a little bit.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> It's basically a fund of funds, we were talking about the structure before we turned on the recording equipment. Mark thanks so much for coming down or coming up rather from Raleigh, North Carolina.","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Woke up in North Carolina and here I am.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> Well thanks so much for joining us. Tell us a bit about just what Morgan Creek is and how it all got started and what you guys are investing in.","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Yeah I'll give you the short version although I'll warn you I don't do short well so I'll try to stay short. But so I grew up in the investment world I worked for an insurance company, an asset manager and then I got the call to go back to the alma mater. I went to Notre Dame back in 93' was the assistant investment officer there for five years and then left to be the Chief Investment Officer at University of North Carolina. Traditional asset allocation, manager selection, portfolio construction. We didn't really make the direct investments, we allocated money to managers. I was approached by a couple of families back in 2004, left, formed a registered investment adviser called Morgan Creek Capital Management. In 2004 we started managing money for individuals, wealthy families, family offices, smaller institutions that didn't have staff and that morphed from advisory work to fund of funds work to hedge funds, private investments and then about five years ago, kind of started to get into the rabbit hole of crypto and blockchain and then a year and a half ago we launched Morgan Creek Digital Assets which is a subsidiary of Morgan Creek Capital Management.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> But it all started when you were at University of North Carolina. These families, how did they know of what you were doing?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Great question. It's interesting, right? I went to North Carolina in 1998 and most people will not remember this but in 1996 <a href=\"https:\/\/www.investopedia.com\/university\/greatest\/julianrobertson.asp\" data-v-f87c67ca=\"\">Julian Robertson<\/a> who's a very famous UNC grad, famous hedge fund manager, ran <a href=\"https:\/\/www.bloomberg.com\/research\/stocks\/private\/snapshot.asp?privcapId=918104\" data-v-f87c67ca=\"\">Tiger Management<\/a> and he had a tough year in 1996 and they wrote an <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/1996-03-31\/fall-of-the-wizard\" data-v-f87c67ca=\"\">article in Businessweek called The Fall of the Wizard<\/a> and he was down 9 percent, the market was up 5 percent. And so North Carolina banned hedge funds. The board of North Carolina banned hedge funds. So I show up in 1998 and I said \"well you know the best managers in the world manage these hedge funds. People like Julian and others, I want to invest\" and they're like \"oh well we banned hedge funds.\" I'm like \"alright fine.\" We won't have any hedge funds, we'll have long short equity, opportunistic equity, enhanced fixed income and absolute return. And the chancellor says that's just nomenclature, right? I said Yeah. He said good as long as we're clear. So we did over the next two years leading up to the Y2K, move to about 40 plus percent in hedge funds, about 20 percent in private. And so from 2000-2002 when the average foundation endowment lost about a quarter of their assets when the market crashed in 2000, 2001, and 2002. We were flat. And so people heard about that and also I became known. It's kind of funny. Someone called me the Madonna of hedge funds because I was out there preaching hedge funds.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> You don't look like Madonna.","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> I don't look like Madonna, I don't sound like Madonna, I don't sing like Madonna. She's way more buff than I am. But I was out on the dais speaking at conferences saying you can't just be in stocks, bonds and cash. You've got to be in alternate investments, you've got to be in hedge funds. The talent is migrating from the traditional world to hedge funds and you've got to go there.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> It's interesting, there's almost a parallel about then in 2000, 2001 you were telling everybody this is where you need to be an investor.","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> It's even more parallel, back then, first time 1996. We go to our board at Notre Dame before I went to UNC, said we want to invest in hedge funds, we'll invest in this guy Julian Robertson and <a href=\"https:\/\/en.wikipedia.org\/wiki\/Daniel_Och\" data-v-f87c67ca=\"\">Danny Och<\/a> and his group. And <a href=\"https:\/\/en.wikipedia.org\/wiki\/Richard_C._Perry\" data-v-f87c67ca=\"\">Richard Perry<\/a> and they're like, \"No, that's where all the bad guys are. You know we're fiduciaries. We can't possibly invest in hedge funds. Those are risky.\".","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> So how did you convince them?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Well just showed them the data, right? Data doesn't lie.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> Unless you're in crypto.","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Well yeah unless you're in crypto. Right, right we could talk about that. So one of my early bosses said <a href=\"https:\/\/quoteinvestigator.com\/2010\/11\/15\/liars-figure\/\" data-v-f87c67ca=\"\">\"figures lie and liars figure\"<\/a> but the data, the actual data doesn't lie. So what's interesting about <a href=\"https:\/\/www.investopedia.com\/terms\/m\/modernportfoliotheory.asp\" data-v-f87c67ca=\"\">Markowitz theory<\/a>, right? Harry Markowitz won the Nobel Prize and he said if you take bonds and you add stocks, risk goes down. If you add real estate and hedge funds, risk goes down. Everybody was like, no that can't be right. Well he won the Nobel Prize, it's right. And so we showed them the data, both at Notre Dame and then again at UNC. And the proof in the pudding is in the eating, right? Our results spoke for themselves. You know we had really good results as we increased our allocation. It makes sense, in what business do you know does the best person not charge the most money? Doctor, lawyer, football coach, basketball player, same thing with asset management. The worst people are going to stay managing index funds because it pays the least and the best are going to go run where they can get <a href=\"https:\/\/www.investopedia.com\/terms\/t\/two_and_twenty.asp\" data-v-f87c67ca=\"\">2 and 20<\/a>. And so we saw this migration of talent and we follow the talent, follow the money, follow the talent and we allocated capital there and it worked. But it's very similar to today in that back then nobody wanted to do hedge funds. They were afraid of hedge funds, like I said UNC had banned hedge funds -- that's where all the evil dark sided people were and oh you're not American if you short stocks, I'm like no, it's really American to tell people to buy stuff that's egregiously overvalued that's going to go down. Yea that's really American. No what's American, is calling out frauds and fads and phonies and all the overvalued assets, that's what a good hedge fund manager does. We made those changes, that worked out so fast forward to today, where are all the bad guys?","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> In crypto.","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> In crypto. And so trying to convince people to go in that direction. What's interesting is that I have this partner, I think you've had him on the show or willl have him on the show. But <a href=\"https:\/\/twitter.com\/APompliano\" data-v-f87c67ca=\"\">Anthony Pompliano or \"Pomp\"<\/a> as everybody knows him. He's got <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/off-the-chain\/id1434060078\" data-v-f87c67ca=\"\">his own podcast<\/a> and all this good stuff. But he and I met two years ago through an investment in Lyft and we're both making late stage venture investments. We also do early stage. He did some early stage stuff, something called <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2018-03-27\/morgan-creek-acquires-full-tilt-capital-for-blockchain-push\" data-v-f87c67ca=\"\">Full Tilt Capital<\/a> and we met and didn't spend much time together. We met, we did this investment. Great. About six months later I start following this guy on Twitter. Turns out it's Pomp and I like, like, like, like, like, everything he said either would have come out of my mouth or I'd said it -- I got to meet this guy.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> I've got to find out what the virus is all about.","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Exactly. The virus is spreading. So we sit down for breakfast, get together for breakfast the next day and then the next week and then after a couple weeks I say we should work together. So, he describes it best in the sense of, sounds better when he says it but if you take the two groups, take the crypto kids -- they all wear black T-shirts and sit on the side of the river and they look across the other side and they look at the institutional old guys like me and say \"don't look like them, don't like them, don't trust them'. And the old guys in the institutional business look across the river and say \"don't look like those guys, don't trust them\". And they're not going to work together but there in the middle, there's four or five guys who've crossed the chasm, <a href=\"https:\/\/www.theblockcrypto.com\/2019\/03\/26\/key-employee-exits-as-john-burbanks-passport-capital-attempts-to-execute-its-complicated-bet-on-crypto\/\" data-v-f87c67ca=\"\">John Burbank<\/a>, <a href=\"https:\/\/www.theblockcrypto.com\/2018\/11\/11\/3-major-execs-have-left-mike-novogratzs-galaxy-digital-as-the-firm-makes-a-big-pivot\/\" data-v-f87c67ca=\"\">Novogratz<\/a>, <a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/22\/mapping-out-pantera-capitals-portfolio\/\" data-v-f87c67ca=\"\">Dan Morehead<\/a> and this Yusko guy and Pomp said well three of those guys are traders. We don't want to be traders but this Yusko guy, he's actually managed billions of dollars, he's got infrastructure he's got salespeople, he's got back office people. Maybe we could create this bridge across the river between the instititutional capital and the people who have this knowledge about this emerging technology.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> But before you and Pomp sort of came together ahead of your meeting of the minds and identified the synergy between the two firms, you had had your own crypto journey, right? You came into contact with Dan Morehead, the Tiger Management sort of mafia so to speak. And you had your own coming of age story with crypto from 2013 til when I guess you met Pomp maybe a year ago? When did the deal close?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Well we met in 2017 and we really put Morgan Creek Digital together last year in 2018. But yeah to your point, we all have a crypto journey, we all see the crypto light and I say what's interesting about this, is everyone I know who's intelligent starts skeptical. That's the way you should start, right? With anything new you should start skeptical. And then, I call it ignorance displacement theory, right? <a href=\"https:\/\/en.wikipedia.org\/wiki\/Archimedes%27_principle\" data-v-f87c67ca=\"\">Archimedes discovered this displacement principle<\/a> by getting in the bathtub and boom, the water displaced. And it's the same thing with ignorance. We all start ignorant about something -- that doesn't necessarily mean in the negative connotation, it just means we don't have knowledge. But as we gain knowledge about something, anything, how to play golf, how to play poker, whatever it is whether it's investing crypto...","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> Ricky, which we play sometimes, you ever play Ricky? You gotta try it","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> No, no so see I'm ignorant so I would be the patsy. If you're in a game for 20 minutes you don't know who the patsy is, stop playing. So we won't play. I was ignorant and so I met Dan Morehead who I had helped seed when he launched Pantera Macro when he spun out of Tiger. I've known Dan twenty five years, we've been investing with pretty much all the Tiger Cubs over the years on the hedge fund side. And we had a great relationship and he in 2013 said \"hey I'm shutting down the macro fund, sending your money back and I'm going to do these two funds in crypto\". I don't even know what you're talking about but tell me more. He says \"well there's this thing Bitcoin, we're going to start a <a href=\"https:\/\/www.newsbtc.com\/2013\/12\/31\/fortress-investment-group-reportedly-starting-Bitcoin-fund\/\" data-v-f87c67ca=\"\">Bitcoin fund and the founders of Fortress are putting money in<\/a> and it is really interesting. And then I'm gonna do this infrastructure fund to back companies that are gonna help build that\". I'm like ding ding ding ding ding. I'm a picks and shovels guy. I like infrastructure. Okay I'll do that. That was the first of my many bad decisions in crypto because that fund's been great. It's about a 9.6X. We'd all say that's awesome. I should have put the money in Bitcoin fund. That's like 86X including the crypto winter. It's the best performing hedge fund of all time. So fast forward another couple of years I'm starting to think more about this. I wrote, actually it was just a year, I wrote, remember when Bitcoin had bounced to a thousand and then it dropped about 400, first quarter of 14'. I write these long letters. I mean they're long, like 40 50 60 and my last one was 83 pages. \"Why do you write such long letters? Like they're too hard to read\". They're not for you. They're for me. It's how I learn, by writing and how I get my views. And so I wrote one paragraph on Bitcoin in a 60 page letter and I had clients say we'll fire you if you don't stop talking about this crazy stuff.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> How many?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Pardon.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> How many clients?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Half a dozen. Half a dozen people called, literally took time out of their day. So that means how many people thought it? But half a dozen people called up and said stop talking about this. This is crazy. We don't wanna hear about Bitcoin. Now that was at 400 but it went to one hundred seventy five. Okay. They were right. That was September that year. And then boom, goes all the way back to 1000. So, 2015 my son's graduating from Notre Dame where we all went and I said go meet with Dan and just talk to some companies and he talked to a couple of companies, Coinbase and a couple others and he comes and he says \"I don't know Dad I just I really want to live in San Francisco but I think I'm going to go with KPMG.\" Safe, easy. Okay great. Great decision. So we're having Thanksgiving dinner last year and he's like \"All right fine. You were right. I should go gone with one of the crypto companies. But you're not as smart as you think you are.\" I'm like \"oh, tell me why?\" He says, \"you didn't mortgage the house up and put it all on Bitcoin.\" I'm like \"Ah, touché!\". All right. So again, told you I've made many bad decisions but the key was I had this beginning of this relationship with the infrastructure side vested in Coinbase and <a href=\"https:\/\/www.xapo.com\/\" data-v-f87c67ca=\"\">Xapo<\/a> and a couple other infrastructure companies. <a href=\"https:\/\/www.crunchbase.com\/organization\/korbit\" data-v-f87c67ca=\"\">Korbit<\/a>, good outcomes. Then we started to dabble in crypto itself and that was kind of 2015, '16 and a couple of our clients instead of saying they'd fire us they said, this is interesting, tell me more and it did a little bit. And one of the good things, we weren't as forceful.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> Now was that through the hedge fund part of the business?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> It was in our private side of the business. So we have private funds that do fund of funds. We have hedge funds of funds and a hedge fund. And so we did everything more in our private funds.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> And so what was the exposure to clients in terms of...?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> What we told people was we should do 1 percent in crypto itself because of the asymmetry of it and then you should put another couple percent in infrastructure related to it. So a couple, 2-3 percent, not crazy allocations but we thought the asymmetry was really high. And when you look at traditional assets today, one of our big themes right now is get off zero <a href=\"https:\/\/twitter.com\/hashtag\/getoffzero\" data-v-f87c67ca=\"\">#getoffzero from Twitter<\/a>. And the key is that 0, 10 years from now you look back it's going to be the wrong answer. As a fiduciary, no exposure crypto assets are going to be the wrong answer. So it doesn't have to be 10 or 20 or 30 percent because the asymmetry is so large. So we started to small, started to allocate and that's when I had this meeting with Anthony and a couple other people too. But it was really that meeting with Anthony 18 months ago.","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> So we started down the path of building what we called Morgan Creek Blockchain Opportunity Fund. So we had the documents we were all ready to go and Pomp and his partner Jason Williams had this thing called Full Tilt Capital, they were doing early stage investing, kind of professionalizing friends and family. And we got together and said hey let's merge, we'll bring you guys on as the team to do the blockchain opportunity fund and we'll flip flop our normal model. Our normal model was 70 percent funds, external managers, 30 percent co investments. So we'll flip flop it and we'll go 70 percent in direct deals, we'll go 15 percent in external managers so we'll invest in a Pantera or Blockchain Capital or something else and then we'll do up to 15 percent directly into crypto. And so, we launched that, we went out to raise 25 million bucks. We actually were oversubscribed, <a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/12\/morgan-creek-digital-raises-over-40m-for-a-venture-capital-fund\/\" data-v-f87c67ca=\"\">we raised 40<\/a>. But the big thing is we got institutions to come in. We got six institutions, because most of the money so far has been high networth individuals but we got six institutions and the big one for us is we got two public pension funds and that was amazing because they're usually not early adopters but we had two great CIO's, real leaders. They both invested personally. We got to their boards and survived the board meeting ordeal.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> That's interesting, we can get into that like what maybe the board meetings were like but something that I was thinking about when that news came out you know 2 massive, I think it was the fireman's fund of Fairfax County. Right. To what degree is this something that's going to impact the investment return of the folks that're investing for when it's just this massive fund that, at the end of the day is only getting limited amount of exposure is it that big of an ask to convince them?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> That's a really good question and a lot of people would say no. If you only put you know half a percent or 1 percent, it can't move the needle. Not true, venture capital. So 1996 I was at Notre Dame and we invested five million dollars in this venture capital company called Sequoia. In 1996 Sequoia was not famous, <a href=\"https:\/\/www.sequoiacap.com\/people\/michael-moritz\/\" data-v-f87c67ca=\"\">Michael Moritz<\/a> hadn't even done a deal yet. He was a reporter for The Wall Street Journal. Don Valentine hired him over and we backed him, of that five million dollar investment they put half a million into this little company called Google and we took out two hundred million dollars. There should be a quad at Notre Dame called the Google quad. So you can have little tiny investments, make a gigantic impact on the overall fund, if they have the right asymmetry. You're never gonna get a 400X return buying stocks in an index fund. You're never going to get a 400 percent return buying bonds or high yield bonds or even...","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> But when a massive pension fund is investing hundreds of millions of dollars. The point I'm trying to get at is do they really care if they're going to throw a couple million or small percent?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Absolutely they care.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> Why do they care?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Because venture capital is all about asymmetry and what you're doing is you're making small bets in areas where you can get in front of a big trend. Whether it be cloud computing. Whether it be blockchain technology and we can spend I mean I'd love to spend time talking about this is -- what people confuse is they think crypto is a thing. They think that you know Bitcoin's a thing. What they're missing is this is a technological evolution -- that's what I wrote <a href=\"https:\/\/www.morgancreekfunds.com\/wp-content\/uploads\/2019\/03\/mccm-4q2018_market-outlook.pdf\" data-v-f87c67ca=\"\">my last letter on financial natural selection and Darwin<\/a>. This is the evolution of technology. Started in the 50s 1954 the mainframe, 68 with the microchip, 82 at the personal computer, 96 with the Internet, 2010 with the mobile net and 2024 we're still five years from now is the trust net (my term, use it liberally) and we want to call it the internet of things or the internet of value but it's the trust net. We're using blockchain technology to establish a single point of truth or trust and we don't need that intermediate trusted third party and what it does is the same way DOS created an operating system for computers, personal computers. And Steve Ballmer, in 1982 going to work for Microsoft. His mom's like why would anyone want a computer in their house? He has 18 billion reasons to say mom I was right. So then in 2010, or in actually 2005 Google bought Android, people were saying what're you doing buying Android? Well now they have 80 percent market share globally of mobile phones operating system. And so the same thing is going to happen here with blockchain over the next 5, 8, 10 years. Blockchain will drive every meaningful company, every meaningful network, every meaningful system on the planet. It is this technological wave that will give early investors huge multiples.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> This is the pitch. This is something like what you might have been saying in front of the board potentially?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Perfect example, in the board meeting, police board. Two and a half hour board meeting, we're grilled every which way from Sunday, right? They had a 200 page due diligence questionnaire that we had to fill out. You know Pomp tells the story great, he's like I've never written 200 pages in my whole life about anything. And you know I was operating out of a coffee shop so I couldn't do a 200 page due diligence document. We already had it done. So that was why the institution trusts Morgan Creek. We want to be the trusted advisor to the digital age or in the digital age. We want to be somebody that institutions can trust because we come from the old world embracing the new world. And so we're at this board meeting, two and a half hours. We get to the very end and it's right out of central casting. Police officer, Harley Davidson parked outside, helmet, uniform, helmet on the table, gun on the table, sunglasses, mustache, right off a TV screen. And he says \"All right let me get this straight. I've got to go tell my guys that I just approved putting their pension in drug dealer money\" and I'm like \"whoa no no that is not what you're going to tell them. No, what you're gonna tell them is this, that today as a fiduciary you look at bonds and you're gonna make 3 percent for the next 10 years. You look at equities you're gonna be lucky to make 3 percent. We have an actuary assumed rate of seven and a half. The only way we're gonna get that is by having diversifying assets that have a greater asymmetry to them.\" And that's venture capital and venture capital in new technology that is going to use this emerging technology and make it mainstream. If you think about new technology the first users are always the bad guys. Who was the first person with a pager? Drug dealer. Who was the first person with a cell phone? Drug dealer. Who's first person to use the Internet?","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> 100 percent. I mean I have an uncle who worked in the telephone industry in the 1980s and he was telling me how like back then, it was a conversation over Thanksgiving dinner where you know obviously I talk about what I write about, what I do and how the industry as you alluded to before is associated with criminals crooks etc. and he was saying \"Well, Frankie back in the 80s when grandpa Bill and I were working in the telephone industry what we would do is we would sell\". Actually I honestly don't think I should say this. They would basically configure the technology so that you could skip ahead calls and so you skip ahead calls and so everyone would look at telephones as in the beginning as this sort of shady thing. And I think every new technology has that.","<span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span> I have a question. So when you're pitching to these funds and to other clients, do you pitch this as a technological revolution or as a monetary revolution?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> So yes and yes. It is going to evolve even within the technology itself. And if you think about it, today we have the most successful blockchain is the Bitcoin blockchain, right? Most powerful supercomputer in the world 1,500X more powerful than the next highest supercomputer. Never had a fraudulent transaction. Never had one second of downtime. Bar none most powerful computing system in the world. Okay that's interesting but what is it really good for? Well right now it's really a store of value. It's digital gold. Now it's also being speculated in but it really is digital gold. So it's a crypto commodity. And at the end of the day there are only four assets that people can invest in: stocks, bonds, currencies, commodities. Ultimately we had analog, right? Physical pieces of paper. Then they went electronic, where we are today we have cue sips that represent analog physical pieces of paper at DTCC. And eventually we'll have digital. Crypto, another word for digital just means cryptographically secure. So we have crypto commodities, right? Bitcoin is a crypto commodity. Now people want it. Satoshi son theoretically wanted to be a cryptocurrency -- a medium of exchange, a payment rail that will come. The challenge is, it's like when you're building a house. <a href=\"https:\/\/medium.com\/@devsociety_\/good-cheap-fast-pick-two-and-how-ngos-can-play-the-triangle-like-a-pro-20d1380884a8\" data-v-f87c67ca=\"\">Good, fast and cheap, pick two.<\/a> You can have a good and fast but it won't be cheap, you can have it good and cheap but it won't be fast. You can have it fast and cheap but it won't be good. So in technology you can have fast or secure, can't have both. So Bitcoin chose secure, so it's the most secure network but is not fast. So we're gonna have to build second and third layer systems just like Visa's not money. We use it like money. Every day everybody uses it but it's a payment rail and everyone says oh well we can't compete. Bitcoin can't compete. Of course not, not yet because it's only 10 years old. But it is a application of technology that will ultimately become a monetary revolution. I have this great chart that I use in these presentations. If you go back five thousand years, gold has been money for five thousand years. There've been seven hundred seventy five paper currencies in the history of mankind. Three quarters of them no longer exist. The <a href=\"https:\/\/en.wikipedia.org\/wiki\/Solidus_(coin)\" data-v-f87c67ca=\"\">Romans Solidus<\/a> which wasn't paper it was actually a copper coin was the most powerful currency in the world for a millennia. Today it's a trinket, I have one in my bag, cost a dollar in Italy. In fact the word solid comes from that. If you had a Solidus you were a citizen, you were solid. Now that's gone away because governments spend too much and they crash and empires fall and all that good stuff, that'll happen again in America. But what happened is, paper currencies have this problem with being unsound money, fiat currencies eventually fall. So for five thousand years one ounce of gold bought a fine man's suit. In 1973 we left the gold standard. Nixon's calamity and we since then have started the slow long journey into calamity which is the disappearance of the purchasing power of our currency. Same thing happened in Zimbabwe or Venezuela or Argentina. All these things will happen because fiat is unsound money. So what I have is this great chart that looks like a big X and if you think about it, fiat started at 100 percent market share and it's going to zero. Crypto started at zero market share, it's going to a hundred. Not gonna happen overnight but it's going to happen over time. And cryptocurrency will replace fiat currency over the long term. It will also become payment rails. Then ultimately we'll have crypto bonds, crypto stocks that will be digital representations of those ownership assets and ultimately everything in the world.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> Investors are known to be a finicky bunch right? How do you convince them along the ride like you know in my reporting over the course of 2018 there were LP lawsuits, there were funds shutting down especially on the Long Tail, most of these guys just operating out of their garage or their mother's basement but for a firm and institutional type firm like yourself, when you're looking at something that sounds so long term, something that's going to going to replace money. A new system of trust. How do you convince investors that this is worth their time over the next 10 years, especially when you have things like <a href=\"https:\/\/www.theblockcrypto.com\/2019\/03\/15\/mt-gox-ceo-karpeles-motion-to-dismiss-denied\/\" data-v-f87c67ca=\"\">exchange hacks<\/a> and you have things like <a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/19\/sidechains-a-technical-and-historical-overview-of-what-works-where-were-going\/\" data-v-f87c67ca=\"\">network scalability<\/a> issues which Teo's diving into all the time and the fact that we're not seeing merchant adoption on the Bitcoin front?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Education education education. Every technological advance takes longer than you think, has setbacks and things that people point at that say it's not going to work, it's not going to happen. The Internet: <a href=\"https:\/\/www.snopes.com\/fact-check\/paul-krugman-internets-effect-economy\/\" data-v-f87c67ca=\"\">Paul Krugman said \"it will never be more important than a fax machine\"<\/a> I'm thinking the Internet's more important than a fax machine.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> Is that how you convince them? You just go to them and say here's what Paul Krugman said?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> No it's about education. The first hurdle is to get them to stop thinking about it as a thing. Don't think of it as a thing that your nephew did and told you about it at Thanksgiving dinner and you put money in in 2017 and you lost a bunch because you speculated and you bought in at the price that was well above fair value and it went below fair value. Investing is a really simple concept right? If you buy things below fair value and you hold them, you make money. If you buy things above fair value and you hold them, you lose money. It's pretty simple. And so people who bought crypto in the you know herd of people in 2017 when Bitcoin was touching 20 thousand, lost a lot of money and they rightfully don't trust it. But they were investing for all the wrong reasons. They didn't understand the technology, they didn't even understand that it was technology. All they knew was it was something moving, it was shiny and that's true of everything. Internet stocks, Pets.com, MySpace, I was doing my research for a presentation I'm doing and there's actually a cover: <a href=\"https:\/\/images.app.goo.gl\/VhheTgLyECi1YKxk7\" data-v-f87c67ca=\"\">Don't mess with MySpace.<\/a> MySpace is going to out Google Google and out PayPal PayPal. They're gone, they disappeared. Technology is going to have winners, it's going to have losers and everyone has experienced that, particularly in the institutional world, they've all been through looking at a technology, whether through venture capital or private equity or private energy or other forms of private investing and it's always a small piece of their portfolio. The bulk of people's wealth is always in the public markets and the public markets the problem with it is you get lots of volatility and now you get the machines and high frequency trading and then you've got people doing stupid ass stuff like you know <a href=\"https:\/\/www.fastcompany.com\/40558198\/surprise-the-long-island-iced-tea-blockchain-pivot-didnt-work\" data-v-f87c67ca=\"\">Long Island Iced Tea turning themselves into Long Island Blockchain<\/a>.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2017-12-21\/crypto-craze-sees-long-island-iced-tea-rename-as-long-blockchain\" data-v-f87c67ca=\"\">I was there for that IPO.<\/a> When I was at Nasdaq. I remember drafting the press release for Long Island Block.... Well no, it was Long Island Iced Tea at the time","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> And here's a crazy thing. We had a company back in the boom in 2000, so we'd invested in the company that helped companies turn their name to dot coms. That's all they did. It went public and our cost was 50 cents. Stock went public, traded to a hundred and four dollars. We were restricted, once we got off restriction I call the venture capital and ask what should we do? He says I can't talk because I'm an insider but I can say two things. Revenue, six million. Market cap, six billion and there was a silence and he asked Mark did you hear? Yeah I got to go, bye. Sell sell sell sell sell! And we sold around a hundred and it went to four. Think about that, if your cost is 50 cents, four is still an eight bagger, that's still pretty good. But we made two hundred X because we got out. The key is there are lots of those examples in institutional portfolios from a prudent allocation to venture capital, growth equity or private investments. The same education process around this, it's convincing that police officer that we were doing a fiduciarily correct thing and what he said was I can support that. In fact he was quoted in an article where the reporter's came in and said \"what are you guys crazy investing in drug dealer money?\" He said we're not investing drug dealer money. We're making a prudent diversifying investment in our portfolio so that we can achieve our long term actuary assumed rate and serve our beneficiaries.","<span class=\"speaker\" data-v-f87c67ca=\"\">Matteo<\/span> You mentioned this sound money and phenomenon. And the loss of purchasing power. Would you say that you consider yourself an Austrian economist, do you fall into that category? Have you always fallen into that category?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> I probably lean that way. I'm not all in but I definitely don't believe in voodoo economics. You know like supply side economics. I definitely probably have a little bit less of a leaning toward the monetarists. I think inflation is not a monetary phenomenon, I think it's a demographic phenomenon. When you have a lot of young people you have a lot of inflation, when you have a lot of old people you have a lot deflation. So I think from a monetary perspective in terms of sound money I'm definitely more of an Austrian. I think the gold standard was right in the sense that for five thousand years it has been pretty consistent.","<span class=\"speaker\" data-v-f87c67ca=\"\">Matteo<\/span> But we've also seen some massive growth in GDP since the US moved off the gold standard.","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Well I'll argue that has nothing to do with the gold standard and everything to do with demographics. As the baby boomers started turning forty five and from forty five to sixty five you're the most productive in your life. You spend the most. We also have a very good system of fractional reserve banking and fractional reserve banking is the key. To me it's the expansion of credit through fractional reserve banking. Now you can do that with sound money, you don't have to devalue the currency to have fractional reserve banking. If you do both, arguably you can juice the return. The problem is you get on this treadmill of if you don't continue to increase the liquidity and the credit you're going to crash and that's where we are today. That's why we had the president or the tweeter in chief telling us that the Fed must continue to cut rates.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> What do you think of Herman Cain coming on board?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Well I guess I have to like the fact he said we should go back to the gold standard. I guess I have to like that but I don't like anything else about the guy.","<span class=\"speaker\" data-v-f87c67ca=\"\">Matteo<\/span> In order for Bitcoin to realize these asymmetric returns, does the dollar have to collapse? Do we have to see this return to a sound money economy?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Great question. No. For for Bitcoin to have truly asymmetric returns like the the 50X, 100X returns that some people believed. From this point forward, I think what you have to have is network effect continue and start to move out of, S curves are really interesting. So S curves, you start with the innovators, the 1 or 2 percent then you go to the early adopters and then you go to the late majority or the early majority rather than the late majority than the early adopters and then the masses. And we're only at the very knee of the curve. We're like 10, 11 percent adoption. So it's that exponential and human beings are bad at math generally. We're really bad at anything that's not linear like we can do linear math, two times two, four times four. But if you ask somebody 17 times 21 that's actually been proven to be the limit of human intelligence. People can't do that without a calculator. If you ask them to do squared or you know cubed or quad they can't do it. So that's part of the challenge, there's <a href=\"https:\/\/www.brainyquote.com\/quotes\/bill_gates_404193\" data-v-f87c67ca=\"\">a great quote from Bill Gates<\/a>. You mentioned it earlier Frank in the sense that we always overestimate what we can accomplish in two years and underestimate what we can accomplish in 10. And that's because we don't understand the compounding effect.","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> For Bitcoin to really achieve, I had this great tie that Vanek gave me it's got gold on one side and Bitcoin on the other with a little scale for Bitcoin gold equivalents and that's where I think the first step is, if gold is a seven and a half trillion dollar asset and Bitcoin gets there with 20 million coins or whatever we got 17 million coins, we can get somewhere between 400 and 500 thousand dollars per coin. They would say ah well that's ridiculous. Well no it's not ridiculous all we have to do is go to <a href=\"https:\/\/en.Bitcoin.it\/wiki\/Satoshi_(unit)\" data-v-f87c67ca=\"\">Satoshi's<\/a>. And then the unit doesn't make people freak out, we can go to eight decimal places and make the per unit value pretty small but a single coin, of which there aren't enough of if every millionaire in the world wanted one, so we're going to end up with Satoshi's anyway. That demand I think has to come from organic growth and people saying I want to use it. I want to use it for its convenience but we need infrastructure. And that's why our first investment fund is all focused on infrastructure. We'll let other people who want to play in the speculating in the currency itself do that. And we have the digital asset index fund that we partnered with bit wise to give an institutional quality. We want be the S&amp;P 500 of crypto. Why the S&amp;P 500? Well the S&amp;P 500 is run by a committee. So we have a committee and they decide what goes in what goes out and there's a second criteria which is it has to be things that aren't controlled by a single entity. So we kick out Stellar and and XRP not because we have anything against them but because they're centrally controlled. So we want that to become the S&amp;P 500. There are lots of indices but people trust the brand of the S&amp;P 500. And so over time we'd like people to have a portion of assets in crypto itself. But right now we want exchanges, protocols, tools, infrastructure, data, all those things.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> But what are we going to see in the near term in terms of actual use cases rolling out, there's a lot of talk that we're looking at at The Block with centralized finance and you know synthetic derivatives and things like decentralized lending. This idea that Bitcoin will replace or at least eat into what gold functions as seems like something that's way down the line. Maybe 10, 15 years","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> I don't think it's way down the line at all. Ask any thirty five year old how much gold they have. Zero nada zip. Ask a sixty five year old how much Bitcoin have. Zero nada zip. So you've got this divide across generations. I'm not saying that Bitcoin will replace gold. I think it's digital gold. The problem with gold, I don't know if you've ever seen the movie Knight's Tale. It's one of my favorites, you got to watch it. Heath Ledger, classic. This weekend you got to watch it. Love this movie. It's all about jousting and you know the main character goes around winning these jousting tournaments and they always give him gold and there's this one scene where he's got a gold calf and he wants to give a piece to his squire and he literally bangs the calf and breaks off the legs and says here go do something with that. That's a really inexact way to divide your gold. It's also heavy. If you want to transport a lot of money across state lines it's really hard to do. Whereas, I say all the world's gold fits into Olympic sized swimming pools. All the Bitcoin in the world fits right here, on my phone. Now I don't have all of it in the world in fact I don't have any on my phone because I've been sim swapped twice, which is ridiculous.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> Someone tried to steal your identity, right?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> It's a crazy world that we live in.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> I get the potential for Bitcoin to replace gold in some aspects especially among the younger folks but what do you see happening very soon, more broadly throughout crypto?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> I think payment rails are already starting. I think you are starting to see people be willing to not just be a hodler but to actually use it as a medium of exchange. I think that's positive. I think you will see more people accept it. I was in New Orleans not for Mardi Gras because my wife didn't want to go then but right before and there were a couple of places in New Orleans that will accept Bitcoin for payment. There's not a lot but what we need is we need better wallets. We need better technology on our phones we need the ability to kind of segregate our hodling store of value stake and our payment piece, where we don't care if we spend a little and get a little.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> We probably have to get more people like you, funds like you comfortable with investing in this market. What are the headaches when you think about allocating capital to this market. We talked about disclosures and such, there's a legal hurdle, there's an education hurdle. But just from the reporting and you think of things like in the traditional Wall Street world, things like prime brokers that extend leverage or rather margin to, what are we missing?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> We're missing everything. We're making progress though, right? We have companies like <a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/29\/blockfi-scores-new-funding-from-coinbase-ventures-to-kickstart-international-expansion\/\" data-v-f87c67ca=\"\">BlockFi<\/a> that are starting to make crypto loans. We've got infrastructure custodians that are starting to get qualified custody status that'll make the institutions happy. We need all of these things.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> Yea but it's like a trust from North Dakota.","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> I understand, Wyoming's right behind was doing great work in Wyoming and now South Carolina is trying to copy what they've done. Good artists borrow, great artists steal. So we want to steal whatever we can get. We are still five years away from the point at which we deem this the next technological wave. This is the cool time to invest and there's so much that's going to change and so much is going to happen and every piece of it is incremental and iterative. But what I love about it and I say this all time, this is the greatest wealth creation opportunity I'm probably ever going to see in my lifetime. Why? Because when the Internet came along, it was building on, pardon my French although I said that once and someone said why do you say that we're not vulgar? So you know it's built on crappy shit. The stuff that was in the technology world at that point was not very good. Trying to do Netflix when it was first envisioned. Video on Demand didn't work because dial up modems were too slow and it almost died. I mean Netflix almost died and it wasn't until we got broadband and we kind of got that from the Koreans that we really started to seize that opportunity. So the same thing that has to happen is the technology of the Internet enabled all of the things around information exchange. In the old days I sent a letter to somebody. Three days later they got it. They spent a day thinking about it. They wrote something down, three days later I got it, I got a response. Think about that, that's seven days. I joke my wife can't wait seven seconds to get a response on a text. But the key is that that got even better when we went to mobile phones. The mobile net because the Internet had a few connected devices, personal computers. Now we have 10 billion cell phones, I don't know why we call them phones because no one talks on them but supercomputers that we hold in our hand, there's 10 billion connected devices. Within five years we'll have two hundred billion connected devices and that language, that operating system is blockchain and it's going to drive payment between things. You'll sit in your autonomous vehicle, you'll drive into the charging station, it will instantaneously charge and you'll drive away. The car will make the payment to the charging station, you won't get out I won't get out we'll be in the back doing whatever we do but the car will interact with the charging station or you'll walk into a store and you'll grab what you want and the payment will happen between your cart or your wallet or whatever and the thing. It's already happening. All these things are are going to be developed and the people who benefit the most are always the ones that embrace innovation as an asset class. As I said there are four assets: stocks, bonds, currencies and commodities. But I say there's a fifth asset which is innovation. If you look at the best investors on the planet whether it's Yale or Notre Dame or UNC or some of the good pension funds like Chris Aleman, it's <a href=\"https:\/\/www.calstrs.com\" data-v-f87c67ca=\"\">CALSTRS<\/a> or some of the others. There are these leaders who always figured out that it's innovation that drives wealth creation and this wealth creation opportunity is so much bigger. The Internet created multi multi-billion dollar companies centabillion dollar companies. The mobile net created the first trillion dollar companies with Apple and Amazon. This is going to create the first trillionaires.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> But before that happens, it's still a 200 billion dollar market, there's still trillions of dollars of other assets floating around the world that you as an investor need to be thinking about and need to be thinking about where the opportunity is. We were watching <a href=\"https:\/\/www.cnbc.com\/video\/2019\/02\/13\/were-in-a-bear-market-that-will-extend-to-2020-says-mark-yusko.html\" data-v-f87c67ca=\"\">the video of you on CNBC, you were calling for a disaster in 2019<\/a>. In terms of the stock market. Best Q1 I think since the 80s in terms of well we can get to...","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> It was only a good Q1 because you had such a crappy Q4.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> But real quick though before we get into what your crystal ball about the markets is saying, before that I just want to know what you think about generally opportunities elsewhere outside of crypto as a fund. What do you look for, as a fund of funds and as a direct investor, what opportunities do you look for outside of crypto?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Our job as an advisor is to have a view on every asset. From stocks to bonds to currencies to commodities to private markets to public markets. And what's interesting is, I would say it's just math, #justmath and every asset has an intrinsic value and has the present value or current value and that current value can be above or below the intrinsic value and then it's either overvalued or undervalued. We like to buy undervalued things and sell overvalued things, pretty simple. Now the problem is things can become more overvalued. So let's just walk through all the assets. Cash last year in 2018 outperformed 98 percent of global assets. How many people were overweight cash last year? No one.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> You guys were though, right?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> We were overweight, we weren't super overweight. But think about that, cash outperformed 98 percent of global assets. Now all of that outperformance happened in three months. So you were you were underperforming for nine months until September 21st. That's when the bear market began in my mind. And since then the next three months you totally made it up and you actually went ahead for the year. So you fast forward and you say like this year you had a good first quarter in equities. Well that's true but it's only because you had such a crappy fourth quarter. Today U.S. stocks, global stocks, dead money since January 26, 2017. I'm sorry 2018. Since January 26, 2018 so 15 months, dead money, no return. That's not a good outcome. I'm going to argue that it's going to stay that way for the next decade. We're going to zero return in equities, public equities for the next decade. Why do I say that. Because we're at similar valuations that we were in 2000 and from 2000 to 2010 we had zero return. Now I think emerging markets will be exempt from that. There's good opportunities in emerging markets. And what you're seeing in many of those emerging markets are faster adoption of things related to crypto and other technologies because they're just more technologically aware. I mean I quote the stat all the time in South Korea for every engineer we graduate in the United States they graduate 17. For every lawyer they graduate in South Korea we graduate 40. I joke they're a country of wealth creation, we're a country of wealth redistribution. Last year we graduated 450,000 stem engineers. China graduated 4.5 million. They have 90 percent of the new patents on A.I. they're killing us with new technology.","<span class=\"speaker\" data-v-f87c67ca=\"\">Matteo<\/span> I had a question which was also going back. We were discussing innovation. And a lot of our conversation today has been focused around Bitcoin specifically. Bitcoin doesn't exist within a vacuum. What percentage probability do you assign to Bitcoin being the MySpace of the crypto market?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> Well OK I thought I knew where you're going. I love it. I love the ending. Zero probability of being the MySpace. Because MySpace lost to Facebook and others because in a closed technology system a company can come along with new technology and ace you out. AltaVista, Lycos, web crawler were all much better search engines than Google but then Google innovated in a closed system and outperformed all of them, became number one. In an open source world post Red Hat. Now anytime someone innovates and comes up with something new, copy paste. You can take that tech and add it to your chain. In the open source world it's different. And so I think there's zero probability it becomes MySpace. I thought you were gonna ask what's the probability that it is the long term winner? And I actually think it's a reasonably high number, I won't put a number on it but a big number. Why do I think that? It's because the guy who won the Nobel Prize this year Paul Romer. I read a paper of his when I was in business school back in 87 and actually said at the time I thought the guy would win the Nobel Prize. It took 30 plus years for it to happen but he did actually win the Nobel Prize. He wrote this thing called the law of increasing returns and in that what he talks about is not the best technology that wins it's the technology that gets the greatest network effect the fastest. So VHS and Beta etc. And I think what Bitcoin has done, it was first. It has got the widest adoption and trust and therefore I think it will be one of the long term winners. Are there technological innovations that could occur that will do other things better? For sure. But what I also think's going to happen is Bitcoin is going to end up as a base layer and then there'll be other layers like lightning network and other things on top of it the same way that I have cash well actually I don't have cash but I used to have cash and then I have cards and I use the cards the same way as cash and now I have the Apple Pay which is even different than the card because it's using my card but it's a third layer's system. All those systems are going to emerge for crypto. And I think Bitcoin will be at the root of that. It may not be the only thing but I think It'll be one of them.","<span class=\"speaker\" data-v-f87c67ca=\"\">Matteo<\/span> That's very interesting. When you're speaking to institutions and your peers in the investment world where does Ethereum figure. Where do these other protocols figure?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> It's a less politically correct analogy these days after the Khashoggi murder but I say that it's like Saudi. Bitcoin's the king and Ethereum's the Crown Prince and then there's all the other princes that hate each other. The other six thousand Saudi princes they all hate each other and really there's the king and the crown prince and that's all that matters. And so I think Ethereum is important. I think it is. There's only twelve-ish or I don't know what the exact number is cryptocurrency's, everything else is called cryptocurrency is not it's a utility token and some utility tokens are good, 90 plus percent of them are bad going to zero. But some of them are going to be amazing but the cryptocurrency as store of value or medium of exchange there's only a small number. Monero, Dash, Ethereum, Bitcoin.","<span class=\"speaker\" data-v-f87c67ca=\"\">Matteo<\/span> That's interesting. How do you tend to distinguish between a utility token and a cryptocurrency?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> A utility token is like a Chucky Cheese token, it gives you access to a network or some privilege like airline miles whereas a cryptocurrency to me has to be either a store of value or medium of exchange and doesn't do anything else whereas you can also have other types of digital assets that don't have any of those functions. One of the challenges of ICOs, you know Pomp and Jason were really negative on ICOs and when they said we're not gonna do any ICOs. People said \"Oh you're idiots\" and everyone else did ICO funds and they've all gone to zero. Close enough. The reality is that most of those ICOs were bad because they don't give you access to cash flow or ownership. Like if I issued the Mark coin and I give you guys all in this room coins and then I take the money and I build out a string of buildings and call them Chucky Cheese and I give you the mark tokens and you go knock yourself out and have fun on the arcade. That's great for you, you get to play the games but what you should have said is that I want 50 percent of your business. I want to own a piece of that business. So utility tokens to me were a great way to crowdsource venture capital. The problem is preseed stage venture has a 90 plus percent loss ratio. And why people are expecting it to be any better than that is silly. So cryptocurrency, I said a dozen or so. I don't know what the exact number is, really interesting. Really good. I think long term winners. Ethereum is one of those.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> I want to ask this to everyone who comes on the show, what you might have been wrong about over the past three months and how you might have in terms of your view of the market, crypto or otherwise have shifted that view? You were talking about how we're going to have in 2019 and we were about to get into it, a devastating year for the markets. How is that still your view despite that this is one of the best Q1 in many many years? How are you still of that view? What in the market are you seeing that the rest of the market isn't? You mentioned zombie companies","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> So first of all I'm wrong all the time and I don't have any ego about it in that to be a great investor you're actually wrong more than lousy investors because great investors actually are willing to put themselves out and take a stand and be wrong. Lousy investors never do anything, they're paralyzed so they're never wrong but they never make any money. The best investors in history, Julian Robertson, George Soros, Michael Steiner. Fifty eight percent of the time I aspire to be 50 something. The key is to when you're wrong cut your losses and when you're right double up. Most people double down and trim their winners. That's the wrong thing to do.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> So are you doubling down or doubling up?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> You asked why do I think we're still in a bear market and why do I think 2019 is gonna be a crappy year even though the first quarter was great? Because I think we are in a three year period just like 2000 2001 2002 and what people forget is in 2000 we had the tech bubble, we had crazy IPO's -- 81 percent didn't make any money. We just eclipsed that record with the Lyft IPO which we made a lot of money on but that's 82 percent of companies now don't make money. So we eclipse that record. We've got the highest number of companies that don't make money going public. Your point about zombie companies, we have the highest percentage of companies we've ever had that actually not only can they not pay off their debt, they can't service their debt with the last three years. So 16 percent of companies in the S&amp;P fifteen hundred. So the top fifteen hundred companies in the United States, 16 percent, one in six can't service their debt with the money they make and one third, actually a little higher thirty five percent, of all the companies in the rest of 2000 make no money. That's bad and that's all because of QE and allowing bad things to exist and what I call participation trophy markets. What I said was two thousand was going to play out, I mean 2018 was gonna play out like two thousand. So we were basically flat to September and then we were up a little bit through September and then we crashed and we finished down in single digits. So in 2000 we were down nine in 2018 we are down four. So then what happened in 2001 is we had the last gasp rally return to normalcy. Have you ever seen the bubble chart? You get the new paradigm, then you get the crash and then you get the last little run up, that's called the return to normal before the big crash. And that's exactly what happened in 2001. We had a big run up, a 20 percent run up in second quarter between first and second quarter of 2001 and then starting in May we went down 30 percent. We rallied another 20 percent, we had two 20 percent rallies in 2001 and we still finished down 14 percent. So I think that's exactly what's happening here. The plunge protection team came and I was on TV on Christmas Eve and they asked what do you think's going on? Actually not on Christmas Eve on the twenty sixth after Christmas Eve and I was up in Chicago and they said what do you think's going on? I said I think they called the Plunge Protection Team. Since September 21st last year we're still down, since September 21st last year we're still down, only down 1 percent but we're still down. And so what people are missing is this is a normal way that a bear market works and I described it on TV as it's like a rubber ball bouncing down a set of stairs. Each bounce is higher ,that's just kinetic energy, the end of the trip is a bad place. So if I'm wrong on the bear market not playing out what I will have missed is here's the thing. First quarter earnings that were supposed to be double digit growth three months ago are now going to be down single digits. It's the steepest drop in 30 years for first quarter earnings estimates. Preannouncements by companies are over 77 percent negative. Haven't had that in 20 years and I think the earnings season of first quarter is going to be absolutely god awful. I think the only thing keeping the market up is buybacks. We had a I thought the record was as good as it could get last year. So I believe that the government cut a deal with companies. The Fed is not allowed to buy stock directly. Bank of Japan can buy stock. Swiss National Bank can buy stock. The Fed is not allowed to buy stock. So what I believe they did is said look we'll cut your taxes and you take that money and you buy back stock and in so doing you'll support the market. So eight hundred billion dollars of buybacks last year shattered the all time record by a factor of two. I thought we couldn't get higher than two hundred billion in fourth quarter. Two hundred and ninety billion dollars. We had outflows from mutual funds, we had outflows from ETF's. The only positive was buybacks. And if you watched the market, every day from about eleven o'clock in the morning till two thirty in the afternoon it goes straight up 45 degree line and what you want to watch is the first half hour, that's when the dumb money trades, that's when the retail money trades and that's usually what you're going to try to buy and if you watch the last half hour that's when the smart money trades and it's been distributing again and by distribution means it's selling, the last half hours always weak. All last year, last half hour was weak, first quarter last half hour strong. That was the buybacks and the ETF's. And then I'll say the plunge protection team. But here's the problem. Look at the volume. Look at Apple's volume in the last two weeks. Minuscule. I think to Monday we had the lowest volume day in the last twelve months. So it's not that lots of people are buying. It's that we have this short squeeze and buybacks and that is artificially holding up. And when that dam breaks and people actually see how bad first quarter earnings are and how bad the growth numbers are. IMF just downgraded global growth for the third time in six months but I could be wrong.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> And just a close up because we were running out of time and there's people that are looking to kick us out. Is that good or bad for Bitcoin in one word?","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> It's agnostic for Bitcoin. There are a lot of things that are good for Bitcoin. What's good for Bitcoin is price is a liar. Don't look at the daily price. Look at all of the fundamental things. Growth in number of wallets, growth in transactions, transactions per block. All the fundamental metrics of blockchain I mean of Bitcoin are going positive. All the fundamentals of blockchain adoption and usage is positive. Focus on that.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> Thank you so much for joining us today.","<span class=\"speaker\" data-v-f87c67ca=\"\">Mark<\/span> All right. Thanks for having me. It was fun.","<span class=\"speaker\" data-v-f87c67ca=\"\">Frank<\/span> We'd like to take a minute to thank our sponsor Cash App. Cash App has been the number one in finance on the App Store for almost two years. It was the first major peer to peer payments app to support Bitcoin and it's still the fastest and easiest way to onramp fiat. No more waiting five days for your ACH transfer to come through. With Cash App you can buy Bitcoin instantly. When you're ready to take full ownership of your private keys just use cash app to scan an external wallet's QR code. It's really that simple, cash app also comes with standard banking features like direct deposits and others your bank would never even consider like cash card, a customizable debit card that lets you instantly save every time you use it at Lyft, Whole Foods, Chipotle, Chick fil A, Starbucks, Dunkin, local coffee shops and a whole lot more. Download cash up today from the App Store or Google Play and thanks for listening.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Morgan Creek Capital","content":"ORGANIZATION"},{"type":"200 billion dollar market","content":"MONEY"},{"type":"Swiss National Bank","content":"ORGANIZATION"},{"type":"Three days later","content":"DATE"},{"type":"Paul Krugman","content":"PERSON"},{"type":"Morgan Creek Blockchain Opportunity Fund","content":"ORGANIZATION"},{"type":"Matteo Leibowitz","content":"PERSON"},{"type":"mankind","content":"LOCATION"},{"type":"Don Valentine","content":"PERSON"},{"type":"GDP","content":"ORGANIZATION"},{"type":"50 percent","content":"PERCENT"},{"type":"82 percent","content":"PERCENT"},{"type":"Yusko","content":"PERSON"},{"type":"Chief Investment Officer at University of North Carolina","content":"ORGANIZATION"},{"type":"Dan","content":"PERSON"},{"type":"Julian","content":"PERSON"},{"type":"Paul Romer","content":"PERSON"},{"type":"Nobel Prize","content":"ORGANIZATION"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"five million dollars","content":"MONEY"},{"type":"Saudi","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Harry Markowitz","content":"PERSON"},{"type":"Coinbase","content":"LOCATION"},{"type":"Chucky Cheese","content":"PERSON"},{"type":"14 percent","content":"PERCENT"},{"type":"Richard Perry","content":"PERSON"},{"type":"Morgan Creek Capital Management","content":"ORGANIZATION"},{"type":"70 percent","content":"PERCENT"},{"type":"90 plus percent","content":"PERCENT"},{"type":"Twitter","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"five percent","content":"PERCENT"},{"type":"Fairfax County","content":"LOCATION"},{"type":"Khashoggi","content":"PERSON"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Robertson","content":"PERSON"},{"type":"Bank of Japan","content":"ORGANIZATION"},{"type":"CALSTRS","content":"ORGANIZATION"},{"type":"America","content":"LOCATION"},{"type":"eight hundred billion dollars","content":"MONEY"},{"type":"Mark<\/span> Education","content":"ORGANIZATION"},{"type":"Koreans","content":"LOCATION"},{"type":"500 thousand dollars","content":"MONEY"},{"type":"Co-Founder &amp; Partner of Morgan Creek Digital","content":"ORGANIZATION"},{"type":"Frankie","content":"PERSON"},{"type":"second quarter between first and second quarter of 2001","content":"DATE"},{"type":"11 percent","content":"PERCENT"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Harley Davidson","content":"PERSON"},{"type":"Chipotle","content":"LOCATION"},{"type":"Raleigh","content":"LOCATION"},{"type":"9 percent","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"15 percent","content":"PERCENT"},{"type":"Dan Morehead","content":"PERSON"},{"type":"KPMG","content":"ORGANIZATION"},{"type":"Chicago","content":"LOCATION"},{"type":"September 21st last year","content":"DATE"},{"type":"twenty five years","content":"DATE"},{"type":"Darwin","content":"PERSON"},{"type":"North Dakota","content":"LOCATION"},{"type":"Satoshi","content":"PERSON"},{"type":"Vanek","content":"PERSON"},{"type":"Markowitz","content":"PERSON"},{"type":"New Orleans","content":"LOCATION"},{"type":"January 26, 2018","content":"DATE"},{"type":"January 26, 2017","content":"DATE"},{"type":"May","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Notre Dame","content":"LOCATION"},{"type":"Argentina","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"four dollars","content":"MONEY"},{"type":"Venezuela","content":"LOCATION"},{"type":"Anthony Pompliano","content":"PERSON"},{"type":"Danny Och","content":"PERSON"},{"type":"1996","content":"DATE"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Mark Yusko","content":"PERSON"},{"type":"1998","content":"DATE"},{"type":"3 percent","content":"PERCENT"},{"type":"Mardi Gras","content":"LOCATION"},{"type":"30 percent","content":"PERCENT"},{"type":"Morgan Creek Digital Assets","content":"ORGANIZATION"},{"type":"Google Google","content":"ORGANIZATION"},{"type":"Jason Williams","content":"PERSON"},{"type":"Plunge Protection Team","content":"ORGANIZATION"},{"type":"1982","content":"DATE"},{"type":"Amazon","content":"LOCATION"},{"type":"two years","content":"DATE"},{"type":"77 percent","content":"PERCENT"},{"type":"Whole Foods","content":"ORGANIZATION"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Leibowitz","content":"PERSON"},{"type":"Morgan Creek","content":"ORGANIZATION"},{"type":"1973","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"ninety billion dollars","content":"MONEY"},{"type":"Tiger Cubs","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"crappy fourth quarter","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"San Francisco","content":"LOCATION"},{"type":"2015","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"ACH","content":"ORGANIZATION"},{"type":"2010","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Netflix","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Teo","content":"PERSON"},{"type":"81 percent","content":"PERCENT"},{"type":"fourth quarter","content":"DATE"},{"type":"Sequoia","content":"ORGANIZATION"},{"type":"AltaVista","content":"ORGANIZATION"},{"type":"2004","content":"DATE"},{"type":"Madonna","content":"ORGANIZATION"},{"type":"2005","content":"DATE"},{"type":"1 percent","content":"PERCENT"},{"type":"2000","content":"DATE"},{"type":"2001","content":"DATE"},{"type":"2002","content":"DATE"},{"type":"Tiger Management","content":"ORGANIZATION"},{"type":"Tiger","content":"ORGANIZATION"},{"type":"100 percent","content":"PERCENT"},{"type":"1954","content":"DATE"},{"type":"Steve Ballmer","content":"PERSON"},{"type":"North Carolina","content":"LOCATION"},{"type":"Nixon","content":"PERSON"},{"type":"Pets.com","content":"ORGANIZATION"},{"type":"400 percent","content":"PERCENT"},{"type":"Ricky","content":"PERSON"},{"type":"Pantera Macro","content":"ORGANIZATION"},{"type":"Anthony","content":"PERSON"},{"type":"Jason","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"George Soros","content":"PERSON"},{"type":"90 percent","content":"PERCENT"},{"type":"South Korea","content":"LOCATION"},{"type":"PayPal PayPal","content":"ORGANIZATION"},{"type":"Mark","content":"PERSON"},{"type":"John Burbank","content":"PERSON"},{"type":"last gasp","content":"DATE"},{"type":"1980s","content":"DATE"},{"type":"Novogratz","content":"PERSON"},{"type":"Pomp","content":"PERSON"},{"type":"two hundred million dollars","content":"MONEY"},{"type":"Spotify","content":"LOCATION"},{"type":"5 percent","content":"PERCENT"},{"type":"Zimbabwe","content":"LOCATION"},{"type":"20 percent","content":"PERCENT"},{"type":"September 21st","content":"DATE"},{"type":"UNC","content":"ORGANIZATION"},{"type":"Anthony 18 months ago","content":"DATE"},{"type":"trillions of dollars","content":"MONEY"},{"type":"Morgan Creek Digital","content":"ORGANIZATION"},{"type":"2 percent","content":"PERCENT"},{"type":"98 percent","content":"PERCENT"},{"type":"Michael Steiner","content":"PERSON"},{"type":"first quarter","content":"DATE"},{"type":"eight percent","content":"PERCENT"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"Michael Moritz","content":"PERSON"},{"type":"Long Island","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Long Island Blockchain","content":"LOCATION"},{"type":"1000","content":"DATE"},{"type":"South Carolina","content":"LOCATION"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"50 cents","content":"MONEY"},{"type":"Yale","content":"ORGANIZATION"},{"type":"16 percent","content":"PERCENT"},{"type":"Julian Robertson","content":"PERSON"},{"type":"Lycos","content":"ORGANIZATION"},{"type":"Dunkin","content":"PERSON"},{"type":"Italy","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Christmas Eve","content":"ORGANIZATION"},{"type":"Sunday","content":"DATE"},{"type":"80 percent","content":"PERCENT"},{"type":"DTCC","content":"ORGANIZATION"},{"type":"Wyoming","content":"LOCATION"},{"type":"Heath Ledger","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Chris Aleman","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"University of North Carolina","content":"ORGANIZATION"},{"type":"40 plus percent","content":"PERCENT"},{"type":"Herman Cain","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","Matteo Leibowitz","The Block"]}