{"summary":"Despite a slump in crypto prices, a solid percentage of Americans is still holding onto their crypto assets, according to a survey commissioned by crypto exchange Coinbase.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215270\/american-crypto-ownership-steady-despite-tough-year-coinbase-survey","publishDate":"2023-02-27T05:00:07","id":7960,"type":null,"title":"American crypto ownership steady despite tough year: Coinbase survey","category":["COMPANIES"],"content":["It may be crypto winter, but plenty of people are hodling.&nbsp;","More than 50 million Americans own crypto, or 20% of the adult population, a recent survey commissioned by Coinbase found. That number has held steady for more than a year despite the tumult in digital assets.","Americans generally find the overall global financial system to be unfair, with 67% of respondents agreeing that it needs “major changes or a complete overhaul,\" according to the survey, which was conducted by Morning Consult in February and polled 2,200 adults.&nbsp;","Coinbase, which facilitates trading in a wide range of crypto assets, touts a user-base topping 100 million. Last year, the company <a href=\"https:\/\/s27.q4cdn.com\/397450999\/files\/doc_financials\/2022\/q4\/Shareholder-Letter-Q4-2022.pdf\" data-v-f87c67ca=\"\">reported<\/a> an average of 8.8 million transacting users per month compared to the 8.4 million average in 2021.","The survey indicates that crypto ownership spans demographic and political groups, with 18% and 22% of Republican and Democratic respondents saying they own digital assets. Coinbase said it conducted the survey to illustrate the bipartisan makeup of crypto investors.","The results also showed that younger Americans are more interested in crypto than older generations, with Gen Z and Millennials leading the way in both current ownership of crypto and plans to purchase digital assets in the near future.&nbsp;","“Americans recognize that financial infrastructure has fallen behind the rest of the economy, and they continue to have a strong interest in crypto,” Coinbase CEO Brian Armstrong said in a statement. The interest comes despite the dramatic fall in cryptocurrency prices since 2021, and as U.S. regulators <a href=\"https:\/\/www.theblock.co\/post\/212241\/gensler-opens-new-regulatory-front-for-crypto-firms-custody\" data-v-f87c67ca=\"\">crack<\/a> down on the industry.","The survey is part of a broader push by Coinbase to educate the masses about crypto. The firm plans to launch what it is describing as an “integrated public education campaign that aims to shed light on every day challenged faced by consumers and the role that crypto can play in a border effort to update the system.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"18%","content":"PERCENT"},{"type":"winter","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"67%","content":"PERCENT"},{"type":"22%","content":"PERCENT"}],"hashtag":["CRYPTO"],"authors":["Frank Chaparro","The Block"]}