{"summary":"Immunefi, Trails of Bits, Solana Foundation and others are launching “The Rekt Test” — a baseline security standard for web3.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241677\/immunefi-polygon-labs-solana-foundation-web3-security-rekt-test","publishDate":"2023-07-27T06:00:02","id":7963,"type":null,"title":"Immunefi, Trail of Bits, Solana Foundation launch web3 ‘Rekt Test’","category":["SECURITY"],"content":["Bug bounty security platform Immunefi is launching “<a href=\"https:\/\/medium.com\/immunefi\/the-rekt-test-9834fc7467fb\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">The Rekt Test<\/a>” — a baseline security standard for web3 — in partnership with cybersecurity firm Trail of Bits.","The test guides web3 projects through a set of questions designed to ensure they adhere to a minimum level of security performance. The results enable users and investors to more easily evaluate the quality of a project before engaging with it, according to a statement.","The Rekt Test covers seven security assessments: system documentation and roles, key management and access control, incident response and crisis management, team and personnel security, code security and testing, external audits and vulnerability management and attack mitigation and user protection.","The test is also in collaboration with Solana Foundation, Fireblocks and Ribbit Capital. It was developed by a group of web3 security experts including, Mitchell Amador, founder and CEO at Immunefi, Dan Guido, co-founder and CEO at Trail of Bits, Lee Mount, head of EulerSwap at Euler Finance, Shahar Madar, head of security products at Fireblocks and Ribbit Capital representatives, Immunefi said.","“The state of web3 security is still largely immature and of poor quality,” Immunefi added, citing its recent <a href=\"https:\/\/assets.ctfassets.net\/t3wqy70tc3bv\/1ObYJk9jzWS4ExHICslYep\/e2b5cee51268e47ee164c4dffbd78ad4\/Immunefi_Crypto_Losses_2022_Report.pdf\" data-v-f87c67ca=\"\">report<\/a> claiming that over $3.9 billion was lost to hacks and scams in web3 last year. With the large amount of capital in the ecosystem providing an incentive for attackers to exploit web3 projects through code vulnerabilities, private key thefts and social engineering, setting security standards was crucial, Immunefi said.","“The Rekt Test is a crucial standard for ensuring that web3 projects are operating at a minimum baseline of security performance,” Amador said. “We see devastating, unnecessary losses caused by private key thefts and social engineering alone that can be mitigated by having an established and proactive approach to security requirements.”&nbsp; &nbsp;","Last week, Immunefi&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/240758\/immunefi-chatgpt-generated-web3-bug-bounty-reports\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a>&nbsp;it had been inundated with ChatGPT-generated web3 security reports since OpenAI launched the tool in November.","<em data-v-f87c67ca=\"\">Correction: Removed references to Polygon Labs and the DeFi Education Fund who said they were not involved in the project.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dan Guido","content":"PERSON"},{"type":"Shahar Madar","content":"PERSON"},{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"Trail of Bits","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$3.9 billion","content":"MONEY"},{"type":"Amador","content":"PERSON"},{"type":"Immunefi","content":"PERSON"},{"type":"Immunefi","content":"LOCATION"},{"type":"Ribbit Capital","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Mitchell Amador","content":"PERSON"},{"type":"Lee Mount","content":"PERSON"},{"type":"Euler Finance","content":"ORGANIZATION"}],"hashtag":["HACKS"],"authors":["James Hunt","The Block"]}