{"summary":"American crypto companies are looking east to Bermuda for its friendlier digital asset framework as the regulatory environment in the U.S. grows dark and stormy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230658\/us-regulatory-crypto-bermuda","publishDate":"2023-05-14T09:42:29","id":7965,"type":null,"title":"US regulation is pushing crypto firms toward Bermuda","category":["COMPANIES"],"content":["As the regulatory environment in the U.S. grows dark and stormy, American crypto companies are looking east to Bermuda and its friendlier digital asset framework.","It’s hardly unusual for crypto firms to go offshore and take advantage of clearer digital asset laws. Now-bankrupt FTX headquartered its exchange in the Bahamas, for example. But after Coinbase obtained a monetary license to operate there, could Bermuda become the new Bahamas?","<span class=\"s2\" data-v-f87c67ca=\"\">\"<\/span>It'll definitely be a hotspot for businesses that do choose to relocate. And they can put their toe in the water like Coinbase,” said Phil Berg, head of the corporate department at Otterbourg law firm.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“It's kind of ironic that we’re praising all of these detailed regulations, when the whole concept of crypto initially was decentralization and no trusted institutions,” said Berg, who led his firm's push into the field of blockchain-based smart contracts and cryptoassets. “But because of the punishing that we've taken at the hand of regulators in the U.S. by regulation through enforcement and a kind of refusal to rule make and an inability to pass laws, it has really made a jurisdiction with some regulatory clarity attractive.”","The renewed interest in crypto frameworks outside of the United States is a reaction to the country’s key regulators cracking down on crypto firms, and Congress moving slowly to establish new rules for the industry. The Securities and Exchange Commission has targeted crypto companies including Coinbase, Kraken, Bittrex and Genesis with enforcement actions, settlements and investigations in recent months.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Enforcement is heating up,” said Andrew Gordon, the managing attorney of the Gordon Law Group. \"But regulatory clarity has not been or has not been increasing.\"","Bermuda has spent the last five years building and fine-tuning its digital asset framework since enacting the <a href=\"https:\/\/www.bma.bm\/digital-assets-supervision-regulation\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">Digital Asset Business Act<\/span><\/a>, which established a licensing regime for issuing, selling or redeeming digital assets, operating as a payment service provider business using digital assets and operating as an electronic exchange, among other endeavors.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Since that time, Bermuda has granted licenses to crypto companies including Block and its subsidiary Cash App, along with Circle, the Boston-based issuer of the USDC stablecoin.","“What Coinbase recognized, which is what a lot of other companies have recognized, is that we have a superior regulatory environment,” Bermuda Premier E. David Burt said during an interview at the <a href=\"https:\/\/www.coindesk.com\/tv\/the-hash\/consensus-2023-bermudas-premier-on-crypto-regulation-jack-dorseys-block-bitcoin-mining-moves\/\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">Consensus 2023 conference<\/span><\/a> in Austin, Texas. “It is, as I’ve said, a race to the top for regulation, and Bermuda has proven that we are a place that you can do that.”","<span data-v-f87c67ca=\"\">Bermuda Premier E. David Burt<\/span>","Burt himself is active in the crypto space, attending conferences like the Satoshi Roundtable in Dubai. The Bermuda premier recalled a recent visit with U.S. policymakers, including the Treasury Department, the Securities and Exchange Commission and members of Congress, to discuss Bermuda’s regulatory regime.","“It's unfortunate what has happened in the United States,” Burt said. “Not everyone in Congress is clueless to what is going on. There are some really good voices that are trying to get this stuff done. But as you know, they're suffering from a little bit of an FTX hangover.”","Burt was not available for an interview for this story.","Coinbase, the largest crypto exchange in the U.S., grabbed headlines last month when it <a href=\"https:\/\/www.theblock.co\/post\/227253\/coinbase-bermuda-offshore-derivatives-exchange\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">obtained a license<\/span><\/a> from the Bermuda Monetary Authority. The company opened an offshore derivates exchange a few weeks later. The expansion is part of Coinbase’s initiative to become a more global company by going “<a href=\"https:\/\/www.coinbase.com\/blog\/an-update-to-coinbases-global-scale-to-go-broad-and-deep\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">broad and deep<\/span><\/a>” in jurisdictions across the world.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The step toward Bermuda also comes amid a looming legal battle between Coinbase and the SEC. The commission recently <a href=\"https:\/\/www.theblock.co\/post\/222084\/sec-investigating-coinbase-for-its-earn-product-wallet-service-and-exchange-activity\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">gave Coinbase official notice<\/span><\/a> that it is the target of an investigation with a Wells Notice, a document which can precede an enforcement action. Coinbase CEO Brian Armstrong <a href=\"https:\/\/www.theblock.co\/post\/228670\/sec-action-against-coinbase-would-be-bad-for-america-ceo-armstrong-warns\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">responded by warning the SEC<\/span><\/a> that he is prepared to defend his firm in court.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Coinbase CEO Brian Armstrong and Chief Legal Officer Paul Grewal responded to the SEC in a video.<\/em>","At the same time, Coinbase went on the offensive and hit the SEC with a <a href=\"https:\/\/www.theblock.co\/post\/228283\/coinbase-vs-the-sec-a-gamble-to-take-on-a-regulator-undefeated-on-crypto\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">separate lawsuit<\/span><\/a>, demanding that the commission answer a request for a digital asset-specific rule that the company made last year.","Other companies are sure to watch Coinbase’s multi-pronged legal battle against the SEC — and how its Bermuda effort fares, Gordon said. Coinbase did not respond to a request for comment.","“Coinbase is the largest player in the U.S.,” Gordon said. “We’ve seen Kraken, Gemini, they've had their own regulatory issues as well. Depending on how it plays out for Coinbase, I wouldn't be surprised if some of them follow suit.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Industries seeking friendlier regulatory regimes outside of the U.S. is fairly common. Hedge funds may set up shop in the British Virgin Islands or the Cayman Islands, for example.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","But welcoming digital asset firms doesn’t come without challenges, even in crypto-friendly jurisdictions. <span class=\"s4\" data-v-f87c67ca=\"\">Bermuda’s size could make it difficult to host a large swath of the growing crypto industry, Berg noted.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">“<\/span>This is a country of, what, 70,000 citizens,” Berg said. “This is a multi-trillion dollar industry. So the whole industry can't move to that one jurisdiction.”","Meanwhile, roughly 900 miles away from Bermuda, the Bahamas became nearly synonymous with the crypto industry after FTX stationed operations there. Executives at the crypto exchange, once valued at $32 billion, scooped up <a href=\"https:\/\/www.theblock.co\/post\/186386\/ftx-spent-74-million-on-real-estate-in-the-bahamas-this-year-exclusive\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">millions in Bahamian real estate<\/span><\/a> and drew celebrities and attention to its business in the country.","After FTX imploded — a trio of former executives have <a href=\"https:\/\/www.theblock.co\/post\/213024\/former-ftx-exec-nishad-singh-plans-to-plead-guilty-to-criminal-charges-bloomberg\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">pleaded guilty<\/span><\/a> to criminal charges in a U.S. court and the company filed for bankruptcy protection — Bahamian financial regulators are revisiting their digital asset laws.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">The Securities Commission of the <a href=\"https:\/\/www.theblock.co\/post\/228350\/bahama-crypto-regulations-ftx\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">Bahamas recently opened a consultation<\/span><\/a> on a set of proposed new rules, which <\/span><span class=\"s6\" data-v-f87c67ca=\"\">include expanding the definition of digital assets businesses, disclosure requirements for crypto staking activities and tighter requirements for stablecoin issuers. The bill could advance during the second quarter of the year, the regulator said in a statement.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>","<span class=\"s6\" data-v-f87c67ca=\"\">And for companies that want to serve U.S. customers, moving to a new jurisdiction is not an instant fix for regulatory issues.<\/span>","“Crypto firms considering offshore locations like Bermuda in response to intensifying regulation may view this as an appealing short-term solution. While offshore licensure has its business benefits from a global perspective, it isn’t a long term solution to serving customers in the U.S.,” Bitstamp USA Chief Compliance Officer Thomas Hook said in a statement to The Block.","“If you want to serve the US market, then you need to work with U.S. regulators,” Hook added.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cayman Islands","content":"LOCATION"},{"type":"$32 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Bermuda Monetary Authority","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Wells Notice","content":"ORGANIZATION"},{"type":"Austin","content":"LOCATION"},{"type":"Satoshi Roundtable","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"Bitstamp USA","content":"ORGANIZATION"},{"type":"Gordon Law Group","content":"ORGANIZATION"},{"type":"Dubai","content":"LOCATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Securities Commission","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"E. David Burt","content":"PERSON"},{"type":"second quarter","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Berg","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Bermuda","content":"LOCATION"},{"type":"Thomas Hook","content":"PERSON"},{"type":"Otterbourg","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Gordon","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Andrew Gordon","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Boston","content":"LOCATION"},{"type":"Burt","content":"PERSON"},{"type":"Phil Berg","content":"PERSON"},{"type":"Paul Grewal","content":"PERSON"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["FTX"],"authors":["Stephanie Murray","The Block"]}