{"summary":"The Massachusetts Democrat also hammered the crypto industry over money laundering issues during a hearing held Tuesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211783\/warren-pledges-to-reintroduce-crypto-anti-money-laundering-bill","publishDate":"2023-02-14T18:54:49","id":7969,"type":null,"title":"Warren pledges to reintroduce crypto anti-money laundering bill","category":["POLICY"],"content":["Sen. Elizabeth Warren, D-Mass., said she plans to reintroduce legislation with Sen. Roger Marshall, R-Kan., that would extend anti-money laundering laws to a broad array of the cryptocurrency ecosystem. That would include digital asset wallet providers, miners, validators and other blockchain network participants.","<span data-v-f87c67ca=\"\">“Sen. Roger Marshall and I are reintroducing our anti-money laundering bill to clamp down on crypto crime and give regulators the tools they need to stop the flow of crypto to drug traffickers and places like North Korea,” Warren said during a Senate Banking Committee hearing on crypto guardrails on Tuesday. During the hearing Warren used her time to claim that anti-money laundering rules do not adequately apply to crypto companies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The original version of the bill she and Marshall introduced last December also would have prohibited banks and other financial institutions from transactions with digital asset mixers, which are meant to mask transactions made on public blockchains.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">If introduced in the same form as last December, the bill would also extend anti-money laundering reporting requirements to include U.S. persons who transact in $10,000 or more in digital assets using an offshore account and require the Treasury Department to do anti-money laundering compliance examinations for money service businesses, the registration that large U.S. crypto companies fall under.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Just last year year, just in one year, crypto was the payment method of choice for international drug traffickers who raked in over a billion dollars through crypto, North Korean hackers who stole $1.7 billion in funding that outfitted their nuclear program, and ransomware attackers who took in almost $500 million,” Warren said at Tuesday's hearing, as the basis of her rationale for more stringent anti-money laundering rules around digital assets.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"a billion dollars","content":"MONEY"},{"type":"Mass.","content":"LOCATION"},{"type":"Warren","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"$10,000","content":"MONEY"},{"type":"$500 million","content":"MONEY"},{"type":"Roger Marshall","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"last year year","content":"DATE"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Marshall","content":"PERSON"},{"type":"$1.7 billion","content":"MONEY"},{"type":"Kan.","content":"LOCATION"},{"type":"Elizabeth Warren","content":"PERSON"}],"hashtag":[],"authors":["Colin Wilhelm","The Block"]}