{"summary":"PancakeSwap’s proposal to reduce the maximum supply of its native CAKE token from 750 million to 450 million was approved.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269619\/pancakeswap-community-approves-removing-300-million-cake-tokens-from-supply","publishDate":"2023-12-29T05:35:16","id":7973,"type":null,"title":"PancakeSwap community approves removing 300 million tokens from supply","category":["CRYPTO INFRASTRUCTURE"],"content":["<span data-v-f87c67ca=\"\">A PancakeSwap proposal to reduce the maximum supply of the decentralized exchange’s native <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248465\/pancakeswap-cake-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/pancakeswap-cake-logo_28129.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">CAKE<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -2.13%\n    <\/span><\/a> <!----><\/span> token from 750 million to 450 million has concluded with nearly 98% of votes in favor of the move.<\/span>","On Thursday, the multi-chain decentralized exchange project posted a vote proposal to reduce the maximum token supply of CAKE. The voting period has concluded, and the final results reveal a 97.88% majority in favor of reducing the maximum supply from 750 million to 450 million.","The updated maximum token supply figures for CAKE are expected to be officially reflected on major price-tracking platforms, like CoinGecko and CoinMarketCap, by January 4.","After the vote concluded, CAKE was trading at $3.70 at 4:49 a.m. ET. The token has pulled back by around 1% in the past 24 hours but has gained over 44% in the past week, according to <a href=\"https:\/\/www.theblock.co\/price\/248465\/pancakeswap-cake-usd\" data-v-f87c67ca=\"\">The Block’s Price Page<\/a> for CAKE.","","","&nbsp;","<a href=\"https:\/\/www.theblock.co\/post\/268826\/pancakeswaps-cake-spikes-over-20-after-proposal-to-reduce-token-supply-by-300-million\" data-v-f87c67ca=\"\">PancakeSwap<\/a> stated that the reason for the change in supply was to advance toward the goal of achieving “ultrasound CAKE” and to signal the token’s shift away from a highly inflationary model.","\"After achieving consistent deflation in recent months, this latest strategic move to reduce the CAKE token's total supply to a maximum cap of 450 million CAKE aligns with PancakeSwap’s vision for a robust, deflationary model,\" the PancakeSwap team said.","Last week PancakeSwap <a href=\"https:\/\/twitter.com\/PancakeSwap\/status\/1737757429721653305\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">announced<\/a> the proposal to cut the supply of CAKE. \"By reducing our token supply by 300,000,000 CAKE, we signal PancakeSwap’s successful pivot from a high-inflation emissions model, to a much more efficient flywheel,\" PancakeSwap <a href=\"https:\/\/twitter.com\/PancakeSwap\/status\/1737757429721653305\" data-v-f87c67ca=\"\">wrote<\/a> on X.","Over the past year, PancakeSwap has significantly revamped its tokenomics, emissions and growth strategy. Plans are in place to introduce a vote-escrowed model, allowing CAKE holders to stake their tokens for veCAKE, which includes staking rewards and incentives.","\"Now that CAKE has achieved consistent deflation for several months and is focusing on accelerating our journey to ultrasound CAKE, this proposal aims to reduce the CAKE token’s total supply to a maximum cap of 450 million CAKE. With a current circulating supply of 388 million CAKE, the Kitchen believes this new and lower cap will be sufficient to gain market share across all chains and sustain the veCAKE model,\" the proposal added.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"4:49 a.m. ET","content":"TIME"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"98%","content":"PERCENT"},{"type":"January 4","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"44%","content":"PERCENT"},{"type":"$3.70","content":"MONEY"},{"type":"750 million","content":"MONEY"},{"type":"97.88%","content":"PERCENT"},{"type":"1%","content":"PERCENT"},{"type":"-2.13%","content":"PERCENT"},{"type":"Kitchen","content":"LOCATION"},{"type":"PancakeSwap","content":"ORGANIZATION"}],"hashtag":["CRYPTO MOVERS","DEXS","SMART CONTRACTS"],"authors":["Brian McGleenon","The Block"]}