{"summary":"While bitcoin is a dominant choice among crypto investors, most of them end up buying altcoins during bull runs, new data from Coinbase shows. Volatility is another factor that &quot;significantly&quot; swings consumers toward non-BTC assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/65227\/most-bitcoin-investors-on-coinbase-end-up-buying-altcoins-during-bull-runs-says-the-exchange","publishDate":"2020-05-14T08:26:14","id":7976,"type":null,"title":"Bitcoin investors tend to buy altcoins during bull runs (coinbase data)","category":["BITCOIN"],"content":["While bitcoin is a dominant choice among crypto investors, most of them end up buying altcoins during bull runs, new data from Coinbase shows.","In a blog post <a href=\"https:\/\/blog.coinbase.com\/around-the-block-6-bitcoins-dominance-alongside-coinbase-customer-behavior-the-coming-dex-c9d952ec6170\" data-v-f87c67ca=\"\">published<\/a> Wednesday, Coinbase said 60% of its users buy bitcoin (BTC) first, but only 24% of them stay with bitcoin only. Overall, more than 75% of investors buy other coins as well, such as ether (ETH) and litecoin (LTC),&nbsp;particularly during bull runs.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"As people feel good about their initial crypto investments (into Bitcoin), they branch out to find other possible categorical winners (as evident in the 2017 bull run). The converse is also possible, as prices drop and fear grips the market (2018–2019), a flight to crypto safety drove Bitcoin back to the forefront,\" said Coinbase.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","The overall consumer behavior suggests that the crypto industry would need to build support for altcoins as well, according to Coinbase. \"Bitcoin is king, and likely to remain king for a long time. But it is also paving the way for a thousand flowers to bloom,\" said the exchange.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"24%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"75%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"LTC","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["COINBASE","XRP"],"authors":["Yogita Khatri","The Block"]}