{"summary":"JBA claimed that its review of the current tax system indicates that the growth of web3 business in Japan is hindered.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241990\/japan-blockchain-association-crypto-tax-revision","publishDate":"2023-07-29T04:04:11","id":7991,"type":null,"title":"Japan Blockchain Association requests crypto tax revision: CoinPost","category":["TAX"],"content":["The Japan Blockchain Association has reportedly requested the country's government revise the tax system to accommodate crypto.","JBA claimed that its review of the current tax system indicates that the growth of web3 business in Japan is hindered.","Specifically, it requested the tax on personal transactions be set to a flat rate of 20%, and taxes on profits stemming from crypto transactions be canceled, <a href=\"https:\/\/coinpost.jp\/?p=474902\" data-v-f87c67ca=\"\">according<\/a> to CoinPost.","Statistics from the Japan Crypto Asset Exchange Association indicate that, as of April 2023, roughly 6.8 million crypto accounts were opened — and JBA believes, based on a questionnaire, that investment would increase if taxation was amended.","JBA also asks to eliminate year-end unrealized profit taxation on third-party-issued tokens — claiming that companies no longer needing to sell the tokens they hold for tax payment will reduce the barrier to entry for web3 businesses.","Earlier this week, Japan’s Prime Minister, Fumio Kishida, <a href=\"https:\/\/www.theblock.co\/post\/241258\/web3-japan-fumio-kishida\" data-v-f87c67ca=\"\">said<\/a> web3 has the potential to transform the traditional internet framework and contribute to social change — and that the government is dedicated to fostering a conducive environment for promoting web3.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"JBA","content":"ORGANIZATION"},{"type":"April 2023","content":"DATE"},{"type":"The Japan Blockchain Association","content":"ORGANIZATION"},{"type":"CoinPost","content":"ORGANIZATION"},{"type":"the Japan Crypto Asset Exchange Association","content":"ORGANIZATION"},{"type":"Fumio Kishida","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Japan","content":"LOCATION"}],"hashtag":[],"authors":["Adam James","The Block"]}