{"summary":"On Sep 21, 2022, Poly Network, a cross-chain interoperability protocol, announced that it will integrate with XRP Ledger, an open source, public and decentralized Layer 1 blockchain. This integration will allow users to send XRP assets cross-chain to heterogeneous blockchain networks such as Ethereum, Polygon, Fantom, Avalanche, and Arbitrum, through Poly Network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171302\/cross-chain-interoperability-protocol-poly-network-integrates-with-xrp-ledger-in-support-of-fast-cross-border-payments","publishDate":"2022-09-21T08:00:11","id":7992,"type":null,"title":"Cross-chain interoperability protocol Poly Network integrates with XRP Ledger in support of fast cross-border payments","category":["SPONSORED"],"content":["<span data-contrast=\"auto\" data-v-f87c67ca=\"\">On Sep 21, 2022, Poly Network, a cross-chain interoperability protocol, announced that it will integrate with XRP Ledger, an open source, public and decentralized Layer 1 blockchain. This integration will allow users to send XRP assets cross-chain to heterogeneous blockchain networks such as Ethereum, Polygon, Fantom, Avalanche, and Arbitrum, through Poly Network. The addition of cross-chain operations allows XRP users to participate in various financial services such as pledging assets, mining, lending, and liquidity provision using their XRP assets. With the addition of XRP Ledger to the Poly Network ecosystem, the network cluster effect grows larger, which creates improved asset interoperability for users amongst various public chains and project parties.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:360}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">With the support of Poly Network, multiple application scenarios open up for XRP to be used as an asset in DeFi. These application scenarios include; DEX trading, lending, and liquidity mining, amongst various heterogeneous blockchains and within the Layer 2 ecosystem. With Poly Network's \"multi-chain inter-crossing\" mechanism, XRP can realize instant low-cost cross-chain asset transfers. This mechanism works through a set of decentralized cross-chain nodes, <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">which work as a multi-signature account in XRPL Mainnet. <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Users can transfer XRP to the <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">multi-signature <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">account <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">held by the cross-chain<\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> node group. Simultaneously, the cross-chain nodes map the corresponding XRP cross-chain tokens on another heterogeneous blockchain, for example Ethereum. And for \"withdraw\", all Poly Network validator nodes will sign the withdraw transaction and submit to Poly Network's smart contract to assemble an XRP multi-signed transaction, then submit to XRPL by any relayer who is listening to the assembly event.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:360}\" data-v-f87c67ca=\"\">&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:360}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The <\/span><a href=\"https:\/\/xrpl.org\/\" data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">XRP Ledger<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> is an open-source, green, permissionless and decentralized blockchain powered by the XRPL community and is the blockchain best suited to enable settlement and liquidity of tokenized assets at scale. The XRPL has been successfully confirming transactions since 2012. Hundreds of millions of transactions have been processed in that time.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Poly Network is a leading cross-chain interoperability protocol for heterogeneous chains. Its uniquely designed blockchain and cross-chain bridge technology open up communication and transactions between various heterogeneous chains, even amongst various mainstream public chains from the protocol layer. Following the mainnet launch in August 2020, over 375,000 addresses have used Poly Network’s cross-chain service to complete cross-chain asset transfers of value equivalent to $16.3 billion.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:360}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Just as the Internet enables instant and seamless flows of information, Poly Network is working with XRP Ledger to achieve instant and seamless flows of value. Through blockchain and cryptocurrency technology, it becomes possible to improve efficiency, fairness and inclusion within the financial industry. This collaboration is committed to spawning a new digital economy for governments, enterprises and consumers in the Web 3.0 era.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:360}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Poly Network<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fantom","content":"PERSON"},{"type":"Arbitrum","content":"LOCATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"2012","content":"DATE"},{"type":"August 2020","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$16.3 billion","content":"MONEY"},{"type":"Sep 21, 2022","content":"DATE"},{"type":"Poly Network","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}