{"summary":"One of the top priorities for Binance over the next few months is to ready its platform for higher trading volumes, said Changpeng Zhao.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237907\/binance-cz-crypto-trading-volumes","publishDate":"2023-07-05T13:44:24","id":7993,"type":null,"title":"Binance CEO expects heavy volumes and readies platform for action","category":["COMPANIES"],"content":["Binance is readying its platform for increased trading volume that it's expecting to hit over the next few months, CEO Changpeng \"CZ\" Zhao said Wednesday.","\"If we look at historical patterns, we want to be prepared for higher volumes,\" he said during a Twitter Spaces \"<a href=\"https:\/\/twitter.com\/binance\/status\/1676553357014585344\" data-v-f87c67ca=\"\">ask me anything<\/a>\" event, adding that the company is doing \"a lot of preparation\" to ready its systems for increased activity over the next six to 18 months.","Higher volumes have already started returning in recent weeks, compared to the bleak period that kicked off last November when the FTX exchange collapsed, according to Zhao. Several factors have led to the recent surge, including new filings for spot bitcoin ETFs and the upcoming Bitcoin <a href=\"https:\/\/www.theblock.co\/post\/61762\/the-bitcoin-halving-what-it-is-and-why-it-matters\" data-v-f87c67ca=\"\">halving event<\/a> expected in April or May of 2024.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\/embed\" title=\"Cryptocurrency Monthly Exchange Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Zhao said bitcoin has seen four-year bull cycles based on historical patterns that suggest the next bull run could occur in 2025, as \"the year after Bitcoin halving is usually the bull year.\" He noted that it's hard to predict the future.","Zhao remains bullish on crypto over the longer run.","\"We're still very early. I think the industry still has a lot of room to grow,\" Zhao said. \"So I'm always bullish. I'm a builder, so I always have a positive outlook on things.\"","Still, if the bear market were to continue, Binance has \"stamina to last,\" Zhao continued.","The company is currently embroiled in a legal battle with regulators in the U.S., with the Commodity Futures Trading Commission and the Securities and Exchange Commission both <a href=\"https:\/\/www.theblock.co\/post\/223015\/cftc-sues-binance\" data-v-f87c67ca=\"\">suing<\/a> the exchange and Zhao for allegedly violating federal laws. On the ongoing lawsuits, Zhao said Binance wants to seek \"the most expedient, reasonable, and mutually agreeable solution possible.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Zhao","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"May of 2024","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"April","content":"DATE"},{"type":"last November","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BINANCE","CZ"],"authors":["Yogita Khatri","The Block"]}