{"summary":"Apple rejected the latest version of Bitcoin wallet app Zeus — a day after Apple warned about removing another Bitcoin-related app, Damus.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234818\/apple-reject-bitcoin-wallet-zeus","publishDate":"2023-06-15T02:55:47","id":7995,"type":null,"title":"Apple rejects Bitcoin wallet Zeus app&#x27;s latest version","category":["TECH"],"content":["<em data-v-f87c67ca=\"\">Update: After Zeus submitted extra notes and resubmitted its application, Apple then <a href=\"https:\/\/twitter.com\/evankaloudis\/status\/1669297396281483265?s=20\" data-v-f87c67ca=\"\">approved<\/a> the latest version of the app.<\/em>","Apple has rejected the latest version of the Zeus app — a non-custodial Lightning Network-enabled Bitcoin wallet — a day after warning about removing another Bitcoin-related app, Damus.","\"Your app facilitates the transmission of a virtual currency but was not submitted by a corresponding exchange or recognized financial institution,\" Apple told Zeus, according to a <a href=\"https:\/\/twitter.com\/evankaloudis\/status\/1668892805924544512?s=20\" data-v-f87c67ca=\"\">tweet<\/a> by Zeus founder Evan Kaloudis. \"To resolve this issue, please provide documentary evidence demonstrating you have the necessary licenses and permissions to distribute an app with cryptocurrency exchange features in all the locations where your app is currently available.\"","Zeus is in talks with Apple for approval, as the app does not provide crypto exchange features but facilities payments via a non-custodial wallet. \"Being non-custodial should be easy to push back since the product is just a software interface,\" <a href=\"https:\/\/twitter.com\/paoloardoino\/status\/1668928955800334336?s=20\" data-v-f87c67ca=\"\">according<\/a> to Tether CTO Paolo Ardoino. The previous version of the Zeus app is still accessible in the App Store.","The news comes a day after Apple <a href=\"https:\/\/www.theblock.co\/post\/234392\/apple-damus-app-removal-warning?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">warned<\/a> Damus to drop its \"zaps\" or Bitcoin tipping feature. Damus now has to remove the zaps functionality from all content sections and can maintain it at the profile level. Damus core developer William Casarin <a href=\"https:\/\/twitter.com\/jb55\/status\/1668581477552988164?s=20\" data-v-f87c67ca=\"\">said<\/a> he would resubmit with zaps in the future as he believes he is not violating any guidelines.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tether CTO","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Evan Kaloudis","content":"PERSON"},{"type":"Zeus","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"William Casarin","content":"PERSON"},{"type":"Damus","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["SIDECHAINS"],"authors":["Yogita Khatri","The Block"]}