{"summary":"&quot;Flaws derive from the underlying incentives of validators rather than from technology,&quot; the Bank of International Settlements said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239208\/bis-slams-crypto-in-new-report-says-reality-doesnt-live-up-to-decentralized-vision","publishDate":"2023-07-12T12:25:19","id":7996,"type":null,"title":"BIS slams crypto in new report, says reality doesn&#x27;t live up to vision","category":["POLICY"],"content":["The Bank of International Settlements thinks crypto is flawed, even if the technology works and could be replicated in a \"more trusted traditional financial system.\"","\"Flaws derive from the underlying incentives of validators rather than from technology,\" the multilateral organization said in a <a href=\"https:\/\/www.bis.org\/publ\/othp72.pdf\" data-v-f87c67ca=\"\">report<\/a> in which it argued that crypto was unsuitable to play significant role in the international monetary system.","Specifically, the BIS said there is a divergence between the decentralized vision often promoted by crypto enthusiasts and reality. It used the 2022 implosion of the FTX crypto exchange as an example.&nbsp;","\"The sector operates under the banner of decentralization, but in practice new centralized intermediaries have played a key role in channeling funds into the crypto universe and intermediating within it,\" the bank said.&nbsp;","It said that innovations the industry has developed such as programmability, composability and the automation of financial transactions can be replicated or embedded in the \"safer and more trusted traditional finance system.\"","The BIS criticized the <a href=\"https:\/\/www.theblock.co\/post\/238965\/former-security-engineer-arrested-in-ny-after-allegedly-defrauding-a-defi-exchange-stealing-9-million\" data-v-f87c67ca=\"\">decentralized finance<\/a> sector, calling it \"self-referential\" and claiming it copied services offered by the traditional financial system. It argued that it amplified risks without financing activity in the real economy.","\"Crypto and DeFi pose substantial risks to, especially retail, investors and its inherent structural flaws make it unsuitable to play a constructive role in the monetary system,\" the bank said.","The report said tokenization of claims on real-world assets is one way traditional finance and crypto could work together. It added this could result in the growth of crypto itself \"as new money gets channeled into such tokenized assets.\"","The systemic importance of the crypto ecosystem could increase substantially with the expansion of tokenization of real world assets, the <a href=\"https:\/\/www.theblock.co\/post\/235800\/bis-makes-case-for-unified-ledger-but-describes-crypto-as-a-flawed-system\" data-v-f87c67ca=\"\">BIS<\/a> added. However, it warned that \"crypto’s growing interconnectedness with traditional finance and the real economy may also pose a threat to monetary sovereignty.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BIS","content":"ORGANIZATION"},{"type":"Bank of International Settlements","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BOE","CBDCS","CRYPTO","ECB","FEDERAL RESERVE","TOKENIZATION"],"authors":["Brian McGleenon","The Block"]}