{"summary":"What does a defective electric massage chair have to do with lost cryptocurrency and cats?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54875\/on-lost-cats-and-crypto-a-lawsuit-on-the-move-raises-questions-about-valuation-and-liability","publishDate":"2020-02-05T09:30:54","id":7997,"type":null,"title":"On lost cats and crypto: a lawsuit on the move raises questions about valuation and liability","category":["LAYER 1S"],"content":["What does a defective electric massage chair have to do with lost cryptocurrency and cats?","A <a href=\"https:\/\/www.scribd.com\/document\/445550833\/crocodile-cats-complaint-pdf\" data-v-f87c67ca=\"\">federal court lawsuit filed in the Eastern District of Michigan<\/a> (and now transferred to federal court in Los Angeles) alleges a connection.","In <em data-v-f87c67ca=\"\">Powers v. Am. Crocodile Int'l Grp.<\/em>, the plaintiffs allege that the Defendant made and sold an electric massage chair. They further say that because of product defects, said chair caused a fire in their home that caused a lot of loss.","<a href=\"https:\/\/www.scribd.com\/document\/445550855\/crocodile-order-pdf\" data-v-f87c67ca=\"\">Per the Court in an Order dated January 27<\/a>, \"[t]he resulting fire allegedly consumed the entirety of Plaintiffs' home. Plaintiffs also claim to have lost $300,000 of 'cryptocurrency,' and three cats. One of the cats was supposed to have been 'the world's tallest domestic cat,' while another sported 'the world's longest tail on a domestic cat.'\"","The Complaint itself says that a non-party bought the chair in 2009. The non-party gave the chair to one of the Plaintiffs in 2017 and it caught on fire. &nbsp;The Complaint says that&nbsp;\"[a]mong other things, the fire destroyed approximately $300,000 in cryptocurrency, which cannot be recovered.\"","It's a two-count suit, alleging strict products liability, negligence and breach of an implied warranty. Pretty standard stuff for this sort of loss. I'm going to oversimplify here, but part of the gist is that a products liability claim imposes liability upon manufactures and sellers regardless of their state of mind if the product was in a defective and unreasonably dangerous condition was sold. Negligence requires a duty of care.","Now, we don't know what kind of crypto the plaintiffs lost from the Complaint (and it sounds like the loss of the cats and was much more traumatic). But (and with no disrespect to the human and feline tragedy alleged) there are some interesting legal issues here.","This is one of a number of cases making their way through the Courts where valuation will be an issue. Do we look at CoinMarketCap? Another data provider? Spot market exchange data? What if the value has gone or gone down? Do you need to have an expert testify about value? Is something really worth $300,000 if there isn't a market for it? Also, how do they prove that they lost $300k in crypto if the only evidence is the form of keys that they lost? (Sworn testimony, I suppose).","Another interesting question – to me, anyway, insurance coverage lawyer that I am – is whether there's coverage for this loss. There's not a ton of law on the treatment of cryptocurrency under a homeowners' policy. I wrote <a href=\"https:\/\/medium.com\/crypto-caselaw-minute\/crypto-caselaw-minute-13-12-6-2018-e17bda405c0b\" data-v-f87c67ca=\"\">about a Ohio case a year or so ago that held that lost bitcoin<\/a> wasn't money for purposes of a property policy sub-limit for money.","It's possible that the plaintiffs here might also the ability to recover under the homeowners insurance policy in a similar way. Similar questions likely will arise under the commercial general liabilty policies held by the Defendants in this case – is a loss of cryptocurrency private keys \"damage because of property damage\", or will insurance complanies argue that coverage doesn't apply?","I'm not going to answer those questions here – here's a <a href=\"https:\/\/www.americanbar.org\/groups\/litigation\/committees\/insurance-coverage\/articles\/2018\/coverage-bitcoin-losses\/\" data-v-f87c67ca=\"\">link to a longer article that I wrote on the subject<\/a>&nbsp;– but will simply note that as crypto becomes more a part of mainstream life, these are the workaday issues that we will see courts grapple with.","In the meantime: &nbsp;consider putting a copy of your keys somewhere safe, and hug you pets.","<strong data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Disclaimer: &nbsp;This isn't legal advice. These are my opinions only. &nbsp;They may or may not reflect the opinions or views of my past, present or&nbsp;future clients, employers, partners or canine companions. Also, I might change my mind. I contain multitudes.<\/i><\/strong>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Crocodile Int","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$300,000","content":"MONEY"},{"type":"Los Angeles","content":"LOCATION"},{"type":"Powers v. Am","content":"ORGANIZATION"},{"type":"January 27","content":"DATE"},{"type":"Ohio","content":"LOCATION"},{"type":"$300k","content":"MONEY"},{"type":"Eastern District of Michigan<\/a> (","content":"ORGANIZATION"},{"type":"2009","content":"DATE"},{"type":"CoinMarketCap","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephen Palley","The Block"]}