{"summary":"Borderless Capital and 6th Man Ventures co-led the seed round for Mayan, with further support from Solana Ventures, Hash3 and others. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287618\/borderless-capital-co-leads-3-million-seed-round-for-cross-chain-auction-protocol-mayan","publishDate":"2024-04-11T09:01:07","id":8,"type":null,"title":"Borderless Capital co-leads $3 million seed round for cross-chain auction protocol Mayan Cross-chain auction protocol Mayan raises $3 million in seed funding","category":["VENTURE CAPITAL"],"content":["Mayan, a startup building a cross-chain auction protocol, raised $3 million in seed funding.&nbsp;","Venture firms 6th Man Ventures (6MV) and Borderless Capital co-led the round. Additional participation came from <a href=\"https:\/\/www.theblock.co\/linked\/127476\/solana-ventures-announces-new-150-million-fund-for-blockchain-gaming\" data-v-f87c67ca=\"\">Solana Ventures<\/a>, Hash3, Big Brain Holdings, Arrington Capital, Wormhole Cross-Chain Ecosystem Fund, Solana co-founder Anatoly Yakovenko and Wormhole Labs co-founder Saeed Badreg.","The seed round comprises <a href=\"https:\/\/mayan.finance\/\" data-v-f87c67ca=\"\">Mayan<\/a>'s total funding raised.","\"We're thankful to the early adopters of Mayan, thanks to whom we have achieved already over $470 million in transferred value across ecosystems,\" Mayan co-founder Mo Elahi told The Block. \"We'd like to reward our most loyal users moving forward.\"&nbsp;","The firm intends to launch a points system to track user engagement on Mayan, Elahi added.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">Built on Solana, Mayan finds the best rate for users enacting transactions from any blockchain. The protocol turns input tokens into the USD-pegged stablecoin USDC and then sends them to their final destinations using Circle's Cross-Chain Transfer Protocol (<a href=\"https:\/\/www.theblock.co\/post\/228407\/circle-protocol-stablecoin-transfers-ethereum-avalanche\" data-v-f87c67ca=\"\">CCTP<\/a>). This on-chain system facilitates inter-blockchain transfers by burning USDC on the source chain, minting it again on the destination chain and communicating both processes between Circle and the source chain. Mayan<\/span><span class=\"s1\" data-v-f87c67ca=\"\"> also sends pertinent data for auctions using a message-passing platform from Wormhole.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">According to the firm's website, Mayan’s total volume reached around $486 million USD among 337,185 swaps, with active wallets hitting nearly 150,000. In the future, Mayan intends to bolster the cross-chain user experience, implement completely permissionless and transparent auctions, launch on more blockchains and add support for NFTs. <\/span>","\"Ultimately, I envision Mayan evolving into a fully permissionless venue for trading any kind of crypto assets, whether Fungible Tokens or NFTs. We’re excited to drive innovation in the intent-centric multichain future, enhancing blockchain interactions for all web3 users,\" Elahi said in a statement.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Ventures","content":"ORGANIZATION"},{"type":"Arrington Capital","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Mo Elahi","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$3 million","content":"MONEY"},{"type":"Big Brain Holdings","content":"ORGANIZATION"},{"type":"$486 million","content":"MONEY"},{"type":"Wormhole","content":"LOCATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"$470 million","content":"MONEY"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Saeed Badreg","content":"PERSON"},{"type":"Elahi","content":"PERSON"},{"type":"Solana","content":"LOCATION"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["MK Manoylov","The Block"]}