{"summary":"Bitcoin futures open interest on centralized exchanges has hit a new high of $38 billion.\nBitcoin’s price has surged to $70,000, a 66% increase year-to-date. ","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285608\/bitcoin-futures-open-interest-reaches-new-high-at-38-billion","publishDate":"2024-03-29T11:03:00","id":8,"type":null,"title":"Bitcoin futures open interest reaches new high at $38 billion","category":["The Block"],"content":["Open interest for bitcoin futures on centralized exchanges has reached a fresh high, indicating increased trading activity around the largest cryptocurrency by market capitalization.&nbsp;","According to CoinGlass, the aggregated open interest for bitcoin futures reached a record level of <a href=\"https:\/\/www.coinglass.com\/BitcoinOpenInterest\" data-v-f87c67ca=\"\">$38 billion<\/a> on Friday.","Since the start of 2024, daily open interest in bitcoin futures has increased by more than 100% from Jan 1, when it was approximately $17.2 billion. This rise coincides with bitcoin’s price surge to <a href=\"https:\/\/www.theblock.co\/prices\" data-v-f87c67ca=\"\">$70,000<\/a> — a 66% increase year-to-date.","Open interest, a measure of the total value of all outstanding or \"unsettled\" bitcoin futures contracts across exchanges, indicates increased market activity and trader sentiment around a particular asset.","The current open interest figure aligns with a monthly volume of over $2.3 trillion in bitcoin futures during March across various exchanges, the highest since May 2021, according to <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\" data-v-f87c67ca=\"\">The Block's data dashboard<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/volume-of-bitcoin-futures-monthly\/embed\" title=\"Volume of Bitcoin Futures\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Meanwhile, the total open interest for ether futures is <a href=\"https:\/\/www.coinglass.com\/BitcoinOpenInterest\" data-v-f87c67ca=\"\">$13.8 billion<\/a>, marking an almost 90% increase since the beginning of 2024. Ether’s trading price has reached $3,500, reflecting a gain of over 53% year-to-date.","In recent months, the introduction of bitcoin spot exchange-traded funds (ETFs) by firms, including BlackRock, has influenced market sentiment and resulted in cumulative net inflows of over $12 billion into bitcoin spot ETFs to date."],"hashtag":[]}