{"summary":"Tron DAO Reserve announced it’s withdrawing 3 billion TRX from various exchanges.\nThe Tron network’s USDD stablecoin continues to trade under a dollar.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152438\/tron-dao-to-withdraw-another-3-billion-trx-from-exchanges","publishDate":"2022-06-16T09:50:07","id":80,"type":null,"title":"Tron DAO to withdraw another 3 billion TRX from exchanges","category":["Stablecoins"],"content":["<span data-v-f87c67ca=\"\">The Tron DAO Reserve will pull another 3 billion TRX (worth about $180 million) from crypto exchanges as it supports the price of Decentralized USD, the stablecoin known by its ticker USDD.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a <a href=\"https:\/\/twitter.com\/trondaoreserve\/status\/1537405146568740866\" data-v-f87c67ca=\"\">tweet<\/a> on Thursday, the Tron DAO Reserve claimed that withdrawing tron (TRX) tokens from unnamed centralized and decentralized exchanges back to its own control will \"safeguard the overall blockchain industry and crypto market.\"<\/span>","The Reserve's decision to dry up TRX's liquidity comes as USDD, an algorithmic stablecoin inspired by the now defunct TerraUSD, trades under a dollar for a fourth straight day. The token is currently trading at $0.975 after falling as low as $0.959 on Wednesday, <a href=\"https:\/\/www.coingecko.com\/en\/coins\/tron\" data-v-f87c67ca=\"\">per CoinGecko<\/a>.","<span data-v-f87c67ca=\"\">Following this latest withdrawal, the DAO Reserve <a href=\"https:\/\/www.theblock.co\/post\/152151\/tron-dao-reserve-pulls-2-5-billion-trx-from-binance-as-usdd-slips-further-from-peg\" data-v-f87c67ca=\"\">will have pulled<\/a> <\/span><span data-v-f87c67ca=\"\">5.5 billion TRX from exchanges in two days, or nearly 6% of its total circulating supply. Withdrawing a token from exchanges is a highly unusual step, although controlling liquidity in this way can limit the ability of short sellers to bet against tron. It also ensures the Tron DAO can maintain a large reserve of tron, with which to redeem USDD holders looking to sell.<\/span>","<span data-v-f87c67ca=\"\">Whenever USDD drops below its dollar peg it puts inflationary pressure on tron as more tokens are created to defend the peg. On Monday, the funding rate for shorting tron on Binance had <a href=\"https:\/\/www.theblock.co\/linked\/151558\/tron-deploys-2-billion-from-reserves-to-guard-against-shorts\" data-v-f87c67ca=\"\">crossed 500%,<\/a> suggesting huge demand for the trade.<\/span>","Tron traded at about $0.06 as of the time of writing, up 6% over the past 24 hours – but still 25% lower than its price a week ago."],"hashtag":[]}