{"summary":"Blockchain analytics firm Chainalysis has launched a new website, called Market Intel, that&#x27;s aimed at asset managers and financial regulators interested in monitoring the health of crypto markets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/72968\/chainalysis-market-intelligence-free","publishDate":"2020-07-27T09:15:08","id":8001,"type":null,"title":"Chainalysis launches new crypto market intelligence site (free to public)","category":["MARKETS"],"content":["<span data-v-f87c67ca=\"\">Blockchain analytics firm <a href=\"https:\/\/www.theblockresearch.com\/org-chart-chainalysis-68923\" data-v-f87c67ca=\"\">Chainalysis<\/a> has launched a new website, called <a href=\"https:\/\/markets.chainalysis.com\/\" data-v-f87c67ca=\"\">Market Intel<\/a>, that's aimed at asset managers and financial regulators interested in monitoring the health of crypto markets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The website, a beta version of which is now free and open to the public, will provide daily metrics on trading, demand, supply, generation, risk, and insights about how cryptocurrency is flowing between various entities and regions. The site currently tracks Bitcoin, Ethereum, Tether, Bitcoin Cash, and Litecoin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Market Intel is, in some ways, a response to feedback from regulators, traditional asset managers, and \"just people from normal walks of life\" who are not necessarily interested in Chainalysis’s more sophisticated blockchain analytics products but want more information about crypto markets, Chainalysis’s chief economist Philip Gradwell told The Block in an interview.<\/span>","<span data-v-f87c67ca=\"\">It’s also a more long-term play. The market for the kind of sophisticated on-chain analytics that Chainalysis specializes in is fairly narrow, Gradwell said. But perhaps if there were better information about crypto for regulator investors, they’d be more willing to enter the market — and down the road perhaps, even willing to pay for the kind of information that Market Intel provides for free.<\/span>","<span data-v-f87c67ca=\"\">\"That is why we’ve done a lot of work to try to get away from the more technical blockchain metrics and try to put things in more real-world terms,\" Gradwell said. For instance, Chainalysis used several on-chain data points, including \"repeated diurnal patterns,\" to estimate flows between world regions. The firm also spent a year developing an algorithm to estimate exchange flows from crypto-to-fiat, which gets at the number of people cashing out, versus flows from one cryptocurrency to another, said Gradwell.<\/span>","The new site will also track indicators of risk associated with the currencies, including the \"known<a href=\"https:\/\/www.theblockcrypto.com\/linked\/53138\/chainalysis-traced-2-8-billion-in-bitcoin-being-sent-to-crypto-exchanges-by-criminals-last-year\" data-v-f87c67ca=\"\"> illicit flows<\/a>\" as a percentage of total flows, known illicit funds held and known illicit funds placed in legitimate services.","<span data-v-f87c67ca=\"\">The beta version of Market Intel will be free, and Chainalysis has no plans at the moment to start charging. \"We think the product market fit will take some time but we think it’s one worth playing for,\" said Gradwell. \"If cryptocurrency does mature into a significant financial asset then it sort of almost follows that there's’ going to be a decent data and intel industry.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fiat","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Litecoin","content":"PERSON"},{"type":"Market Intel","content":"ORGANIZATION"},{"type":"Intel","content":"ORGANIZATION"},{"type":"Gradwell","content":"PERSON"},{"type":"Philip Gradwell","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Chainalysis","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Mike Orcutt","The Block"]}