{"summary":"Walmart, the world&#x27;s biggest retailer, is set to sell NFT collection Pudgy Penguins&#x27; toyline in its 2,000 stores across the U.S.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252987\/walmart-pudgy-penguins-nft-toys","publishDate":"2023-09-26T11:00:04","id":8007,"type":null,"title":"Walmart to sell Pudgy Penguins toyline in 2,000 stores","category":["NFT COLLECTIONS"],"content":["Walmart, the world's biggest retailer, is set to sell NFT collection Pudgy Penguins' toyline in its 2,000 stores across the U.S.","<span data-v-f87c67ca=\"\">Each Pudgy toy provides access to Pudgy World — a multiplayer digital social platform where users can build their \"Forever Pudgy\" characters, play mini-games and interact with other users. Pudgy World is based on zkSync Era, an <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.45%\n    <\/span><\/a> <!----><\/span><\/span> Layer 2 blockchain network.<\/span>","Walmart will sell 26 different Pudgy toys, including Plush Buddies, Clip-on Plushes, Igloo Collectibles and Action Figures, Pudgy Penguins said Tuesday. Meanwhile, exclusive toys to Walmart are Ice Chrome and Gold Chrome collectible figures inside mystery Igloos, as well as a Blind Box with a surprise Clip-On Plush inside, Pudgy Penguins added. The Pudgy toys cost between $2.99-$11.97.","\"We know our customers are looking for the latest trends and innovation to gift themselves or a loved one,\" Brittany Smith, vice president of merchandising — toys, <a href=\"https:\/\/www.theblock.co\/post\/252032\/walmart-metaverse-expansion\" data-v-f87c67ca=\"\">Walmart<\/a> U.S., said in a statement. \"Pudgy Penguins is bridging the gap between our physical and digital worlds of play for kids in a really engaging way and their price point is right in line with our goal of providing Every Day Low prices.\"","Each Pudgy toy comes with a unique birth certificate that allows users to claim unique traits for their digital Forever Pudgy character inside Pudgy World by scanning a QR code, Pudgy Penguins said. The toy designs feature traits based on IP from NFT collections, including Meebits and DeGods. And since all of the toys are connected to existing pieces of NFT IP, the current NFT holders will receive licensing royalties for each corresponding toy that is sold at Walmart, Pudgy Penguins said.","Additionally, Pudgy toys sold at Walmart will offer consumers the chance to find a golden ticket, which provides access to a rare trait for their Forever Pudgy Penguin in Pudgy World.","Pudgy Toys and Pudgy World were first launched in May of this year to blend NFTs and blockchain technology with physical toys. The toys <a href=\"https:\/\/www.amazon.com\/stores\/page\/15E0E178-93ED-4DE6-A58C-837672E651C5\" data-v-f87c67ca=\"\">are also available on online retailer Amazon.<\/a> Pudgy toys are made by PMI Kids' World, which also produces toys for Fortnite and Among Us.","As for <a href=\"https:\/\/www.theblock.co\/post\/197969\/pudgy-penguins-floor-price-jumps-25-why-because-penguins\" data-v-f87c67ca=\"\">Pudgy Penguins<\/a>, it is the nineteenth-largest NFT collection by sales volume of all time, according to <a href=\"https:\/\/www.cryptoslam.io\/\" data-v-f87c67ca=\"\">CryptoSlam data<\/a>. The Ethereum-based collection, comprising 8,888 NFTs featuring cartoon penguins, was launched in 2021 and sold to entrepreneur Luca Netz for $2.5 million in 2022 after the community voted to oust the project's founders. Pudgy Penguins holders had claimed the founders didn't keep their promises, like making a kids' book and a metaverse game.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"Amazon","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"May","content":"DATE"},{"type":"$2.5 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Brittany Smith","content":"PERSON"},{"type":"Pudgy World","content":"LOCATION"},{"type":"Luca Netz","content":"PERSON"},{"type":"Igloo Collectibles and Action Figures","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$11.97","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"$2.99","content":"MONEY"},{"type":"Walmart<\/a> U.S.","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Walmart","content":"ORGANIZATION"},{"type":"Pudgy Penguins","content":"ORGANIZATION"},{"type":"-0.45%","content":"PERCENT"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["PUDGY PENGUINS"],"authors":["Yogita Khatri","The Block"]}