{"summary":"The founder of CipherBlade said new management stole his company&#x27;s assets and forged signatures, according to a complaint filed last week. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259055\/employees-forged-signatures-stole-assets-in-takeover-of-cipherblade-lawsuit-alleges","publishDate":"2023-10-23T15:15:02","id":8009,"type":null,"title":"Employees forged signatures, stole assets in takeover of CipherBlade, lawsuit alleges","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The founder of blockchain investigations firm CipherBlade said new management stole his company's assets, forged signatures and took items from his home, according to a <a href=\"https:\/\/www.courtlistener.com\/docket\/67898209\/cipherblade-llc-v-cipherblade-llc\/\" data-v-f87c67ca=\"\">complaint<\/a> filed last week.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Richard Sanders founded Pennsylvania-based CipherBlade in 2019. The firm helps federal government agencies, private companies and individuals in investigations of financial crimes, with a focus on cybercrime. After Sanders went to Ukraine in 2022 to volunteer with investigations involving crypto, trouble ensued, according to the lawsuit filed in an Alaska district court.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Specifically, knowing Mr. Sanders would be in Ukraine, prior to and just after his departure, Defendants made material misrepresentations to Mr. Sanders to gain access to his accounts, stole trade secrets in the form of confidential investigation information, customer leads, customer lists, and investigatory data and stole access to the CipherBlade PA business itself,\" the filing read.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The defendants named in the lawsuit also allegedly redirected clients to an entity in Alaska and another in Singapore.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">One of the defendants, Manuel Kriz, began working for CipherBlade in 2021 and had limited authority and administrative access. Kriz and another defendant, Michael Krause, convinced Sanders to grant them access to an email address while he was in Ukraine. Sanders said he did not have access to that email and thought it would be used to \"facilitate electronic signing of routine client engagements,” according to the complaint.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">After Kriz and others kept allegedly asking Sanders for access to a separate email, he became concerned and asked that Kriz be fired.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Mr. Kriz's termination was a charade. In fact, Mr. Kriz had not been terminated as Mr. Sanders had directed. Mr. Kriz continued to be involved with CipherBlade PA and conspired with the other Defendants to engage in this scheme,\" according to the complaint.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Later when Krause announced to CipherBlade PA that Kriz was fired, the team became concerned because they were not familiar with Krause, despite him making large changes, the filing read.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I didn't realize the situation was that bad,\" one employee wrote.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Also while abroad in Ukraine, Sanders said he received alerts from his home security system that notified him of all his security cameras suddenly switching offline, according to the complaint.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Upon returning home, Mr. Sanders observed that business registration-related documents, including LLC and business filings, were missing from his home. He found a U.S. Postal Service receipt for a package mailed by U.S. Mail from his home, fraudulently using his name and credit card information without permission, to an address in Cyprus,\" according to the filing.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Sanders said on <a href=\"https:\/\/www.linkedin.com\/pulse\/warning-cipherblade-richard-sanders%3FtrackingId=fqm%252F9wadTcKlppMdZqZJTQ%253D%253D\/?trackingId=fqm%2F9wadTcKlppMdZqZJTQ%3D%3D\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">LinkedIn<\/span><\/a> on Monday that he was left with no choice but to cut ties.<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"For all of these reasons, I have no choice but to publicly sever ties and warn everyone that I am no longer in control of or associated with CipherBlade, and to share the lawsuit pleadings that enumerate the allegations of acts of misconduct, theft and fraud conducted by those who are controlling CipherBlade. I want to be clear that I now have zero involvement in CipherBlade and this has been the case for months now,\" Sanders said.&nbsp;<\/span>","CipherBlade disputed Sanders' allegations on Monday afternoon in a LinkedIn <a href=\"https:\/\/www.linkedin.com\/posts\/cipherblade_cipherblade-finds-itself-forced-to-issue-activity-7122299824250449920-RCSA\/?utm_source=share&amp;utm_medium=member_ios\" data-v-f87c67ca=\"\">post<\/a>. The firm said Sanders was never an owner and said he \"withdrew from active participation in the operations of CipherBlade throughout 2022 <span class=\"s2\" data-v-f87c67ca=\"\">and effectively ceased such participation altogether in early 2023, when he moved to Ukraine to pursue his personal pro-bono mission.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"We vigorously dispute Sanders’ allegations and believe that his claims are baseless, vexatious, and motivated by personal animosity. Our repeated efforts to bring about a more orderly and amicable separation have been consistently rebuffed. We will respond to his claims in due course, within the legal process, as we continue to provide our clients with world-class service.\"&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Updated at 5:15 pm. ET to add comments from CipherBlade&nbsp;<\/em>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Michael Krause","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"5:15","content":"TIME"},{"type":"PA","content":"ORGANIZATION"},{"type":"CipherBlade PA","content":"ORGANIZATION"},{"type":"CipherBlade","content":"PERSON"},{"type":"Cyprus","content":"LOCATION"},{"type":"2019","content":"DATE"},{"type":"Sanders","content":"PERSON"},{"type":"U.S. Postal Service","content":"ORGANIZATION"},{"type":"Richard Sanders","content":"PERSON"},{"type":"Krause","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Manuel Kriz","content":"PERSON"},{"type":"Pennsylvania","content":"LOCATION"},{"type":"CipherBlade","content":"ORGANIZATION"},{"type":"Alaska","content":"LOCATION"},{"type":"Kriz","content":"PERSON"},{"type":"afternoon","content":"TIME"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["LAWSUITS"],"authors":["Sarah Wynn","The Block"]}