{"summary":"FLock will use the funds to grow its team and develop an AI training platform powered by federated learning.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285181\/web3-ai-training-firm-flock-raises-6-million-in-seed-funding","publishDate":"2024-03-28T09:01:09","id":8014,"type":null,"title":"Web3 AI training firm FLock raises $6 million in seed funding","category":["VENTURE CAPITAL"],"content":["FLock, a web3 startup that decentralizes artificial intelligence training, raised $6 million in seed funding.&nbsp;","Venture firms Lightspeed Faction and Tagus Capital led the round, which included participation from DCG, OKX Ventures and Volt Capital, among others. The seed round brings FLock's total funding raised to $8 million, the firm's CEO Jiahao Sun told The Block. Sun added that FLock's board of directors will not change following the round since FLock is still at a Simple Agreement for Future Equity (SAFE) stage.&nbsp;","FLock, intentionally stylized that way, will use the funds to grow its team and develop an AI training platform powered by federated learning — a decentralized machine learning approach that emphasizes data privacy. Sun said FLock uses an open leaderboard to incentivize competition in the machine learning community and sponsored training tasks that set reward criteria for each model.&nbsp;","\"As we continue to grow and expand our platform, we are excited to witness the transformative impact of decentralized AI across various industries, from healthcare and finance to education and beyond,\" Sun said. \"We believe that the future of AI lies in the power of decentralized communities, and we are proud to be at the forefront of this revolution.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Volt Capital","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Simple Agreement for Future Equity","content":"ORGANIZATION"},{"type":"Lightspeed Faction","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$6 million","content":"MONEY"},{"type":"$8 million","content":"MONEY"},{"type":"OKX Ventures","content":"ORGANIZATION"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["MK Manoylov","The Block"]}