{"summary":"Frankfurt-based Deutsche Börse has launched a cryptocurrency trading platform for institutional clients.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280470\/deutsche-borse-rolls-out-crypto-trading-platform-focused-on-institutional-clients","publishDate":"2024-03-05T06:08:04","id":8015,"type":null,"title":"Deutsche Börse rolls out crypto trading platform focused on institutional clients","category":["COMPANIES"],"content":["Frankfurt-based stock exchange operator Deutsche Börse Group has released a platform for the spot trading, settlement, and custody of crypto assets for institutional clients called Deutsche Börse Digital Exchange (DBDX).","<a href=\"https:\/\/www.theblock.co\/linked\/127721\/deutsche-borse-closes-deal-for-majority-stake-in-crypto-finance-ag\" data-v-f87c67ca=\"\">Deutsche Börse Group<\/a> said in a statement on Tuesday that the platform offers institutional clients trading products for cryptocurrencies through a single point of access.","\"We aim to provide trusted market operations for crypto assets, ensuring transparency, security, and regulatory compliance for institutional clients in Europe. This enhances market integrity and security. It is a first step towards realizing Deutsche Börse’s ambition in the Horizon 2026 strategy to play a leading role in the digitalization of asset classes,\" Deutsche Börse Head of FX &amp; Digital Assets Carlo Kölzer said.","Deutsche Börse presented its '<a href=\"https:\/\/www.deutsche-boerse.com\/dbg-en\/our-company\/insights-horizon2026-en\/Horizon-2026-our-new-strategy-3717416#:~:text=At%20its%20Investor%20Day%20on,new%20%E2%80%9CHorizon%202026%E2%80%9D%20strategy.&amp;text=Its%20core%20elements%20are%3A,cent%20per%20year%20to%20growth\" data-v-f87c67ca=\"\">Horizon 2026<\/a>’ strategy in November 2023. The strategy details Deutsche Börse’s plan to enhance its engagement in the digitalization of asset classes and the corresponding trading and settlement platforms. The objective is to create a trading platform for digital assets to significantly broaden the range of both investable and tradable instruments open to institutional clients","Trading on the DBDX platform will initially take place on a Request for Quote (RfQ) basis. The DBDX platform will be operated by Deutsche Börse, and <a href=\"https:\/\/www.theblock.co\/linked\/109947\/deutsche-borse-majority-stake-crypto-finance\" data-v-f87c67ca=\"\">Crypto Finance<\/a> (Deutschland) GmbH will provide settlement and custody services.","\"This marks a pivotal moment in our mission to cultivate a resilient and trusted digital asset ecosystem together with Deutsche Börse, while also strengthening Crypto Finance's well-established and regulated custody and settlement offering in Germany,\" Crypto Finance CEO Stijn Vander Straeten said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Deutsche Börse Group","content":"ORGANIZATION"},{"type":"2026","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Crypto Finance<\/a> (Deutschland) GmbH","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Stijn Vander Straeten","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Deutsche Börse Head of FX &amp; Digital Assets Carlo Kölzer","content":"ORGANIZATION"},{"type":"Frankfurt","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Germany","content":"LOCATION"},{"type":"Deutsche Börse","content":"ORGANIZATION"},{"type":"Deutsche Börse Digital Exchange","content":"ORGANIZATION"},{"type":"This marks","content":"MONEY"},{"type":"Crypto Finance","content":"ORGANIZATION"}],"hashtag":["FINTECH","TRADFI BANKS"],"authors":["Brian McGleenon","The Block"]}