{"summary":"ProShares is set to launch the first short bitcoin-linked exchange traded fund in the US on Tuesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153108\/proshares-launches-first-us-etf-to-bet-on-bitcoins-decline","publishDate":"2022-06-20T10:43:34","id":8018,"type":null,"title":"ProShares launches first US ETF to bet on bitcoin&#x27;s decline","category":["BITCOIN"],"content":["<span data-v-f87c67ca=\"\">ProShares <\/span><span data-v-f87c67ca=\"\">plans to launch a short bitcoin exchange traded fund (ETF) to allow investors to bet on declines in the largest cryptocurrency.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The ProShares Short Bitcoin Strategy ETF will give investors the opportunity to profit from a decline in bitcoin’s price, or to hedge their exposure to crypto, according to a statement on Monday. The product will launch on Tuesday with the ticker BITI as markets reopen following the Juneteenth holiday.<\/span>","<span data-v-f87c67ca=\"\">“As recent times have shown, bitcoin can drop in value,” ProShares CEO Michael L. Sapir said in Monday's announcement, adding that the product will enable investors to obtain short exposure to bitcoin through a traditional brokerage account.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">BITI will aim to deliver the opposite performance of the S&amp;P CME Bitcoin Futures Index. It will obtain exposure through bitcoin futures contracts.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Alternatively investors will also have the option of investing through ProFunds, an affiliated mutual fund company of ProShares, which will launch a short bitcoin strategy ProFund (BITIX) on Tuesday.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Previously ProShares was the first issuer to offer a crypto ETF product in the US, with the launch of its ProShares Bitcoin Strategy ETF — which topped almost <\/span><a href=\"https:\/\/www.theblock.co\/linked\/121364\/proshares-bitcoin-futures-etf-sees-historic-nearly-1-billion-trading-day\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$1 billion<\/span><\/a><span data-v-f87c67ca=\"\"> in its first day of trading in October 2021. <\/span>","<span data-v-f87c67ca=\"\">While this is the first product of its kind in the US, several short bitcoin exchange traded products (ETPs) already exist in markets from Europe to Canada.<\/span>","<span data-v-f87c67ca=\"\">The launch comes as trading in bitcoin and most cryptocurrencies was flat on Monday, following a tumultuous week that saw bitcoin fall below $20,000 for the first time since December 2020. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$20,000","content":"MONEY"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"Michael L. Sapir","content":"PERSON"},{"type":"October 2021","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"December 2020","content":"DATE"},{"type":"ProShares Short Bitcoin Strategy ETF","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"US","content":"LOCATION"}],"hashtag":["BITCOIN","BITCOIN FUTURES ETF"],"authors":["Adam Morgan McCarthy","The Block"]}