{"summary":"Neutron raised $10 million in a funding round led by venture firms Binance Labs and CoinFund.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235831\/cosmos-blockchain-neutron-reports-10-million-funding-round-led-by-binance-labs-and-coinfund","publishDate":"2023-06-21T10:12:33","id":8019,"type":null,"title":"Cosmos blockchain Neutron sees $10M round led by Binance Labs, CoinFund","category":["DEALS"],"content":["Neutron, a smart contract blockchain for the Cosmos ecosystem, raised $10 million in a seed funding round led by venture firms Binance Labs and CoinFund. Delphi Ventures, LongHash and Nomad also participated in the round, the company said in a statement.","Neutron serves as a Cosmos-based network designed for writing smart contracts using CosmWasm, a computational environment within the Cosmos ecosystem, while simultaneously allowing developers to write code in the Rust programming language.&nbsp;","Neutron aims to provide cross-chain, smart contract applications for the Cosmos network of more than 50 interconnected, app-specific blockchains or appchains by closely aligning with the Cosmos Hub and leveraging its high security.","\"The market demand for appchains and L2s is growing rapidly and Neutron enables mission-critical tooling while also supporting Rust, the second-most popular smart contracting language in the world,\" said Alex Felix, chief investment officer at CoinFund.","The company didn't disclose the valuation seen in the round.&nbsp;","Neutron launched in May after becoming the first Cosmos blockchain to go live using Replicated Security, a feature that allows so-called consumer chains to tap into the validators of the Cosmos Hub, the central and oldest chain in the Cosmos ecosystem, to gain the ability to run secure applications in a cost-effective way.","\"The Cosmos ecosystem has significant potential and, as its first consumer chain, Neutron is driving the development of secure, developer-friendly cross-chain infrastructure,\" said Yi He, co-founder of Binance and head of Binance Labs.","The funds raised will be directed toward supporting the expansion of the Neutron ecosystem and incentivize development of new dApps, the team said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alex Felix","content":"PERSON"},{"type":"CoinFund","content":"ORGANIZATION"},{"type":"Delphi Ventures","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"Binance Labs","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Nomad","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}