{"summary":"A since-deleted post began circulating yesterday calling for the removal of three Coinbase executives. CEO Brian Armstrong responded today.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/151415\/coinbase-ceo-addresses-company-culture-claims-from-anonymous-post","publishDate":"2022-06-10T16:21:29","id":8024,"type":null,"title":"Coinbase CEO addresses company culture claims from anonymous post","category":["COMPANIES"],"content":["A since-deleted online post began circulating yesterday calling for the removal of three Coinbase executives, citing failures of the exchange's non-fungible token (NFT) platform, an aggressive approach to hiring and communication failures.","On Friday, CEO Brian Armstrong addressed the claims <a href=\"https:\/\/twitter.com\/brian_armstrong\/status\/1535304943728414721\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">in a tweet thread<\/a>.","The author positions themselves as a Coinbase employee or coalition of Coinbase employees, though The Block was not able to verify the identity of the poster.&nbsp;","\"We the employees at Coinbase believe that the executive team has recently been making decisions that are not in the best interests of the Company, its employees, and its shareholders,\" reads the post, according to <a href=\"https:\/\/web.archive.org\/web\/20220609194212\/https:\/\/mirror.xyz\/0x58E3a8Bc8CBFC10AC2972Fb9d0cF359E21eae56b\/ZIO--5ywx1z-aKs0KCQ2PeTNutVKune7zhA1D09R0q0\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">an archived version<\/a> since circulated on social media.","The post names COO Emilie Choi, CPO Surojit Chatterjee, and Chief People Officer LJ Brock as \"the most prominent executives who have been executing plans and ideas that have led to questionable results and negative value,\" and calls for their removal.","These \"questionable results\" include a toxic workplace culture due to feedback and performance review systems, aggressive hiring and recent <a href=\"https:\/\/www.theblockcrypto.com\/linked\/149965\/coinbase-extends-hiring-freeze-will-rescind-some-accepted-offers\" data-v-f87c67ca=\"\">rescinding<\/a> of offers and \"over-prioritization of certain products\" leading to a lack of focus on what the poster perceives as important issues, \"like infrastructure.\"","The post also cites \"a general apathetic and sometimes condescending attitude\" from the named executives. It proposes a vote of no confidence to remove them.","The post claims the actions of Choi, Chatterjee and Brock have hurt employees, \"who have to deal with the unrealistic demands from said executives and the damage they have caused on a day-to-day basis,\" as well as damage to shareholders. Coinbase's stock has <a href=\"https:\/\/www.theblockcrypto.com\/linked\/145886\/coinbase-stock-price-falls-more-than-20-to-hit-record-low-as-us-equities-continue-decline\" data-v-f87c67ca=\"\">plummeted<\/a> in recent weeks.&nbsp;","The Block spoke with multiple Coinbase employees who could not verify if the post came from a fellow employee, but said the claims are consistent with grievances they've seen expressed in the workplace.","One employee said that some teams have grown to a size that doesn't make sense for their mandate and that over-expansion can dilute cultures. Another said that Choi, Chatterjee and Brock are unpopular internally among certain groups in the company.&nbsp;","Armstrong pushed back against the letter in a Twitter <a href=\"https:\/\/twitter.com\/brian_armstrong\/status\/1535304943728414721?s=20&amp;t=ylTqrNUvPmiba6fmjLu0AA\" data-v-f87c67ca=\"\">thread<\/a>, posting a Hacker News forum discussion of the post and calling the claims \"really dumb on multiple levels.\"","He urged the poster to quit and find a company to work at that they believe in if they have no confidence in Coinbase leadership. While he said he welcomed suggestions to improve the company, Armstrong said \"our culture is to praise in public, and criticize in private.\"","\"Posting this publicly is also deeply unethical because it harms your fellow co-workers, along with shareholders and customers,\" he tweeted. \"It's also dumb because if you get caught you will be fired, and it's just not an effective way to get what you claim to want.\"","The supposed-employee post made mention of specific human resources tools Coinbase has tested, naming the Dot Collector, a Ray Dalio-developed tool that enables real-time feedback and polling of micro-feedback to improve performance. Armstrong specifically responded to this claim, saying he was \"shocked to see how much play this got, for such a small thing in the org.\"","Two teams tried out the tool for about a quarter, according to Armstrong, and didn't use it much. The feedback received was positive, he said, but there weren't plans to use it further at Coinbase.","\"A non-event from my POV,\" Armstrong wrote.","He attributed some of the ire to the general frustration of a down market, and encouraged teams to pull together in a difficult period. Given Coinbase's size, Armstrong said he expects a small number of individuals to periodically leak information.","\"There is probably lots we can be doing better, but if you're at a place where you want to leak stuff externally then it's time for you to go,\" he said. \"You're hurting yourself and those around you.\"","<em data-v-f87c67ca=\"\">Contributed reporting by Frank Chaparro<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Brock","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Chatterjee","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Ray Dalio","content":"PERSON"},{"type":"Emilie Choi","content":"PERSON"},{"type":"Choi","content":"ORGANIZATION"},{"type":"Surojit Chatterjee","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["BRIAN ARMSTRONG","COINBASE","HIRING","TWITTER"],"authors":["Aislinn Keely","The Block"]}