{"summary":"Crypto market maker B2C2 has acquired an equity and token stake in institutional bitcoin exchange LGO\nThe deal takes the market maker\/exchange relationship one step further","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61356\/crypto-market-maker-b2c2-acquires-equity-stake-in-bitcoin-exchange-lgo","publishDate":"2020-04-09T08:00:16","id":803,"type":null,"title":"B2C2 Acquires Equity Stake in Bitcoin Exchange LGO","category":["Exchanges"],"content":["Cryptocurrency market maker B2C2 has acquired an equity and token stake in institutional bitcoin exchange LGO.","Revealing the news exclusively to The Block on Thursday, France-based LGO said the partnership had been in the pike for a couple of months. B2C2 has been a market maker on LGO, providing liquidity for the exchange.&nbsp;","Since the beginning of the year, LGO has been connected to B2C2 through its internal agency brokerage, which allows users of its platform to access liquidity across several market makers.&nbsp;","It's not unusual for exchanges to offer incentive deals to entice market makers to add liquidity to their venues, but the new deal takes the market maker\/exchange relationship one step further.&nbsp;","In an interview with The Block, LGO chief executive Hugo Renaudin said that those agreements typically work well, but the deal struck with B2C2 will better align interests of the two companies.&nbsp;","Founded in April 2019, LGO claims to serve 50 institutional clients in 15 different countries.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Powerful market markers?<\/strong><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nB2C2 acquiring an equity stake in LGO is interesting, market observers told The Block, because it goes on to show that liquidity providers are becoming powerful in the crypto ecosystem.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLast year, market maker Jump Trading was also reportedly looking to acquire an equity stake in prime brokerage firm Tagomi.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nDetails of the B2C2 and LGO deal remain scarce. Both the firms declined to share the deal size and percentage of the stake acquisition.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLooking ahead, B2C2 and LGO plan to launch several products, including over-the-counter (OTC) execution, digital asset financing, and stablecoin trading.","LGO <a href=\"https:\/\/www.coindesk.com\/a-new-exchange-launches-letting-institutions-custody-their-own-crypto\" data-v-f87c67ca=\"\">raised<\/a> 3,600 bitcoin (roughly $32.5 million at the time) through an initial coin offering or ICO in February 2018, when it was known as Legolas Exchange. The ICO sold LGO tokens to 9,000 retail buyers from more than 50 countries.","<em data-v-f87c67ca=\"\">Frank Chaparro contributed reporting.<\/em>"],"hashtag":[]}