{"summary":"The creators of a new Brazilian Real-pegged stablecoin called the Celo Real say it can complement Brazil&#x27;s real-time payment system.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/132360\/why-celo-launched-an-algorithmic-stablecoin-pegged-to-brazils-currency","publishDate":"2022-01-30T09:13:23","id":8032,"type":null,"title":"Why Celo launched an algorithmic stablecoin pegged to Brazil&#x27;s currency","category":["STABLECOINS"],"content":["<span data-v-f87c67ca=\"\">Open-source blockchain Celo launched a Brazilian Real-pegged, algorithmic stablecoin (cREAL).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Open-source blockchain Celo recently introduced a Brazilian Real-pegged, algorithmic stablecoin called the Celo Real (cREAL).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Three crypto exchanges in Brazil will provide access to the cREAL stablecoin: FlowBTC, NovaDAX and Ripio. In addition, the wallets Bitfy and Coins will also support the digital asset. <\/span><a href=\"https:\/\/www.theblockresearch.com\/analyzing-algorithmic-stablecoins-exploits-112840\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Algorithmic stablecoins<\/span><\/a><span data-v-f87c67ca=\"\"> are designed to hold their peg to a currency automatically, instead of being backed by fiat money.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While Brazil already has a <a href=\"https:\/\/www.theblockcrypto.com\/news+\/115829\/brazils-public-instant-payment-system-pix-crypto\" data-v-f87c67ca=\"\">very popular<\/a> public instant payment system, called Pix, <\/span><a href=\"https:\/\/clabs.co\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">CLabs<\/span><\/a><span data-v-f87c67ca=\"\"> partner <\/span><span data-v-f87c67ca=\"\">Markus Franke told The Block that the cREAL now provides a way to use complementary DeFi applications (CLabs is a “service organization” focused on developing and growing Celo projects). For example, Celo’s DeFi applications could help enable new options for building up a credit history, he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Celo is completely open-source, so there will be projects that will build a bridge from Pix to Celo transactions,” Franke said. ”There will be people who build lending and borrowing applications, so I think this is really, really nice.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Franke, Brazil’s high penetration of smartphones and strong “gig economy\" make the country an interesting market for launching a stablecoin in local currency that is focused on mobile payments. <\/span>","<span data-v-f87c67ca=\"\">While most early stablecoins have been pegged to the U.S. dollar to help people avoid the volatility of their home currencies, Franke says there’s now growth in those pegged to local currencies as well.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Now, this is changing,” Franke says, of stablecoins typically being pegged to the dollar. “Now we see real end-users coming into the equation, using crypto not only for trading but also for transactions, for saving, for lending and borrowing, but also for payments for remittances. And now it makes a difference because people in these different countries actually have to maybe pay their merchants in local currencies, or pay taxes in local currencies.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Celo, the cREAL stablecoin can be used for both centralized finance and decentralized finance (DeFi) applications on its blockchain, such as Moola Market for collateralized loans. <\/span>","<span data-v-f87c67ca=\"\">People in Brazil can also load cREAL into their Bitfy wallet to pay for bills, food or merchants belonging to the network of leading Brazilian payment processor, Cielo.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"Celo","content":"PERSON"},{"type":"Franke","content":"PERSON"},{"type":"Markus Franke","content":"PERSON"}],"hashtag":[],"authors":["Kristin Majcher","The Block"]}