{"summary":"MakerDAO is set to integrate the Ethereum Layer 2 network StarkNet on April 28 as part of its multichain strategy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142641\/makerdao-starknet-integration-ethereum-layer-2","publishDate":"2022-04-20T06:30:30","id":8034,"type":null,"title":"MakerDAO integrating Ethereum Layer 2 StarkNet next week","category":["DEFI"],"content":["MakerDAO, one of the oldest and largest DeFi protocols and the creator of the DAI stablecoin, is set to integrate the Ethereum Layer 2 network StarkNet on April 28 as part of its multichain strategy.","Deploying MakerDAO on StarkNet will allow users to mint and trade DAI faster and at a cheaper cost. \"It's going to be about 10x improvement in cost compared to Ethereum,\" Louis Baudoin, facilitator for the StarkNet core unit at MakerDAO, told The Block.","As for speed, it currently it takes 1-2 minutes to process transactions on StarkNet, Baudoin said, but the goal is to reduce this to a few seconds within the next year. Ethereum transactions can take up to 5 minutes to process, depending on the gas fees paid and the network's congestion.","<a href=\"https:\/\/www.theblockcrypto.com\/post\/135161\/ethereum-scaling-solution-starknet-completes-launch-with-goal-to-move-to-community-control\" data-v-f87c67ca=\"\">StarkNet,<\/a> developed by StarkWare, uses ZK-rollups — a Layer 2 technology that bundles Ethereum transactions off the main chain — to support a larger number of transactions at a lower cost.","MakerDAO's StarkNet integration is an expansion of its multichain roadmap. The Ethereum-based protocol has previously integrated <a href=\"https:\/\/forum.makerdao.com\/t\/official-dai-token-bridge-now-live-on-arbitrum-one\/10438\" data-v-f87c67ca=\"\">Arbitrum<\/a> and <a href=\"https:\/\/forum.makerdao.com\/t\/official-dai-bridge-on-optimism\/9329\" data-v-f87c67ca=\"\">Optimism<\/a>, two networks based on a different scaling technique known as optimistic rollups.","The StarkNet integration will occur in four phases, Baudoin explained.","On April 28, a simple token bridge will be released for DAI transactions. The second phase will implement fast withdrawals from Layer 2 to Layer 1, in the second quarter of this year. The third step, in the third quarter, will include Layer 2 to Layer 2 teleportation. And, finally, MakerDAO will deploy full multi-collateral DAI (MCD) on Starknet in the fourth quarter of 2022 or the first quarter of 2023.","MakerDAO aims to support more networks in the future. Baudoin said the protocol will support \"most Ethereum Layer 2s and some key Layer 1s.\" For Layer 1s, MakerDAO will deploy wrapped DAI, he said.","\"The aim of the multichain strategy is to capitalize on the speed and cost advantages of Layer 2 chains while also growing coverage of DAI and making it the stablecoin of choice within the multichain world,\" said MakerDAO.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the fourth quarter of 2022","content":"DATE"},{"type":"second quarter of this year","content":"DATE"},{"type":"April 28","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"third quarter","content":"DATE"},{"type":"DAI","content":"ORGANIZATION"},{"type":"first quarter of 2023","content":"DATE"},{"type":"Baudoin","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"Louis Baudoin","content":"PERSON"}],"hashtag":["DAI","ETHEREUM","STARKNET"],"authors":["Yogita Khatri","The Block"]}