{"summary":"The top 10 ladys whales are sitting on cumulative profits currently worth over $20 million, according to on-chain data.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230955\/milady-ladys-memecoin-whales-profits","publishDate":"2023-05-16T06:57:44","id":8036,"type":null,"title":"Milady memecoin whales sitting on paper profits worth over $20 million","category":["MARKETS"],"content":["Milady (ladys), a memecoin styled on the Milady NFT collection, has made some crypto traders millions — at least on paper — as its price jumped since launching earlier this month.","The top 10 ladys whales — large holders of the tokens — are collectively sitting on potential profits that currently total more than $20 million, according to onchain data analyzed by The Block Research via Nansen and Lookonchain. While some of the whales have sold some holdings, they still hold over 176 trillion ladys coins, or around 20% of its total supply, per the onchain data.","The profits result from simple math. The whales paid a weighted average price of $0.0000000037604 per token, and the current price of the coin is around $0.00000012. That's a lot of zeros, but it adds up to a gain of 3,091%, according to CoinGecko data.","","","Realizing profits may not come easy for these whales, given the low liquidity. “There is about $3 million worth of liquidity, spread over Uniswap v2 and v3. If these whales want to close down their position, they should either take into account huge slippage, or they need to wind down the position slowly over time,” said Simon Cousaert, director of data at The Block.","Memecoin trading volumes are soaring, led by ladys and <a href=\"https:\/\/www.theblock.co\/post\/230279\/elon-musk-milady-price-twitter-meme\" data-v-f87c67ca=\"\">pepe<\/a>. Last month, Dogecoin saw volatility after Elon Musk temporarily replaced the blue Twitter bird icon with an image of the doge dog. <span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Last week, Musk also sent the price of Milady NFTs and ladys jumping after <a href=\"https:\/\/www.theblock.co\/post\/230279\/elon-musk-milady-price-twitter-meme\" data-v-f87c67ca=\"\">he&nbsp;<\/a><\/span><a href=\"https:\/\/www.theblock.co\/post\/230279\/elon-musk-milady-price-twitter-meme\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">tweeted a Milady meme<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">.“There is no meme. I love you,” the text of the meme read, over an image of a Milady NFT.&nbsp;<\/span>","The Milady (ladys) memecoin pays homage to the Milady NFT collection, and was launched on May 7. The coin has no association with Charlotte Fang or her creation Milady Maker, <a href=\"https:\/\/milady.gg\/\" data-v-f87c67ca=\"\">according to its website<\/a>.","\"$LADYS is a memecoin with no intrinsic value or expectation of financial return,\" the website reads. \"There is no formal team or roadmap. The coin is completely useless and for entertainment purposes only.\"","Despite the warning, crypto enthusiasts have lapped up the coin and traded it significantly. Pepe is currently the 271st largest crypto token from thousands of tokens in the market, with a market capitalization of over $100 million, according to CoinGecko data.","The total supply of ladys is over 888 trillion and 1% of the total supply was airdropped to all pepe and Milady NFT holders, according to Milady memecoin's website.","Two of the top 10 whales' wallets seem to belong to <a href=\"https:\/\/www.theblock.co\/post\/225705\/dwf-labs-biggest-crypto-investors\" data-v-f87c67ca=\"\">DWF Labs, a controversial crypto market maker and investment firm<\/a>, according to Lookonchain. DWF Labs appears to be depositing ladys to centralized exchanges (CEXs) and could, therefore, dump the tokens, according to Lookonchain. But Andrei Grachev, managing partner of DWF Labs, <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1658381968730357768\" data-v-f87c67ca=\"\">tweeted today that<\/a> \"no any single $LADYS was sold on CEX. We already approach the wallet owner and he will withdraw all the $LADYS back to the wallet asap.\"","\"This wallet belongs to one of our partners, not to us. @lookonchain. I have no idea what coins he will buy \/ send in the future , but it should not be related to us,\" Grachev continued. \"As I said - for community driven tokens and we are happy to be 100% transparent. We have no intention to sell even a single $LADYS and have long term vision about that.\"","Earlier this week, <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1656591119067512833?s=20\" data-v-f87c67ca=\"\">Grachev<\/a> <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1656584413742768129?s=20\" data-v-f87c67ca=\"\">said<\/a> <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1656566820898234370?s=20\" data-v-f87c67ca=\"\">some of the tokens were sent to CEXs for market making purposes.<\/a> DWF Labs did not respond to The Block's request for comment.","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Ladys memecoin price, source: CoinGecko<\/em><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$0.00000012","content":"MONEY"},{"type":"3,091%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"100%","content":"PERCENT"},{"type":"The Block Research via Nansen","content":"ORGANIZATION"},{"type":"$LADYS","content":"MONEY"},{"type":"Grachev","content":"PERSON"},{"type":"Milady NFTs","content":"ORGANIZATION"},{"type":"$0.0000000037604","content":"MONEY"},{"type":"Dogecoin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"May 7","content":"DATE"},{"type":"Milady NFT","content":"ORGANIZATION"},{"type":"Milady meme","content":"ORGANIZATION"},{"type":"$3 million","content":"MONEY"},{"type":"Uniswap","content":"LOCATION"},{"type":"Simon Cousaert","content":"PERSON"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Charlotte","content":"LOCATION"},{"type":"Milady Maker","content":"ORGANIZATION"},{"type":"Musk","content":"ORGANIZATION"},{"type":"$20 million","content":"MONEY"},{"type":"Milady memecoin","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"Andrei Grachev","content":"PERSON"},{"type":"Lookonchain","content":"LOCATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}