{"summary":"From massive companies to entire countries to the latest Bitcoin ETF approvals, Bitcoin has come a long way in 15 years, says Morgan Stanley.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272523\/morgan-stanley-spot-bitcoin-etf-approvals-are-a-potential-paradigm-shift-in-global-view-of-crypto","publishDate":"2024-01-13T13:02:41","id":8039,"type":null,"title":"Morgan Stanley: Spot bitcoin ETF approvals are a &#x27;potential paradigm shift&#x27; in global view of crypto","category":["COMPANIES"],"content":["Fifteen years ago, Bitcoin was an idea on an internet forum. Now, as stablecoin volumes rival payment networks like PayPal and Visa, bitcoin's adoption by Wall Street in the form of <a href=\"https:\/\/www.theblock.co\/post\/272460\/day-two-of-spot-bitcoin-etf-trading-tops-3-1-billion-as-grayscale-and-blackrock-lead\" data-v-f87c67ca=\"\">spot Bitcoin ETFs<\/a> may mark a \"potential paradigm shift in the global perception and use of digital assets,\" said Andrew Peel, head of digital asset markets for investment bank Morgan Stanley.&nbsp;","In a note to investors, Peel gave an overview of the current threats against the U.S. dollar's current reign as the world's reserve currency, as 60% of global foreign exchange reserve balances are held in dollars. In comparison, China's yuan, despite the country's recent efforts to boost its foreign trade, makes up only 2.5% of those balances.&nbsp;","However, several \"de-dollarization\" threats may erode the greenback's place on top, Peel <a href=\"https:\/\/www.morganstanley.com\/im\/en-us\/financial-advisor\/insights\/articles\/digital-dedollarization.html\" data-v-f87c67ca=\"\">wrote<\/a>, including Bitcoin's \"remarkable\" adoption worldwide, noting that 100 million people worldwide hold the cryptocurrency (there are Bitcoin ATMs in 82 countries, Peel claims) along with major companies like Tesla and a sovereign nation, El Salvador.","Stablecoins, however, may prove to be crypto's \"killer app,\" according to Peel, who notes that stablecoin trading volume has rivaled traditional digital clearinghouses like Visa and PayPal in recent years. Both Visa and PayPal have made steps towards adopting stablecoins themselves, with Visa's integration of USDC on Solana and PayPal's PYUSD stablecoin.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"El Salvador","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"2.5%","content":"PERCENT"},{"type":"Tesla","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"Andrew Peel","content":"PERSON"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Zack Abrams","The Block"]}