{"summary":"The collection features 3D pixelated avatars that can be used in virtual worlds, gaming, and virtual reality.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/103664\/larva-labs-crypto-punks-creator-nft-meebits","publishDate":"2021-05-03T16:39:16","id":8045,"type":null,"title":"Cryptopunks creator Larva Labs launches new NFT collection Meebits","category":["NFTS"],"content":["NFT project Larva Labs just launched its third non-fungible token (NFT) project that features avatar characters for virtual worlds, games, and VR.&nbsp;","The collection, dubbed \"Meebits,\" is similar to the company's popular NFT project CryptoPunks, except instead of 2D 8-bit-pixelated characters, the avatars are 3D.&nbsp;","\"Writing a generator of voxel characters was a lot more challenging and involved than writing a 2D generator. We've been tinkering with voxel generation for a few years and are really proud of where we ended up,\" Larva Labs co-founders Matt Hall and John Watkinson wrote in a <a href=\"https:\/\/www.larvalabs.com\/blog\/2021-5-3-1-1\/introducing-the-meebits\" data-v-f87c67ca=\"\">blog post<\/a> published Monday.&nbsp;","According to the post, the collection will feature characters with rare details like Autoglyphys-style generative tattoo patterns on particular Meebits. The company will roll out an \"asset pack\" for each Meebit which allows the owner to take a \"T-pose\" version of the avatar and use it in any game or virtual world that supports humanoid avatars. By doing this, owners can activate or \"bring their Meebits to life.\"","Similar to CryptoPunks, there is a file hash stored in the smart contract. \"Once all 20,000 Meebits have been minted, we'll release the file matching that hash on IPFS. This will contain all the attribute and voxel data for each Meebit, so they can live on in perpetuity,\" Hall and Watkinson wrote.","The Meebits launch will have two distinct components: a community grant and a sale.&nbsp;","Through the community grant, CryptoPunks and Autoglyphs owners can \"redeem\" their collectibles for a free Meebit. Owners can still keep the Punk or Glyph but the Meebits contract will mark it as \"used\" once the Meebit has been claimed. The remaining Meebits will be available for sale.","Nobody knows which Meebits they will receive, but holders will have the chance to trade their collectibles on a newly-developed marketplace.&nbsp;","\"We think being able to trade Meebits for Meebits is going to be really fun. For us, this evokes the kind of collecting we did as kids, where money was rarely involved in transactions,\" Hall and Watkinson wrote. \"We are just getting started fleshing out this new market, so in the coming weeks, expect lots of new features to make trading more convenient, plus the analysis tools that we've all grown accustomed to on the Cryptopunks site.\"","The launch comes a month after Larva Labs <a href=\"https:\/\/www.theblockcrypto.com\/linked\/101170\/christies-cryptopunks-nft-auction-may\" data-v-f87c67ca=\"\">announced<\/a> it would auction off some of its CryptoPunks in a sale by auction house Christie's.&nbsp;","<em data-v-f87c67ca=\"\">Image via Larva Labs website.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Christie's","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Larva Labs website","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Larva Labs","content":"ORGANIZATION"},{"type":"Hall","content":"PERSON"},{"type":"Watkinson","content":"PERSON"},{"type":"voxel","content":"ORGANIZATION"},{"type":"Matt Hall","content":"PERSON"},{"type":"John Watkinson","content":"PERSON"},{"type":"Autoglyphys","content":"PERSON"}],"hashtag":["CRYPTOPUNKS"],"authors":["Saniya More","The Block"]}