{"summary":"Pacman addressed “too good to be true” yields, the rationale behind its invite rewards and the role of Paradigm in Blast’s launch.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264668\/pacman-chews-over-blast-ponzi-scheme-criticisms-humorous-memes","publishDate":"2023-11-24T17:09:16","id":8049,"type":null,"title":"Blast founder rejects Ponzi scheme criticism, says Paradigm suggested change of strategy","category":["PEOPLE"],"content":["Blast founder Tieshun Roquerre, also known as Pacman, <a href=\"https:\/\/x.com\/PacmanBlur\/status\/1728137456027877599?s=20\" data-v-f87c67ca=\"\">addressed<\/a> what he described as some of the “misunderstandings” circulating about the platform, including critics' claims likening Blast to a Ponzi scheme. He also said its investor Paradigm asked to alter its go-to-market strategy following the reception.","Blast went <a href=\"https:\/\/www.theblock.co\/post\/263926\/blur-ethereum-layer-2-blast-live-20-million-raise\" data-v-f87c67ca=\"\">live<\/a> on Tuesday in an invite-only early access mode, following a $20 million raise from Paradigm and Standard Crypto, among others. Blast claims to offer native Layer 2 yield generation for ether and stablecoins, with automatically compounding balances at 4 to 5%, alongside invite rewards known as “Blast Points,” the team said at the launch. The project has attracted over $400 million in bridged assets so far, according to a Dune Analytics <a href=\"https:\/\/dune.com\/wumbonft\/blast\" data-v-f87c67ca=\"\">dashboard<\/a>.","Though he admitted the yield that Blast provides users can feel “too good to be true,” Roquerre said Blast’s high yields are sourced from legitimate platforms like Lido and MakerDAO. Lido’s yield stems from Ethereum's staking rewards, while MakerDAO’s yield is derived from on-chain T-Bills, he said.","\"These yields are not unsustainable. They are a core component of the on-chain and off-chain economy,” Roquerre continued. “The reason the yield feels too good to be true in Blast is because Blast makes this yield the default for everyone. It gives users yield that was hiding in plain sight. In effect, democratizing higher yield.”","Further, Roquerre addressed the comments surrounding Blast's invite rewards. Far from being a marketing gimmick for the sake of growth, he insisted the system was a strategic move to foster community growth, recognizing the contribution that users made by expanding the ecosystem — something deserving of rewards. <a href=\"https:\/\/www.theblock.co\/post\/263926\/blur-ethereum-layer-2-blast-live-20-million-raise\" data-v-f87c67ca=\"\">Critics had likened<\/a> the structure of Blast's rewards as akin to a pyramid scheme.","The founder also wanted to respond to memes about Paradigm being the real entity behind the project’s launch, stating the crypto investment firm had “zero involvement” in Blast’s go-to-market strategy. “Candidly, they probably would have asked me to change a lot about Blast's launch if they had been involved,” he said, adding that Blast consulted Paradigm on research but not its internal go-to-market plans.","He noted that Paradigm had asked him to make changes to the plans post-launch, which were under consideration, but said the Blast team would make the final call.","In a separate <a href=\"https:\/\/x.com\/Blast_L2\/status\/1728096087351914736?s=20\" data-v-f87c67ca=\"\">post<\/a> today, Blast also sought to clear the air on its multisig security, responding to <a href=\"https:\/\/www.theblock.co\/post\/263926\/blur-ethereum-layer-2-blast-live-20-million-raise\" data-v-f87c67ca=\"\">criticism<\/a> it was controlled by just five people.&nbsp;","Blast said that like other Layer 2 solutions such as Arbitrum, Optimism and Polygon, it utilizes a nuanced multisig security model to ensure the integrity of its platform, something the project said was “highly effective” if done right. Recognizing that security exists on a spectrum with various dimensions and attack vectors, Blast stated that while immutable smart contracts may seem more secure, despite audits they can still harbor undetectable bugs. Upgradeable smart contracts also have their risks, Blast added, particularly with token-gated upgrades and timelocks that could be exploited by malicious actors.","To counter these challenges, Blast said it employs a multisig where each signing key is kept in cold storage, managed by geographically distributed independent entities. Its signers are “deeply technical engineers who have experience with high stakes apps ranging from financial applications to smart contracts,” it added.","To “improve security one step further,” Blast said it plans to diversify its hardware wallet providers to mitigate risks from potential hardware compromises and ensure “no single hardware wallet type is used three of five times.”","<em data-v-f87c67ca=\"\">Disclaimer: Larry Cermak, CEO of The Block, is an angel investor in Blast.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"“Blast Points","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tieshun Roquerre","content":"PERSON"},{"type":"today","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Roquerre","content":"PERSON"},{"type":"Pacman","content":"LOCATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Larry Cermak","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"$400 million","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"Standard Crypto","content":"ORGANIZATION"}],"hashtag":["ASSETS"],"authors":["James Hunt","The Block"]}