{"summary":"El Salvador&#x27;s Legislative Assembly approved a law on the issuance of digital assets, paving the way for bitcoin bonds that have been championed by President Nayib Bukele.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201275\/el-salvador-one-step-closer-to-bitcoin-bonds-after-law-passage","publishDate":"2023-01-11T16:31:54","id":8050,"type":null,"title":"El Salvador one step closer to bitcoin bonds after law passage","category":["INTERNATIONAL POLICYMAKING"],"content":["El Salvador's Legislative Assembly approved a law on the issuance of digital assets, paving the way for bitcoin bonds that have been championed by President Nayib Bukele.","The new law establishes the legal order granting legal certainty to transfer operations of any kind of digital asset&nbsp; used in public offerings in El Salvador. It also creates a new government agency to administer El Salvador's digital assets. The bitcoin bonds have been in the works since at least early 2022.","Bitcoin already is legal currency in the country","The opposition alleged that the regulations facilitate money laundering, tax evasion and greater indebtedness, according to <a href=\"https:\/\/www.elsalvador.com\/noticias\/nacional\/asamblea-legislativa\/1031174\/2023\/\" data-v-f87c67ca=\"\">ElSalvador.com<\/a>.","Digital asset service providers in El Salvador would have to complete a registration process and follow several rules under the proposed law. These entities would have to provide a list of digital assets they plan to offer, including their \"benefits, restrictions and limits.\" They would also have to demonstrate cybersecurity precautions and customer service capabilities, as well as providing the names and titles of company employees.","Issuers of digital assets would also have to follow certain rules, such as disclosing information about the jurisdictions or countries where they operate.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"El Salvador","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Nayib Bukele","content":"PERSON"},{"type":"El Salvador's Legislative Assembly","content":"ORGANIZATION"},{"type":"El Salvador","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}