{"summary":"Akash Network rolled out an upgrade to give users access to graphics processing unit chips on its decentralized compute marketplace.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248558\/akash-network-adds-nvidia-gpus-to-its-decentralized-compute-market","publishDate":"2023-08-31T13:38:02","id":8051,"type":null,"title":"Akash Network adds Nvidia GPUs to its decentralized compute market","category":["CRYPTO ECOSYSTEMS"],"content":["Akash Network has implemented the Mainnet 6 upgrade to give users access to graphics processing unit chips on its decentralized compute marketplace.","Referred to by the team as \"Supercloud,\" Akash’s Upgrade 6 aims to offer a decentralized approach to utilizing GPU resources, providing an alternative to centralized cloud service providers. While GPUs are mostly known in the crypto space for <a href=\"https:\/\/www.theblock.co\/post\/98117\/chinese-eth-miners-nvidias-gpu\" data-v-f87c67ca=\"\">mining<\/a> on Ethereum before its switch to proof of stake, their primary applications lie in handling high-performance computing.","After the Mainnet 6 launch, the GPUs offered will include models such as Nvidia H100s and <a href=\"https:\/\/www.nvidia.com\/en-in\/data-center\/a100\/\" data-v-f87c67ca=\"\">A100s<\/a>, as well as consumer-grade chips capable of handling compute-intensive workloads for training AI and data science models.","Akash is a decentralized computing platform that aims to make underutilized cloud resources available to those who need them. Up until now, the network has only allowed users to buy and sell storage and compute resources on a peer-to-peer basis, but it has now also integrated with GPUs for processing power.","The consumer-grade GPUs being offered are often not provided by other cloud service providers and were validated in a testnet that involved 1,300 participants.","Akash Network has a governance system in place for feature modifications, and future plans include support for GPUs from other manufacturers like AMD. In the decentralized compute niche, Akash competes with projects like Render, Flux, and others.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"AMD","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nvidia","content":"ORGANIZATION"},{"type":"GPU","content":"ORGANIZATION"}],"hashtag":["DEVELOPER TOOLS","HARDWARE","INTERNET"],"authors":["Vishal Chawla","The Block"]}