{"summary":"Ceramic is a network that web3 projects can use to store data which doesn’t need to be on a blockchain. It’s now easy to use.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218089\/ceramic-releases-tool-that-awakens-its-storage-for-web3-protocol","publishDate":"2023-03-09T05:06:10","id":8052,"type":null,"title":"Ceramic releases tool that awakens its ‘storage for web3’ protocol","category":["CRYPTO ECOSYSTEMS"],"content":["The Ceramic network released ComposeDB last week, an essential part of its tooling that enables developers to build on the network much more easily.","Ceramic is an open network that’s designed for web3 applications to store data that can be accessed by anyone. It’s particularly built for data that doesn’t need to be stored on a blockchain, but that blockchain applications may want to access. It's more scalable and affordable than a blockchain but as an open network, it offers some of the same advantages.","While the network has been live for nearly two years, the launch of ComposeDB is a key step in making the network easily accessible for developers. This means the project finally is ready to see if it can garner adoption across the wider crypto space.","“What we really want to see happen —&nbsp;and the reason that we built ComposeDB over the last nine months plus — is we see all this demand to create experiences in web3 that were not possible in web2, like truly leveraging composable data in a way that creates value for users and communities,” said Danny Zuckerman, co-founder of 3Box, the company behind Ceramic, in an interview.","Essentially, ComposeDB makes it easy for developers to access the Ceramic network, enabling other projects to use it to store their own data — or to access what’s already there. This piece of tooling lets developers interact with it as though it were a normal database.","While this all sounds relatively simple, for the founders, it’s been a long time coming.","The idea was seeded when Zuckerman and fellow co-founders Joel Thorstensson and Michael Sena were at Ethereum development company ConsenSys together. Thorstensson and Sena had been working on a project called uPort, which had a similar goal in mind.&nbsp;","The trio decided to go their own way and in 2018, and launched 3Box with the intention of building their own service. They started with a software development kit (SDK) which was widely adopted by 1,000 applications including MetaMask, Zerion and Rarible.&nbsp;","Yet Zuckerman said he felt the technology wasn’t working. “We were spending a lot of time just trying to find ways to scale and fighting fires.\" Instead, the founders had to go deeper down the technology stack to really build what they needed.","“We started as this developer tooling, had to come down several layers to build a missing piece of the web3 data protocol ecosystem that wasn't there, and now we're coming back up a layer again to build ComposeDB so that app developers really have something approachable for them,” he added. “We kind of changed the engine mid-flight.\"","The Ceramic network operates as a set of nodes that each store and provide access to certain databases of their choosing. Unlike many networks, not all nodes store all of the information. Rather it’s the reverse; many nodes are focused on storing the information just for the project they’re focused on.&nbsp;","Zuckerman said a developer needs to ensure they have their own node running and at least one other (in case theirs goes down) for a project. As long as their nodes are online, the protocol can store data on them and anyone else can access this data too.","This makes the network very scalable, but, to some degree, it remains somewhat centralized, or at least running with only a few points of failure. Zuckerman said the network will likely need a token in the future in order to incentivize wider participation but that there are no specific plans for one just yet.","“We want this to be a community-driven data ecosystem. We want the community to govern the protocol and it should be a shared resource. And so we're huge believers that tokens can be really powerful long term for coordinating an ecosystem,” he said.","Ceramic allows a protocol to store larger amounts of data in a place that it can access. This means the protocol doesn’t need to store the data on-chain and could reduce the weight that some protocols are currently placing on blockchain networks.&nbsp;","Take Lens Protocol. It’s a social graph used for decentralized social networks where interactions are stored as NFTs on Polygon. This type of data could be stored on Ceramic instead, providing similar access to the information while not adding bloat to a public blockchain.","Zuckerman said that a bunch of projects are already building on Ceramic, including Collab Land — a protocol for creating token gated communities. He pointed to Gitcoin, which uses Ceramic for its protocol called Passport, a decentralized and private record of user credentials. Gitcoin uses this to reduce people using multiple accounts in its grant process.&nbsp;","Ceramic can be used for a wide array of possible functions. This could range from decentralized exchanges, to decentralized social media, to blockchain gaming. Anything where a blockchain protocol needs to store information that doesn’t belong on-chain.&nbsp;","It could also spearhead a new wave of open data. If a blockchain game were to use Ceramic, the data that it generates could be available to all protocols that want to use it — and they could contribute to the dataset too. This means that not only could user assets be portable, such as in-game items that are NFTs, but their gaming history could be too.&nbsp;","“It's pretty early in the gaming use case for us given that we just launched and they do consume a massive amount of work, produce a massive amount of data, but definitely something that we're seeing and expect to see a lot more,” Zuckerman said.","This isn’t to say that all data will necessarily be public. It’s possible that projects elect to create gated access to such datasets, leading to a market for access to this type of data. That said, while Zuckerman sees selling access to data as a small use-case, he reckons simply delegating access will be what really takes off.","<em data-v-f87c67ca=\"\">Update: Added reference to the third co-founder.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Danny Zuckerman","content":"PERSON"},{"type":"SDK","content":"ORGANIZATION"},{"type":"Rarible","content":"ORGANIZATION"},{"type":"Michael Sena","content":"PERSON"},{"type":"Joel Thorstensson","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Gitcoin","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"Sena","content":"ORGANIZATION"},{"type":"Zuckerman","content":"PERSON"}],"hashtag":["DECENTRALIZED INFRASTRUCTURE","DEVELOPER TOOLS","FILE STORAGE"],"authors":["Tim Copeland","The Block"]}