{"summary":"Bakkt has seen a subdued performance of its recently launched bitcoin options\nAn ICE spokesperson told The Block that Bakkt continues to see “strong” interest in both its bitcoin options and futures products\nCME Group’s bitcoin options, on the other hand, continue to outperform rival Bakkt’s ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54294\/bakkts-bitcoin-options-saw-zero-volume-last-week","publishDate":"2020-01-29T03:51:18","id":806,"type":null,"title":"Bakkt’s bitcoin options saw zero volume last week","category":["Bitcoin"],"content":["Intercontinental Exchange (ICE)-owned Bakkt has seen a subdued performance of its recently launched bitcoin options.","Last week, i.e., January 20-24, Bakkt saw zero trading volumes, according to <a href=\"https:\/\/www.theice.com\/marketdata\/reports\/13\" data-v-f87c67ca=\"\">data<\/a> available on the ICE website. The last traded day for the options was January 17, when 20 lots got traded.","However, according to data from <a href=\"https:\/\/twitter.com\/skewdotcom\/status\/1222088332227813376?s=20\" data-v-f87c67ca=\"\">Skew<\/a>, Bakkt has seen no trading for its options in the last 10 days. This is because Skew has taken weekends as well into the picture; a more accurate way would be to look at trading days.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","An ICE spokesperson told The Block that Bakkt continues to see “strong” interest in both its bitcoin options and futures products.","“We continue to see strong interest in our growing base of customers in our bitcoin futures and options complex, which offers a broad range of choices for interacting with and hedging positions in digital assets,” the spokesperson said.","Bakkt launched bitcoin options on December 9, while CME Group rolled it out on January 13. On day one also, CME <a href=\"https:\/\/www.theblockcrypto.com\/post\/52891\/cme-tops-bakkts-reported-bitcoin-options-volumes-in-one-day\" data-v-f87c67ca=\"\">surpassed<\/a> Bakkt’s reported volumes at $2.19 million versus the latter’s $1.15 million, as The Block reported earlier this month.","Tim McCourt, managing director at CME Group, told The Block at the time that he was satisfied with the first day of trading and that feedback from market participants was \"great.\""],"hashtag":[]}