{"summary":"Ledn has launched new ETH Growth Accounts, offering up to 2% APY without the complexities of manual ether staking.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253396\/ledn-ether-crypto-savings-yields","publishDate":"2023-09-28T09:21:59","id":8060,"type":null,"title":"Ledn expands crypto savings product to ether with up to 2% yield","category":["COMPANIES"],"content":["Crypto lending platform Ledn is expanding its Growth Account offering, enabling users to earn up to 2% APY from ether deposits, starting from Oct. 12, in addition to its bitcoin, USDC and USDT savings products.","Unlike the complex process of manual ether staking, Ledn argues it offers a more user-friendly experience by simply transferring ether to its Growth Accounts to start earning interest immediately, according to a statement.","<span data-v-f87c67ca=\"\">Manual solo ether staking offers the highest rewards but involves running an Ethereum node and depositing 32 <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.42%\n    <\/span><\/a> <!----><\/span> to activate a validator to participate directly in network consensus. However, liquid staking options at platforms like Lido Finance, Coinbase and Rocket Pool are also available, enabling users to earn ether staking rewards while unlocking utility across various DeFi applications in the form of a liquid staking derivative token. Although such platforms typically take a fee from staking rewards, with Coinbase taking a 25% cut.<\/span>","Ledn’s yield is lower for ether than its <a href=\"https:\/\/www.stakingrewards.com\/asset\/ethereum-2-0?category=liquid-staking&amp;sort=staked_tokens&amp;timeframe=30d&amp;order=desc&amp;verifiedFirst=true\" data-v-f87c67ca=\"\">liquid staking counterparts<\/a>, with Lido Finance, Coinbase and Rocket Pool currently offering a theoretical APR of up to 3.87%. However, Ledn said its users are not subject to delays for staking and unstaking their ETH, so there are trade-offs each way.","Earlier this month, the Cayman Islands-based crypto lender also told The Block it offered a “savings experience outside of exposing clients to the risks associated with decentralized finance protocols, which continue to be scarred by a consistent stream of hacks and exploits.”","“Users have been continuously asking us to add ether, so, in line with our mission to offer only the best and most profitable yield options, we are thrilled to now introduce support for ETH on Ledn’s Growth Accounts,” Ledn co-founder and CSO Mauricio Di Bartolomeo said in the statement. “This yield option is significantly easier to set up than native ETH staking. Looking forward, we’re working towards rolling out ETH support across the entire Ledn suite of products in the coming months.”","The current staking rate stands at around <a href=\"https:\/\/www.stakingrewards.com\/\" data-v-f87c67ca=\"\">20% of all ether in circulation<\/a>, according to Staking Rewards. Over $20 billion of value is locked in liquid staking alone, according to The Block’s data dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/total-value-locked-tvl\/value-locked-in-liquid-staking\/embed\" title=\"Value Locked in Liquid Staking\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","On Sept. 7, Ethereum developers said staked tokens will likely reach over 50% of the entire ether supply by May 2024 — impairing liquidity. They <a href=\"https:\/\/eips.ethereum.org\/EIPS\/eip-7514#rationale\" data-v-f87c67ca=\"\">proposed<\/a> a plan to “mitigate the negative externalities of very high level of total ETH supply staked,\" which would slow down the growth in staked ether.","Ledn’s Growth Accounts come partly in response to the collapse of several centralized lending platforms in 2022 — including the bankruptcy of firms like <a href=\"https:\/\/www.theblock.co\/post\/157483\/crypto-lender-celsius-to-declare-chapter-11-bankruptcy-cnbc?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">Celsius<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/188915\/crypto-firm-blockfi-files-for-bankruptcy\" data-v-f87c67ca=\"\">BlockFi<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">Voyager Digital<\/a> — severely impacting trust in the sector.","These savings accounts are legally ring-fenced. This means users are only exposed to the counterparties generating their yield, are shielded if Ledn ever went bankrupt and are not exposed to the risks of each type of account. For example, Bitcoin Growth Accounts are not exposed to the risks of Ether Growth Accounts and vice versa.","Ledn also confirmed that its <a href=\"https:\/\/www.theblock.co\/post\/250439\/ledn-usdt-growth-accounts\" data-v-f87c67ca=\"\">USDT Growth Accounts<\/a>, announced earlier this month, will go live alongside the new ETH Growth Accounts on Oct. 12, offering up to 8.5% APY on clients’ USDT stablecoins. However, Ledn’s ETH and USDT Growth Accounts are not available in Canada or the U.S. at launch, the company noted.","Ledn’s previous <a href=\"https:\/\/blog.ledn.io\/en\/growthaccounts\" data-v-f87c67ca=\"\">USDC and Bitcoin Savings Accounts<\/a> were split into a non-interest earning Transaction Account and an interest-earning Growth Account, starting with its Bitcoin Growth Accounts on Aug. 3 at up to 1% APY. Its USDC Growth Accounts transition went live on Sept. 12 at 8.5% APY. Ledn enables users to freely switch between the Transaction and Growth Accounts to ensure control over their assets.","Ledn said it offers savings accounts and loans to clients in over 130 countries, and is working with qualified institutions to provide more transparency in how it generates yield.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cayman Islands","content":"LOCATION"},{"type":"Canada","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2%","content":"PERCENT"},{"type":"8.5%","content":"PERCENT"},{"type":"3.87%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"Aug. 3","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Ledn","content":"PERSON"},{"type":"USDT Growth Accounts","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"$20 billion","content":"MONEY"},{"type":"Sept. 12","content":"DATE"},{"type":"Transaction and Growth Accounts","content":"ORGANIZATION"},{"type":"Sept. 7","content":"DATE"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"May 2024","content":"DATE"},{"type":"Bitcoin Growth Accounts","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"CSO Mauricio Di Bartolomeo","content":"ORGANIZATION"},{"type":"-0.42%","content":"PERCENT"},{"type":"Oct. 12","content":"DATE"},{"type":"1%","content":"PERCENT"}],"hashtag":["BITCOIN","CRYPTO BANKS AND LENDERS","ETHEREUM","TETHER","USDC"],"authors":["James Hunt","The Block"]}