{"summary":"Decentralized oracle network Chainlink has launched a new developer platform called Functions, aiming to foster interactions between traditional and web3 apps.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216251\/chainlink-launches-new-developer-platform-called-functions","publishDate":"2023-03-01T11:44:56","id":8062,"type":null,"title":"Chainlink introduces new developer platform called Functions","category":["CRYPTO ECOSYSTEMS"],"content":["Decentralized oracle network Chainlink has launched a new developer platform called Chainlink Functions to help connect decentralized applications (dApps) with traditional web apps in a seamless manner.","The platform is now available in beta on the Ethereum Sepolia and Polygon Mumbai testnets.","Chainlink's <a href=\"https:\/\/www.theblock.co\/post\/192357\/chainlink-staking-is-now-live-a-major-step-in-its-new-economics-2-0-plan\" data-v-f87c67ca=\"\">oracle network<\/a> is designed to enable smart contracts and applications to utilize off-chain data in a secure and decentralized manner. It is the most widely used oracle network in the industry with over 650,000 active users, per <a href=\"https:\/\/dune.com\/sergiimk\/Oracle-Comparison-(Chainlink-API3-Band-Ocean)\" data-v-f87c67ca=\"\">data<\/a> from Dune Analytics.","The introduction of a new platform called \"Functions\" is going to complement its Oracle service. It will allow blockchain developers to connect their dApps or smart contracts with any application programming interface from within the traditional tech space without having to manage additional cloud infrastructure. The platform already integrates with various cloud providers, including Amazon Web Services, Meta and others.","According to Kemal El Moujahid, Chainlink's chief product officer, the launch of Chainlink Functions will remove a significant obstacle in the adoption of web3.","\"With the launch of Chainlink Functions, we are removing a major roadblock in the adoption of web3 and making it easier than ever for developers to combine smart contracts with the powerful APIs and web2 data sources they need to build amazing applications,\" Moujahid said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kemal El Moujahid","content":"ORGANIZATION"},{"type":"Meta","content":"LOCATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Oracle","content":"ORGANIZATION"},{"type":"Polygon Mumbai testnets","content":"ORGANIZATION"},{"type":"Moujahid","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Ethereum Sepolia","content":"LOCATION"},{"type":"Amazon Web Services","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}