{"summary":"Evmos will utilize its EVM Extensions software module to introduce ERC-20 compatibility for Cosmos tokens, focusing on EVM support.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263452\/evmos-plans-to-use-native-cosmos-assets-as-erc-20-tokens-via-evm-extension-software","publishDate":"2023-11-17T10:29:35","id":8064,"type":null,"title":"Evmos plans to use native Cosmos assets as ERC-20 tokens via EVM Extension software","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Evmos <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/257160\/evmos-evmos-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/evmos.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">EVMOS<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -4.066%\n    <\/span><\/a> <!----><\/span><\/span> plans to introduce ERC-20 compatibility for Cosmos tokens, focusing on EVM support.<\/span>","Altiplanic, the core development firm for the Layer 1 blockchain Evmos, is working on a software mechanism to facilitate the use of various assets in the Cosmos ecosystem as ERC-20 tokens.","Essentially, this integration will enable Cosmos tokens (that are not compatible with the ERC-20 standard) to be directly employed in dapps on the Evmos EVM, eliminating the need for token wrapping as well as overcoming certain technical issues on the network.","“This functionality will allow users, wallets, and developers to seamlessly onboard all Cosmos native assets without the need to change their preferred tools on the EVM or executing a transaction to wrap or unwrap them,” said Federico Kunze Küllmer, Evmos founder and CEO of Altiplanic.","The mainnet release of this mechanism, expected by the end of the year, will introduce a unified token model for Evmos, accommodating both native and ERC-20 tokens. EVM, which stands for the Ethereum Virtual Machine, is a software environment on blockchains such as Ethereum and Evmos, responsible for processing and executing software logic within smart contracts.","Evmos operates an EVM-compatible <a href=\"https:\/\/www.theblock.co\/post\/143771\/evmos-launches-blockchain-to-bring-ethereum-virtual-machine-to-cosmos\" data-v-f87c67ca=\"\">blockchain<\/a> that supports decentralized applications from the Ethereum and Cosmos ecosystems, which presents distinctive challenges in maintaining compatibility between the two. While ERC-20 is the EVM standard, most chains in the Cosmos ecosystem use a different format for native assets, containing only denomination and amount information, and lacking token metadata that's present with ERC-20 tokens.","<span data-v-f87c67ca=\"\">The core development firm noted that the absence of native ERC-20 support for Cosmos tokens has been an issue for client software and developers on Evmos, which it now plans to address.&nbsp;<\/span>","This will be implemented for Cosmos assets on Evmos using a planned software module called \"ERC-20 Extension.\" This module will consolidate ERC-20 and native Cosmos token formats on Evmos into a single standardized interface to simplify interactions for developers. The feature will be rolled out soon on the Evmos testnet with mainnet launch expected by the end of the year.&nbsp;","Just recently, Evmos <a href=\"https:\/\/www.theblock.co\/post\/261855\/evmos-plans-to-deprecate-cosmos-transactions-signals-ethereum-alignment\" data-v-f87c67ca=\"\">announced<\/a> plans to phase out specific Cosmos infrastructure tools in favor of Ethereum or EVM-compatible ones like MetaMask. However, since Evmos is a Cosmos-based network, support for Cosmos code will persist to facilitate application functionality through specialized code modules called EVM Extensions. The team noted that the ERC-20 Extension will augment its EVM-only transition.","Kunze Küllmer said that Evmos ERC-20 Extension will allow the use of Cosmos native assets across all EVM wallets without extra steps or asset conversion processes, offering a straightforward one-step onboarding to Cosmos via popular wallets, including MetaMask.","Previously, Evmos <a href=\"https:\/\/www.theblock.co\/post\/182223\/evmos-developers-raise-27-million-in-a-token-sale-led-by-polychain\" data-v-f87c67ca=\"\">raised<\/a> $27 million in a funding round led by Polychain Capital, though the valuation was not disclosed.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$27 million","content":"MONEY"},{"type":"Kunze Küllmer","content":"PERSON"},{"type":"Evmos","content":"ORGANIZATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"-4.066%","content":"PERCENT"},{"type":"Cosmos","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"20","content":"DATE"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Federico Kunze Küllmer","content":"PERSON"}],"hashtag":["COSMOS","DEVELOPER TOOLS"],"authors":["Vishal Chawla","The Block"]}