{"summary":"Raft paused further minting of its stablecoin known as R on Friday after it acknowledged what it said was a &quot;security vulnerability.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262681\/defi-platform-raft-pauses-minting-of-its-stablecoin-after-acknowledging-security-vulnerability","publishDate":"2023-11-10T18:48:52","id":8066,"type":null,"title":"DeFi platform Raft pauses minting of its stablecoin after acknowledging &#x27;security vulnerability&#x27;","category":["CRYPTO ECOSYSTEMS"],"content":["DeFi platform Raft paused further minting of its stablecoin known as R on Friday after it acknowledged what it said was a \"security vulnerability.\"","\"We are currently investigating and will provide an update as soon as we can,\" it <a href=\"https:\/\/twitter.com\/raft_fi\/status\/1723073536909099302\" data-v-f87c67ca=\"\">wrote<\/a> on X. \"Existing users are still able to repay their positions and receive their collateral.\"","Users on social media pointed to onchain data that showed a presumed hacker had burnt millions worth of ether in the apparent exploit. Wintermute Head of Research Igor Igamberdiev said 6.7 uncollateralized R stablecoin had been minted and then converted into ether.","\"The twist is that they converted them into ETH, which was sent to the null address,\" he <a href=\"https:\/\/twitter.com\/FrankResearcher\/status\/1723099971824582713\" data-v-f87c67ca=\"\">wrote<\/a> on X, detailing an apparent coding mistake. \"Instead of sending ETH to the attacker, coins went to the null address, which has no private key, oops.\"","The R stablecoin depegged from its typical price of $1, falling to as low as $0.18 before recovering somewhat. It was trading for $0.78 at 6:34 p.m. ET, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/r\" data-v-f87c67ca=\"\">CoinGecko<\/a>.","Raft did not immediately respond to a request for comment from The Block.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$0.78","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Wintermute Head of Research Igor Igamberdiev","content":"ORGANIZATION"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"$0.18","content":"MONEY"},{"type":"6:34 p.m. ET","content":"TIME"}],"hashtag":["EXPLOITS","HACKS"],"authors":["MK Manoylov","The Block"]}