{"summary":"Optimism will pause ETH withdrawals for one hour on Feb. 15 to test an upgraded incident response system.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276878\/optimism-to-pause-eth-withdrawals-for-one-hour-next-week-to-test-incident-response-system","publishDate":"2024-02-09T06:12:32","id":8067,"type":null,"title":"Optimism to pause ETH withdrawals for one hour next week to test incident response system","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Layer 2 network <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Optimism <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248388\/optimism-op-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Optimism.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">OP<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -2.23%\n    <\/span><\/a> <!----><\/span><\/span> will see its ether (ETH) withdrawals halted for one hour on Feb. 15 to test an upgraded incident response system.<\/span>","Withdrawals of ETH from the Layer 2 network to the Ethereum mainnet will be paused during this time, according to a Discord announcement. Deposits from the mainnet to the Layer 2 network and normal transactions on the network will not be affected.","The goal is to enhance the ability to respond to security incidents across different chains in the Optimism ecosystem in a coordinated manner.","The incident response system currently features an on-chain pause for Ethereum withdrawals. The new feature will enable a Superchain wide pause, stopping withdrawals for tokens and NFTs for Optimism and any Optimism-based chains that choose to opt in.","\"This upgrade is not just about strengthening individual chains; it's about leveraging the collective security intelligence of the entire Superchain,\" OP Labs said when it <a href=\"https:\/\/blog.oplabs.co\/improved-superchain-incident-response\/\" data-v-f87c67ca=\"\">announced<\/a> the upgraded system on Jan. 25.","The upgraded feature is currently live on its testing network. The one-hour pause will be to check whether it works in a live environment.","During the downtime, updates will be posted on its <a href=\"https:\/\/status.optimism.io\/\" data-v-f87c67ca=\"\">network status page<\/a>.","Optimism comprises an ecosystem of Layer 2 chains (collectively called the Superchain) that utilize optimistic rollups to reduce transaction costs for dapps. This ecosystem is governed by a DAO, known as the Optimism Collective.","The flagship network is the <a href=\"https:\/\/www.theblock.co\/post\/236277\/optimism-changes-name-to-op-mainnet-in-line-with-superchain-vision\" data-v-f87c67ca=\"\">OP Mainnet<\/a>, joined by others like <a href=\"https:\/\/www.theblock.co\/post\/232158\/coinbase-backed-base-targeting-mainnet-launch-after-optimisms-bedrock-upgrade\" data-v-f87c67ca=\"\">Base<\/a> and Zora.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Feb. 15","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Jan. 25","content":"DATE"},{"type":"-2.23%","content":"PERCENT"},{"type":"OP Labs","content":"ORGANIZATION"}],"hashtag":["OPTIMISM"],"authors":["Tim Copeland","The Block"]}