{"summary":"A group of U.S. senators introduced a bill that would broaden Treasury&#x27;s sanctions powers to more terrorist groups, while addressing crypto.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266660\/bipartisan-group-of-senators-introduce-bill-to-expand-treasury-departments-sanctions-powers-and-provide-more-resources-to-address-crypto","publishDate":"2023-12-07T15:57:42","id":8068,"type":null,"title":"Bipartisan group of senators introduce bill to expand Treasury Department&#x27;s sanctions powers and provide more resources to address crypto","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A group of bipartisan U.S. senators introduced a bill on Thursday that would broaden the Treasury Department's sanctions powers to cover more terrorist groups including Hamas, and give them more resources to address crypto.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Sens. Mark Warner, D-Va., Mike Rounds, R-S.D. Jack Reed, D-R.I. and Mitt Romney, R-Utah, introduced the Terrorism Financing Prevention Act, which expands the Treasury Department's authority to beyond a 2015 law that focused primarily on Hezbollah.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The new bill would allow the agency to identify foreign financial institutions and foreign digital asset companies that knowingly facilitate transactions for Hamas and other groups, and then sanction them.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Crypto's possible use in terrorist financing has been at the forefront of discussions involving Hamas fundraising efforts in Washington following its attack on Israel in October. Last month, Treasury sent <a href=\"https:\/\/www.theblock.co\/post\/265227\/u-s-treasurys-wally-adeyemo-calls-for-more-authority-to-go-after-bad-actors-in-crypto\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">recommendations<\/span><\/a> to lawmakers asking them to give it more authority and sanctions tools to go after illicit actors in the crypto industry.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“The October 7 attacks on Israel perpetrated by Hamas have made it more urgent and necessary for the U.S. to counter the role that cryptocurrency plays in the financing of terrorism,\" Sen. Romney said in a statement. \"Our legislation would expand financial sanctions to cover all terrorist organizations — including Hamas — and it would equip the Treasury Department with additional resources to counter terrorism and address emerging threats involving digital assets.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The bill also includes a provision from the Crypto-Asset National Security Enhancement and Enforcement Act, or CANSEE, which was introduced in July. That provision would give the Treasury's Financial Crimes Enforcement Network authority to \"<\/span><span class=\"s4\" data-v-f87c67ca=\"\">restrict transactions with primary money laundering concerns that do not involve a U.S. correspondent bank account,\" according to the statement.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Other senators have looked to rein in the crypto industry and go after bad actors. Sen. Elizabeth Warren, D-Mass., has repeatedly pushed for her bill in Congressional hearings. Dubbed the Digital Asset Anti-Money Laundering Act, the bill <\/span><span class=\"s5\" data-v-f87c67ca=\"\">aims to extend anti-money laundering requirements including know-your-customer rules to crypto miners, validators, wallet providers and others.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Warren asked a panel of bank executives, including JPMorgan Chase CEO Jamie Dimon, Wells Fargo &amp; Company CEO Charles Scharf, Bank of America CEO Brian Moynihan and Goldman Sachs CEO David Solomon, on Wednesday during a Senate Banking Committee hearing if they agreed that crypto should follow the same anti-money laundering rules that their banks follow.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Absolutely,\" they all replied.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"When it comes to banking policy, I am not usually holding hands with the CEOs of multibillion dollar banks, but this is a matter of national security,\" Warren said.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jack Reed","content":"PERSON"},{"type":"2015","content":"DATE"},{"type":"Warren","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Financial Crimes Enforcement Network","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Bank of America","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"October 7","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"Va.","content":"LOCATION"},{"type":"Israel","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Charles Scharf","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"Mass.","content":"LOCATION"},{"type":"Brian Moynihan","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Mike Rounds","content":"PERSON"},{"type":"Washington","content":"LOCATION"},{"type":"Romney","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wells Fargo &amp; Company","content":"ORGANIZATION"},{"type":"Mark Warner","content":"PERSON"},{"type":"Jamie Dimon","content":"PERSON"},{"type":"Hamas","content":"ORGANIZATION"},{"type":"R.I.","content":"LOCATION"},{"type":"Mitt Romney","content":"PERSON"},{"type":"Hezbollah","content":"ORGANIZATION"},{"type":"S.D.","content":"LOCATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"David Solomon","content":"PERSON"},{"type":"Utah","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":["SENATE BANKING COMMITTEE"],"authors":["Sarah Wynn","The Block"]}