{"summary":"A new paper from the HM Treasury lays out guidelines for regulating crypto activities like investing and trading while the UK industry buzzes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207488\/the-uk-finally-reveals-plan-to-regulate-crypto-trading-and-lending","publishDate":"2023-02-01T09:28:11","id":8069,"type":null,"title":"The UK finally reveals plan to regulate crypto trading and lending","category":["INTERNATIONAL POLICYMAKING"],"content":["<span data-v-f87c67ca=\"\">The UK government introduced a new crypto regulatory framework via a consultation paper published by the Treasury on Wednesday with stricter rules for investing and trading.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nTop of the agenda for the government is to introduce a regime to regulate crypto more broadly. The paper takes a stab at designing a regime that covers crypto service providers, lending platforms, prudential requirements, consumer protection, crypto issuances and disclosures, preventing market abuse and more.<\/span>","<span data-v-f87c67ca=\"\">Following a turbulent year in crypto markets in 2022, Economic Secretary to the Treasury Andrew Griffith hopes to achieve “clear, effective, timely regulation and proactive engagement with industry.” The crypto industry was generally receptive to the proposals, and has until the end of April to submit responses.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“As the voice of the UK’s crypto sector we welcome this positive step towards greater regulatory clarity,” said Ian Taylor, Board Advisor of CryptoUK, in a statement. “Given the provisions within the proposed legislation, consultation with the industry could not be more critical.” He added that the group will respond to the consultation and advocate for regulation “that is fit for purpose.”<\/span>","<span data-v-f87c67ca=\"\">Crypto exchanges in the UK will need to beef up their compliance departments, as operating a crypto exchange will become an activity regulated by the Financial Conduct Authority beyond its current anti-money laundering provisions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Prospective exchanges will need to supply details of their operations, risk management processes and financial resources, among other requirements. They will be responsible for designing control systems to detect and disrupt market abuse. Crypto lenders will also need FCA authorization, and the proposed rules spell out the operational remit for crypto custodians too.<\/span>","<span data-v-f87c67ca=\"\">Tokens traded on a UK crypto exchange will be subject to traditional finance market abuse&nbsp;<\/span><span data-v-f87c67ca=\"\">rules. This covers offences like insider dealing, market manipulation and unlawful disclosure of inside information. Plus, those offering crypto trading services will need to follow the European Union’s financial market trading rules. This includes obtaining the best result when executing client orders.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Stablecoins, which are addressed in the Financial Services and Markets Bill working its way through Parliament, are not the main priority for the new regime. However, the Treasury considers that “activities relating to so-called algorithmic stablecoins should be subject to the same requirements as for unbacked crypto assets.”<\/span>","<span data-v-f87c67ca=\"\">When it comes to initial coin offerings, the proposed guidelines likely stamp them as security offerings. It will be up to the crypto exchanges to do due diligence on the token and ensure necessary admission and disclosure documents are filed correctly. The more complicated prospectus documents that companies file when doing an initial public offering will not be necessary in an ICO.<\/span>","<span data-v-f87c67ca=\"\">The Treasury calls for a helping hand from respondents on certain topics to provide more data, including decentralized finance, sustainability and other crypto activities such as mining, staking and investment advising.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Greater regulatory clarity is important for the UK at this stage, the industry experts said. Andrew Whitworth, policy director for EMEA at Ripple, is looking for close cooperation with the industry. “From today, the government should encourage further collaboration with the private sector to devise a comprehensive, risk-based framework, which aligns with international best practice,” he said in a statement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Regulation and innovation are not mutually exclusive,” Nick Taylor, head of <\/span>EMEA public policy at crypto exchange Luno told The Block in an email. “The blueprint outlined today will give businesses a level of certainty about the medium-term operating environment, making the UK a more competitive place to do business. This would allow companies to plan, attract investment and create more jobs in the UK.”","<span data-v-f87c67ca=\"\">Kraken’s UK Managing Director Blair Halliday also welcomed the new step, but added that “if the UK wants to fulfill its ambition of becoming a global crypto hub, it’s crucial that the proposed ‘adaptation’ of existing regulation is right-fitted to the asset-class. Most importantly, the framework must cover firms that have no onshore presence but which continue to offer services to UK customers.”<\/span>","<span data-v-f87c67ca=\"\">Others, however, called for more action. Katharine Wooller, business unit director at <\/span><span data-v-f87c67ca=\"\">Coincover<\/span><span data-v-f87c67ca=\"\">, a company that focuses on protections against crypto loss and fraud, said “the UK’s approach to digital assets so far has been sluggish despite the broad, cross-party support to become a crypto hub. This sounds a little like another announcement that merely kicks the can down the road.”<\/span>","<span data-v-f87c67ca=\"\">The impact of the dramatic collapses of FTX, Celsius, Voyager and others leave a print in the new regulatory approaches, some worry. “A number of these proposals are well trailed, but others perhaps less so and it is evident that the shadow cast by high profile failures through 2022 has influenced the extent and pace of implementation of these measures,” said Albert Weatherill, financial services partner at law firm Norton Rose Fulbright.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"end of April","content":"DATE"},{"type":"European Union","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"EMEA","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Nick Taylor","content":"PERSON"},{"type":"Board Advisor of CryptoUK","content":"ORGANIZATION"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Norton Rose Fulbright","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Andrew Whitworth","content":"PERSON"},{"type":"Ian Taylor","content":"PERSON"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Andrew Griffith","content":"PERSON"},{"type":"Blair Halliday","content":"PERSON"},{"type":"Katharine Wooller","content":"PERSON"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Coincover","content":"ORGANIZATION"},{"type":"Albert Weatherill","content":"PERSON"}],"hashtag":["BOE","CBDCS","CRYPTO BANKS AND LENDERS","FCA","INVESTMENT FIRMS","MINING COMPANIES","SECURITY FIRMS","STAKING FIRMS","UK PARLIAMENT","WALLET MAKERS"],"authors":["Inbar Preiss","Benjamin Robertson","The Block"]}