{"summary":"BlackRock CEO Larry Fink sang crypto’s praise again on Friday, just a week after he highlighted the role of bitcoin as a kind of “digitizing gold.”\n“It’s an international asset,” he said in an interview with CNBC.","author":["Nathan Crooks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239737\/blackrocks-larry-fink-says-crypto-will-transcend-any-one-currency","publishDate":"2023-07-14T16:32:09","id":807,"type":null,"title":"BlackRock&#x27;s Larry Fink says crypto will transcend any one currency","category":["The Block"],"content":["BlackRock CEO Larry Fink sang crypto's praise again on Friday, just a week after he highlighted the role of bitcoin as a kind of \"<a href=\"https:\/\/www.theblock.co\/post\/237978\/blackrock-ceo-larry-fink-sees-bitcoin-as-digitizing-gold\" data-v-f87c67ca=\"\">digitizing gold<\/a>.\"","\"It's an international asset,\" he said in an <a href=\"https:\/\/www.cnbc.com\/2023\/07\/14\/blackrock-has-a-responsibility-to-democratize-investing-including-in-crypto-larry-fink-says.html\" data-v-f87c67ca=\"\">interview<\/a> with CNBC, referring to crypto on broad terms. \"It has a differentiating value versus other asset classes, but more importantly, because it's so international, it's going to transcend any one currency.\"","\"If you just look at the value of our dollar, how it depreciated the past two months and how much it appreciated over the last five years, a international crypto product can really transcend that,\" he <a href=\"https:\/\/www.youtube.com\/watch?v=wIxCnZ0b8ho\" data-v-f87c67ca=\"\">continued<\/a>. \"And that's why we believe there's great opportunities. And that's why were seeing more and more interest. And that interest is broad-based, worldwide.\"","The asset manager last month filed an application with the Securities and Exchange Commission for a spot bitcoin ETF, triggering a widespread rally in the sector. The SEC has yet to approve a spot bitcoin fund.","\"We believe we have a responsibility to democratize investing,\" Fink said, commenting on broader growth in the ETF market and highlighting how gold funds had brought down the costs of transactions for the metal. \"Now, with crypto, the idea of democratizing that role...the cost right now to transact, it's quite expensive. We're talking points, not decimal points.\"","Fink said that he couldn't talk specifically about bitcoin because of the pending application.","\"We are working with our regulators,\" he added. \"If BlackRock's name is going to be on it, we're going to make sure that it's safe and sound and protected.\""],"hashtag":[]}