{"summary":"Gemini says it will work with Genesis on a new reorganization plan after DCG missed a $630 million payment that was due last week.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231656\/dcg-misses-630-million-payment-due-earlier-this-month-says-gemini","publishDate":"2023-05-22T04:14:09","id":8071,"type":null,"title":"DCG misses $630 million payment due earlier this month, says Gemini","category":["CAPITAL MARKETS"],"content":["Digital Currency Group missed a $630 million payment it was meant to shell out to its subsidiary Genesis Global Capital earlier this month, according to a May 19 <a href=\"https:\/\/www.gemini.com\/earn\" data-v-f87c67ca=\"\">update<\/a> to clients shared by crypto exchange Gemini.&nbsp;","A creditor to Barry Silbert's DCG's Genesis, Gemini said that it is currently working with Genesis and other creditor groups to provide forbearance to DCG to avoid a default.&nbsp;","DCG — one of the several victims of the credit crisis that swept crypto in 2022 — has been in negotiations with creditors of Genesis Capital, which filed for bankruptcy protection in January. Gemini, which lent customer funds to Genesis as part of its retail high-yield Earn program, has <a href=\"https:\/\/twitter.com\/cameron\/status\/1616302998736756737?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1616302998736756737%7Ctwgr%5E0965a1cab29423dfd80aa7a78f0ee24a06cf0947%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.coindesk.com%2Fbusiness%2F2023%2F01%2F20%2Fcameron-winklevoss-threatens-legal-action-against-dcg-ceo-after-genesis-bankruptcy%2F\" data-v-f87c67ca=\"\">threatened<\/a> to file a lawsuit against Silbert and DCG.","In total, DCG's Genesis owes Gemini $900 million. At the beginning of May, Gemini <a href=\"https:\/\/decrypt.co\/138453\/gemini-warns-barry-silbert-digital-currency-group-630m-default-risk\" data-v-f87c67ca=\"\">said<\/a> that DCG was at risk of default if a $630 million debt payment was not made to Genesis's bankruptcy estate.","In Gemini's latest update, the firm says that if a deal can't be reached with DCG then it will work with other creditors \"to suggest terms for an amended plan of reorganization that could be advanced without DCG’s consensual participation.\"","Gemini filed a motion with the bankruptcy court on May 19 to propose such a reorganization plan, which would not require the approval of DCG.&nbsp;","As per DCG's last update on May 9, the firm is currently in discussions with \"capital providers for growth capital and to refinance its outstanding inter company obligations with Genesis.\"","Furthermore, Gemini has been preparing a claim to be filed today that seeks the return of $1.1 billion in crypto for its 232,000 Earn users, the update added.","<em data-v-f87c67ca=\"\">Paragraph five was revised for added clarity.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$900 million","content":"MONEY"},{"type":"DCG","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"Gemini","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"May 19","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Silbert","content":"PERSON"},{"type":"$630 million","content":"MONEY"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Barry Silbert","content":"PERSON"},{"type":"Genesis","content":"PERSON"},{"type":"May 9","content":"DATE"},{"type":"Genesis Global Capital","content":"ORGANIZATION"},{"type":"$1.1 billion","content":"MONEY"},{"type":"Genesis","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}