{"summary":"Robinhood&#x27;s crypto arm is teeing up support for bitcoin&#x27;s Lightning network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141008\/robinhood-widens-user-access-for-crypto-wallet-transfers-unveils-plan-to-support-lightning-payments-for-bitcoin","publishDate":"2022-04-07T13:30:50","id":8072,"type":null,"title":"Robinhood widens user access for crypto wallet transfers, unveils plan to support Lightning payments for bitcoin","category":["STARTUPS"],"content":["Robinhood is widening access to its much-anticipated crypto wallet transfer functionality, the company announced Thursday.","The <a href=\"https:\/\/www.theblockcrypto.com\/post\/118271\/robinhood-rolling-out-crypto-wallet-transfer-features\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">rollout<\/a> began in September to a select group of users, as reported at the time, and in December the company inked a deal with blockchain analytics firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/127186\/robinhood-onboards-chainalysis-in-preparation-for-crypto-wallet-launch\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Chainalysis<\/a> to prepare for the offering's wider rollout. Robinhood said in a press statement that it has now granted wallet transfer capabilities \"to every eligible person on the 2 million+ WenWallets waitlist of more than two million people.\"","Access is not available to those based in Hawaii, New York and Nevada, the firm said.","Robinhood also unveiled a pending feature on the horizon, in keeping with the theme of its announcement at the bitcoin-centric conference in Miami. The brokerage app will support the Lightning network, which is focused on smaller bitcoin transactions.&nbsp;","\"We will be adding the ability to transact on the Bitcoin Lightning Network, an open-source 'layer-2' for Bitcoin transactions in the near future,\" Robinhood said, adding that more updates on this front would be pending \"in the coming months.\"&nbsp;","As previously reported, the expanded rollout comes as Robinhood is <a href=\"https:\/\/www.theblockcrypto.com\/linked\/132089\/robinhood-looks-to-beef-up-crypto-offering-after-q4-revenue-slide\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">teeing up<\/a> more crypto functionalities. The firm posted a decline in crypto transaction-based revenue during the fourth quarter of 2021.","Still, during a presentation on Thursday, chief product officer Aparna Chennapragada remarked that bitcoin has been this year's top recurring buy on the Robinhood app.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2 million","content":"MONEY"},{"type":"Bitcoin Lightning Network","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Aparna Chennapragada","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Hawaii","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"the fourth quarter of 2021","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Nevada","content":"LOCATION"}],"hashtag":["BITCOIN","ROBINHOOD"],"authors":["Anushree Dave","The Block"]}