{"summary":"After going public on August 9, Base plans a structured phase with 50 launch partners and a promotional event called “Onchain Summer.”","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242961\/base-network-bridge","publishDate":"2023-08-03T09:02:13","id":8073,"type":null,"title":"Coinbase to widen mainnet access to Base on August 9, releases Ethereum bridge","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Crypto exchange Coinbase will release its Base network for full public access on August 9 and has launched an Ethereum bridge ahead of time.<\/span>","<span data-v-f87c67ca=\"\">“Base’s bridging functionality is live today, and the mainnet is set to be accessible to all by August 9,” said Jesse Pollak, protocols lead at Coinbase.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Releasing an official bridge introduces a way for users to move tokens between the Base network and Ethereum. <br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Base operates on the OP software stack and is a Layer 2 blockchain, aiming for lower transaction fees than Ethereum. It aims to pitch itself as an alternative way to use Ethereum, catering to a broad audience, from Coinbase's regular users to DeFi participants.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Base’s developer-only mainnet <a href=\"https:\/\/www.theblock.co\/post\/239393\/coinbase-base-mainnet-developers?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">went live<\/a> on July 13 and was primarily accessible to developers. However, in the lead-up to the official launch, several users bridged assets to the network using a <a href=\"https:\/\/docs.base.org\/tools\/bridges\/#portal-proxy-contract\" data-v-f87c67ca=\"\">portal proxy contract<\/a> and other unofficial bridges to trade new memecoins launching on Base.<\/span>","<span data-v-f87c67ca=\"\">A notable incident involved a Bald memecoin, which was started by an unknown developer. <\/span><span data-v-f87c67ca=\"\">Last week, the token boasted a valuation of $85 million. Its value plummeted to nearly zero after the developer abruptly <\/span><a href=\"https:\/\/www.theblock.co\/post\/242503\/bald-memecoin-has-potential-ties-with-alameda-research-wintermute-researcher-finds\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">withdrew<\/span><\/a><span data-v-f87c67ca=\"\"> liquidity from Bald’s main liquidity pool, resembling the features of a rug pull —a deceptive strategy where key developers or holders siphon off liquidity, causing the token’s price to collapse.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This precipitous drop was subsequently followed by a major security <\/span><a href=\"https:\/\/www.theblock.co\/post\/242402\/leetswap-bases-leading-dex-halts-trading-amid-reports-of-an-exploit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">hack<\/span><\/a><span data-v-f87c67ca=\"\"> at Base’s decentralized exchange LeetSwap.<\/span>","<span data-v-f87c67ca=\"\">After becoming publicly available, Coinbase is eyeing for a more structured phase that includes launch partners. The team is set to introduce “Onchain Summer,” a month-long promotional event on the network. This event will feature collaborations with numerous launch partners, including Coinbase, Atari, OpenSea, Showtime, Optimism, Rainbow Wallet, Manifold, Parallel, and Friends With Benefits.<\/span>","<span data-v-f87c67ca=\"\">Additionally, starting from August 9, the network will introduce NFT functionalities. Users will be able to mint commemorative NFTs, participate in tasks to earn rewards, and reserve cb.id crypto usernames on the Coinbase Wallet.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Summer","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Atari","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"August 9","content":"DATE"},{"type":"Showtime","content":"ORGANIZATION"},{"type":"Rainbow Wallet","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Jesse Pollak","content":"PERSON"},{"type":"July 13","content":"DATE"},{"type":"$85 million","content":"MONEY"}],"hashtag":["BASE"],"authors":["Vishal Chawla","The Block"]}