{"summary":"Superdao, an all-in-one DAO creation and operation software, is valued at $160 million after new funding. Superdao valued at $160 million after new funding.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131637\/superdao-raises-10-5-million-seed-round-valued-at-160-million","publishDate":"2022-01-26T10:15:14","id":8079,"type":null,"title":"Superdao raises $10.5 million seed round, valued at $160 million","category":["VENTURE CAPITAL"],"content":["Superdao, which is developing a services suite for decentralized autonomous organizations (DAOs), just raised a $10.5 million seed round at a $160 million valuation led by SignalFire.","“The vision for the company is essentially Shopify for DAOS,” said Yury Lifshits, CEO and founder of Superdao to The Block. “It’s kind of an all-in-one DAO formation and operating tool, where in one-click you can start a DAO and grow it over time and explore.”","The 25-person team is building a member directory with tools for NFT and token airdrops, treasury dashboard, open ecosystem for third-party DAO apps, one-click DAO creation, and more. This is in contrast to how DAOs are started and operated currently, which require heavy engineering infrastructure.","DAOs grew in popularity in 2021 as a way for groups to decentralized decision-making and work toward common goals, such as fundraising. They use digital assets to vote on decisions and outcomes, versus having the hierarchical decision-making structure of traditional organizations.","More DAOs will likely pop up this year as ways to build web3 startups, investment groups, NFT and metaverse projects, and social clubs, said Lifshits.","“While at the start of the year there are 10 to 20 thousand operating DAOs, we expect up to 1 million new DAOs to be formed by the year’s end,” said the company.","Superdao itself is currently operating as a traditional company but has ambitions to become a DAO itself. “It will take time to do it properly,” said Lifshits. It’s a similar path for many web3 startups, who start off with C-crop type private equity to win time to fully prepare for a token-based system, he said.","Backers of the investment round include funds AllianceDAO, Signal Fire, Pear VC, DIGITAL and One Block Capital. Superdao also drew support from <a href=\"https:\/\/mobile.twitter.com\/superdao_co\/status\/1486358865616592897\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a range of angels<\/a>, including founders and staffers from firms like 1inch, Protocol Labs, OpenSea and Coinbase.&nbsp;","<em data-v-f87c67ca=\"\">Editor's Note: Updated to clarify the composition of Superdao's backers.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$160 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Yury Lifshits","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$10.5 million","content":"MONEY"},{"type":"SignalFire","content":"ORGANIZATION"}],"hashtag":["DAOS"],"authors":["Anushree Dave","The Block"]}