{"summary":"For those of us who may never quite make it out of the rabbit hole, I think there’s a certain satisfaction that comes in reading crypto history–gleaning","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275254\/why-we-follow-satoshi","publishDate":"2024-01-31T09:01:56","id":8083,"type":null,"title":"Why We Follow Satoshi","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">For those of us who may never quite make it out of the rabbit hole, I think there’s a certain satisfaction that comes in reading crypto history–gleaning the smallest, poignant insights from the details of the journey to get here.<\/span>","<span data-v-f87c67ca=\"\">Whenever I open “<\/span><a href=\"https:\/\/www.bookofsatoshi.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Book of Satoshi<\/span><\/a><span data-v-f87c67ca=\"\">,” come across artifacts of the Crypto War I, or read through an old forum debate, I’m transported to very different times. Returning to the present, there’s an awe of how far first principles and an uncompromising adherence to values can take us.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The bedrock of our networked world exists in large part due to the fearless efforts of the <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=UGxf9H26ZG4\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Cypherpunk<\/span><\/a><span data-v-f87c67ca=\"\"> movement of the late ‘80s. While mastering the dark arts of applied arithmetic, these pioneers stood in opposition to the most formidable of adversaries, a united front of nation-states.<\/span>","<span data-v-f87c67ca=\"\">Up until about thirty years ago, the only <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">legal <\/span><\/i><span data-v-f87c67ca=\"\">encryption was “weak encryption,” which could be broken by accessible supercomputers at the time. “Strong” encryption, the kind we use today, was categorized as a weapon of war, which no company dared distribute en masse.<\/span>","<span data-v-f87c67ca=\"\">The Cypherpunks however, held a belief which is somehow perennially incontrovertible, yet in practice controversial: <\/span><b data-v-f87c67ca=\"\">privacy is a fundamental human right<\/b><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Based on an assertion that code is constitutionally protected speech, cypherpunk Phil Zimmermann convinced the MIT Press to send his PGP email encryption source code to Europe, a federal offense at the time. Courts would later clear Zimmerman, affirming that code is, in fact, speech.<\/span>","<span data-v-f87c67ca=\"\">There’s a parallel in the contemporary far-reaching efforts against end-to-end encryption, but that’s a topic for another day.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The topic at hand here is decentralization, as it relates to another product of applied arithmetic: blockchains.<\/span>","<span data-v-f87c67ca=\"\">In Satoshi’s first forum <\/span><a href=\"https:\/\/p2pfoundation.ning.com\/forum\/topics\/bitcoin-open-source\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\">, the sage remarked of Bitcoin: “It’s completely decentralized, with no central server or trusted parties, because everything is based on crypto proof instead of trust.”<\/span>","<span data-v-f87c67ca=\"\">Students of history will immediately spot a contrast being drawn. Previous digital currency attempts such as <\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/E-gold\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">e-gold<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/www.investopedia.com\/terms\/l\/liberty-reserve.asp#:~:text=Liberty%20Reserve%20was%20formerly%20a,between%20U.S.%20dollars%20or%20Euros.\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Liberty Reserve<\/span><\/a><span data-v-f87c67ca=\"\">, survived longer than many of today’s popular cryptocurrencies have existed, but eventually operations were seized and core conspirators arraigned in federal courts.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The only reason Bitcoin thrived, while every preceding digital currency system faltered is that it lacks the notion of an operator.<\/span>","<span data-v-f87c67ca=\"\">This is <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">not <\/span><\/i><span data-v-f87c67ca=\"\">to say Bitcoin is “sufficiently decentralized” or some other semantic web of compromises. Satoshi’s words, “everything is based on crypto proof,” are resounding, and more than 15 years into Bitcoin’s history, they are still deserving of pause.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bitcoin is only a series of specific, universally agreed mathematical operations, witnessed by society at large.<\/span>","<span data-v-f87c67ca=\"\">For what it accomplishes, Bitcoin is remarkably simple. I'm certain someone could codify Satoshi’s paper in the space of an index card. In this light, Bitcoin is more of an idea than an information system. It is astoundingly abstract.<\/span>","<span data-v-f87c67ca=\"\">Regarding the scale of the challenges Bitcoin faced, there’s no reason to mince words. Born in diametric opposition to the strongest force this planet has known, it has survived a journey fraught with an inherent objection that no technology since the printing press can compare to.<\/span>","","","<span data-v-f87c67ca=\"\">While Dollar Supremacy has long been a cornerstone of US power projection across an incomprehensibly vast planet, in more recent times, high-ranking officials have acknowledged Bitcoin’s potential to disrupt this paradigm.<\/span>","<span data-v-f87c67ca=\"\">In the 21st century, the US emerged as an effectively omnipotent and omniscient force. No matter how smart, how fast, or how obfuscated an antagonist is, eventually, they will be found and their ambitions brought to a quick end.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This calls to mind the allegory of David vs. Goliath. David was armed with courage, wit, and a stone, but what about Bitcoin?<\/span>","","","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Against an all-powerful adversary, removing the consequence of the inevitable is the only defense.<\/span><\/i>","<span data-v-f87c67ca=\"\">Arresting Bitcoin users would not bring an end to Bitcoin. Arresting Bitcoin miners would not bring an end to Bitcoin. Even arresting Satoshi would not bring an end to Bitcoin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This is comparable to the mythical creature of Hydra, which sprouts two heads when one is severed, or my favorite, a starfish, which will re-generate any severed arms, and maybe even a few more starfish.<\/span>","<span data-v-f87c67ca=\"\">In Bitcoin’s case, regardless of the number of Davids eliminated by Goliath, the overall outcome is multiplicative of David’s spawning, akin to the ideological reverberance of martyrdom.<\/span>","","","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin is only a series of specific, universally agreed mathematic operations, witnessed by society at large.&nbsp;<\/span><\/i>","<span data-v-f87c67ca=\"\">Manifesting David only requires running software that implements the system's rules and finds other nodes in the network. We know code is speech; software propagation is unstoppable.<\/span>","<span data-v-f87c67ca=\"\">The ink spilled over Bitcoin’s energy usage has sowed a devastating underappreciation for the system’s elegance, the emergent effects of which enabled Bitcoin to survive the most harrowing of journeys.<\/span>","<span data-v-f87c67ca=\"\">In place of understanding, Bitcoin’s intrinsic characteristics were twisted into the meme of “blockchain” without a shared comprehension of why, precisely, the opportunity exists to assertively make these statements in the first place.<\/span>","<span data-v-f87c67ca=\"\">The innovation of Bitcoin cannot be overstated. Unconventionally, Satoshi accomplished what was accepted as an impossibility in computer science: a leaderless, permissionless, distributed system.<\/span>","<span data-v-f87c67ca=\"\">Due to its novelty, Bitcoin was the butt of jokes, a scam, or simply a scheme destined to implode. Today, the world is awash in incentives to convince you Bitcoin has been improved upon. However, skepticism toward extensions of this domain would seem to be reasonable until time has surfaced their trade-offs and proven their longevity.<\/span>","<span data-v-f87c67ca=\"\">This may be considered a radical opinion today, but if a system can be deterministically halted and restarted, it may be useful for many applications, but it’s <\/span><b data-v-f87c67ca=\"\">not<\/b><span data-v-f87c67ca=\"\"> in the same class of systems Satoshi and other cypherpunks intuited.<\/span>","<span data-v-f87c67ca=\"\">Conversely, it’s a system with the notion of operators.<\/span>","<span data-v-f87c67ca=\"\">Everyone from sophisticated coastal operators to Joe Public has been able to bypass critical thinking, salivating over an opportunity to cash in on recreating Bitcoin’s meteoric rise out of indifference.<\/span>","<span data-v-f87c67ca=\"\">As I said earlier, primitive digital currency schemes Liberty Reserve and e-gold operated for longer than nearly every smart contract platform has existed (save for Ethereum, which, to the community’s credit, did improve on Bitcoin in many respects, albeit with compromise).<\/span>","<span data-v-f87c67ca=\"\">Every one of the well-known smart contract platforms launched with Proof-of-Stake, allowing VCs to gobble up sizable allocations in all of them. Further issuance is deterministic, based on staked coins (at near zero cost to the staker), with no natural force (beyond the threat of regulation) to rotate these stakeholders out.<\/span>","<span data-v-f87c67ca=\"\">Even in the case of the “optically” noble Worldcoin, the equivalent of 100 million eyeball scan airdrops were pre-mined to the initial development team and investors.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In this paradigm, certain parties hold significant control at launch, with no impetus for this to change. Degenerates dismiss these nuances with convincing memes. In a narrow, profit-centric view, they are exceedingly irrelevant.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, in the interest of longevity, does this seem to resemble the inputs to Bitcoin's emergent effects, or something else entirely?<\/span>","<span data-v-f87c67ca=\"\">While some readers have heard this enough for one lifetime, for others, it may be their first time:<\/span>","","","<span data-v-f87c67ca=\"\">There are a number of architectural differences between Bitcoin and the “here to fix things” blockchains, but the most poignant is the difference in consensus mechanisms.&nbsp;<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">In Proof-of-Work systems, it is <\/span><\/i><b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">expensive<\/i><\/b><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> to produce blocks but <\/span><\/i><b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">cheap<\/i><\/b><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> to verify them.<\/span><\/i>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">In Proof-of-Stake systems, it is <\/span><\/i><b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">cheap<\/i><\/b><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> to produce blocks but <\/span><\/i><b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">expensive<\/i><\/b><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> to verify them.<\/span><\/i>","<span data-v-f87c67ca=\"\">The trade-off is the expension of mass amounts of physical resources, <\/span><b data-v-f87c67ca=\"\">but to what end<\/b><span data-v-f87c67ca=\"\">?<\/span>","<span data-v-f87c67ca=\"\">Mining a Bitcoin block involves brute force computation of a very improbable but <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">defined<\/span><\/i><span data-v-f87c67ca=\"\"> outcome.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On average, every 10-minute block is the product of quintillions of <\/span><a href=\"https:\/\/www.nervos.org\/knowledge-base\/SHA256_most_used_hash_function_(explainCKBot)\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">algorithm<\/span><\/a><span data-v-f87c67ca=\"\"> executions, as miners try at random to produce this outcome. Each block contains a reference to the previous block, and thus is imprinted with proof of an unbounded number of machines attesting to the same history of Bitcoin, codified in the microscopic space of 48 bytes.<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">(To demonstrate...this line is about 48 bytes of data)<\/span><\/i>","<span data-v-f87c67ca=\"\">To appreciate Satoshi’s invention, check out how this prior art in distributed systems:<\/span>","","","&nbsp;","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin’s otherworldly “efficiency” in this respect is devastatingly ironic.<\/span><\/i>","<span data-v-f87c67ca=\"\">The magic of probability and cryptography allow anyone to confirm the incomprehensible computational effort undertaken to produce the history of Bitcoin—in a matter of seconds.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Rational economic behavior dictates that it is overwhelmingly likely this history is valid, as miners are only rewarded for valid blocks. These properties are absolutely unique to Proof-of-Work and impossible to replicate in Proof-of-Stake.<\/span>","<span data-v-f87c67ca=\"\">With this knowledge of the chain’s history, users can connect directly using a “light client,” bypassing the need for third-party services like centralized RPC providers. Bitcoin’s UTXO transaction model also makes it possible for these users to construct their own transactions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Explanations of <\/span><a href=\"https:\/\/www.nervos.org\/knowledge-base\/utxo_model_explained\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">UTXOs<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/www.nervos.org\/knowledge-base\/ultimate_guide_to_light_clients\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">light clients<\/span><\/a><span data-v-f87c67ca=\"\"> are beyond the scope of this article, but you can learn more by checking the linked pieces.<\/span>","<span data-v-f87c67ca=\"\">Raising the issue of users’ reliance on RPC providers verges on alarmism; however, we already have cases of countries’ traffic being <\/span><a href=\"https:\/\/www.vice.com\/en\/article\/g5qkb7\/ethereum-companies-suddenly-ban-users-in-certain-countries\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">geo-blocked<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">The truth is, the stronger the protocol design assumption that users will access network functionality through specialized gateways, the stronger the case can be made that these service providers are “operators.”<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">It should be noted that Proof-of-Work and UTXOs both reduce end-user node hardware requirements, compared to those of Proof-of-Stake and account model systems.<\/span><\/i>","<span data-v-f87c67ca=\"\">Bitcoin has no privileged identities, no validator addresses, no staked balances, and no attribution of responsibility anywhere for the system’s operation. Even the concept of “transaction confirmation” is out of the scope for the protocol.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In Bitcoin, transactions are deemed valid and included in the chain’s history. However, they are never “confirmed.” Any transaction can later be reversed through a blockchain re-organization, and thus, the acceptance of a particular transaction’s veracity in the system is entirely left up to the discretion of its users.<\/span>","<span data-v-f87c67ca=\"\">In this paradigm, no miner is actually asserting any authority, they are instead attempting to extend the chain with their best guess as to what the most probable prior history is.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Over time, it does become infeasible to reverse a transaction (6 block confirmations is the rule of thumb for Bitcoin). There is something extraordinary in the details here.<\/span>","<span data-v-f87c67ca=\"\">We can compare this paradigm to a Proof-of-Stake system, which provides definitive “finality” to transactions through a quorum of signatures from specific validators’ keys. This means that the Proof-of-Stake chain progresses and funds flow between users as a function of the actions of specific entities specified in-protocol.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In other words, Proof-of-Stake chains have unintentionally re-introduced the notion of operators to blockchains, negating the essence of Satoshi’s invention.<\/span>","<span data-v-f87c67ca=\"\">While miners also perform a service to a decentralized network, they are external to the system, and no specific miner or group of miners is needed for the system to function.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The memes will tell you that Proof-of-Stake allows anyone to operate a validator.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It is, however, a technically complex endeavor with a low margin for error and is also capital intensive <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">(besides the <\/span><\/i><a href=\"https:\/\/ethresear.ch\/t\/sticking-to-8192-signatures-per-slot-post-ssf-how-and-why\/17989\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">physical limits<\/span><\/i><\/a><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">)<\/span><\/i><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Natural economic forces (specialization and economies of scale) inevitably work toward the concentration of validation power. And while the situation may look similar in Proof-of-Work, there’s one key difference: miners are constantly fighting against entropy, with no chance to permanently secure a monopoly position and capture the chain.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Miners incur real costs, their future is never guaranteed.<\/span>","<span data-v-f87c67ca=\"\">Another meme becomes appropriate here, the meme of “f*ck around and find out.”<\/span>","","","<span data-v-f87c67ca=\"\">In Proof-of-Work, “f*ck around” and “find out” are linearly correlated—nodes will reject blocks that do not adhere to the system's rules, and the miners will incur significant costs with no revenue. In other words, there’s no room for network stakeholders to fool around in Proof-of-Work, as they “find out” immediately.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On the other hand, in Proof-of-Stake, the costliness of producing a block is removed, making the relationship between “f*ck around” and “find out” asymptotic.<\/span>","","","<span data-v-f87c67ca=\"\">At near zero cost, a validator(s) can fool around and produce a block that doesn’t adhere to consensus rules (they’ll get a slap on the wrist for missing their slot). This may sound trivial, but to me, the idea looks a lot like a <\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/Trial_balloon\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">trial balloon<\/span><\/a><span data-v-f87c67ca=\"\">, a useful tactic in the process of changing established order.<\/span>","<span data-v-f87c67ca=\"\">It’s also possible that a critical mass of the blockchain’s stakeholders accept the consensus change specified in the block.<\/span>","<span data-v-f87c67ca=\"\">We’ve covered one side of the asymptote; what about the other? In Proof-of-Stake, “find out” amounts to <\/span><a href=\"https:\/\/ercwl.medium.com\/the-case-for-social-slashing-59277ff4d9c7\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">social slashing<\/span><\/a><span data-v-f87c67ca=\"\">, a concerted movement to delete an aggressor’s coins. It sounds far-fetched, but it has been the established path of last resort in the Ethereum community for some time. <\/span>","","","<span data-v-f87c67ca=\"\">But who has the authority to delete another’s coins? This is ultimately a political process with uncertain consequences. The best analogue I can think of is the game theory around <\/span><a href=\"https:\/\/cointelegraph.com\/news\/vitalik-centralized-usdc-could-decide-the-future-of-contentious-eth-hard-forks\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Circle’s potential role<\/span><\/a><span data-v-f87c67ca=\"\"> in a contentious hard fork.<\/span>","&nbsp;","<span data-v-f87c67ca=\"\">Proof-of-Work is not immune to politics, social consensus is the ultimate arbiter in a permissionless blockchain. However, adding a cost to consensus makes rational economic behavior an invaluable counterweight, which grounds every tick of the public, ownerless system.<\/span>","<span data-v-f87c67ca=\"\">In November of last year, CKB was “<\/span><a href=\"https:\/\/twitter.com\/NervosNetwork\/status\/1721244628119159065\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">down<\/span><\/a><span data-v-f87c67ca=\"\">.”<\/span>","<span data-v-f87c67ca=\"\">My first thought: we are hypocrites, we are Solana.<\/span>","<span data-v-f87c67ca=\"\">The outage stemmed from incompatibilities with mining pool middleware and a soft fork activation. After a couple of hours, a mining pool with about 10% of the total hash rate deployed a fix. Seconds later, a block was mined, and a few minutes later, another block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Still full of cortisol, I had a realization.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">There was no “gather the validators on Discord” and no quorum of specific entities needed to “restart” the chain. Simply put, someone, somewhere, needed to mine a block in accordance with the consensus rules.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">And eventually someone did, because Proof-of-Work properly incentivizes them and allows them to do so. It was a nice reminder that Proof-of-Work is self-healing.<\/span>","<span data-v-f87c67ca=\"\">It was also a reminder of the brilliance of Satoshi’s invention. While every smart contract chain I can think of has painted Bitcoin as a relic, CKB considers it an inspiration—the result of decades of philosophical and technical exploration by principled computer science pioneers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As opposed to the blockchains that tear up this body of work and start anew, CKB inherits the ingenious features of Bitcoin, like Proof-of-Work and the <\/span><a href=\"https:\/\/www.nervos.org\/knowledge-base\/utxo_model_explained\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">UTXO<\/span><\/a><span data-v-f87c67ca=\"\"> model, and then takes a <\/span><a href=\"https:\/\/www.theblock.co\/post\/266973\/ckb-risc-v-unlocking-unprecedented-blockchain-programmability\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">step further<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">And like Bitcoin, it’s just “crypto proof” observed by an audience. The reality is: a Proof-of-Work chain can never be “down;\" it’s never even actually “up.”<\/span>","<span data-v-f87c67ca=\"\">The system is definitively asynchronous, and what we refer to as the “Bitcoin blockchain” is a convergence of independent observations, similar to how we socially and collectively cognize “reality.\" This truth changes through wide observation of a new, valid block.<\/span>","<span data-v-f87c67ca=\"\">This fact is crucial because we are building public, ownerless systems, which <\/span><b data-v-f87c67ca=\"\">must<\/b><span data-v-f87c67ca=\"\"> run on public interest. Relying on countless individuals makes them unlikely to fail, and while this path is not sexy, efficient, or at times even comprehensible, it is robust—and that’s what’s important.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Permissionless blockchains offer us the promise of self-sovereignty, and thus, the systems themselves must be sovereign, free to pursue the destiny emergent of their technical and social DNA.<\/span>","<span data-v-f87c67ca=\"\">While “decentralization,” or more aptly, “the lack of centralization,” may <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">seem<\/span><\/i><span data-v-f87c67ca=\"\">, even for prolonged periods of time, to be an arcane and frivolous concern— on a long enough timeline, it will prove absolutely essential.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">I can only speak for myself and others in our community, but this reality is why we follow Satoshi.<\/span>","<span data-v-f87c67ca=\"\">In CKB, we have found something astounding: not only does Satoshi’s work provide a robust foundation for a public system, but it elegantly facilitates many of the landmark features the industry at large is directed toward, including <\/span><a href=\"https:\/\/github.com\/nervosnetwork\/rfcs\/blob\/master\/rfcs\/0015-ckb-cryptoeconomics\/0015-ckb-cryptoeconomics.md#collecting-state-rent-with-secondary-issuance-and-the-nervosdao\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">state rent<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/www.nervos.org\/knowledge-base\/account_abstraction_where_were_going\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">account abstraction<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/github.com\/nervosnetwork\/rfcs\/blob\/master\/rfcs\/0002-ckb\/0002-ckb.md#44-transaction\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">transaction parallelization<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/talk.nervos.org\/t\/exploring-the-ckb-otx-paradigm-accomplishments-and-insights-from-building-a-transaction-streaming-prototype\/7346\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">intents<\/span><\/a><span data-v-f87c67ca=\"\">, localized fee markets, and trust-minimized <\/span><a href=\"https:\/\/talk.nervos.org\/t\/flyclient-on-ckb\/5973\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">light clients<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">To learn more about CKB and the Nervos Network, visit <\/span><a href=\"https:\/\/www.nervos.org\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/www.nervos.org\/<\/span><\/a>","<em data-v-f87c67ca=\"\">A massive thanks to Stefan Stankovic for the expansive exploration of the topics that became this article. Follow the author on X <a href=\"https:\/\/x.com\/matt_bitcoin\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/x.com\/matt_bitcoin&amp;source=gmail&amp;ust=1706765953470000&amp;usg=AOvVaw0ty9kN41JcPOn513OFRNzh\" data-v-f87c67ca=\"\">@matt_bitcoin<\/a><\/em>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Nervos Network <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"21st century","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"MIT Press","content":"ORGANIZATION"},{"type":"Worldcoin","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"Satoshi’s","content":"PERSON"},{"type":"thirty years ago","content":"DATE"},{"type":"Solana","content":"ORGANIZATION"},{"type":"Joe Public","content":"PERSON"},{"type":"Zimmerman","content":"PERSON"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"CKB","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"November of last year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"David’s","content":"PERSON"},{"type":"David","content":"PERSON"},{"type":"Phil Zimmermann","content":"PERSON"},{"type":"Satoshi","content":"PERSON"},{"type":"Liberty Reserve","content":"ORGANIZATION"},{"type":"RPC","content":"ORGANIZATION"},{"type":"Nervos Network","content":"ORGANIZATION"},{"type":"Hydra","content":"ORGANIZATION"},{"type":"Stefan Stankovic","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"David vs. Goliath","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"PGP","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}