{"summary":"A former Voyager executive and his father are proposing their own restructuring plan that would cut the firm&#x27;s lending program.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160344\/former-voyager-executive-vies-for-an-alternative-restructuring-plan","publishDate":"2022-07-29T20:18:00","id":8088,"type":null,"title":"Former Voyager executive vies for an alternative restructuring plan","category":["LEGAL"],"content":["Voyager's former Chief Innovation Officer Shingo Lavine and his father and business partner Adam Lavine are pushing back on the embattled lender's restructuring plan and calling for the bankruptcy proceedings to explore his alternative.","The Lavines objected in a Thursday filing to Voyager's motion for an order approving logistics related to approving its restructuring plan. They offered a plan that would have the firm cease all lending activity, integrate live trading and issue a recovery token to keep users on the platform.","Both Shingo and Adam are equity holders in Voyager. Together they built Ethos, which hosted a wallet application in addition to blockchain architecture that allowed developers to build a variety of applications. Voyager purchased Ethos in 2018, and Shingo took a seat on the board and as CIO before disagreements on the company's direction led the two to part ways in 2021. Now, the father and son want their firm, Emerald, to become a key partner in Voyager's restructuring and install themselves as the leaders of a new management team.&nbsp;","\"Specifically, Emerald has been exploring submitting an alternative restructuring plan that, while similar to the debtors’ plan in structure, would immediately re-build trust by changing management, re-implementing a robust self-custody solution, and focusing the business around trading: Eliminating the lending and debit card platforms, paring back costs, and restructuring around a mission of building a best in class self-custody and integrated trading solution.\"","Voyager already has filed a restructuring plan and is seeking bids for the company. Voyager has not deemed Emerald an \"acceptable bidder\" thus far. Emerald and the Lavines are seeking to block Voyager's plan from moving forward until alternative restructuring plans, like their proposal, are considered.&nbsp;","To formally submit a proposal, they need additional access to information that Voyager so far has declined to give them as they have yet to be considered acceptable bidders. The Thursday document highlights repeated attempts by Emerald to be involved in the process, which Voyager allegedly continues to brush off.&nbsp;","Voyager filed for <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">Chapter 11 bankruptcy<\/a> earlier this month after halting withdrawals. The collapse occurred during a wider market downturn that has claimed several firms.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CIO","content":"ORGANIZATION"},{"type":"Adam","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"earlier this month","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Shingo","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Shingo Lavine","content":"PERSON"},{"type":"Voyager","content":"LOCATION"},{"type":"Adam Lavine","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Lavines","content":"LOCATION"},{"type":"Voyager","content":"ORGANIZATION"},{"type":"Emerald","content":"ORGANIZATION"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}