{"summary":"Banks supervised by the Federal Reserve Board should notify the board before engaging in crypto asset-related activity, according to a new supervisory letter.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163926\/fed-banks-should-notify-reserve-board-before-engaging-in-crypto-activity","publishDate":"2022-08-16T15:06:20","id":8100,"type":null,"title":"Fed: Banks should notify Reserve Board before engaging in crypto activity ","category":["POLICY"],"content":["The Federal Reserve Board released new information for banking organizations that want to engage in crypto-asset activities on Tuesday.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Board-supervised banks should notify the board before engaging in crypto activities, assess whether crypto-related activities are legally permissible and determine whether regulatory filings are required, according to the <a href=\"https:\/\/www.federalreserve.gov\/supervisionreg\/srletters\/SR2206.htm\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">supervisory letter<\/span><\/a>. Banking organizations should also have systems and controls in place to conduct crypto-related activities.","“The emerging crypto-asset sector presents potential opportunities to banking organizations, their customers, and the overall financial system,” the letter says. “However, crypto-asset-related activities may pose risks related to safety and soundness, consumer protection, and financial stability.”","Crypto asset-related activities could pose risks related to technology and operations, the letter warns, along with money laundering and terrorism financing, consumer protection, legal compliance and financial stability.","The letter was signed by Michael Gibson, the director of the subdivision of supervision and regulation, and Eric Belsky, director of the division of consumer and community affairs.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tuesday","content":"DATE"},{"type":"Michael Gibson","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Eric Belsky","content":"PERSON"},{"type":"Federal Reserve Board","content":"ORGANIZATION"}],"hashtag":["CRYPTO","FEDERAL RESERVE","TRADFI BANKS"],"authors":["Stephanie Murray","The Block"]}