{"summary":"Grayscale is launching Grayscale Digital Infrastructure Opportunities, &quot;a private, co-investment opportunity in mining hardware that powers the Bitcoin ecosystem.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175140\/grayscale-unveils-bitcoin-mining-centered-investment-entity","publishDate":"2022-10-06T08:31:32","id":8103,"type":null,"title":"Grayscale unveils bitcoin mining-centered investment entity","category":["INVESTMENTS"],"content":["Crypto asset management firm Grayscale aims to take advantage of the slide in crypto prices with a new investment product focused on bitcoin mining hardware.&nbsp;","The new product is \"designed to capture (the) upside of crypto winter,\" Grayscale said.&nbsp;","It was launched via the newly founded Grayscale Digital Infrastructure Opportunities (GDIO), a \"private, co-investment opportunity in mining hardware that powers the bitcoin ecosystem.\"","\"GDIO will use invested capital to purchase mining equipment – as it becomes available for sale in the coming months at what is likely to be discounted prices,\" said Rayhaneh Sharif-Askary, Grayscale head of investor relations. \"GDIO will then deploy this equipment to mine bitcoin, sell bitcoin daily, and distribute cash generated to investors, generating income.","GDIO will be open for investments from \"eligible\" individual and institutional accredited investors, the company said.","\"While a lot of people have exposure to cryptocurrencies themselves, it’s significantly more difficult for the everyday investor to source, store, and operate mining equipment to generate a profit mining bitcoin,\" Sharif-Askary said.","Foundry, which runs one of the biggest mining pools, Foundry USA, will manage the day-to-day operations of the new entity, which is the first of its kind for Grayscale. Foundry and Grayscale are both subsidiaries of the Digital Currency Group (DCG).","“As part of Foundry’s mission to empower a decentralized infrastructure, we’re excited to partner with Grayscale to broaden the ability to invest in bitcoin mining during this opportune time,\" said Foundry CEO Michael Colyer in a statement from Grayscale.","Bitcoin miners have seen their margins decline in the past few months, as the cryptocurrency has fallen in value.","\"In the coming months, we anticipate some miners will be forced to liquidate their mining equipment,\" said Sharif-Askary. \"GDIO is positioned to provide liquidity to these miners, purchasing mining equipment at distressed prices, and mining profitably as the price of Bitcoin recovers.\"","There's been <a href=\"https:\/\/www.theblock.co\/post\/169988\/bitcoin-mining-execs-talk-industry-consolidation-cleansparks-asset-deal\" data-v-f87c67ca=\"\">talk of consolidation<\/a> in the bitcoin mining industry, and companies like CleanSpark already have been leveraging market conditions to scoop up <a href=\"https:\/\/www.theblock.co\/post\/168193\/bitcoin-miner-cleanspark-bought-10000-asics-at-a-significantly-discounted-price\" data-v-f87c67ca=\"\">thousands of mining machines<\/a> at discounted prices.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"winter","content":"DATE"},{"type":"Michael Colyer","content":"PERSON"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"Grayscale Digital Infrastructure","content":"ORGANIZATION"},{"type":"Grayscale","content":"LOCATION"},{"type":"Rayhaneh Sharif","content":"PERSON"},{"type":"Askary","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Foundry USA","content":"ORGANIZATION"},{"type":"Sharif","content":"PERSON"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"Foundry","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}