{"summary":"Sam Altman&#x27;s Worldcoin has launched in Germany and integrated with Okta&#x27;s Auth0, to offer an easier way to sign in with Worldcoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237018\/worldcoin-germany-okta-auth0-token","publishDate":"2023-06-29T05:40:05","id":8105,"type":null,"title":"Worldcoin launches in Germany and integrates with Okta&#x27;s Auth0 platform","category":["COMPANIES"],"content":["Sam Altman's Worldcoin has launched sign-ups for its World ID in Germany and has brought its \"Sign in with Worldcoin\" tool to Okta's Auth0, one of the world's largest authentication and authorization platforms.","The Auth0 integration is Worldcoin's first extensive implementation of Sign in with Worldcoin, the project said Thursday. Sign in with Worldcoin is similar to common social single sign-ons — a system that allows users to access multiple applications or websites using just one set of login credentials.","The Auth0 integration means the thousands of apps that use Auth0 can now easily support Sign in with Worldcoin, <span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Tiago Sada, <\/span>head of product at Tools for Humanity, a technology company building tools for the Worldcoin project, told The Block. \"Sign in with Worldcoin is designed to provide a secure, privacy-preserving way to access services and applications while preventing fraud and penetration of bots,\" Sada said.","Users get to retain more privacy because when they Sign in with Worldcoin, a zero-knowledge proof (ZKP) is generated on their device, attesting their \"proof of personhood\" without revealing any unnecessary personal information, Worldcoin said. Proof of personhood, in turn, helps prevent fraud and bots, it added.","Sada gave an example of an app building an integration that will require Sign in with Worldcoin to purchase concert or event tickets. With proof of personhood, artists can help ensure that tickets go to fans, not bots or larger ticket purchasing systems that want to purchase the tickets and resell them at a higher price. \"The implementations and applications for Sign in with Worldcoin are limitless and it is exciting to see what developers have built to date,\" Sada said.","The Auth0 integration is connected to World ID, a protocol that helps users provide a digital passport to prove they are unique and real people while remaining anonymous. The <a href=\"https:\/\/www.theblock.co\/post\/229742\/sam-altman-worldcoin-app-token\" data-v-f87c67ca=\"\">World App<\/a> can be used to create a digital passport or <a href=\"https:\/\/www.theblock.co\/post\/219541\/sam-altmans-worldcoin-unveils-world-id-protocol-and-sdk\" data-v-f87c67ca=\"\">World ID<\/a>, which can be optionally verified with a phone number or biometrics using \"Orb,\" a biometric imaging device developed to prove personhood.","Orb is designed, engineered and manufactured in <a href=\"https:\/\/worldcoin.org\/blog\/announcements\/worldcoin-launches-world-id-sign-ups-eu-largest-economy-germany\" data-v-f87c67ca=\"\">Germany<\/a> and the launch of World ID sign-ups in the country means residents can prove their humanness through Worldcoin.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tools for Humanity","content":"ORGANIZATION"},{"type":"Sada","content":"PERSON"},{"type":"Germany","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Okta","content":"ORGANIZATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"LOCATION"},{"type":"Worldcoin","content":"PERSON"},{"type":"Tiago Sada","content":"PERSON"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["IDENTITY","INTERNET"],"authors":["Yogita Khatri","The Block"]}