{"summary":"The number of wallets staking Pyth network’s token has exceeded 110,000, a significant increase in recent weeks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274497\/pyth-token-stakers","publishDate":"2024-01-25T12:04:33","id":8107,"type":null,"title":"Number of Pyth stakers surpass 110,000 as community participation grows","category":["CRYPTO ECOSYSTEMS"],"content":["The count of crypto wallets staking the Pyth network's token has <a href=\"https:\/\/dune.com\/etaetaeta\/pyth-stakers-over-time\" data-v-f87c67ca=\"\">surpassed<\/a> the 110,000 mark, exhibiting an exponential surge in interest over the past few weeks.","At December's start, the number of Pyth token stakers was under 10,000. Yet, over the past month, there has been a more than tenfold increase in wallets participating in Pyth governance staking.","In November, Pyth first introduced its token, <a href=\"https:\/\/www.theblock.co\/post\/260421\/pyth-network-token-airdrop\" data-v-f87c67ca=\"\">rewarding<\/a> community members who contributed to the oracle network by offering them a stake. The Pyth tokens, native to the Solana blockchain, can be staked to participate in the oracle network's governance.","<span data-v-f87c67ca=\"\">Pyth stakers over 30 days | Source: <a href=\"https:\/\/dune.com\/etaetaeta\/pyth-stakers-over-time\" data-v-f87c67ca=\"\">Dune (via @etaetaeta)<\/a><\/span>","The recent spike in Pyth staking could be attributed to <a href=\"https:\/\/twitter.com\/kabukistory\/status\/1749498958630777077\" data-v-f87c67ca=\"\">speculation<\/a> — widely <a href=\"https:\/\/twitter.com\/rektfencer\/status\/1748337951392551015\" data-v-f87c67ca=\"\">shared<\/a> by multiple crypto influencers on X — about potential airdrops for Pyth stakers.","Several influencers have claimed Pyth will see a trend akin to what was observed in the Celestia ecosystem, where stakers have continued to receive rewards from projects leveraging its data availability solution. This appears to have driven many to stake the tokens, although Pyth has yet to comment on the speculation.","Pyth stands as a decentralized oracle network, specialized in delivering real-time, off-chain market data to blockchain applications. It is one the most used oracle service, especially on the Solana platform, and supports over 200 protocols across different networks. Pyth's closest competitor is Chainlink.","The Pyth token trades at $0.40 with a a fully diluted market capitalization of $4 billion, according to <a href=\"https:\/\/www.theblock.co\/price\/264488\/pyth-network-pyth-usd\" data-v-f87c67ca=\"\">The Block's price page<\/a>.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana blockchain","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"$4 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Pyth","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Pyth","content":"LOCATION"},{"type":"$0.40","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"November","content":"DATE"},{"type":"past month","content":"DATE"},{"type":"Celestia","content":"LOCATION"},{"type":"Pyth stakers","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"}],"hashtag":["ASSETS","DAOS","PROTOCOLS","STAKING"],"authors":["Vishal Chawla","The Block"]}