{"summary":"The tool allows developers to create zero-knowledge powered chains, connecting through a shared ZK bridge.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247873\/polygon-labs-chain-development-kit","publishDate":"2023-08-29T10:00:00","id":8109,"type":null,"title":"Polygon Labs unveils Chain Development Kit to develop and connect Ethereum Layer 2s","category":["COMPANIES"],"content":["Polygon Labs released a software tool called the Chain Development Kit (CDK), allowing developers to develop Layer 2 chains for Ethereum that are powered by zero-knowledge proofs.","CDK is the evolution of the <a href=\"https:\/\/www.theblock.co\/post\/221942\/gaming-project-aavegotchi-to-release-own-blockchain-with-polygon-supernets\" data-v-f87c67ca=\"\">Supernets<\/a> tool, offered as part of the <a href=\"https:\/\/www.theblock.co\/post\/234354\/polygon-2-zk\" data-v-f87c67ca=\"\">Polygon 2.0<\/a> roadmap coming next year. It aims to provide a framework for the development of Layer 2 blockchains that can operate on the Ethereum network.","According to Polygon Labs, Layer 2 blockchains deployed using its CDK will have the ability to connect to a shared ZK bridge — allowing for interoperability.&nbsp;","“Any developer deploying a chain using the Polygon CDK will be launching a ZK-powered L2 on Ethereum. By connecting to a shared ZK bridge, every chain is also seamlessly interoperable — connected to every other,” Polygon Labs noted.","The codebase for the CDK will be open-sourced, the firm stated.","\"Polygon CDK is the evolution of Supernets, which offered projects the ability to operate sidechain-like appchain protocols,\" the team added. \"Using CDK, all existing Supernets can upgrade their current architecture to the industry-leading Polygon ZK technology.\"","The toolkit will support what is called as \"Interop Layer,\" a new protocol being developed by Polygon Labs that will aggregate zero-knowledge proofs from multiple Polygon chains and secure them together by generating with the Ethereum mainnet. This layer also serves as a coordinator for the states of various Layer 2 chains, ensuring composability across them.","Recently, Polygon Labs has been involved in developing individual chains for <a href=\"https:\/\/www.theblock.co\/post\/221420\/polygon-to-help-develop-immutable-zkevm-secured-by-matic-stakers)\" data-v-f87c67ca=\"\">Immutable<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/238140\/idex-unveils-a-zkevm-layer-2-chain-based-on-polygon-supernets\" data-v-f87c67ca=\"\">IDEX<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/241693\/palm-network-polygon\" data-v-f87c67ca=\"\">Palm Network<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/221942\/gaming-project-aavegotchi-to-release-own-blockchain-with-polygon-supernets\" data-v-f87c67ca=\"\">Aavegotchi<\/a>. With Polygon 2.0, the emphasis will shift towards creating more interconnected chains, leading to an ecosystem akin to Cosmos and Polkadot but targeting Ethereum Layer 2 developers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"IDEX","content":"ORGANIZATION"},{"type":"Aavegotchi","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"Palm Network","content":"ORGANIZATION"},{"type":"Polygon CDK","content":"ORGANIZATION"},{"type":"\"Interop Layer","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}