{"summary":"Arbitrum community members have greenlit a governance vote on a proposal that asks for ARB token holders to stake their holdings in exchange for yield.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261628\/arbitrum-dao-approves-proposal-to-activate-token-staking","publishDate":"2023-11-06T05:59:36","id":8110,"type":null,"title":"Arbitrum community approves initial vote on proposal to activate token staking","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Arbitrum community members have greenlit an initial governance vote on a proposal that asks for <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248386\/arbitrum-arb-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/photo_2023-03-29_21.47.00.jpeg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ARB<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -2.0038%\n    <\/span><\/a> <!----><\/span> token holders to stake their holdings in exchange for yield. This is expected to be funded by the Arbitrum treasury and distributed over 12 months through a smart contract, per the PlutusDAO <\/span><a href=\"https:\/\/forum.arbitrum.foundation\/t\/proposal-activate-arb-staking-final\/19068\" data-v-f87c67ca=\"\">proposal<\/a>.","The <a href=\"https:\/\/snapshot.org\/#\/arbitrumfoundation.eth\/proposal\/0xf22530295daee96dffd7f70854475c06216a4d3594929672f71c12bf638bb0c8\" data-v-f87c67ca=\"\">proposal<\/a>'s first phase of the governance vote, which was approved today, originally presented a tiered system for token allocation, with options to allocate 1% (100 million tokens), 1.5% (150 million tokens), or 1.75% (175 million tokens) of the total 10 billion ARB supply as staking rewards.","In the temperature check vote conducted on SnapShot, the majority — more than 66% of the DAO members — voted in favor of the lowest tier of allocating 1% (100 million tokens) toward staking. A minority, 33%, voted against the vote, highlighting a disagreement within the community regarding the use of treasury funds for staking incentives.&nbsp;","After this temperature check voting period, the DAO is set to consider a subsequent AIP proposal that will focus on the specifics of the staking implementation and will need approval. Furthermore, a final community nod on the Tally, an on-chain DAO management platform, would be required to finally grant stakers a token yield from the treasury. This yield will be distinct from other mechanisms where tokens are staked to secure the network or to distribute revenue.","The annualized percentage yield is estimated between 7.84% and 78.43% if 100 million tokens are used, depending on the percentage of the ARB supply that is staked.","<em data-v-f87c67ca=\"\">The headline and body were updated to clarify that a final vote will be conducted before the staking implementation.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"AIP","content":"ORGANIZATION"},{"type":"-2.0038%","content":"PERCENT"},{"type":"1.75%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"1.5%","content":"PERCENT"},{"type":"7.84%","content":"PERCENT"},{"type":"1%","content":"PERCENT"},{"type":"78.43%","content":"PERCENT"},{"type":"66%","content":"PERCENT"},{"type":"33%","content":"PERCENT"}],"hashtag":["ARBITRUM","ASSETS","DAOS","GOVERNANCE VOTES"],"authors":["Vishal Chawla","The Block"]}