{"summary":"Uniswap will implement a 0.15% new swap fee for ETH, USDC, WETH, USDT, DAI, WBTC, agEUR, GUSD, LUSD, EUROC and XSGD. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/257798\/uniswap-to-charge-0-15-to-swap-certain-tokens-on-web-interface-and-wallet","publishDate":"2023-10-16T15:13:55","id":8113,"type":null,"title":"Uniswap to charge 0.15% to swap certain tokens on web interface and wallet","category":["CRYPTO ECOSYSTEMS"],"content":["The decentralized cryptocurrency exchange Uniswap will start implementing a fee of 0.15% to trade cryptocurrencies on its web app and wallet starting on Oct. 17.&nbsp;","The tokens affected include ETH, USDC, WETH, USDT, DAI, WBTC, agEUR, GUSD, LUSD, EUROC and XSGD, Uniswap said Monday on its <a href=\"https:\/\/support.uniswap.org\/hc\/en-us\/articles\/20131678274957-What-are-Uniswap-Labs-fees\" data-v-f87c67ca=\"\">website<\/a>.","\"This is separate from the Uniswap Protocol fee switch, which is voted on by UNI token governance,\" Uniswap founder Hayden Adams <a href=\"https:\/\/twitter.com\/haydenzadams\/status\/1713987105666265113?s=46\" data-v-f87c67ca=\"\">wrote on X<\/a>.","The new fee follows liquidity pool fees of 0.3% and a protocol fee expected to rise from 0% after after a governance vote. The Block Research estimates that weekly 0.15% swap fee volume is expected to be around $800,000 (about $114,000 a day) with roughly $42 million annualized revenue.&nbsp;","\"Users have countless choices of ways to use it, through aggregators, other UIs, or by interacting directly with the smart contracts,\" Adams wrote. \"Our interface remains the best – a huge amount of love (and money) goes into making that the case.\"","\"This interface fee is one of the lowest in the industry, and it will allow us to continue to research, develop, build, ship, improve, and expand crypto and DeFi,\" he continued.","(<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Updates figures to reflect estimated daily, weekly and annualized swap revenue.<\/i>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"UNI","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"0.3%","content":"PERCENT"},{"type":"Adams","content":"PERSON"},{"type":"EUROC","content":"ORGANIZATION"},{"type":"Block Research","content":"ORGANIZATION"},{"type":"Hayden Adams","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"$800,000","content":"MONEY"},{"type":"$114,000","content":"MONEY"},{"type":"Oct. 17","content":"DATE"},{"type":"0.15%","content":"PERCENT"},{"type":"0%","content":"PERCENT"},{"type":"$42 million","content":"MONEY"}],"hashtag":["DEXS","UNISWAP"],"authors":["MK Manoylov","The Block"]}