{"summary":"StormX&#x27;s token has seemingly experienced market manipulation amid what a Binance customer service rep calls an &quot;emergency incident of the STMX contract.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241051\/stormx-stmx-manipulation-binance","publishDate":"2023-07-23T05:35:59","id":8115,"type":null,"title":"StormX token price fluctuates wildly amid &#x27;emergency&#x27; contract incident","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto cash-back project StormX's token has seemingly experienced market manipulation amid what a Binance customer service rep calls an \"emergency incident of the STMX contract.\"","\"Regarding the emergency incident of the STMX contract, the relevant team is dealing with it urgently,\" a Twitter-translated <a href=\"https:\/\/twitter.com\/sisibinance\/status\/1683010071750475776?s=20\" data-v-f87c67ca=\"\">tweet<\/a> from @sisibinance reads.","The tweet, in translation, continues: \"Further information will be synchronized with you later. Please enter the online customer service to fill out the appeal form.\"","Neither Sisi nor StormX immediately responded to a request for comment.","StormX's token is the 268th-ranked cryptocurrency by market capitalization, according to CoinGecko. Over the past 24 hours, the STMX price surged from $0.0063 to nearly $0.015 before experiencing a full retracement.","<span data-v-f87c67ca=\"\">The price of StormX's token surged before immediately collapsing today. Source: <a href=\"https:\/\/www.tradingview.com\/symbols\/STMXUSDT\/\" data-v-f87c67ca=\"\">TradingView<\/a><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TradingView","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$0.015","content":"MONEY"},{"type":"$0.0063","content":"MONEY"}],"hashtag":["BINANCE"],"authors":["Adam James","The Block"]}