{"summary":"Argentine crypto app Lemon Cash is laying off about 100 people.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189848\/lemon-cash-ceo-expects-more-fintech-layoffs-in-latam-amid-its-own-exclusive","publishDate":"2022-11-24T17:04:41","id":8117,"type":null,"title":"Lemon Cash CEO expects more fintech layoffs in LatAm amid its own: Exclusive","category":["EXCHANGES"],"content":["Argentina-based crypto app Lemon Cash has laid off about 100 people, 38% of staff, marking the latest round of cuts in the region.","Several other Latin America-based crypto companies have announced significant <a href=\"https:\/\/www.theblock.co\/post\/167677\/mercado-bitcoin-parent-2tm-lays-off-more-staff-calls-for-regulation\" data-v-f87c67ca=\"\">layoffs<\/a> this year including Bitso, Buenbit and 2TM, parent of the Brazilian crypto exchange Mercado Bitcoin.","Lemon Cash CEO Marcelo Cavazzoli said the Latin America fintech industry could continue to see further layoffs as companies adjust to a difficult market and funding environment. Crypto-specific companies might have an easier time due to having higher margins, he added.","\"Companies that are not adjusting now, they will adjust when they try to fundraise in the, let's say, the next 12 months, 10 months,\" Cavazzoli said. \"They will be even in a worse situation because they will have less runway left and it's going to be even harder.\"","The news comes amid the fallout and ripple effects of FTX's bankruptcy filing, on top of the slump in crypto asset prices over the past year. While venture funding was plentiful in previous years, Cavazzoli warned not to expect much in the future.","\"There was a huge wave of investment in LatAm from the VC industry — not only in crypto but in tech in general — with gigantic rounds in fintech as well,\" Cavazzoli said in an interview with The Block. \"And I believe that made the tech industry in LatAm a bit too much dependent on further fundraises.\"","Lemon Cash also revealed today that it closed a $27.8 million extension of its Series A funding round this year, bringing the total size of the round to $44 million. Firms including DST Global, Valor Capital, GoodWater Capital, CMT Digital and Cadenza participated. The company now has runway for three years, Cavazzoli said.&nbsp;","Lemon Cash, an app with more than 1.6 million users in Argentina, allows users to buy and sell crypto as well as earn weekly crypto gains by holding crypto in the app. The company has also issued more than 760,000 Visa cards that allow users to automatically convert crypto into local currency. Additionally, it has minted more than 435,000 \"Lemmy\" NFTs on OpenSea.","FTX Ventures participated in the Series A extension with a \"very small percentage,\" Cavazzoli said. Lemon has an insignificant amount of money stuck with FTX's sister trading firm Alameda that it does not expect to get back, he said, declining to state the amount due to ongoing liquidations.","Lemon was using FTX and Alameda's protocols for its Lemon Earn service, a spokesperson said, with Cavazzoli confirming that all of those user funds had been withdrawn. The only exposure Lemon continues to have in the companies is an amount in Alameda, which is similar to the FTX Ventures investment.&nbsp;","Cavazzoli stressed that the FTX bankruptcy did not have any effects on Lemon's users, and that the recent layoffs were previously planned.&nbsp;","The CEO expects three main trends for 2023 as it innovates its products: customers will demand transparency in centralized exchanges, businesses will need to show sustainability to weather the ongoing bear market and Web3 adoption will be a major focus.&nbsp;","The FTX situation inspired Cavazzoli to think about how to increase transparency in not only the Lemon Cash app, but the overall industry.","Lemon recently implemented an audited live proof-of-funds feature, allowing its users to see the company's funds at any time in the app. It will expand on this by using the Merkle tree data structure to show its liabilities as well, it added. He expects two more local exchanges to use this feature as well and plans to make the technology open-source.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cavazzoli","content":"PERSON"},{"type":"DST","content":"ORGANIZATION"},{"type":"CMT Digital","content":"ORGANIZATION"},{"type":"Lemon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Latin America","content":"LOCATION"},{"type":"$44 million","content":"MONEY"},{"type":"Marcelo Cavazzoli","content":"PERSON"},{"type":"$27.8 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Argentina","content":"LOCATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Merkle","content":"PERSON"},{"type":"38%","content":"PERCENT"},{"type":"Sam Bankman","content":"PERSON"}],"hashtag":["FTX","LAYOFFS"],"authors":["Kristin Majcher","The Block"]}