{"summary":"As lawmakers filter back from summer recess, Sen. Hagerty says they should be focused on an incremental approach rather than a larger bill. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249781\/us-senator-hagerty-calls-for-incremental-approach-in-drafting-bills-to-regulate-crypto","publishDate":"2023-09-07T12:34:46","id":812,"type":null,"title":"US Senator Hagerty calls for incremental approach to regulate crypto","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">As lawmakers filter back from a summer recess and the push for crypto legislation continues, Sen. Bill Hagerty, R-Tenn., says they should be focused on an incremental approach rather than a larger bill.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The perspective I've taken is rather than trying to come up with a fulsome complete package in one blow, to try to take step by step processes,\" Hagerty said on Thursday morning at an <a href=\"https:\/\/www.cato.org\/events\/staying-ahead-curve-crypto-regulation-competitiveness\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">event<\/span><\/a> hosted by the Cato Institute.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The statement comes as lawmakers have worked on bills this past summer to regulate crypto, with some taking a comprehensive approach and others focused on specific issues.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Both the House Financial Services Committee and the House Agriculture Committee led by Republican lawmakers <a href=\"https:\/\/www.theblock.co\/post\/241812\/historic-crypto-market-bill-approved-to-advance-to-full-us-house\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">advanced<\/span><\/a> legislation in July that overhauls crypto market regulation in part by creating a pathway for a digital asset to transition from being a security investment to a commodity. The bill is next set to go in front of the full House of Representatives.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">On the Senate side, a bipartisan group of lawmakers <\/span><span class=\"s4\" data-v-f87c67ca=\"\">introduced a <a href=\"https:\/\/www.theblock.co\/post\/240587\/senate-bill-would-tighten-money-laundering-and-sanctions-rules-for-defi\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">bill<\/span><\/a> in July to tighten existing rules aimed at combating money laundering and sanctions evasion by making specific how they apply to decentralized finance.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Hagerty, who sits on the Senate Banking Committee, introduced a few bills last year that run on the shorter side to regulate crypto, including one that would give exchanges a safe harbor from certain SEC enforcement actions.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">An incremental approach creates certainty, allows for lawmakers to learn from what they're doing and continue on with input from the industry, Hagerty said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"My legislation is two pages as opposed to some complex behemoth that comes out of the Hill,\" Hagerty said. \"I admire my colleagues, but it seems that they value the legislation based on how many pages are in it and as a business person, I don’t see it that way. Simplicity has a tremendous amount of value, particularly when we’re about an industry that’s evolving this rapidly.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lawmakers need to create broad boundaries so that innovation can continue and then respond accordingly, he added.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Hagerty also criticized the Securities and Exchange Commission on Thursday over what he calls its \"regulation by enforcement proceeding.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Rather than articulating a set of criteria, what they're doing is they're allowing the market to evolve and then they're just picking and choosing where they want to lay an enforcement proceeding and say, well, we don't like that and therefore it's wrong,\" Hagerty said. That creates uncertainty, he added.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">SEC Chair Gary Gensler’s \"posture\" is hurtful to the industry, Hagerty said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It’s up to the Senate and to the House of Representatives to bring this into check,\" Hagerty said.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tenn.","content":"LOCATION"},{"type":"Bill Hagerty","content":"PERSON"},{"type":"House Agriculture Committee","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Hagerty","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"morning","content":"TIME"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Cato Institute","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["HOUSE AGRICULTURE COMMITTEE","HOUSE FINANCIAL SERVICES COMMITTEE","SEC","SENATE BANKING COMMITTEE","SENATE FINANCE COMMITTEE"],"authors":["Sarah Wynn","The Block"]}