{"summary":"Community members of decentralized exchange Uniswap voted down a proposal that would have introduced a protocol fee for liquidity providers on the platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232951\/uniswap-community-votes-against-proposal-for-protocol-fee-on-trades","publishDate":"2023-06-01T17:37:40","id":8123,"type":null,"title":"Uniswap community votes against initial feedback poll for protocol fees","category":["DEFI"],"content":["Community members of decentralized exchange Uniswap voted in an initial poll against a plan to introduce a protocol fee for liquidity providers on the platform.","In the end, the naysayers only squeaked by with a plurality. Some 45.3% percent of token-votes supported the \"no fee\" option, while votes worth 54.6% split over two options to set the proposed fee equal to either one-fifth or one-tenth of the pool fee across Uniswap v3 pools.&nbsp;","The <a href=\"https:\/\/gov.uniswap.org\/t\/making-protocol-fees-operational\/21198?u=gfxlabs\" data-v-f87c67ca=\"\">proposal<\/a> was brought forth last month by GFX Labs, which argued that Uniswap was in a \"strong position\" to turn on fees and \"prove that the protocol can generate significant revenues.\"&nbsp;","\"Uniswap is a decentralized exchange, and market participants are used to paying fees to utilize exchanges. We need to reaffirm that liquidity providers are protocol users and do not need full rebates,\" GFX Labs said in the propsoal. \"The LPs making the most money off Uniswap are not retail traders. They are professional market makers, just like the ones seen on traditional exchanges.\"","Leighton Cusack, a DeFi contributor and co-founder of PoolTogether, <a href=\"https:\/\/twitter.com\/lay2000lbs\/status\/1664326806487400448\" data-v-f87c67ca=\"\">said on Twitter<\/a> that most of the no votes were against the proposed implementation and not necessarily the idea of the fees themselves.&nbsp;","\"I generally think UNI governance is on board with fees but how they are implemented matters a lot,\" he wrote in a follow-up message to The Block. Last month, Cusack said he was against the proposal because it did \"not address what to do with any fees collected.\"","\"I’ve come to the strong belief that any fees collected by the protocol should be autonomously distributed in a programmatic way,\" he wrote in a <a href=\"https:\/\/gov.uniswap.org\/t\/making-protocol-fees-operational\/21198\/12?u=leighton\" data-v-f87c67ca=\"\">discussion<\/a> about the proposal last month ahead of the vote. \"I think this proposal is a step in the right direction but the crucial piece I outlined above needs to be addressed before I can support it.\"","Uniswap Foundation Executive Director Devin Walsh <a href=\"https:\/\/twitter.com\/devinawalsh\/status\/1664393327251210241\" data-v-f87c67ca=\"\">said on Twitter<\/a> that the poll had been posted to get feedback and was not part of a formal governance process.","\"In the past Snapshots have been used by the UF and others to gather feedback from the community. This is how it's being used here,\" she <a href=\"https:\/\/twitter.com\/devinawalsh\/status\/1664393327251210241\" data-v-f87c67ca=\"\">wrote<\/a>. \"If @labsGFX moves forward to a Temp Check, that Snapshot vote will be part of the Uniswap gov process.\"","<em data-v-f87c67ca=\"\">(Corrects story to reflect that poll was part of initial feedback process and not final governance vote.)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cusack","content":"PERSON"},{"type":"GFX Labs","content":"ORGANIZATION"},{"type":"Leighton Cusack","content":"PERSON"},{"type":"Devin Walsh","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"54.6%","content":"PERCENT"},{"type":"UF","content":"ORGANIZATION"},{"type":"45.3% percent","content":"PERCENT"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Uniswap Foundation Executive","content":"ORGANIZATION"},{"type":"Uniswap","content":"LOCATION"},{"type":"Temp Check","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}