{"summary":"Unstoppable Messaging enables users to message anyone on other XMTP-enabled platforms like Coinbase Wallet and Lens apps.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246976\/unstoppable-domains-decentralized-messaging-xmtp","publishDate":"2023-08-23T12:00:00","id":8128,"type":null,"title":"Unstoppable Domains launches decentralized messaging with XMTP","category":["WEB3"],"content":["Web3 domain provider Unstoppable Domains has launched a decentralized, end-to-end encrypted messaging service, powered by the Extensible Message Transport Protocol project.","The new service, dubbed \"Unstoppable Messaging,\" will enable secure communication using web3 domain names provided by Unstoppable Domains like \".cypto\" and \".x,\" according to a statement.&nbsp;","Unstoppable Messaging is interoperable with other XMTP-enabled communities, enabling users to securely message people on Ethereum-compatible platforms like Coinbase Wallet and Lens apps by entering their wallet address or domain and vice versa. Unstoppable Domains plans to enable other dapps to use Unstoppable Messaging via Push Protocol to message their communities, the team added.","Web3 domain names offer an alternative to the Domain Name System, enabling more user-friendly transactions by mapping human readable names like \"alice.eth\" to more complex crypto addresses.","With Unstoppable Messaging, users have full ownership of their messages, Unstoppable Domains said. Messages are encrypted and stored on XMTP’s decentralized network, and as users can access their chats on any XMTP platform, their messages remain intact regardless of what happens to Unstoppable. Users can also block other individuals using the network from contacting them, according to the statement.&nbsp;","Unstoppable users need to set up a \"Reverse Resolution\" for their web3 domain (enabling dapps and websites to replace their wallet address with the domain) and click on the chat icon to initiate their first conversation. The feature is available on the Unstoppable iOS app and website, with Android support to follow.","In March, Unstoppable Domains <a href=\"https:\/\/www.theblock.co\/post\/219619\/unstoppable-domains-releases-web3-domain-names-for-polygon-blockchain\" data-v-f87c67ca=\"\">released<\/a> web3 domain names for the Polygon blockchain, creating the domain ending \".polygon\" in partnership with Polygon Labs. Unstoppable also supports other networks, including BNB Chain and Solana.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Unstoppable Domains","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Coinbase Wallet","content":"ORGANIZATION"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Extensible Message Transport Protocol","content":"ORGANIZATION"},{"type":"Domain Name System","content":"ORGANIZATION"}],"hashtag":["ETHEREUM","IDENTITY"],"authors":["James Hunt","The Block"]}