{"summary":"Laser Digital, the digital asset subsidiary of Japanese financial services giant Nomura, plans to grow its venture capital arm despite shrinking industry-wide funding.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238809\/nomuras-laser-digital-adds-new-partner-as-it-expands-crypto-vc-arm","publishDate":"2023-07-11T03:12:05","id":8129,"type":null,"title":"Nomura’s Laser Digital adds new partner as it expands crypto VC arm","category":["DEALS"],"content":["<span data-v-f87c67ca=\"\">Laser Digital, the crypto subsidiary of Japanese financial services giant Nomura, has appointed industry veteran Florent Jouanneau as a new partner in its venture capital business. The company plans to grow its venture capital arm despite <a href=\"https:\/\/www.theblock.co\/post\/238681\/web3-venture-funding-dropped-80-in-first-quarter\" data-v-f87c67ca=\"\">shrinking industry-wide funding levels<\/a>.<\/span>","<span data-v-f87c67ca=\"\">The appointment of Jouanneau brings Laser’s venture team size to a total of seven members, said Olivier Dang, the company’s general partner and head of ventures. Launched last fall, Laser Digital currently has about 65 employees and also runs asset management and trading services.<\/span>","<span data-v-f87c67ca=\"\">Jouanneau came to Laser from White Star Capital, a VC firm investing in web3 and DeFi startups. He was previously a structured credit and ABS trader at Bank of America, and has held roles in sales and trading at UBS and BPCE Group’s Natixis.<\/span>","<span data-v-f87c67ca=\"\">Laser’s ambition to expand its venture business comes with VC investments in web3 on the decline. Web3 venture funding dropped in the first quarter of this year, <\/span><a href=\"https:\/\/www.theblock.co\/post\/238681\/web3-venture-funding-dropped-80-in-first-quarter\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">down 80%<\/span><\/a><span data-v-f87c67ca=\"\"> from the same period last year, according to data from K33 Research.<\/span>","<span data-v-f87c67ca=\"\">The Block Pro data also show that VC investment in web3 totaled $2.8 billion in the first quarter of this year, representing a sharp decline from $13.5 billion in the first quarter of last year.<\/span>","<span data-v-f87c67ca=\"\">“In 2022, we have seen a slowdown in the market, especially when 2021 was an incredible year in terms of fundraising with big institutions [participating],” Jouanneau told The Block in an interview.<\/span>","<span data-v-f87c67ca=\"\">Jouanneau said now is the “perfect time” to invest as “we are seeing a lot of valuations being dragged down by effectively the lack of capital to be deployed” — a common bear market narrative among crypto VCs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“From a risk-reward perspective and frankly from a VC perspective, it’s definitely a good time to invest and for institutions to invest in several VCs that are taking that view,” he added.<\/span>","<span data-v-f87c67ca=\"\">With an increasing number of traditional financial institutions including <a href=\"https:\/\/www.theblock.co\/post\/237563\/blackrock-refile-for-spot-bitcoin-etf-naming-coinbase-as-surveillance-partner\" data-v-f87c67ca=\"\">BlackRock<\/a> showing interest in spot Bitcoin ETFs, Olivier Dang, Laser’s general partner and head of ventures, is hopeful that the crypto industry can mature.<\/span>","<span data-v-f87c67ca=\"\">“We fundamentally believe that more institutions will come into the space,” Dang said. “[This] will gradually increase the quality of the deal flow, [and] the quality of the transactions done on the venture side. On the asset management and trading side, we need more robust institutional-grade infrastructure to be able to support those institutions.”<\/span>","<span data-v-f87c67ca=\"\">Dang added Laser’s Nomura backing has helped gain trust among investors.<\/span>","<span data-v-f87c67ca=\"\">“People have not necessarily been comfortable investing into crypto funds or VC funds focusing on crypto because they may have had questions around the quality of their due diligence,” Dang said.<\/span>","<span data-v-f87c67ca=\"\">With its fund currently backed exclusively by Nomura, Laser has now started to raise third-party capital, according to Dang. It has invested in early-stage startups that focus on DeFi, CeFi, web3 tooling and infrastructure. Its portfolio companies include <\/span><span data-v-f87c67ca=\"\">DeFi protocol <\/span><a href=\"https:\/\/www.theblock.co\/post\/211852\/nomura-laser-digital-invests-infinity-exchange\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Infinity Exchange<\/span><\/a><span data-v-f87c67ca=\"\"> and the crypto trading firm <\/span><a href=\"https:\/\/www.theblock.co\/post\/221577\/two-sigma-flow-traders-and-laser-digital-back-crypto-trading-venue-crossx\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">CrossX<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Laser wouldn’t disclose the size of its fund, but Dang said for the rest of this year, the team aims to make another 10 investments in addition to the dozen or so deals it has completed so far.<\/span>","<span data-v-f87c67ca=\"\">“We see almost 100 deals per month, so we are extremely selective when it comes to assessment of those opportunities,” Dang said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We tend to prioritize projects that are really focusing on institutional use cases,” he continued, adding that Laser stays away from projects that are “too focused on gaming and NFTs” as the team doesn’t know enough about the space to confidently invest in it.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"White Star Capital","content":"ORGANIZATION"},{"type":"fall","content":"DATE"},{"type":"Laser Digital","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"the first quarter","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Nomura","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bank of America","content":"ORGANIZATION"},{"type":"Florent Jouanneau","content":"PERSON"},{"type":"UBS","content":"ORGANIZATION"},{"type":"the first quarter of last year","content":"DATE"},{"type":"K33 Research","content":"ORGANIZATION"},{"type":"BPCE Group’s Natixis","content":"ORGANIZATION"},{"type":"first quarter","content":"DATE"},{"type":"Jouanneau","content":"PERSON"},{"type":"Infinity Exchange","content":"ORGANIZATION"},{"type":"ABS","content":"ORGANIZATION"},{"type":"$2.8 billion","content":"MONEY"},{"type":"$13.5 billion","content":"MONEY"},{"type":"Olivier Dang","content":"PERSON"},{"type":"Dang","content":"PERSON"}],"hashtag":[],"authors":["Timmy Shen","The Block"]}