{"summary":"The cross-chain bridge platform Orbiter Finance explained what caused faulty transactions and why its Discord account appears deleted. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254113\/orbiter-finance-allays-rug-pull-accusations-says-discord-blocked-its-account","publishDate":"2023-10-03T13:47:10","id":8131,"type":null,"title":"Orbiter Finance allays rug pull accusations, says Discord blocked its account","category":["CRYPTO ECOSYSTEMS"],"content":["The team behind the decentralized cross-bridge rollup Orbiter Finance said that customer funds are safe and explained the cause of its Discord disappearance.&nbsp;","\"Orbiter bridge works very well and does not have any security issues. The transaction may fail due to network instability or the sender deleting the target network identification code when sending the transaction. We will execute these failed transactions ASAP,\" Orbiter <a href=\"https:\/\/twitter.com\/Orbiter_Finance\/status\/1709254171780935995\" data-v-f87c67ca=\"\">wrote<\/a> on the social media platform X.","Orbiter's explanation comes after a few users questioned why some transactions weren't going through and why the Orbiter team wasn't responding, leading some to accuse <a href=\"https:\/\/www.theblock.co\/post\/235022\/phishing-frenzy-school-kids-are-stealing-millions-of-dollars-of-nfts-to-buy-roblox-skins\" data-v-f87c67ca=\"\">Orbiter<\/a> of a rug pull.","A crypto analyst known as DeFiyst <a href=\"https:\/\/twitter.com\/DeFiyst\/status\/1709258659178459212?s=20\" data-v-f87c67ca=\"\">noted<\/a> that Obiter's system appends the last four digits of the transaction amount and then uses these four numbers to determine the recipient chain. If a user changes the transaction amount manually, this can cause issues. They speculated this could have been the cause of the issues.","\"Orbiter's Discord is safe, but Orbiter's Discord account is blocked by Discord team for no reason,\" Orbiter added. \"We have been trying to contact the Discord team to appeal. This is why Orbiter's account is displayed as a 'deleted account' in our channel.\"","Orbiter concluded by affirming that the bridge and community are safe.&nbsp;","Orbiter Finance allows users to transact Ethereum native assets across numerous protocols, including Base, Arbitrum, Polygon and Immutable X, quickly and at a low cost.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DeFiyst","content":"ORGANIZATION"},{"type":"Arbitrum","content":"LOCATION"},{"type":"Orbiter Finance","content":"ORGANIZATION"},{"type":"Discord","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Obiter","content":"PERSON"},{"type":"Orbiter","content":"ORGANIZATION"}],"hashtag":["CROSS-CHAIN SWAPS","INTEROPERABILITY"],"authors":["MK Manoylov","The Block"]}