{"summary":"The market capitalization of Circle’s USDC stablecoin has fallen by about $10 billion over the last two weeks, to  $32.5 billion.\nDespite assurances from Circle that redemptions will be met with reserves, the stablecoin continues to see outflows.","author":["Adam Morgan McCarthy","Sam Venis","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224172\/usdc-stablecoin-market-cap-plunges","publishDate":"2023-03-30T19:17:19","id":814,"type":null,"title":"Circle’s USDC stablecoin sees market cap plunge $10 billion over past two weeks","category":["Companies"],"content":["Circle’s USDC continues to see redemptions en masse as the stablecoin's market cap fell to about $32.5 billion, a decline of roughly $10 billion over the last two weeks.","\"It appears that the events of early March have damaged the trust crypto investors and traders have in the reliability of the stablecoin, despite Circle offering full redemptions without delays for USDC,\" said Steven Zheng, director of research at The Block.","Net redemptions in the past 24 hours reached close to $463 million, with $487 million burned and just $24.1 million minted. USDC's market cap has gone from around $33.3 billion to $32.8 billion over the same period, according to data from The Block.","","","<em data-v-f87c67ca=\"\"><a href=\"https:\/\/www.coingecko.com\/en\/coins\/usd-coin\" data-v-f87c67ca=\"\">USDC market cap chart via CoinGecko<\/a><\/em>","<br data-v-f87c67ca=\"\">\nTroubles with the stablecoin began in early March when news surfaced that Circle had $3.3 billion of reserve funds held in Silicon Valley Bank, which led to USDC de-pegging from the US dollar. After U.S. federal bank regulators guaranteed the full return of customer deposits from Silicon Valley Bank and Signature Bank, however, Circle CEO Jeremy Allaire <a href=\"https:\/\/www.theblock.co\/post\/219133\/circle-usdc-operations-will-resume-at-open-monday-allaire\" data-v-f87c67ca=\"\">announced<\/a> that operations would resume.&nbsp;Still, redemptions have continued.&nbsp;","Last week, Allaire addressed concerns in a <a href=\"https:\/\/twitter.com\/jerallaire\/status\/1638855105410740230\" data-v-f87c67ca=\"\">post<\/a> on Twitter, connecting the sell-off to a wider de-risking process among investors from projects exposed to U.S. banks and U.S. regulatory risk. For Circle, Allaire said, \"we are going to keep doing what we have always done,\" noting that the stablecoin has \"never failed to mint or redeem USDC for $1, including during the past weeks stress test.\"","\"USDC as a protocol and digital currency continues to function on public chains, protocols and wallets uninterrupted,\" Allaire said.&nbsp;","Circle directed The Block to Allaire's tweet.","<em data-v-f87c67ca=\"\">Correction: Story updated to correct redemption figures in third paragraph.&nbsp;<\/em>"],"hashtag":[]}