{"summary":"Convincing the world&#x27;s sovereign wealth funds about the advantages of investing in bitcoin still poses challenges, according to an analyst.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283665\/bitcoin-investment-by-sovereign-wealth-funds-still-faces-obstacles-analyst-says","publishDate":"2024-03-22T12:26:43","id":814,"type":null,"title":"Bitcoin investment by sovereign wealth funds still faces obstacles, analyst says","category":["INSTITUTIONAL INVESTORS"],"content":["Convincing the world's sovereign wealth funds about the advantages of investing in bitcoin still poses challenges, according to an analyst.","<span data-v-f87c67ca=\"\">In early March, rumors spread that Qatar's sovereign wealth fund, the Qatari Investment Authority (QIA), might potentially invest in the bitcoin market. This speculation arose when it was reported that one of the Emir of Qatar’s private jets landed on the island of Madeira for the <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +1.21%\n    <\/span><\/a> <!----><\/span><\/span> Atlantis conference.<\/span>","\"Max is saying Qatar may have added bitcoin to their balance sheet. If true all we can say is thank you Max Keiser,\" U.S. financier Anthony Scaramucci <a href=\"https:\/\/twitter.com\/Scaramucci\/status\/1764436326202458342\" data-v-f87c67ca=\"\">posted<\/a> on X.com.","However, Fadi Aboualfa, head of research at Copper, questioned the likelihood of any sovereign wealth fund choosing <a href=\"https:\/\/www.theblock.co\/post\/284115\/bitcoin-stalls-stock-indices-record-highs-rate-cuts\" data-v-f87c67ca=\"\">bitcoin<\/a> over fixed income or more traditional assets during capital allocation. For instance, Aboualfa questioned why sovereign wealth funds would invest in bitcoin rather than the security of five-year bonds, which can offer 5-6% annual returns risk-free.","\"You need someone with a lot of power and conviction to push through and give the go-ahead for sovereign money into bitcoin,\" Aboualfa told The Block.","In the case of the QIA bitcoin investment rumors, Aboualfa said the nation would be better off using its uncaptured gas to mine bitcoin. \"That would be growth in terms of revenue against natural resources that they already have and are not being used, and the most expensive part of mining bitcoin,\" he added.","However, Aboualfa suggested that bitcoin could potentially appeal to countries seeking to disentangle themselves from a dollar-dominated global financial system.","Countries, \"especially those whose reliance on the West might be more than they want it to be, especially in regard to payment networks,\" may look to bitcoin because \"blockchain and digital assets are giving them some increased level of control and mitigation of geopolitical risks. This could eventually, in the long, long run, circle back to sovereignty of money which right now is only bitcoin,\" he added.","Despite doubts about sovereign wealth funds worldwide investing in <a href=\"https:\/\/www.theblock.co\/post\/283670\/bitcoin-price-trades-flat-as-federal-reserve-holds-rates-steady\" data-v-f87c67ca=\"\">bitcoin<\/a>, one analyst cited signals indicating that these financial institutions are showing interest in the digital asset sector.","\"One element of the institutionalization of crypto, which surely appeals to sovereign wealth funds, and also family offices, is the new tooling used for sophisticated portfolio managers,\" cryptocurrency derivatives trader Gordon Grant said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fadi Aboualfa","content":"PERSON"},{"type":"6%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Gordon Grant","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"+1.21%","content":"PERCENT"},{"type":"Max Keiser","content":"PERSON"},{"type":"Qatari Investment Authority","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Anthony Scaramucci","content":"PERSON"},{"type":"Aboualfa","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"Madeira","content":"LOCATION"},{"type":"X.com","content":"LOCATION"},{"type":"Qatar","content":"LOCATION"}],"hashtag":["CRYPTO MOVERS","SOVEREIGN WEALTH FUNDS"],"authors":["Brian McGleenon","The Block"]}