{"summary":"Regulated DeFi platform Swarm has launched &quot;Open dOTC&quot; — an alternative permissionless platform for trading tokenized real-world assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267229\/swarm-launches-permissionless-trading-platform-for-tokenized-real-world-assets","publishDate":"2023-12-12T19:00:03","id":8146,"type":null,"title":"Swarm launches permissionless trading platform for tokenized real-world assets","category":["INFRASTRUCTURE"],"content":["Swarm, a Berlin-based DeFi platform regulated by BaFin in Germany, has launched a permissionless trading platform for tokenized real-world assets, dubbed \"Open dOTC,\" as a public goods service.&nbsp;","Built on Ethereum, the platform utilizes decentralized over-the-counter (dOTC) smart contracts. These contracts are designed to eliminate slippage, ensure instant settlement and minimize credit and counterparty risks by fully collateralizing trades, according to a statement.","Swarm’s tokenized U.S. treasury bond ETFs are available at launch, with the platform planning to add tokenized publicly traded stocks such as Apple and Tesla.","“Adoption of tokenized assets is impeded by a lack of viable platforms where they can be traded,” Swarm co-founder Timo Lehes said. “The launch of this public goods service means more people can take advantage of the RWA narrative that has exploded in 2023.”","Swarm said Open dOTC was built following <a href=\"https:\/\/www.theblock.co\/post\/227309\/mica-european-union-crypto-regulation-passes\" data-v-f87c67ca=\"\">MiCA<\/a> clarity — the European Union’s Markets in Crypto Assets regulation — which came into force in June. Applications that are sufficiently decentralized do not fall under regulator purview, Swarm claimed. However, European trade body, the Association for Financial Markets in Europe, warned against the exclusion of DeFi from MiCA in July, arguing it could open opportunities for <a href=\"https:\/\/www.theblock.co\/post\/238100\/afme-defi-mica-exclusion\" data-v-f87c67ca=\"\">regulatory arbitrage<\/a>.","The platform ensures that tokenized assets comply with EU prospectus regulation in Liechtenstein, ensuring that they are issued to and redeemed from wallets that have passed know-your-customer and anti-money laundering checks, Swarm explained. However, “The tokens can be freely transferred between wallets in the meantime and can be accessed by retail investors with no minimum investment amount,” it said.","Swarm added that it will continue operating its permissioned platform for those who need regulated DeFi trading infrastructure.","“Swarm has been in the regulatory process for three years so we have had a head start on most players in the space,” Swarm co-founder Philipp Pieper added. “We know there is a whole crypto and DeFi ecosystem that believes in permissionless infrastructure and Open dOTC has been designed with them in mind. To date, innovation has happened in the largely unregulated area of DeFi, which regulated players are now taking advantage of.”","Trading fees on Open dOTC are set at 0.25% and are used to buy and burn Swarm’s Ethereum-based SMT tokens. These were previously used as payment for trading fee discounts and liquidity rewards on Swarm’s permissioned and regulated platform.","Lehes said SMT token holders would benefit from trading activity on Open dOTC, “effectively marking this a community owned project.” However, any potential benefit would be derived from a reduction in SMT supply rather than any formal community ownership or governance program, as the public goods service is not owned or governed by anyone.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"0.25%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Tesla","content":"LOCATION"},{"type":"European Union’s Markets","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Open dOTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Berlin","content":"LOCATION"},{"type":"Liechtenstein","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"Timo Lehes","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"the Association for Financial Markets","content":"ORGANIZATION"},{"type":"Germany","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"BaFin","content":"ORGANIZATION"},{"type":"Philipp Pieper","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["DEXS","ETHEREUM","EUROZONE REGULATION","SMART CONTRACTS"],"authors":["James Hunt","The Block"]}