{"summary":"Mazars concluded that Binance&#x27;s bitcoin reserves are fully collateralized, following a proof-of-reserves and proof-of-liabilities verification.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192861\/binance-collateralized-mazars-audit","publishDate":"2022-12-07T07:59:51","id":8149,"type":null,"title":"Binance&#x27;s bitcoin reserves are collateralized 101% according to Mazars report","category":["EXCHANGES"],"content":["Global auditor Mazars today concluded that crypto exchange Binance's bitcoin reserves are fully collateralized, following a proof-of-reserves and proof-of-liabilities verification.","The collateralization ratio considers in-scope assets lent through the margin and loans service offering, which are collateralized by out-of-scope assets. It only focused on the exchange's bitcoin holdings on multiple blockchains. Mazars deemed this to be 101%, according to an <a href=\"https:\/\/veritas.mazars.com\/binance\/\" data-v-f87c67ca=\"\">announcement<\/a> on Mazars's website.","\"At the time of assessment, Mazars observed Binance controlled in-scope assets in excess of 100% of their total platform liabilities,\" it stated. The audit took place on Nov. 22 at 23:59:59 UTC.","Binance users are also able to independently verify that their assets were included in the audit.","<em data-v-f87c67ca=\"\">Update: This article has been updated to clarify the report is only for Binance's bitcoin reserves. The headline has also been adjusted.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mazars","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Nov. 22","content":"DATE"},{"type":"101%","content":"PERCENT"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Adam James","The Block"]}