{"summary":"Masa is receiving support from the Avalanche Foundation and investment from Avalanche’s Blizzard Fund to help develop the platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268051\/decentralized-google-launch-zk-powered-data-marketplace-avalanche","publishDate":"2023-12-18T07:05:06","id":8150,"type":null,"title":"‘Decentralized Google’ to launch zk-data marketplace in Avalanche ecosystem","category":["CRYPTO ECOSYSTEMS"],"content":["Data network Masa Finance, which describes itself as architecting the “decentralized Google for the AI era,” is set to launch a decentralized data network and marketplace in Q1 2024.","Masa is collaborating with the managed blockchain service AvaCloud to deploy a gasless Avalanche subnet (application-specific blockchain). The customizable blockchain will be designed to handle high volumes of zero-knowledge encrypted data efficiently and cost-effectively, according to a statement.","Masa previously <a href=\"https:\/\/techcrunch.com\/2022\/05\/04\/masa-finance-gets-3-5m-pre-seed-to-build-its-decentralized-credit-protocol\/\" data-v-f87c67ca=\"\">secured<\/a> $3.5 million in pre-seed funding to build its decentralized credit data protocol in May 2022.","The subnet represents an expansion of Masa’s existing data protocol. The project, the team says, aims to give users control back over their personal data and be compensated for its use. “We were doing credit data in early 2022, and then generalized the technology for all user data starting August 2022. This [subnet] for data analytics is more of an expansion in scope,” a Masa spokesperson told The Block.","“We explored different options in the market when selecting the infrastructure to build a dedicated Masa blockchain,” Masa co-founder Brendan Playford said. “Building on Avalanche using AvaCloud, Masa is able to launch a gasless self-sovereign chain which enables high throughput of transactions and powers use cases that consume high volumes of private data – all at a low cost.”","Masa is also receiving support from the Avalanche Foundation and investment from Avalanche’s Blizzard Fund to help develop the platform. The investment amount was not disclosed. This comes after&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/267394\/nodekit-pre-seed\" data-v-f87c67ca=\"\">NodeKit<\/a> recently closed a $1.2 million pre-seed round to also build an Avalanche-based network for rollups.","Masa’s system uses a zero-knowledge soulbound token (zkSBT) that acts as a personal data locker — a digital tool designed to securely manage and control an individual's personal data. It encrypts and stores individuals' digital footprints and social graphs to ensure privacy of their activity, such as participation in web3 communities or use of decentralized applications.","The team claims that over 890,000 user wallets have permissioned more than 8 million data events on Masa over the past year. With the launch of its zk-data marketplace, users will be able to view their information in their zkSBT locker and share that data in the marketplace via staking in return for compensation. For instance, users could allow financial institutions to access their Masa zkSBT for age verification without accessing their birth date.","“This is the perfect architecture to support our zk-data network and marketplace,” Masa co-founder Calanthia Mei added. “By deploying on a dedicated Avalanche subnet, major financial institutions, AI startups, and large-scale consumer tech applications can access secure, scalable, zk-encrypted user data without paying any gas.”","Masa argues that the proprietary silos of big tech companies exploit personal data without user consent or compensation — something that is worsened by the proliferation of AI as demand for peoples’ personal data grows exponentially to train models and agents.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Brendan Playford","content":"PERSON"},{"type":"May 2022","content":"DATE"},{"type":"August 2022","content":"DATE"},{"type":"Avalanche Foundation","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"$3.5 million","content":"MONEY"},{"type":"Calanthia Mei","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Masa","content":"ORGANIZATION"},{"type":"$1.2 million","content":"MONEY"},{"type":"Masa","content":"LOCATION"},{"type":"Masa Finance","content":"ORGANIZATION"}],"hashtag":["AVALANCHE","IDENTITY"],"authors":["James Hunt","The Block"]}