{"summary":"The company said it expects there to be a delay in meeting the hashrate growth guidance for the first quarter.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208892\/bitcoin-miner-riot-expects-growth-delay-due-to-december-storm-damages","publishDate":"2023-02-06T10:15:41","id":8157,"type":null,"title":"Bitcoin miner Riot expects growth delay due to December storm damages","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitcoin miner Riot said there will be a delay in meeting its first quarter hashrate guidance of 12.5 EH\/s due to damage from the winter storm that hit the U.S. in December and knocked miners offline.","In January, it mined 740 bitcoins, 12% more than in the previous month when it curtailed power due to the storm.","Of the 2.5 EH\/s affected by damage to piping in two buildings, a total of 0.6 EH\/s has been brought back online with 1.9 EH\/s remaining.","\"The company is evaluating its repair options and will provide additional information on deployment timelines as it becomes available,\" Riot said in a statement.","The miner sold 700 BTC in January as the coin rallied, bringing in $13.7 million. Rival Marathon, which typically holds all of its bitcoin, <a href=\"https:\/\/www.theblock.co\/post\/208339\/bitcoin-mining-firm-marathon-digital-sold-1500-btc-in-january\" data-v-f87c67ca=\"\">sold 1,500 last month<\/a>.","Riot had a hash rate capacity of 9.3 EH\/s as of Jan. 31, with 82,656 miners deployed.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"first quarter","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$13.7 million","content":"MONEY"},{"type":"Bitcoin miner Riot","content":"ORGANIZATION"},{"type":"Jan. 31","content":"DATE"},{"type":"12%","content":"PERCENT"},{"type":"December","content":"DATE"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}