{"summary":"The New York Department of Environmental Conservation denied Greenidge the application for an air permit renewal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155188\/greenidges-permit-renewal-denied-by-new-york-regulators","publishDate":"2022-06-30T14:14:55","id":8158,"type":null,"title":"Bitcoin miner Greenidge&#x27;s permit renewal denied by New York regulator","category":["MINING"],"content":["The New York Department of Environmental Conservation (DEC) has denied bitcoin miner Greenidge's air permit renewal.","The regulator <a href=\"https:\/\/www.dec.ny.gov\/press\/125678.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a> Thursday that Greenidge's application didn't comply with the green gas house gas (GHG) emissions limits set by the state's Climate Leadership and Community Protection Act (CLCPA), signed into law in 2019.","\"Greenidge has failed to demonstrate that the continued operation of the Facility is justified notwithstanding this inconsistency,\"&nbsp;the letter to Greenidge stated, adding that the miner didn't demonstrate \"adequate GHG mitigation measures.\"","Greenidge now has the right to request an administrative adjudicatory hearing within 30 days of the decision. The company said in a statement on Thursday that their mining operations in New York will continue running during the extended judicial review process.","\"We can continue running uninterrupted under our existing Title V Air Permit, which is still in effect, for as long as it takes to successfully challenge this arbitrary and capricious decision,\" Greenidge said. \"We are confident that an unbiased court system will reverse this regulatory misjudgment.\"","The DEC said that there was a \"dramatic increase in greenhouse gas emissions\" stemming from Greenidge's 106-megawatt facility in Dresden, as well as a shift in the power plant's primary focus.","\"Rather than solely providing energy to the state’s electricity grid, the power plant now primarily provides energy behind-the-meter to support the demands of Greenidge’s energy-intensive proof of work cryptocurrency mining operations,\" the DEC said.","Per the DEC's letter, Greenidge didn't initially state that it intended to use a significant amount of energy \"for its own purposes\" when it originally applied for an air permit in 2014, with the intent of powering back up a former coal-fired and switch it to natural gas.","\"The reopening of the Facility was, according to Greenidge, for the purpose of producing electricity on a limited basis to be sold into the New York Independent System Operator (NYISO) market. That is, the Facility was to be utilized in a “peaking” capacity, providing a limited amount of electricity to the grid in certain circumstances,\" the DEC said.&nbsp;","The DEC <a href=\"https:\/\/www.theblock.co\/post\/140081\/greenidge-permit-renewal-delayed-as-company-debates-with-regulators\" data-v-f87c67ca=\"\">had delayed the final decision on Greenidge's application<\/a> multiple times. The regulator said that it reviewed roughly 4,000 public comments.","The mining firm has stressed that it was compliant with the CLCPA, arguing, for example, GHG emissions limits in the CLCPA would only need to be achieved years after the new permit would expire.","The DEC countered that logic, stating that \"achieving the Statewide GHG emission limits will require substantial action prior to 2030.\"","\"We believe there is no credible legal basis whatsoever for a denial of this application because there is no actual threat to the State’s Climate Leadership and Community Protection Act (CLCPA) from our renewed permit,\" Greenidge said on Thursday. \"It is not, and cannot be transformed into, a politically charged ‘cryptocurrency permit’.\"","Assemblywoman Anna Kelles, the sponsor of the <a href=\"https:\/\/www.theblock.co\/linked\/150001\/new-york-senate-passes-moratorium-on-proof-of-work-mining\" data-v-f87c67ca=\"\">mining moratorium recently recently passed in the Senate<\/a> praised the regulator for the decision on Twitter:","\"A huge win for our #CLCPA goals and the first step toward preventing the use of NY's old retired fossil-fuel power plants for personal corporate gain. Happy to see @GovKathyHochul and the @NYSDEC issue this decision today as #SCOTUS weakens EPA’s ability to regulate power plants,\"Kelles said, in referance to a decision on Thursday from the Supreme Court to prevent the Environmental Protection Agency from regulating GHG limits.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Greenidge","content":"PERSON"},{"type":"GHG","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DEC","content":"ORGANIZATION"},{"type":"Dresden","content":"LOCATION"},{"type":"Kelles","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Anna Kelles","content":"PERSON"},{"type":"New York Department of Environmental Conservation (DEC","content":"ORGANIZATION"},{"type":"Greenidge","content":"ORGANIZATION"},{"type":"NY","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"State’s Climate Leadership","content":"ORGANIZATION"},{"type":"Environmental Protection Agency","content":"ORGANIZATION"},{"type":"EPA","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"Air Permit","content":"ORGANIZATION"},{"type":"the Supreme Court","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}