{"summary":"Web3 data storage solution Kyve Network has raised $9 million in a round led by Distributed Global, valuing the company at $100 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154836\/kyve-network-hits-100-million-valuation-as-it-raises-9-million","publishDate":"2022-06-30T10:00:11","id":8159,"type":null,"title":"Kyve Network hits $100 million valuation as it raises $9 million","category":["WEB3"],"content":["Kyve Network, a decentralized data storage solution, has raised $9 million in a round led by Distributed Global, according to a news release. Kyve was valued at $100 million after the raise.&nbsp;","Wicklow Capita, IOSG Ventures, Blockchain Coinvestors, Anagram, Cerulean Ventures, Huobi Incubator and MEXC Global also took part in the round.&nbsp;","Kyve, which operates as a decentralized autonomous organization, or a DAO, is a protocol that allows providers to standardize, validate and permanently store blockchain data streams. This decentralized data storage solution reduces dependence on centralized services such as AWS for web3 companies.","\"The framework <span class=\"searchHighlight\" data-v-f87c67ca=\"\">KYVE<\/span> is building across chains allows developers to collect and categorize data from a truly decentralized environment,\" said Fabian Riewe, co-founder of Kyve. \"Instead of relying on centralized snapshots, <span class=\"searchHighlight\" data-v-f87c67ca=\"\">KYVE<\/span> Network is powered by decentralized uploaders and validators, therefore respecting the original web3 ethos.”&nbsp;","Kyve claims it has had more than 85,000 unique users interacting with the protocol, creating 23.7 million on-chain events.&nbsp;","With the new funding, the company plans to build support for more blockchain networks — it recently incorporated Cosmos and Polkadot — and expand its team as it gears up for a mainnet launch. It is looking to recruit senior executives in engineering, marketing and finance.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockchain Coinvestors","content":"PERSON"},{"type":"$9 million","content":"MONEY"},{"type":"Fabian Riewe","content":"PERSON"},{"type":"IOSG Ventures","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"Cerulean Ventures","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"MEXC Global","content":"ORGANIZATION"},{"type":"AWS","content":"ORGANIZATION"},{"type":"KYVE<\/span> Network","content":"ORGANIZATION"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}