{"summary":"European Commissioner Peter Kerstens called on the crypto industry to help come up with solutions on regulating decentralized finance, as the European","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179757\/eu-commissioner-calls-for-industry-recommendations-on-defi-regulation","publishDate":"2022-10-25T13:14:19","id":8161,"type":null,"title":"EU Commissioner calls for industry recommendations on DeFi regulation","category":["POLICY"],"content":["European Commissioner Peter Kerstens called on the crypto industry to help come up with solutions on regulating decentralized finance, as the European Commission's investigation in the matter gains momentum.&nbsp;","“If you want us to come up with great solutions come and talk to us,” the senior adviser to the Commission's financial department and co-head of the fintech task force said. Kerstens made his remarks on a panel in Brussels organized by a European crypto advocacy group. “If you have bad solutions, we already have plenty of those ourselves.”","The EU’s latest project for overseeing crypto assets is almost coming to a close, as the Markets in Crypto-Assets framework is expected to be adopted by early next year. The regulation focuses on regulating cryptocurrencies as well as centralized entities, such as exchanges and other service providers. The legislative text calls on the European Commission to come up with guidelines on how to regulate DeFi 18 months after MiCA rolls out. DeFi was mostly excluded from the MiCA drafting process.","“We need to think more imaginative about how DeFi can be captured in legal concepts, if it is necessary,“ Kerstens said. The regulator added that for DeFi to develop into its potential “the best thing to do from a policy view is to do nothing at all — maybe.”&nbsp;","Kerstens said that even without third parties to go bankrupt or organize scams, there still are risks to DeFi. Mango Markets, which is built on decentralized platform Solana, <a href=\"https:\/\/www.theblock.co\/post\/176445\/hacker-steals-over-100-million-from-mango-markets\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">suffered<\/a> a $100 million loss from a hack, for example.","Defi represents a shift in paradigm from centralized finance in terms of account keeping, Kerstens said. \"If you want to regulate that, you need a paradigm shift in regulation.\"","The European Commission has bolstered resources to research ways to supervise DeFi. It <a href=\"https:\/\/www.theblock.co\/post\/175920\/eu-commission-seeks-automated-ethereum-defi-monitoring\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">released<\/a> a bid to study an “embedded supervision” of the Ethereum platform earlier this month. After that, the Commission <a href=\"https:\/\/www.theblock.co\/post\/178922\/tradfi-policies-inadequate-for-treating-defi-claims-eu-commission-study\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">revealed<\/a> a new academic report outlining a series of bespoke policy proposals.","A more hawkish approach may come from different crypto legislations in the pipeline. The EU’s Anti-Money Laundering regulation <a href=\"https:\/\/www.theblock.co\/post\/173652\/europe-aml-rules-could-implicate-defi-daos-and-nfts\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">saw<\/a> amendments from the European Parliament looking to implicate DeFi, DAOs and NFTs.","As Europe’s financial authorities iron out the details on implementation of MiCA provisions over the next 18 months, new conversations may arise on how to define decentralization, and when an entity falls into the category.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kerstens","content":"PERSON"},{"type":"European Parliament","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Peter Kerstens","content":"PERSON"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"DeFi 18 months after MiCA","content":"DATE"},{"type":"Brussels","content":"LOCATION"},{"type":"Solana","content":"PERSON"},{"type":"Crypto","content":"LOCATION"}],"hashtag":[],"authors":["Inbar Preiss","The Block"]}