{"summary":"Coinsource, the bitcoin ATM operator, made headlines last week for snagging the holy grail of bitcoin licenses, the so-called BitLicense from the New York","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/2789\/coinsource-just-snagged-its-bitlicense-and-now-its-looking-into-the-lucrative-remittance-business","publishDate":"2018-11-05T15:11:51","id":8165,"type":null,"title":"Coinsource just snagged its BitLicense, and now it&#x27;s looking into the lucrative remittance business","category":["BITCOIN"],"content":["Coinsource, the bitcoin ATM operator, made headlines last week for snagging the holy grail of bitcoin licenses, the so-called BitLicense from the New York State Department of Financial Services.","The firm, which operates 200 so-called BTMs across the U.S., announced it received the nod on Thursday, joining 11 other cryptocurrency firms. The firm applied for a BitLicense three years ago and has been operating in New York under a temporary license. With approval under its belt, the firm is now eyeing an opportunity in a $33 billion market, according to&nbsp;Arnold Spencer, general counsel at the firm.&nbsp;<em data-v-f87c67ca=\"\">The Block&nbsp;<\/em>caught up with Spencer to dissect the importance of Thursday's news.&nbsp;","<strong data-v-f87c67ca=\"\">Regulatory risk<\/strong>","First<em data-v-f87c67ca=\"\">,&nbsp;<\/em>Spencer said the BitLicense will remove a degree of regulatory risk for the firm. That will cement Coinsource's standing with its banking partners and other business relationships, he said.&nbsp;","\"Up until now we didn't necessarily know if we would&nbsp;receive regulatory approval and we didn't know under what terms we would have been able to operate,\" Spencer told&nbsp;<em data-v-f87c67ca=\"\">The Block.<\/em>&nbsp;\"Now, we have a clear path forward. When we talk to banks, investors, or our kiosk manufacturers, we have a good sense of where we are going to be 12 months from now.\"","Spencer added that the firm will be able to enter into new relationships with an added level of credibility.&nbsp;","<strong data-v-f87c67ca=\"\">New business opportunities<\/strong>","Now, Spencer is focusing on getting approval to operate as a money transmitter in all 50 states. Already, it has approval in 18. That'll be key for new business lines the firm is eyeing, including the lucrative <a href=\"https:\/\/www.investopedia.com\/terms\/r\/remittance.asp\" data-v-f87c67ca=\"\">remittance business<\/a>.&nbsp;","\"With the blessing of regulators, we are interested in getting into remittances,\" Spencer said. \"An individual could use our BTM machines at a&nbsp;fraction of the fees that they now pay using money transfer services.\"","Currently, some users of Coinsource's BTMs buy bitcoin to send to their own wallet and then send that crypto abroad. But Coinsource wants to facilitate that entire process -- allowing money to move across borders in a single step. That could be a big opportunity for the firm. World Bank stats show that remittance companies — including MoneyGram and Western Union — raked in $33 billion from fees related to migrants working in first-world countries sending funds to relatives in the developing world.&nbsp;","The details of what that business will look like are still being ironed out. But Spencer said that it might be possible for a person to send coins electronically to a foreign retailer or grocery store for a specific person to use.&nbsp;","\"That person might&nbsp;receive the money directly in their bank account or as a credit at a grocery store or a retail store or they can simply go and&nbsp;pick up [the funds in their local currency],\" he said.&nbsp;","As part of its efforts, the firm has began conversations with foreign regulators.","<span data-v-f87c67ca=\"\">\"We've started talking to regulators in South America and Asia,\" he said. <\/span>","Spencer said the firm should have approval to operate in as many as three additional countries over the next 6 to 12 months.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"MoneyGram","content":"ORGANIZATION"},{"type":"next 6","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Arnold Spencer","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Western Union","content":"ORGANIZATION"},{"type":"BitLicense","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Coinsource","content":"ORGANIZATION"},{"type":"$33 billion","content":"MONEY"},{"type":"New York","content":"LOCATION"},{"type":"South America","content":"LOCATION"},{"type":"Spencer","content":"PERSON"},{"type":"New York State Department of Financial Services","content":"ORGANIZATION"},{"type":"BTM","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}