{"summary":"What&#x27;s the future of staking? Union founder Shayne Coplan dives deep into that question.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56263\/staking-beyond-consensus-decentralized-digital-labor-markets","publishDate":"2020-03-02T12:00:14","id":8169,"type":null,"title":"Staking Beyond Consensus: decentralized digital labor markets","category":["TECHNOLOGY"],"content":["&nbsp;","The beginning of a new decade feels like the perfect time to share ambitious predictions on macro blockchain trends, so that when 2030 comes around you can hopefully tell everyone “I told you so”.","Currently, staking has found its identity as a near-riskless yield offered natively by some blockchains that entices long term holding and enables distributed consensus in a much more cost-effective and energy efficient manner than alternatives. While empirically accurate, this interpretation is shortsighted and underestimates the potential use cases of staking in systems beyond Proof-of-Stake based consensus mechanisms.","By understanding staking as a blockchain-enabled breakthrough that has the potential to greatly reduce, or even eliminate, the need for trust in labor markets — one of the most prohibitive factors for scaling said markets today — it becomes clear that its use cases can extend far past just Layer-1 consensus. By removing this need for trust, staking enables decentralized digital labor markets of unprecedented global scale that shift the paradigm of typical marketplace value accrual, where the immense value once extracted by intermediaries is now equitably distributed amongst those participating in the market.","The past decade has seen cryptocurrency as a technological innovation and asset class grow at an unprecedented pace, but only in 2019 did we see significant adoption of crypto assets in a uniquely crypto-native, non-speculative context: I’m referring to <i data-v-f87c67ca=\"\">network participation<\/i>, where stakeholders in decentralized networks use their tokens as capital to earn for performing digital labor or contributing resources that help secure the respective network.","The first instantiation of this model to reach critical mass is Proof-of-Stake (PoS) based consensus; particularly PoS networks with intra-protocol stake delegation functionality like Tezos and the Cosmos Hub, which have both seen stakeholder participation rates (% of token supply staked) soar to between 70-80%<span data-v-f87c67ca=\"\">[1]<\/span>.","The significance of this cannot be overstated. In 2019, cryptoeconomic models involving active participation in decentralized networks — long limited to theoretical whitepapers and academic critiques — finally materialized on mainnets; and, to date, have functioned as intended<span data-v-f87c67ca=\"\">[2]<\/span>.","Entering into the new decade, the total value staked across all staking networks sits at ~$6.5 billion<span data-v-f87c67ca=\"\">[3]<\/span>. This comes after a year where we saw the launch and significant fundraises of many staking networks, numerous companies specializing in providing staking infrastructure or accepting delegation for a commission, and more recently, the entrance into the market from custodial exchanges such as Coinbase, Binance, Kraken, and OKEx.","Additionally, Ethereum 2.0’s upcoming transition to Proof-of-Stake has sparked myriad industry-wide debates on topics like decentralization, scalability, staking derivatives, rehypothecation with DeFi money markets, and so on.","These are still the early days. While Proof-of-Stake based consensus, stake delegation, and its byproduct, <i data-v-f87c67ca=\"\">the staking economy<\/i>, has settled into what today is a fairly predictable, homogenous labor market that has converged on community-adopted standards and norms, <strong data-v-f87c67ca=\"\">my bet is the staking economy of tomorrow will bear very little resemblance to its current state.<\/strong>&nbsp;The primary catalysts for this shift will be 1. the proliferation of many new decentralized networks with unique staking models that involve more subjective labor and specialized resource provisioning, and 2. the arrival of exponentially more valuable staking networks, which will create a financial incentive to participate strong enough to attract larger entities.","The goal of this essay is to introduce the reader to a new mental framework for thinking about staking; not just as a component of Layer 1 consensus mechanisms, but as a widely-applicable cryptoeconomic primitive that can be used to eliminate or greatly reduce the need for trust in markets. Specifically: how staking can be utilized to create an unprecedented class of decentralized digital labor markets (it’s a mouthful, I know. Bear with me).","<strong data-v-f87c67ca=\"\">People conflate the cryptoeconomic primitive of staking with Proof-of-Stake based consensus, but by understanding staking as a technological breakthrough made possible by blockchains that enables hyper-efficient, trustless digital labor markets, it becomes clear that the use cases for staking could span far wider than just Layer 1 consensus.<\/strong>","First, how can one measure the efficiency of a market? Put briefly, the lower a market’s transaction cost, the greater its efficiency<span data-v-f87c67ca=\"\">[4]<\/span>. Transaction cost can be boiled down to the 3 T’s<span data-v-f87c67ca=\"\">[5]<\/span>:","In Web 2.0 (today), most marketplaces have successfully reduced the triangulation and transfer costs for customers in their given segment by making it easier to find formerly-fragmented goods or services and enabling easy payments with card through the internet.","Fostering trust in the marketplace is more difficult, and for most marketplace businesses, the necessary evil that imposes restrictions on their scale. In contrast, it also represents the holy grail for these intermediaries to capture immense value. Convincing target users to trust your marketplace is the first step in a virtuous cycle that results in the compounding of proprietary liquidity and, ultimately, a business so defensible and with so much bargaining power over users that they can do whatever they want with little to no consequences; extracting rent and user data as they please.","<strong data-v-f87c67ca=\"\">Enter staking. Staking, as a cryptoeconomic primitive, can fundamentally change labor markets on the Internet by eliminating or greatly reducing the need for trust, thereby enabling marketplaces of unprecedented global scale.<\/strong>","In staking-enabled decentralized digital labor markets, prospective service providers can verifiably stake collateral in the form of the network’s native token to:","Often, one’s earning capacity scales linearly with the value they’ve staked, which means that when the network experiences growth and adoption, all stakeholders’ tokens — which are scarce and represent a right to network cash flows — become intrinsically more valuable.","Assuming that the value staked exceeds the value one could gain by violating network conditions (incentive compatibility), the inclusion of a staking mechanism eliminates the need for trust and, thus, the additional transaction cost associated with it. This enables inherently global, ultra-efficient digital labor markets that can function self-sustainably without the need for oversight from a trusted 3rd party and the rent-seeking behavior and censorship that comes with their presence.","Proof-of-Stake based consensus and its various implementations are all just instances of the previously described staking-enabled decentralized digital labor markets.","Users of these PoS chains pay a set of dozens to hundreds of validators (the laborers in this case) for providing them the service of censorship-resistant, arbitrary transaction validation and smart contract execution. All these laborers maintain pseudonymity and get paid proportionally the same, regardless of where they stand in the socioeconomic hierarchy. Their stake ensures that they’ll deliver acceptable services, thereby eliminating any geographical or reputational biases, which maximizes competition on the supply side and thus drives cost for users down to its minimum.","<strong data-v-f87c67ca=\"\">Further, Proof-of-Stake models that allocate work based on stake weight are not just exponential improvements on the trust component of transaction cost, but also triangulation and transfer.<\/strong> By divvying up block rewards pro rata based on stake size, the need for triangulation is abstracted away from users, and the transfer component is solved by intermediary-free, on-chain transaction fee markets paid for in cryptocurrency. The demand side specifies their offered fee in each transaction, and it’s up to the supply side validators to decide if and when they execute it. Put simply: higher fee = higher priority. <strong data-v-f87c67ca=\"\">Collectively, this represents the absolute lowest transaction cost possible in a market structure.<\/strong>","Most traditional marketplaces struggle to generate enough volume to attract and retain supply side liquidity. As a solution, many staking networks are programmed to mint new tokens every block and reward them to staking laborers simply for being active and ready to supply resources. <strong data-v-f87c67ca=\"\">This inflationary reward, often misinterpreted as interest by the community, is actually a zero-sum value redistribution mechanism designed to incentivize an inherently sufficient number of token holders to stake. <\/strong>","The network cleverly pays for this by indirectly taxing <i data-v-f87c67ca=\"\">non<\/i>-staking token holders via dilution, thereby subsidizing supply side user acquisition and retention. This is a unique competitive advantage staking-enabled decentralized digital labor markets have over alternative market designs when it comes to solving the chicken-and-egg problem.","The previous examples have all bundled capital (staking token) with labor (validation). Often, the labor is too technical for the stakeholders to do themselves; yet, in order to accrue the inflationary rewards, they need to put their tokens to work. Anticipating this problem, most staking networks include <i data-v-f87c67ca=\"\">delegation<\/i> into their architecture; where stakeholders lend their tokens to a third-party laborer to stake for them. Stake Delegation decouples capital from labor in staking networks, allowing laborers to gain leverage on their earning capacity by increasing their stake size with someone else’s capital and taking a fee on the additional rewards.","Delegated stake is not available to the laborer for spending, however, the penalties incurred from the laborer getting slashed are often passed on proportionally to the delegators. <strong data-v-f87c67ca=\"\">This makes delegation akin to uncollateralized lending, where default risk exists in the form of slashing, and each laborer or validator fundamentally has a non-fungible credit profile. <\/strong>","While staking eliminates the need for trust, stake delegation reintroduces it, where the staking token holder needs to delegate to a validator that they trust won’t get slashed. <i data-v-f87c67ca=\"\">This<\/i> reintroduces triangulation cost, as the stakeholder needs to discover and compare the different delegation services available in the market before making their decision.","Due to these inherent transaction costs, the delegation economy currently requires a more traditional marketplace, equipped with credit measurements for laborers that span to multiple networks, and various relevant off and on-chain metrics that help stakeholders delegate wisely. As the capital at stake increases, however, there will be priced risk instruments and insurance, likely utilizing staking itself.","The advent of Stake Delegation allows parties with complementary capabilities to remotely collaborate in servicing staking networks. Notably, this creates opportunities for capable service providers around the world to participate and earn in these markets without the barrier to entry of having to stake significant capital themselves: the <i data-v-f87c67ca=\"\">delegation economy<\/i>.","Imagine utilizing the same staking-enabled market structure for services other than transaction validation and Layer 1 consensus. The most accessible next targets are other types of digital labor markets that involve the provision of scarce, often commoditizable digital resources and services, <strong data-v-f87c67ca=\"\">where the network can deterministically identify deliverables that violate the slashing conditions.<\/strong>","","","Delegation and the collaborative performance of work exist in each of the aforementioned decentralized networks with varying implementations. Looking at Livepeer’s Transcoder delegation market<span data-v-f87c67ca=\"\">[7]<\/span>, one can see a profound difference between Transcoder commissions on inflationary block rewards (~&lt;5%) and on direct earnings from transcoding services (50-100%). Despite Livepeer’s current inflationary rewards being inordinately more than its transcoding fee volume, empirically, <strong data-v-f87c67ca=\"\">this evidence suggests that delegation markets for direct labor will be much more equitably distributed than those for inflationary block rewards, which today strongly favor capital providers.<\/strong>","Dozens of highly-ambitious and well-capitalized networks are slated for 2020 mainnet launches and will inevitably attract more actors and capital into the staking economy. Most notably, Ethereum’s upcoming transition to Proof-of-Stake: a $25 billion network<span data-v-f87c67ca=\"\">[8]<\/span> with roughly 86 million unique addresses<span data-v-f87c67ca=\"\">[9]<\/span>. The move will single-handedly multiply the size of the staking economy and introduce millions of people to the concept of staking for the first time. It will unavoidably task Ether holders with making the decision of whether or not to stake, and if so, how.","Additionally, proposed networks such as Libra — which, according to their published documentation<span data-v-f87c67ca=\"\">[10]<\/span>, intends to adopt a stake-based model with delegation — implies a staking economy where corporate behemoths like Facebook, Uber, and Spotify are validators and compete with one another for delegation from Libra native token holders. This early example foreshadows the upcoming shift; as more large corporates and governments wake up to the potential of blockchain tech they will inevitably want to assume roles as validators themselves.","These new entrants will have vastly different cost bases and incentives than today’s incumbents. We’ll see validators with entirely different business models, involving loss-leading strategies, ancillary revenue streams and services (possibly offered exclusively to delegators), and desire to maximize influence over governance. This will make it hard for today’s validators to compete in the delegation market, yet will also represent a significant opportunity for existing incumbents as the services, expertise, and products relevant to helping staking networks flourish become increasingly in-demand by many extremely well-capitalized entities. <strong data-v-f87c67ca=\"\">Even a small percentage of the value staked being captured across the staking value chain — whether it be at the delegation, infrastructure, or liquidity layer — may collectively represent a multi billion dollar opportunity.<\/strong>","As the staking economy matures, decentralization remains vital. A crucial characteristic of staking networks is that centralization of stake makes them vulnerable to attack; effectively a honey pot akin to Bitcoin’s 51% attack, except often with the threshold of 33%. A network with stake concentration that exceeds that threshold — whether it be an individual validator or multiple colluding validators in aggregate — is no longer decentralized. At that point it’s just a typical, rudimentary database, and loses all the value propositions of building on a blockchain, and thus its network value.","Therefore, appropriate distribution of stake will always be in the stakeholders’ best interest; which should, in the long term, be reflected in the delegation market, regardless of who the validators are.","I’m sure many readers will be quick to point out why some of the aforementioned staking implementations don’t work, which may very well be true. In particular, stake-weighted work allocation becomes tricky with capacity-based and subjective networks, circular token economies have game theoretic flaws, and if a network with poor token design achieves product market fit, the token may just be forked out. Unlike Proof-of-Stake, which leaves behind a graveyard of unsuccessful blockchains with failed consensus mechanisms — all publicly available for new network designers to learn from — there are not many failed attempts at building other types of staking-enabled decentralized digital labor markets. However, in due time, frameworks will emerge that abstract most the complexities and considerably reduce time to market for staking networks, thus increasing the rate of innovation.","For example, Proof-of-Stake was first proposed in 2012 with Peercoin (oh boy, I remember hearing about Peercoin in ‘13). It didn’t work<span data-v-f87c67ca=\"\">[11]<\/span>. Then, seven years later, the Cosmos SDK<span data-v-f87c67ca=\"\">[12]<\/span> arrived. Leveraging the battle-tested Tendermint consensus protocol<span data-v-f87c67ca=\"\">[13]<\/span> and a variety of open source modules that represent commonly-used functionality, developers could now create their own application-specific, Byzantine Fault Tolerant<span data-v-f87c67ca=\"\">[14]<\/span> Proof-of-Stake network using an accessible, customizable, plug and play solution.","<strong data-v-f87c67ca=\"\">Almost every network built using the Cosmos SDK will have its own staking token, used for consensus, but also potentially bundled with other types of participation like governance or service provision.&nbsp;<\/strong>Soon, Inter-Blockchain Communication<span data-v-f87c67ca=\"\">[15]<\/span> will enable each network to interoperate, potentially sparking an explosion of new staking networks.","Implementing staking in a labor market can basically be thought of as trading away the capital efficiency of credit and reputation-based transactions in return for pseudonymity, trustlessness, and decentralization. <strong data-v-f87c67ca=\"\">This tradeoff, currently viewed as binary, is actually a spectrum. And while maximizing the latter metrics is seemingly ideal for Layer 1 consensus, there may be better solutions for other, less deterministic types of decentralized digital labor markets.<\/strong>","<strong data-v-f87c67ca=\"\">The emergence of an accurate, Sybil-resistant, pseudonymous on-chain reputation solution is the essential missing piece of the puzzle.<\/strong><span data-v-f87c67ca=\"\">[16]<\/span> This could enable reputation staking, partially-collateralized staking, pseudonymous quantifiable-risk and credit, and staking networks with much more subjective labor; all while maintaining self-sustainability, censorship-resistance, and trustlessness. This innovation would have powerful ramifications for the whole Web 3 ecosystem and unlock unprecedented scale for trustless peer-to-peer markets.","The staking economy has the potential to be much more than just a standard % yield offered by the network and by proxy through exchanges and delegation services.","Staking reduces the need for trust in labor markets and has the opportunity to propel a paradigm shift in value accrual of marketplaces, where the immense value once extracted by intermediaries is now equitably distributed amongst those servicing the market. Leveraging cryptography and behavioural economics, these markets function self-sustainably, and thus inherently allow anyone to participate while maintaining their privacy.","As predicted in A Cypherpunk’s Manifesto — arguably the text that inspired this industry — “Cryptography will ineluctably spread over the whole globe, and with it the anonymous transactions systems that it makes possible.”<span data-v-f87c67ca=\"\">[17]<\/span>","Staking networks may do for labor markets what cryptocurrencies intend to do for money.&nbsp;A lot can happen before 2030.","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Footnotes:<\/strong><\/em>","<em data-v-f87c67ca=\"\">[1] <a href=\"https:\/\/union.market\/token\/cosmos\" data-v-f87c67ca=\"\">https:\/\/union.market\/token\/cosmos<\/a>, <a href=\"https:\/\/union.market\/token\/tezos\" data-v-f87c67ca=\"\">https:\/\/union.market\/token\/tezos<\/a> see: Staking Rate<\/em>","<em data-v-f87c67ca=\"\">[2] I’m aware of the potential various adversarial attacks, however that’s outside the scope of this paper.<\/em>","<em data-v-f87c67ca=\"\">[3] <a href=\"https:\/\/www.stakingrewards.com\/\" data-v-f87c67ca=\"\">https:\/\/www.stakingrewards.com\/<\/a><\/em>","<em data-v-f87c67ca=\"\">[4] Pearson, Taylor. “Markets Are Eating The World.” Ribbonfarm, 28 Feb. 2019<\/em>","<em data-v-f87c67ca=\"\">[5] Munger, M. (2018). Tomorrow 3.0: Transaction Costs and the Sharing Economy (Cambridge Studies in Economics, Choice, and Society). Cambridge: Cambridge University Press. doi:10.1017\/9781108602341<\/em>","<em data-v-f87c67ca=\"\">[6] Technically speaking, slashing makes the network resistant to Sybil-attacks and Byzantine behaviour (BFT), up to a certain extent.<\/em>","<em data-v-f87c67ca=\"\">[7] <a href=\"https:\/\/union.market\/token\/livepeer\" data-v-f87c67ca=\"\">https:\/\/union.market\/token\/livepeer<\/a><\/em>","<em data-v-f87c67ca=\"\">[8] <a href=\"https:\/\/coinmarketcap.com\/\" data-v-f87c67ca=\"\">https:\/\/coinmarketcap.com\/<\/a><\/em>","<em data-v-f87c67ca=\"\">[9] <a href=\"https:\/\/etherscan.io\/chart\/address\" data-v-f87c67ca=\"\">https:\/\/etherscan.io\/chart\/address<\/a><\/em>","<em data-v-f87c67ca=\"\">[10] <a href=\"https:\/\/libra.org\/en-US\/permissionless-blockchain\/#open_technical_and_economic_challenges\" data-v-f87c67ca=\"\">https:\/\/libra.org\/en-US\/permissionless-blockchain\/#open_technical_and_economic_challenges<\/a> <\/em>","<em data-v-f87c67ca=\"\">[11] <a href=\"https:\/\/bitcointalk.org\/index.php?topic=131901.0\" data-v-f87c67ca=\"\">https:\/\/bitcointalk.org\/index.php?topic=131901.0<\/a><\/em>","<em data-v-f87c67ca=\"\">[12] <a href=\"https:\/\/cosmos.network\/sdk\" data-v-f87c67ca=\"\">https:\/\/cosmos.network\/sdk<\/a><\/em>","<em data-v-f87c67ca=\"\">[13] Kwon, Jae. \"Tendermint: Consensus without mining.\" Draft v. 0.6, fall 1 (2014): 11.<\/em>","<em data-v-f87c67ca=\"\">[14] <a href=\"https:\/\/blog.cosmos.network\/tendermint-explained-bringing-bft-based-pos-to-the-public-blockchain-domain-f22e274a0fdb\" data-v-f87c67ca=\"\">Tendermint Explained — Bringing BFT-based PoS to the Public Blockchain Domain<\/a><\/em>","<em data-v-f87c67ca=\"\">[15] <a href=\"https:\/\/cosmos.network\/ibc\/\" data-v-f87c67ca=\"\">https:\/\/cosmos.network\/ibc\/<\/a><\/em>","<em data-v-f87c67ca=\"\">[16] I’ve thought about this for many years and it seems to be gaining some traction. Reach out if you’d like to chat about it.<\/em>","<em data-v-f87c67ca=\"\">[17] <a href=\"https:\/\/www.activism.net\/cypherpunk\/manifesto.html\" data-v-f87c67ca=\"\">https:\/\/www.activism.net\/cypherpunk\/manifesto.html<\/a><\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"Transcoder","content":"ORGANIZATION"},{"type":"2012","content":"DATE"},{"type":"seven years later","content":"DATE"},{"type":"Coinbase","content":"LOCATION"},{"type":"Cosmos SDK","content":"ORGANIZATION"},{"type":"multi billion dollar","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"] Kwon","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Taylor","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Stake Delegation","content":"ORGANIZATION"},{"type":"Tezos","content":"PERSON"},{"type":"(%","content":"PERCENT"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"Inter-Blockchain Communication","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"Sharing Economy (Cambridge Studies in Economics","content":"ORGANIZATION"},{"type":"$25 billion","content":"MONEY"},{"type":"Cambridge University Press","content":"ORGANIZATION"},{"type":"Binance","content":"LOCATION"},{"type":"standard %","content":"PERCENT"},{"type":"] Munger","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"Jae","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Feb. 2019","content":"DATE"},{"type":"$6.5 billion","content":"MONEY"},{"type":"33%","content":"PERCENT"},{"type":"Pearson","content":"LOCATION"},{"type":"Sybil","content":"PERSON"},{"type":"51%","content":"PERCENT"},{"type":"Uber","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Public Blockchain Domain","content":"ORGANIZATION"}],"hashtag":["STAKING"],"authors":["Shayne Coplan","The Block"]}