{"summary":"Bitcoin succumbed to the pressure of global market turmoil, tanking more than 20% over the last 24-hours\nFor trading firms and exchanges, however, that’s been a good thing in terms of volumes\nStill, anxiety is running high.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58540\/crypto-otc-desk-bitcoin-price-plunge-markets-coronavirus","publishDate":"2020-03-12T16:05:08","id":817,"type":null,"title":"Crypto OTC desks see activity surge as bitcoin&#x27;s price plunges alongside global markets","category":["Bitcoin"],"content":["As anxiety over the coronavirus gripped global financial markets this morning, not everyone was losing money.","B2C2, the U.K.-based cryptocurrency trading firm, was on track to beat its record for volume trading, according to co-founder Max Boonen.","B2C2 isn't unique in that respect. For trading firms and exchanges, periods of spiked volatility can be profitable as trading volumes surge in lockstep.","Over the course of the last 24 hours bitcoin has shed more than 22% as of press time. The precipitous drop, which began prior to market open in the U.S., is said to be tied to larger crypto \"whales\" unloading their crypto positions to set aside bigger cash position ahead of a global recession, according to traders.","The fact that traders have been working remotely could have also played into the intensity of the sell-off since it could have contributed to a liquidity crunch. Bitcoin pared some losses following an <a href=\"https:\/\/www.wsj.com\/articles\/fed-to-inject-1-5-trillion-in-bid-to-prevent-unusual-disruptions-in-markets-11584033537\" data-v-f87c67ca=\"\">announcement<\/a> by the Fed that it will pump $1.5 trillion of liquidity into Wall Street.","","","As for B2C2, the scene was a hectic one this morning, but they stayed online, pricing orders throughout the market slide. And like many financial services firms, the trading team was not working from their London offices but rather Boonen's living-room.","Keeping with the crypto ethos of protecting op-sec, Boonen declined to share his location, sharing this photo of the team:","","","B2C2 isn't alone in having a positive day as far as trading volumes are concerned. Forex and crypto exchange operator LMAX Group reported a surge in volumes on its cryptocurrency exchange, LMAX Digital, despite seeing a widening of spreads on the platform.","\"This is going to be a record week for us,\" CEO David Mercer said in a phone interview. Employees at the UK-based firm are still coming into work at some of its offices. Still, Mercer expressed concern about a global economic downturn, which would be bad for business in the long term.","\"When all of your customers are licking their wounds, that is not good,\" he said.","Indeed, several traders said they were taken aback by this morning's move, despite the world's stock markets diving into correction territory.","\"It certainly feels like 2008,\" Rich Rosenblum of GSR, said. \"Or Arab Spring for oil.\"","Elsewhere, traders reported some trading platform outages but declined to name the specific firm. Genesis Global Trading head Michael Moro said this is par for the course in a hyper-volatile market.","\"Given that crypto volatility is basically the norm, quote outages from certain desks is par for the course,\" Moro told The Block.","In addition to traders not being tied to their desks because of the virus, Moro said the sell-off is noteworthy because of the backdrop of global markets. In a sense, it puts a dagger in the heart of the argument that bitcoin is an uncorrelated asset relative to the broader market.","Still, the sentiment in the market is not as negative as one might expect. Moro said its institutional counter-parties are split 60\/40, \"tilted to selling.\"","\"Our retail flow, which we chatted about the other week, continue to be way biased to buying,\" he said.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","<em data-v-f87c67ca=\"\">Editor's note (March 13): This story has been updated for clarity.&nbsp;<\/em>"],"hashtag":[]}