{"summary":"Do Kwon, founder of Terraform Labs, has bet $1 million on the future of LUNA and the Terra ecosystem — and agreed to another $10 million bet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/137687\/terraform-labs-do-kwon-bets-1-million-on-lunas-future-price","publishDate":"2022-03-14T11:25:20","id":8170,"type":null,"title":"Terraform Labs CEO Do Kwon bets $1 million on LUNA’s future price","category":["DEFI"],"content":["Terraform Labs founder Do Kwon has accepted a $1 million<a href=\"https:\/\/twitter.com\/AlgodTrading\/status\/1503103705939423234\" data-v-f87c67ca=\"\"> bet<\/a> on the price of his own project Terra (LUNA) with the pseudonymous Sensei Algod. A crypto personality known as Cobie is acting as the escrow for the wagered funds.","According to the details of the bet, Sensei Algod wins if the price of LUNA is lower in one year’s time, while Kwon will be the winner if it is higher than today’s price. The price of LUNA as of the time the wager was accepted was about $88.","Both parties in the wager agreed to use the time-weighted average price (TWAP) for LUNA on Coingecko on March 14, 2023. TWAP refers to the average price of an asset within a specific time.","Cobie volunteered an <a href=\"https:\/\/etherscan.io\/address\/0x4Cbe68d825d21cB4978F56815613eeD06Cf30152\" data-v-f87c67ca=\"\">address<\/a> under his control as escrow for the wagered funds. Data from Etherscan shows both parties have already deposited $1 million in tether (USDT) each.","LUNA is already up almost 5% since the time of the wager, with Coingecko showing the coin’s price at $93 as of the time of writing.","Kwon, meanwhile, has also<a href=\"https:\/\/twitter.com\/cobie\/status\/1503354485640687620\" data-v-f87c67ca=\"\"> accepted<\/a> another wager from a crypto personality named GCR to the tune of $10 million. The details of the bet are the same and Cobie has also volunteered to act as an escrow for the bet. Cobie's wallet shows a $10 million USD Coin (USDC) <a href=\"https:\/\/etherscan.io\/tx\/0x6731c72b114a8bc52094616576732964546da40cb03faba331099aa2fc0ec3a3\" data-v-f87c67ca=\"\">deposit<\/a> from GCR but Kwon has yet to respond as of the time of writing.","Sensei Algod has previously criticized the Terra ecosystem, on the basis that it relies on LUNA to maintain the peg of its major stablecoin TerraUSD (UST). As an algorithmic stablecoin, UST maintains its peg not by having reserves of cash or commercial paper but by burning LUNA tokens to mint each UST coin.","Periods of increased UST demand on DeFi protocols often cause massive LUNA burning, which critics like Sensei Algod say will eventually lead to a significant decline in the price of LUNA. Since LUNA is what keeps UST pegged as a stablecoin, a big drop in the price of LUNA could potentially cause UST to permanently lose its peg.","The Luna Foundation Guard recently<a href=\"https:\/\/www.theblockcrypto.com\/post\/134871\/luna-founation-guard-token-sale\" data-v-f87c67ca=\"\"> raised $1 billion<\/a> to create a bitcoin reserve for UST, something that would make it less reliant on LUNA.","Kwon is confident, however, that LUNA will not suffer a price crash and challenged Sensei Algod to another bet that UST will not lose its peg by this same time next year. Kwon offered 2:1 odds to Sensei Algod if the latter accepts the wager.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cobie","content":"PERSON"},{"type":"Luna Foundation Guard","content":"ORGANIZATION"},{"type":"$88","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Sensei Algod","content":"ORGANIZATION"},{"type":"Kwon","content":"PERSON"},{"type":"LUNA","content":"ORGANIZATION"},{"type":"March 14, 2023","content":"DATE"},{"type":"GCR","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Sensei Algod","content":"PERSON"},{"type":"Cobie","content":"ORGANIZATION"},{"type":"$93","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}