{"summary":"Crypto exchange operator Gemini has launched Superlunar, a web3 research and design studio, to help grow web3 adoption.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/144819\/gemini-launches-superlunar-web3-studio","publishDate":"2022-05-03T09:00:03","id":8172,"type":null,"title":"Gemini launches new entity Superlunar to help grow web3 adoption","category":["WEB3"],"content":["Gemini has launched a research and design studio called Superlunar as the crypto exchange operator aims to increase adoption of web3 products.","Superlunar, which means beyond the moon, will research, design and develop decentralized applications focused on security and usability. By simplifying the user experience, it hopes to improve their trust in the crypto space and thereby web3's mass adoption like web2.","Rich Smith, CTO of Superlunar, told The Block in an interview that there is \"quite a lot of mistrust\" in the crypto space from an average user's perspective.","\"It feels very experimental, which is fantastic if you have a technical background, but if you are a normal user, it makes one feel confused about how this whole world works,\" said Smith.","Superlunar aims to improve web3's complexity and access by \"enabling developers to get more things done with the underlying technology quicker and easier,\" said Smith.","Smith declined to comment on specific initiatives that Superlunar is working on but said the firm will also partner with open source developers and other crypto firms to increase web3 adoption. He said Superlunar’s tools could be used internally at Gemini as well as by the industry as standalone products.","Pete Baker, VP of design at Superlunar, said in the interview that the firm will work on the plumbing and infrastructure of web3, including refining on-chain data, decentralized identity and authentication. In all, Superlunar aims to simplify the web3 space for developers as well as users.","Gemini has a dedicated fund for Superlunar, which will build upon the existing $2.25 million that the Gemini Opportunity Fund committed in December 2020, said Smith.","There are currently 14 people working for Superlunar, half of which have moved from Gemini, said Smith. Superlunar isn't immediately looking to grow its team and wants to focus on execution, he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"December 2020","content":"DATE"},{"type":"Rich Smith","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"$2.25 million","content":"MONEY"},{"type":"Pete Baker","content":"PERSON"},{"type":"Smith","content":"PERSON"}],"hashtag":["GEMINI"],"authors":["Yogita Khatri","The Block"]}