{"summary":"Reverie is an investment firm headed by former Digital Currency Group, Blockchain Capital and Genesis Global Trading employees.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251101\/investment-firm-reverie-launches-20-million-crypto-venture-fund","publishDate":"2023-09-14T12:14:01","id":8174,"type":null,"title":"Investment firm Reverie launches $20 million crypto venture fund","category":["COMPANIES"],"content":["Investment firm Reverie announced a $20 million crypto venture fund called Reverie Fund One.","The firm provides monetary support for pre-seed and seed-stage startups. In addition, Reverie will play an advisory role in the investee's community building, business model construction, marketing and more.&nbsp;","\"Our bet is the next generation of founders will change things by building truly useful products,\" Reverie co-founder Larry Sukernik <a href=\"https:\/\/twitter.com\/lsukernik\/status\/1702311039331697055\" data-v-f87c67ca=\"\">said<\/a> on social media.","\"If we want to make this happen, it all starts with picking the right investor — someone who is always by your side, thinks incredibly long-term like you do, and is going to help you dismantle the incumbents,\" he added. \"We’ve designed Reverie to be that partner to founders.\"","Sukernik previously participated in over 100 investments at Digital Currency Group, according to his <a href=\"https:\/\/www.linkedin.com\/in\/sukernik\/\" data-v-f87c67ca=\"\">LinkedIn<\/a>. Reverie's <a href=\"https:\/\/www.reverie.ooo\/team\" data-v-f87c67ca=\"\">team<\/a> also includes Derek Hsue, former investor at Blockchain Capital, and former vice president of operations at Genesis Global Trading Carl Bergman.&nbsp;","Reverie did not immediately respond to a request for comment from The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Carl Bergman","content":"PERSON"},{"type":"Larry Sukernik","content":"PERSON"},{"type":"Derek Hsue","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Reverie","content":"ORGANIZATION"},{"type":"$20 million","content":"MONEY"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Genesis Global","content":"ORGANIZATION"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["MK Manoylov","The Block"]}