{"summary":"From Florida to California, states are drafting new legislation to regulate the crypto industry, seeking to fill the gaps left by Congress.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230341\/crypto-implosion-has-states-scrambling-here-are-six-crypto-bills-to-watch","publishDate":"2023-05-10T18:21:24","id":8177,"type":null,"title":"Six state-level crypto bills to watch after industry implosion","category":["POLICY"],"content":["Lawmakers in states from Florida to California are drafting new legislation to regulate the crypto industry, seeking to fill the gaps left by Congress.&nbsp;","Some states are eyeing stricter rules for the industry after the high-profile collapses including Terra-Luna and FTX, while others looking to clamp down on a potential central bank digital currency, or make it easier for decentralized autonomous organizations to incorporate.&nbsp;","“As the saying goes, states are the laboratories for democracy. Increasingly, as comprehensive federal crypto legislation continues to prove elusive, states are stepping into the void,” said Alex Grieve, a vice president at the Washington, D.C. government affairs firm Tiger Hill Partners, via text. “The result is a mixed bag: some are overly antagonistic (as this has become politically popular in some instances); some are generally supportive of crypto and entrepreneurs building innovative companies in it.”","Lawmakers in Congress have introduced a laundry list of their own crypto regulation bills, but it’s <a href=\"https:\/\/www.theblock.co\/post\/230304\/consensus-building-congress-crypto\" data-v-f87c67ca=\"\">not yet clear<\/a> which bills might actually pass — or when.","In the meantime, states are working to write new laws after the crypto industry chaos of 2022, said Aaron Kaplan, the founder and co-CEO of Prometheum, a company that is creating market for compliant security tokens overseen and regulated by the Securities and Exchange Commission.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“States are taking actions to try to protect their constituents, the investors who live there, the average people,” Kaplan said. “Instead of a democratization of finance … You saw a democratization of the scam. They were able to use the internet and the catchy branding and FOMO to basically get the retail public, as many people as they could, to participate. And as a result, when everything turned upside down those are the people who were most injured. And those are the people who the those legislators in those states represent. So there's obviously going to be a reaction.”","Here are six state-level crypto bills to watch.","New York Attorney General Letitia James, a Democrat, unveiled <a href=\"https:\/\/www.theblock.co\/post\/229690\/new-york-crypto-bill\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">legislation<\/span><\/a> last week that could force crypto firms to repay customers who are victims of fraud the same way that banks do.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“For too long, fraud in the cryptocurrency industry has caused investors to lose hundreds of billions, with low-income investors and people of color suffering the most,” James <a href=\"https:\/\/twitter.com\/NewYorkStateAG\/status\/1654482730313216005\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">said on Twitter<\/span><\/a>.","The bill would also “prevent people who create crypto assets from also owning crypto platforms,” James said, and stop crypto firms from borrowing or lending investor assets. The bill is still in its early stages: A group of Democratic state lawmakers praised the bill in a&nbsp;<a href=\"https:\/\/ag.ny.gov\/press-release\/2023\/attorney-general-james-proposes-nation-leading-regulations-cryptocurrency\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">press release<\/span><\/a>, but it wasn't clear who might officially sponsor the legislation.","The Florida state House and Senate passed a bill to ban central bank digital currencies last week. Republican Gov. Ron DeSantis, a potential presidential candidate, promoted the legislation earlier this year. The bill would update the state commercial code to ban CBDCs.","\"Florida rejects the idea of a central bank digital currency,\" DeSantis <a href=\"https:\/\/www.theblock.co\/post\/229539\/they-want-to-get-rid-of-crypto-florida-governor-ron-desantis-warns\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">said at a recent press conference<\/span><\/a>. \"You could just get fined, and they'll just take it right out of your digital currency, without any due process or anything like that. And so it gives the government a huge amount of power over your economic self sufficiency and independence.”","If the bill becomes law, it could face a <a href=\"https:\/\/www.theblock.co\/post\/224555\/fighting-digital-dollar-becomes-new-conservative-crypto-cause-to-champion\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">court challenge<\/span><\/a> thanks to a so-called supremacy clause in the U.S. Constitution. The clause establishes that federal law generally takes precedence over state law.","Matt Haney, a Democrat in the California state Assembly, recently <a href=\"https:\/\/a17.asmdc.org\/press-releases\/20230424-bill-offers-pathway-blockchain-and-crypto-organizations-incorporate\" data-v-f87c67ca=\"\">filed a bill<\/a> aimed at creating a legal framework for decentralized autonomous organizations, or DAOs.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The legislation “creates a new legal framework to regulate, tax, and legitimize DAOs in California and sends a strong signal that California intends to stay at the forefront of the innovation economy,” according to a press release.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The legislation would update California’s corporations code to include tech enabled by DAOs, blockchain networks and smart contract protocols. DAOs would be allowed to incorporate in California under the bill, and could pay taxes and operate within “proper legal parameters.”","A proof-of-reserves bill is on the move in the Texas state legislature. The Texas House passed GOP state Rep. Giovanni Capriglione’s bill last month, which <a href=\"https:\/\/capitol.texas.gov\/tlodocs\/88R\/billtext\/pdf\/HB01666I.pdf#navpanes=0\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">would require<\/span><\/a> digital asset exchanges to show proof of reserves.","Capriglione filed the bill in January after crypto behemoth FTX was accused of commingling customer funds and filed for bankruptcy protection. The legislation would also prohibit exchanges from mixing customer and corporate funds.","“Multiple companies have betrayed the public trust by commingling investor digital assets with corporate assets,” Capriglione <a href=\"https:\/\/twitter.com\/VoteGiovanni\/status\/1619745801244377093\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">said<\/span><\/a> when he filed the bill at the beginning of the year.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","New Jersey could put its own spin on New York’s BitLicense framework <a href=\"https:\/\/legiscan.com\/NJ\/drafts\/A2371\/2022\" data-v-f87c67ca=\"\">with a bill<\/a> sponsored by a trio of Democratic state assembly members.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“The act would radically change the regulatory landscape for cryptocurrency-focused businesses providing services to New Jersey residents,” lawyers at Lowenstein Sandler<span class=\"s3\" data-v-f87c67ca=\"\">&nbsp;said in a <a href=\"https:\/\/www.lowenstein.com\/news-insights\/publications\/client-alerts\/new-jersey-wants-its-own-bitlicense-regulation-crypto\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">bill analysis<\/span><\/a>.<\/span>","The legislation would grant crypto oversight and licensing to the New Jersey Bureau of Securities, which marks a “significant shift” in the way state government has regulated crypto and blockchain firms. The New Jersey Department of Banking Insurance has typically regulated the company as money transmitters.","The Illinois Department of Financial and Professional Regulation <a href=\"http:\/\/www.apple.com\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">rolled out two bills<\/span><\/a> in February that are “designed to protect Illinois residents from financial fraud and abuse and establish regulatory oversight of cryptocurrencies and the broader digital asset marketplace.” Two lawmakers, both Democrats, sponsored the legislation in the state House and Senate.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The&nbsp;Fintech-Digital Asset Bill would establish regulations for digital asset firms and modernize regulations for money transmission in the state, including requiring exchanges to obtain a license from the IDFPR to operate in Illinois. Meanwhile, the Consumer Financial Protection Bill would give the department more authority to enforce regulations.","The bill could be particularly stringent for decentralized finance projects, according to Web3 accelerator Alliance DAO.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“This bill would kill DeFi in the State of Illinois,” Alliance DAO said in a <a href=\"https:\/\/twitter.com\/alliancedao\/status\/1633593347007733768\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">bill analysis<\/span><\/a> earlier this year. “Not only would decentralized protocols not be able to qualify for licensure, it would be impossible for them to meet some of the licensure requirements.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ron DeSantis","content":"PERSON"},{"type":"GOP","content":"ORGANIZATION"},{"type":"Letitia James","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Lowenstein Sandler","content":"PERSON"},{"type":"New Jersey","content":"LOCATION"},{"type":"” Alliance DAO","content":"ORGANIZATION"},{"type":"Kaplan","content":"PERSON"},{"type":"Tiger Hill Partners","content":"ORGANIZATION"},{"type":"Illinois","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"Aaron Kaplan","content":"PERSON"},{"type":"Terra","content":"LOCATION"},{"type":"Luna","content":"PERSON"},{"type":"Alex Grieve","content":"PERSON"},{"type":"Florida state House","content":"ORGANIZATION"},{"type":"New Jersey Department of Banking Insurance","content":"ORGANIZATION"},{"type":"Giovanni Capriglione","content":"PERSON"},{"type":"Alliance DAO","content":"ORGANIZATION"},{"type":"Capriglione","content":"PERSON"},{"type":"Florida","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"DeSantis","content":"PERSON"},{"type":"New Jersey Bureau of Securities","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"James","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"State of Illinois","content":"ORGANIZATION"},{"type":"Matt Haney","content":"PERSON"},{"type":"Consumer Financial Protection Bill","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"Texas House","content":"ORGANIZATION"},{"type":"D.C.","content":"LOCATION"},{"type":"Senate","content":"ORGANIZATION"},{"type":"Illinois Department of Financial and Professional Regulation","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}