{"summary":"Johnny Ng, a CPPCC National Committee member, suggests the government build a Web3 funding platform connecting Hong Kong, Macao and Guangdong.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280746\/web3-financing-project-proposed-at-chinas-two-sessions-to-connect-hong-kong-macao-and-guangdong","publishDate":"2024-03-06T00:58:21","id":8180,"type":null,"title":"Web3 financing project proposed at China&#x27;s &#x27;Two Sessions&#x27; to connect Hong Kong, Macao and Guangdong","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">A Hong Kong delegate to China’s central political advisory body has suggested the country establish a Web3 financing platform across the southeastern Greater Bay Area, as Hong Kong continues its drive to become a regional crypto hub.<\/span>","<span data-v-f87c67ca=\"\">Johnny Ng, a member of the CPPCC National Committee, the country’s top political advisory body, has <\/span><a href=\"https:\/\/www.tkww.hk\/epaper\/view\/newsDetail\/1764717301871022080.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">submitted<\/span><\/a><span data-v-f87c67ca=\"\"> a suggestion this week, proposing that the authorities may consider building a financing platform for the blockchain and digital assets industry across the Greater Bay Area connecting Hong Kong, Macao and Guangdong, according to local news outlet Wen Wei Po.<\/span>","<span data-v-f87c67ca=\"\">Ng said that the regulated crypto asset trading platforms in Hong Kong could play a key role in funding projects, according to the report.<\/span>","<span data-v-f87c67ca=\"\">Ng’s proposal came as thousands of delegates from across China are gathering in Beijing this week for the “Two Sessions,” the most important annual political meetings that brought together the country’s political elite and industry leaders.<\/span>","<span data-v-f87c67ca=\"\">China continues to ban crypto trading and mining activities on the Chinese mainland, while Hong Kong <\/span><a href=\"https:\/\/www.theblock.co\/post\/277767\/hong-kong-crypto-etf-reach-peak-performances\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">rolled out the welcome mat for crypto firms<\/span><\/a><span data-v-f87c67ca=\"\"> last year. In June 2023, Hong Kong officially started its crypto licensing regime for virtual asset trading platforms, allowing licensed exchanges to offer retail trading services. Hong Kong has granted licenses to two platforms — HashKey and OSL.<\/span>","<span data-v-f87c67ca=\"\">In December, China’s Ministry of Industry and Information Technology said that it <\/span><a href=\"https:\/\/www.theblock.co\/post\/268528\/china-nft-dapp-development-crypto-ban\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">plans to formulate strategy documents<\/span><\/a><span data-v-f87c67ca=\"\"> to clarify the development path of web3 and intends to encourage the development of non-fungible tokens and decentralized applications. The ministry added that it plans to launch pilots related to distributed digital identity to explore web3 digital identity authentication and management.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Beijing","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Johnny Ng","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Greater Bay Area","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"Macao","content":"LOCATION"},{"type":"OSL","content":"ORGANIZATION"},{"type":"China’s Ministry of Industry and Information Technology","content":"ORGANIZATION"},{"type":"Guangdong","content":"LOCATION"},{"type":"this week","content":"DATE"},{"type":"CPPCC National Committee","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"Wen Wei Po","content":"PERSON"},{"type":"June 2023","content":"DATE"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}