{"summary":"“In the exchange space and the broker-dealer space I accept that people have not come in and used what was put in place,&quot; to provide guidance on what projects need to register as securities offerings, Gensler said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170453\/gensler-market-intermediaries-not-following-sec-guidance-on-listing-tokens","publishDate":"2022-09-15T12:04:00","id":8186,"type":null,"title":"Gensler: market intermediaries not following SEC guidance on listing tokens","category":["THE BLOCK"],"content":["Securities and Exchange Commission Chair Gary Gensler signaled that he sees broad violations of securities laws by crypto exchanges and broker-dealers.&nbsp;","“In the exchange space and the broker-dealer space I accept that people have not come in and used what was put in place under Chair Clayton,” Gensler said, alluding to prior guidance from the SEC dating back to 2017 on how it views digital assets. The SEC is reportedly <a href=\"https:\/\/www.theblock.co\/post\/159593\/the-sec-is-investigating-coinbase-over-its-coin-listings-bloomberg\" data-v-f87c67ca=\"\">investigating<\/a> major U.S. exchange Coinbase for listing unregistered securities, and has <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2022-26\" data-v-f87c67ca=\"\">already fined<\/a> BlockFi $100 million for securities violations.&nbsp;","For the past five years the SEC has signaled that most digital currencies are securities under U.S. law, and conducted dozens of enforcement actions against various projects for failing to register and follow other securities guidelines, as companies issuing stocks or bonds do. The commission currently carves bitcoin and ether out from securities laws because they are held by broad, decentralized networks of people.","Because of that distinction, cryptocurrency developers, investors, and advocates have complained that the regulatory agency has not provided enough guidance on what would qualify as a sufficiently decentralized project.","Sen. Pat Toomey (R-Pa.), the top Republican on the Senate Banking Committee that Gensler appeared before today, echoed that criticism and pressed the SEC chair for more specifics on what qualifies as decentralized enough to be exempted from standard disclosures.","“It is not reasonable to fail to provide clarity,” said Toomey. “What is it about bitcoin that causes you to think it’s not a security?,” Toomey asked.","Gensler responded: “The investment public’s not betting on people in the middle.”","Gensler expanded that he is following multiple past rulings by the Supreme Court on the definition of a security, in which a common enterprise seeks to raise capital, but directed his staff to, “use everything in our regulatory toolkit, whether it’s exemptive orders and others,” to allow for some flexibility in the still-nascent space.","“We’re in conversations with a number of these intermediaries across the exchange, the broker-dealer, the custody space,” added Gensler. “We actually believe it’s worthwhile to talk to the industry, talk to the market participants, and get them registered.”","“People will not have trust in this space unless it comes into investor protection,” warned Gensler.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Pat Toomey","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"Clayton","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Pa.","content":"LOCATION"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Exchange Commission","content":"ORGANIZATION"},{"type":"Toomey","content":"PERSON"},{"type":"the Supreme Court","content":"ORGANIZATION"}],"hashtag":["BITCOIN","CONGRESS","DAOS","GARY GENSLER","SEC"],"authors":["Colin Wilhelm","The Block"]}