{"summary":"As investors seek out safety amidst the backdrop of a fast-spreading infection and plunging stocks, they don&#x27;t appear to be turning to bitcoin. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58123\/institutional-investors-are-shunning-cme-bitcoin-futures-as-coronavirus-roils-global-markets","publishDate":"2020-03-09T10:15:46","id":819,"type":null,"title":"Institutional investors are shunning CME bitcoin futures as coronavirus roils global markets","category":["BITCOIN"],"content":["As investors seek safety amid the global coronavirus outbreak and plunging equities markets, they don't appear to be turning to bitcoin – at least on the institutional side of things.","Bitcoin has long been touted as a non-correlated asset, meaning its price swings don't follow other assets, namely stocks. Some proponents have also viewed bitcoin as a <a href=\"https:\/\/ftalphaville.ft.com\/2020\/03\/09\/1583742985000\/Isn-t-bitcoin-meant-to-be-a-safe-haven-\/\" data-v-f87c67ca=\"\">safe haven<\/a>, a place where investors can expect outsized returns during broader market turmoil. The past week's market performance and revelations about the coronavirus's spread have put both these viewpoints have been put to the test.","The Dow Jones Industrial Average plunged Monday morning at the open, shedding more than 7% following the biggest one-day decline in oil prices in 30 years <a href=\"https:\/\/twitter.com\/fintechfrank\/status\/1237011080498511878?s=20\" data-v-f87c67ca=\"\">over the weekend<\/a>. The opening sell-off quickly led to a circuit breaker triggering.","In some instances, bitcoin has bucked the broader market sell-off, trading in the green while other assets saw steep losses. The cryptocurrency's price picked up 4% from March 4 to March 6 while the S&amp;P 500 fell by more than 2%. This morning presented a different story with bitcoin trading down 3%.","Still, since the beginning of February, bitcoin and S&amp;P 500 have primarily moved in lockstep while gold and U.S. Treasuries have outperformed.&nbsp;","","","Indeed, <a href=\"https:\/\/www.bloomberg.com\/opinion\/articles\/2020-03-09\/coronavirus-drives-a-wedge-between-bitcoin-and-gold-as-havens?srnd=premium\" data-v-f87c67ca=\"\">Bloomberg Opinion's Tim Culpan<\/a>&nbsp;pointed out in a column Monday morning that bitcoin and gold have moved in opposite directions as the coronavirus outbreak has deepened. Indeed, the correlation between bitcoin – which is often referred to as \"digital gold\" – and gold has flipped to -0.22.&nbsp;","Aside from price action, data from CME Group's bitcoin futures market indicates that institutional investors are shunning bitcoin. If bitcoin was a safe haven, one might expect volumes to increase while investors seek safety, as noted by The Block's Ryan Todd. <a href=\"https:\/\/www.theblockresearch.com\/uncorrelated-is-uncorrelated-data-continues-to-suggest-bitcoin-clearly-not-a-haven-asset-56928\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Here's Todd<\/a>:","But that hasn't happened, as the data indicates:","","","Daily volume for CME bitcoin futures peaked the day before U.S. equities made all-time highs (February 19) at over $1 billion in volume, before falling now close to 75%. The CME bitcoin futures market printed its lowest volume day in 2020 on Friday, while the 7-day rolling open interest is down 25% in the past two weeks.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"Ryan Todd","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"3%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"75%","content":"PERCENT"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"Bloomberg Opinion","content":"ORGANIZATION"},{"type":"February 19","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Tim Culpan","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"morning","content":"TIME"},{"type":"Friday","content":"DATE"},{"type":"March 6","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"March 4","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}