{"summary":"The Blockchain Association launched BA PAC, a new political action committee.\n\nThe PAC will support pro-crypto political candidates on either side of the aisle, Executive Director Kristin Smith in a statement posted to Twitter","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169329\/blockchain-association-launches-new-pac-to-back-pro-crypto-candidates","publishDate":"2022-09-12T13:13:57","id":819,"type":null,"title":"Blockchain Association launches new PAC to back pro-crypto candidates","category":["Policy"],"content":["The Blockchain Association launched a new political action committee aimed at promoting pro-crypto candidates, the organization announced Monday.","The trade association is launching BA PAC as crypto regulation heats up in Washington. The political group sees crypto as a nonpartisan issue, and will back candidates on both sides of the aisle. The PAC, which can raise political cash and donate to candidates, will “mirror” the point of view of the Blockchain Association, the group’s Executive Director Kristin Smith said in a <a href=\"https:\/\/twitter.com\/KMSmithDC\/status\/1569367265111412741?s=20&amp;t=lhWuvljPFeg6BenOtFvBLQ\" data-v-f87c67ca=\"\">series<\/a> <a href=\"https:\/\/twitter.com\/KMSmithDC\/status\/1569367266369884161?s=20&amp;t=lhWuvljPFeg6BenOtFvBLQ\" data-v-f87c67ca=\"\">of<\/a> <a href=\"https:\/\/twitter.com\/KMSmithDC\/status\/1569367267548270596?s=20&amp;t=lhWuvljPFeg6BenOtFvBLQ\" data-v-f87c67ca=\"\">tweets<\/a>.","“<span class=\"css-901oao\" data-v-f87c67ca=\"\">We will support candidates in that spirit, seeking the best champions for this technology no matter which side of the aisle they come from<\/span>,” Smith posted. “This is a natural step for a growing industry.”","The Blockchain Association is a nonprofit trade association in Washington, D.C. Its members include Solana, Union Square Ventures, Ripple, <span class=\"s1\" data-v-f87c67ca=\"\">Crypto.com,<\/span> and other major companies involved in the digital asset space."],"hashtag":[]}