{"summary":"Following a successful public launch and token listing (YLD), YIELD App, the DeFi wealth management platform bridging traditional and digital finance, launched its Ethereum fund today, allowing users to earn high-interest returns on their Ether (ETH). ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/97430\/yield-app-launches-ethereum-fund","publishDate":"2021-03-08T06:31:57","id":8193,"type":null,"title":"YIELD App launches Ethereum fund, gives users up to 20% APY","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Following a successful public launch and token listing (<\/span><a href=\"https:\/\/on.yield.app\/2PDioCx\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">YLD<\/span><\/a><span data-v-f87c67ca=\"\">), <\/span><b data-v-f87c67ca=\"\">YIELD App<\/b><span data-v-f87c67ca=\"\">, the DeFi wealth management platform bridging traditional and digital finance, launched its Ethereum fund today, allowing users to earn high-interest returns on their Ether (ETH).&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Quick take:<\/b>","<span data-v-f87c67ca=\"\">Designed for both the retail and institutional market, <\/span><a href=\"https:\/\/on.yield.app\/2MMiPcp\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">YIELD App<\/span><\/a><span data-v-f87c67ca=\"\"> accommodates the needs of investors interested in digital asset classes while also allowing crypto veterans to capitalize on DeFi’s incredible opportunities without navigating a sea of complex protocols. The platform serves as a gateway for users to benefit from DeFi’s high-interest yields while keeping their funds secure and protected.<\/span>","<span data-v-f87c67ca=\"\">“Ether is the backbone of decentralized finance,” says Tim Frost, CEO of YIELD App. “We want to provide people with the opportunity to earn high interest on their Ether without selling the asset that allowed DeFi to emerge and could very well be the home to the future of global finance. This is an important milestone on our roadmap and a great development for our client base, who are looking for more ways to passively earn on crypto assets they want to hold long-term.”<\/span>","<span data-v-f87c67ca=\"\">In the near future, <\/span><a href=\"https:\/\/on.yield.app\/2MMiPcp\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">YIELD App<\/span><\/a><span data-v-f87c67ca=\"\"> will launch additional funds, fiat ramps, in-app token swaps for each token pair, and card services.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tim Frost","content":"PERSON"},{"type":"2023","content":"DATE"}],"hashtag":["ETHEREUM"],"authors":["Sponsored","The Block"]}