{"summary":"DCG filed a motion seeking the dismissal of crypto exchange Gemini&#x27;s lawsuit against the firm and its founder Barry Silbert.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244140\/dcg-asks-court-to-dismiss-pr-campaign-wrapped-in-lawsuit","publishDate":"2023-08-10T12:00:05","id":8196,"type":null,"title":"DCG asks court to dismiss Gemini&#x27;s &#x27;PR campaign wrapped in lawsuit&#x27;","category":["COMPANIES"],"content":["Digital Currency Group filed a motion seeking the dismissal of crypto exchange Gemini's lawsuit against the firm and its founder Barry Silbert, describing the July suit as \"a continuation of the Winklevoss's year-long Twitter-based character assassination.\"","Gemini, which was founded by twin brothers Cameron and Tyler Winklevoss, sued Silbert and DCG over the money DCG-subsidiary Genesis owes the crypto exchange's clients. Prior to the credit crisis that swept crypto in 2022, Genesis and Gemini entered into a business relationship in which the latter firm provided its Earn clients' funds to the former firm to generate a yield. That provided Gemini clients with a juicy yield until <a href=\"https:\/\/www.gemini.com\/blog\/an-important-message-regarding-gemini-earn\" data-v-f87c67ca=\"\">Genesis paused withdrawals and stopped processing redemption requests<\/a> in the wake of FTX's bankruptcy.","Genesis's lending unit filed for bankruptcy protection at the beginning of the year, and about $1.2 billion worth of Gemini client funds are stuck in limbo.","Gemini filed a lawsuit on <a href=\"https:\/\/www.theblock.co\/post\/238387\/gemini-sues-digital-currency-group-barry-silbert-over-alleged-fraud\" data-v-f87c67ca=\"\">July 7<\/a> in which it accused Silbert as being the \"architect\" and \"mastermind\" behind a fraud against Genesis's creditors, claiming that Silbert was directly involved in misleading creditors about the state of Genesis's financial status leading up to its meltdown. In the motion filed Thursday in the U.S. Southern District of New York, DCG said those claims are baseless.","A spokesperson added in a message to The Block that Gemini and its principles, Cameron and Tyler Winklevoss, are engaged in a \"PR campaign wrapped in a lawsuit.\"","The motion notes that DCG and Silbert were not involved in Genesis's operations and did not have \"any substantive involvement with the Gemini Earn program.\"","\"These tweets were personal, vicious, and false, accusing Silbert of 'foster[ing] and architect[ing] a culture of lies and deceit' and describing a letter by Silbert as 'another piece of carefully crafted stupidity,'\" the motion states. \"This Complaint is a continuation of that public relations campaign.\"","The motion goes on to say that the lawsuit provides no substantive evidence that DCG would have had any knowledge of alleged fraud carried out by Genesis.&nbsp;","\"In the alternative, Gemini argues that Defendants aided and abetted Genesis’s alleged fraud through various corporate transactions and paperwork. This effort fares no better,\" the complaint reads. \"There are no well-pled allegations that Defendants had actual knowledge of any alleged fraud, and Gemini does no more than rely on Defendants’ corporate relationship with Genesis to argue otherwise.\"","Gemini's suit was first filed after Winklevoss gave Silbert an <a href=\"https:\/\/www.theblock.co\/post\/237642\/geminis-winklevoss-demands-1-47-billion-payment-from-dcg-in-final-offer\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">ultimatum<\/a> at the beginning of July to immediately pay a sum of $640 million he says is owed to Gemini's Earn clients or face a lawsuit.","<span class=\"s1\" data-v-f87c67ca=\"\">\"This lawsuit seeks to recover from Defendants the damages and losses that Gemini has incurred as a direct result of DCG’s and Silbert’s false, misleading, and incomplete representations and omissions to Gemini, and Defendants’ role in encouraging and facilitating Genesis’s fraud against Gemini,\" the complaint read.&nbsp;<\/span>","As per Gemini's suit, Genesis claimed that its business was operating as usual in the after math of Three Arrows Capital's collapse because DCG had stepped in to cover the losses tied to that specific counterparty.&nbsp;","\"It's now clear this was a carefully crafted lie. DCG didn’t absorb any losses or provide real capital,\" Cameron Winklevoss noted in a <a href=\"https:\/\/twitter.com\/cameron\/status\/1677327403285086212\" data-v-f87c67ca=\"\">tweet<\/a>. \"Behind the scenes, DCG wrote Genesis a sham 10yr promissory note w\/ a measly 1% interest rate – worth just a fraction of its $1.1b face amount. Genesis was wildly insolvent.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"$640 million","content":"MONEY"},{"type":"Gemini","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"July 7","content":"DATE"},{"type":"$1.1","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"Silbert","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Tyler Winklevoss","content":"PERSON"},{"type":"Barry Silbert","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Cameron","content":"PERSON"},{"type":"U.S. Southern District of New York","content":"LOCATION"},{"type":"Cameron Winklevoss","content":"PERSON"},{"type":"Genesis","content":"LOCATION"},{"type":"1%","content":"PERCENT"},{"type":"Winklevoss","content":"PERSON"},{"type":"$1.2 billion","content":"MONEY"},{"type":"Genesis","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}