{"summary":"Macro investor and hedge fund manager Paul Tudor Jones issued a strong case for buying bitcoin and indicated that his Tudor BVI fund will trade bitcoin futures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64398\/paul-tudor-jones-says-he-is-buying-bitcoin-as-a-hedge-against-central-bank-money-printing","publishDate":"2020-05-07T13:09:19","id":8197,"type":null,"title":"Macro investor Paul Tudor Jones makes the case for owning bitcoin as a hedge against central bank money printing","category":["BITCOIN"],"content":["Macro investor and hedge fund manager Paul Tudor Jones issued a strong case for buying bitcoin and indicated that his Tudor BVI fund will trade bitcoin futures.","The founder and chief investment officer of Tudor Investment Corp. says he sees the crypto asset as a hedge against upcoming inflation as a result of central bank money printing, according to <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-05-07\/paul-tudor-jones-buys-bitcoin-says-he-s-reminded-of-gold-in-70s?utm_source=google&amp;utm_medium=bd&amp;cmpId=google\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Bloomberg<\/a>.&nbsp;","\"The best profit maximizing strategy is to own the fastest horse,\" Jones said in an investor letter, titled The Great Monetary Inflation, which was reviewed by The Block. Bloomberg first reported Thursday that the noted investor is buying bitcoin, though the letter contains a more nuanced take without offering a clear sense that he is purchasing actual coin.","\"If I am forced to forecast, my bet is it will be bitcoin,\" he added. Indeed, Jones said that such money-printing will move many different assets. And it will push traditional investors to gold, but he said the world \"craves new safe assets,\" which might be a boon for bitcoin.","As Jones put it:","\"Quite often, how the markets respond will be at odds with your priors. But remember, the P&amp;L always wins in the long run. With that in mind, in a world that craves new safe assets, there may be a growing role for Bitcoin.\"","The letter also provides additional clarity on the exact nature of Tudor's plans, which stated:","\"I am not an advocate of Bitcoin ownership in isolation, but do recognize its potential in a period when we have the most unorthodox economic policies in&nbsp;modern history. So, we need to adapt our investment strategy. We have updated the Tudor BVI offering memoranda to disclose that we may trade Bitcoin futures for Tudor BVI. We have set the initial maximum exposure guideline for purchasing Bitcoin futures to a low single digit exposure percentage of Tudor BVI’s net assets, which seems prudent. We will review this exposure guideline regularly.\"","Part of Jones' attraction to bitcoin is its fixed supply, which is capped at 21 million.&nbsp;","<span data-v-f87c67ca=\"\">\"I also made the case for owning Bitcoin, the quintessence of scarcity premium,\" Jones wrote. \"It is literally the only large tradeable asset in the world that has a known fixed maximum supply. By its design, the total quantity of Bitcoins (including those not yet mined) cannot exceed 21 million.\"<\/span>","According to the letter, Jones views bitcoin as being in a similar position to gold&nbsp;<a href=\"https:\/\/www.investopedia.com\/articles\/economics\/09\/1970s-great-inflation.asp\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">during the 1970s, a period when inflation gripped U.S. markets<\/a>.","\"Bitcoin reminds me of gold when I first got in the business in 1976,\" he wrote. \"Gold had just been productized as a futures instrument (like Bitcoin recently) and had enjoyed a heck of a bull market, almost tripling in price. It then corrected almost 50% in nearly two years similar to Bitcoin’s 28-month 80% correction! You can see the similarities in the two charts below.\"","As he noted elsewhere in the letter:","\"But the GMI caused me to revisit Bitcoin as an investable asset for the first time in two and a half years. It falls into the category of a store of value and it has the added bonus of being semi- transactional in nature. The average Bitcoin transaction takes around 60 minutes to complete which makes it “near money.” It must compete with other stores of value such as financial assets, gold and fiat currency, and less liquid ones such as art, precious stones and land. The question facing every investor is, “What will be the winner in ten years’ time?”\"","","","<em data-v-f87c67ca=\"\">Source: Paul Jones &amp; Lorenzo Giorgianni<\/em>","Jones' comments come amid a period of heightened activity by the world's central banks, most notably the Fed, as they attempt to use monetary policy to beat back the effects of the coronavirus pandemic and government-mandated economic shutdowns. Other macro investors, including Raoul Pal, have <a href=\"https:\/\/www.theblockresearch.com\/why-raoul-pal-believes-the-dollar-is-going-to-break-the-global-system-62437\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">predicted further instability<\/a> in light of these recent actions.","What's more, the price of bitcoin has been on the rise since mid-March lows, and at time of writing has jumped above $9,800.&nbsp;The announcement from the Tudor Investment Corp. founder comes just days before bitcoin is set to undergo its third-ever block <a href=\"https:\/\/www.theblockcrypto.com\/post\/61762\/the-bitcoin-halving-what-it-is-and-why-it-matters\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">reward halving<\/a>, which will see the network's per-block coin issuance fall from 12.5 BTC and 6.25 BTC.","Other investors, including those in the crypto space like Pantera's Dan Morehead, have (perhaps unsurprisingly) <a href=\"https:\/\/www.theblockcrypto.com\/post\/63969\/panteras-dan-morehead-expects-bitcoin-to-shine-amid-sluggish-economic-recovery\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">predicted<\/a> that sluggish economic conditions will be a boon for bitcoin.&nbsp;","<em data-v-f87c67ca=\"\">This post and its headline have been updated to&nbsp;<\/em><i data-v-f87c67ca=\"\">include more information from the letter, titled The Great Monetary Inflation.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tudor Investment Corp.","content":"ORGANIZATION"},{"type":"Jones","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"Paul Jones &amp; Lorenzo Giorgianni","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"GMI","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$9,800","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"1970s","content":"DATE"},{"type":"Dan Morehead","content":"PERSON"},{"type":"Pantera","content":"ORGANIZATION"},{"type":"Tudor","content":"ORGANIZATION"},{"type":"Paul Tudor Jones","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"P&amp;L","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tudor BVI","content":"ORGANIZATION"},{"type":"1976","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"The Great Monetary Inflation","content":"ORGANIZATION"},{"type":"Raoul Pal","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}