{"summary":"Crypto exchange Binance Australia has halted Australian dollar deposits, citing issues with its third-party payment service provider.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231278\/binance-australia-dollar-deposit-issues","publishDate":"2023-05-18T03:40:19","id":8198,"type":null,"title":"Binance Australia halts AUD deposits, citing third-party issues","category":["COMPANIES"],"content":["Crypto exchange Binance Australia has halted Australian dollar deposits, citing issues with its third-party payment service provider.","\"We regret to inform you that with immediate effect we are unable to facilitate PayID AUD deposits for Binance users due to a decision made by our third-party payment service provider,\" <a href=\"https:\/\/twitter.com\/Binance_AUS\/status\/1659018600496373760?s=20\" data-v-f87c67ca=\"\">Binance Australia tweeted<\/a>. PayID is an instant bank transfer method supported by over 100 Australian banks and financial institutions, according to Binance's website.","A Binance spokesperson said Cuscal, which provides banking services for its local payments processor Zepto, decided to end the AUD deposit services. Cuscal didn’t immediately respond to a request for comment on the situation.","After first saying AUD withdrawals are also impacted, Binance Australia later said, \"<a href=\"https:\/\/twitter.com\/Binance_AUS\/status\/1659086110113267712?s=20\" data-v-f87c67ca=\"\">users can continue to withdraw AUD<\/a> and we will update with any further changes on timing as we know more.\"","The news comes a month after the Australian Securities and Investments Commission <a href=\"https:\/\/www.theblock.co\/post\/225192\/binances-australia-derivatives-license-cancelled-by-regulator\" data-v-f87c67ca=\"\">canceled Binance's financial services license in the country<\/a> after the company requested it, halting the derivatives trading on the exchange. Today's development means Binance's spot trading services are also now impacted.","Binance Australia said it is working to find an alternative provider to continue offering AUD deposits and withdrawals to its users.","Meanwhile, Binance Australia users can still buy and sell crypto using credit or debit cards and Binance's peer-to-peer or P2P marketplace, the exchange said.","<a href=\"https:\/\/www.theblock.co\/post\/231141\/binance-market-share-crypto-exchange\" data-v-f87c67ca=\"\">Binance's market share has dropped by nearly 15 percentage points<\/a> in the last few months. Binance had a 62% share of spot crypto trading volumes in February and that has declined to around 47% this month, according to The Block's Data Dashboard. Nonetheless, Binance remains the largest spot crypto exchange in the world.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/the-block-legitimate-index-market-share\/embed\" title=\"Monthly Exchange Volume Market Share\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<em data-v-f87c67ca=\"\">Update: story updated to show Binance named Cuscal as its PayID service provider.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance Australia","content":"LOCATION"},{"type":"15 percentage points","content":"PERCENT"},{"type":"47%","content":"PERCENT"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Binance spokesperson","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Investments Commission","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Cuscal","content":"PERSON"},{"type":"62%","content":"PERCENT"}],"hashtag":["BINANCE"],"authors":["Yogita Khatri","The Block"]}