{"summary":"Goblin Sax, a decentralized autonomous organization, acquired the instant loans app Fluid.\nThe app will be rebranded to Goblin Lend.","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182175\/goblin-sax-dao-to-offer-instant-nft-backed-loans","publishDate":"2022-11-02T09:47:56","id":82,"type":null,"title":"Goblin Sax DAO to offer instant NFT-backed loans","category":["NFTs"],"content":["Goblin Sax, a decentralized autonomous organization for NFT finance, is launching an instant loans service.&nbsp;It acquired instant loans app Fluid, which it will rebrand as Goblin Lend, to build out the product alongside its already existing peer-to-peer NFT lending service.","Formerly known as Gringotts DAO, Goblin Sax is one of several NFT loan platforms that have popped up over the last year that targets NFT holders looking to unlock liquidity without selling their nonfungible tokens.&nbsp;","Among them, South African company NFTfi raised a $5 million seed round late last year. In November, it <a href=\"https:\/\/www.theblock.co\/post\/123165\/someone-took-out-a-1-4-million-loan-with-an-nft-as-collateral\" data-v-f87c67ca=\"\">issued<\/a> a loan for $1.4 million over 30 days at 9.69% APR. The collateral was a rare NFT from the generative art collation Autoglyphs.","Goblin Sax was originally a lender on NFTfi but has been looking for ways to evolve.&nbsp;","\"The instant loans app will enable users to click a few buttons and take a loan instantly\", the DAO's head of integrations, who goes by \"Arentweall,\" told The Block. They explained that \"the base layer is using NFTfi, but I think the user experience is very different from the one on NFTfi, where you first put out your NFT and then wait for someone to offer you a loan.\"","As floor prices decline, NFT lending platforms have encountered liquidity issues of their own. BendDAO, another NFT finance DAO, had a liquidity crisis in August due to <a href=\"https:\/\/www.theblock.co\/post\/164828\/nft-lender-benddao-begins-vote-to-change-protocol-amid-liquidity-crisis\" data-v-f87c67ca=\"\">underestimating<\/a> how illiquid NFTs could be in a bear market when setting its initial parameters. After interest rates on borrowed loans increased, users let go of their NFTs instead of paying back the loans.","Goblin Sax said that NFT projects are looking for more revenue and engagement, while NFT holders want liquidity and floor prices.&nbsp;\"We believe Goblin Lend can help create a win-win solution and we want to empower these communities to their next stage of growth,” it said in a press release."],"hashtag":[]}