{"summary":"Polyhedra Network, the developer of zkBridge, has reached a valuation of $1 billion following a new $20 million strategic funding round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282461\/polyhedra-network-zkbridge-funding-1-billion-valuation-token-round","publishDate":"2024-03-14T08:00:04","id":82,"type":null,"title":"zkBridge developer Polyhedra Network reaches $1 billion valuation in token round","category":["VENTURE CAPITAL"],"content":["Polyhedra Network, the developer of the zero-knowledge interoperability protocol zkBridge, has reached a valuation of $1 billion following a new $20 million strategic funding round.","Polychain Capital led the round, with Animoca Brands, Hashkey Capital, Longhash Ventures, Emirates Consortium, Mapleblock Capital and others participating, Polyhedra said Thursday. This round and the previous four funding rounds were all conducted through a simple agreement for future tokens or SAFT, Eric Vreeland, chief strategy officer of Polyhedra, told The Block.","The latest funding round closed last month and brought Polyhedra's total funding to date to $75 million, Vreeland said. Regarding the $1 billion valuation, he added that it represents the fully diluted token valuation. He declined to specify a timeline for the token launch.","With fresh funding in place, Polyhedra plans to expand its current team of about 50 people to around 80 this year by hiring across functions, including product, engineering, business development and marketing, Vreeland said.","<a href=\"https:\/\/www.theblock.co\/post\/212924\/binance-labs-and-polychain-co-lead-zk-startup-polyhedra-networks-10-million-raise\" data-v-f87c67ca=\"\">Polyhedra<\/a> is a web3 infrastructure firm that has developed <a href=\"https:\/\/www.theblock.co\/post\/273668\/polyhedra-network-building-the-largest-interoperable-bitcoin-ecosystem-with-zkbridge\" data-v-f87c67ca=\"\">zkBridge<\/a>, among other tools. zkBridge is a zero-knowledge blockchain interoperability protocol that enables cross-chain transactions. Polyhedra's zero-knowledge proofs are \"significantly faster\" than existing proofs, both in proof generation and proof verification, according to Vreeland.","Since its launch last year, zkBridge has facilitated over 20 million cross-chain transactions and generated over 40 million zero-knowledge proofs, Vreeland said. There is no total value locked data available for zkBridge since it does not custody assets, he added.","zkBridge can be compared with the blockchain interoperability protocol Wormhole, which was <a href=\"https:\/\/www.theblock.co\/post\/265184\/cross-chain-protocol-wormhole-closes-225-million-funding-round-at-2-5-billion-valuation\" data-v-f87c67ca=\"\">valued<\/a> at $2.5 billion last November when it raised $225 million in funding. However, Vreeland mentioned that Wormhole has yet to implement zero-knowledge proofs into its interoperability protocol. Earlier this year, Wormhole announced plans to utilize zero-knowledge proofs and also partnered with chipmaker AMD to assist in that implementation.","In addition to zkBridge, Polyhedra has also developed zkLightClient technology that is integrated with the LayerZero protocol. It allows application developers to use zero-knowledge proofs to secure their cross-chain messages sent via the protocol, Vreeland said. Polyhedra recently also announced a Bitcoin messaging protocol that aims to improve the interoperability of the Bitcoin network with other Layer 1 and Layer 2 networks.","Lastly, Polyhedra has also developed a proof-of-reserve system using zero-knowledge technology, which allows users to verify their crypto holdings on centralized exchanges.","\"As blockchain usage continues to grow, technology that enables secure and highly scalable computation across multiple networks will be a necessity,\" according to Vreeland. \"Unlocking this without introducing additional trust assumptions is critical if we are to stay true to the values this industry was founded on. Zero-knowledge technology is the key to unlocking blockchain's full potential.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Hashkey Capital","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Mapleblock Capital","content":"ORGANIZATION"},{"type":"Emirates Consortium","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Vreeland","content":"PERSON"},{"type":"AMD","content":"ORGANIZATION"},{"type":"Polyhedra","content":"PERSON"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Polyhedra","content":"LOCATION"},{"type":"$75 million","content":"MONEY"},{"type":"$225 million","content":"MONEY"},{"type":"SAFT","content":"ORGANIZATION"},{"type":"$2.5 billion","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"Polyhedra","content":"ORGANIZATION"},{"type":"Eric Vreeland","content":"PERSON"},{"type":"Longhash Ventures","content":"ORGANIZATION"}],"hashtag":["CROSS-CHAIN SWAPS","DECENTRALIZED INFRASTRUCTURE","INTEROPERABILITY","STRATEGIC INVESTMENTS"],"authors":["Yogita Khatri","The Block"]}