{"summary":"A Chinese outlet today sounded the alarm on illegitimate purchases of Worldcoin credentials for as little as $30.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231433\/worldcoin-iris-black-market","publishDate":"2023-05-18T15:18:52","id":8200,"type":null,"title":"Sam Altman&#x27;s Worldcoin rolls out fresh measures to combat black market","category":["COMPANIES"],"content":["It hasn’t even launched yet, but already there are signs of a new kind of black market springing up around Worldcoin.","Co-created by OpenAI’s Sam Altman, the Worldcoin project revolves around a soon-to-launch token that will be distributed to anyone who proves they’re a unique individual. The main way of doing that is to get an iris scanned by one of Worldcoin’s orbs. Over 1.7 million people have already signed up — the majority of them in the Global South.","But as its launch nears, scammers are finding ways to cheat the system.","BlockBeats, a Chinese news site, <a href=\"https:\/\/twitter.com\/BlockBeatsAsia\/status\/1659060950748782594?s=20\" data-v-f87c67ca=\"\">said in tweets posted earlier today<\/a> that people in China — where people cannot yet sign up to receive a share of the Worldcoin token when it launches — are purchasing iris scans taken in Cambodia and Africa for as little as $30. The news <a href=\"https:\/\/twitter.com\/mattysino\/status\/1659084612448993282?s=20\" data-v-f87c67ca=\"\">drew sharp criticism<\/a> from Twitter users.","A spokesperson for Worldcoin acknowledged these incidents in a written statement sent to The Block, but stressed that the problem was confined to “a few hundred instances.”","“Through ongoing threat and awareness monitoring measures, the Worldcoin team identified suspicious and potentially fraudulent activity whereby individuals were incentivized to sign up for a verified World ID that was then delivered to a third party’s World App rather than their own,” they said.","Worldcoin has taken several steps to try to contain the issue. Those include “adjustments to the initial in-person signup process and the implementation of dynamic vs static QR codes,” the spokesperson said.","The project had previously <a href=\"https:\/\/worldcoin.org\/blog\/engineering\/humanness-in-the-age-of-ai\" data-v-f87c67ca=\"\">addressed the subject of account theft<\/a> in a blog post published in March. “Once a proof of personhood is granted, it is crucial to ensure that it is difficult to sell or steal, yet easy to recover,” Worldcoin said in the blog post.","It explained that users could reclaim their World ID — their verified account — by getting scanned by an orb a second time. This, Worldcoin said, would help deter the illegitimate sale of proof-of-personhood credentials.","“Despite these precautions, it is important to acknowledge that they do not entirely safeguard against collusion or other attempts to bypass the one-person-one-proof principle. To address these challenges, innovative ideas in mechanism design and the attribution of social relationships will be necessary,” the project added.","Worldcoin has said previously that its token will go live in the first half of this year. The project <a href=\"https:\/\/www.theblock.co\/post\/229742\/sam-altman-worldcoin-app-token\" data-v-f87c67ca=\"\">rolled out its self-custodial mobile app<\/a> in early May.","The organization is currently valued at $3 billion after reportedly raising $100 million from Khosla Ventures and a16z in March 2022. The Block <a href=\"https:\/\/www.theblock.co\/post\/210014\/sam-altman-worldcoin-fundraise\" data-v-f87c67ca=\"\">revealed in February<\/a> that the company is seeking another round of funding at the same valuation.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$30","content":"MONEY"},{"type":"$3 billion","content":"MONEY"},{"type":"Khosla Ventures","content":"ORGANIZATION"},{"type":"earlier today","content":"DATE"},{"type":"May","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Cambodia","content":"LOCATION"},{"type":"Worldcoin","content":"LOCATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"March 2022","content":"DATE"},{"type":"Worldcoin","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"the first half of this year","content":"DATE"},{"type":"Africa","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":["IDENTITY"],"authors":["Ryan Weeks","The Block"]}