{"summary":"Former employees of a trading firm acquired by FTX have started their own hedge fund that will focus on liquid tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273562\/ex-ledgerprime-employees-start-liquid-token-hedge-fund-called-split-capital","publishDate":"2024-01-19T11:03:57","id":8201,"type":null,"title":"Ex-LedgerPrime employees start liquid token hedge fund called Split Capital","category":["FUNDS"],"content":["Former employees of crypto trading firm LedgerPrime have launched a new hedge fund that will focus on liquid tokens.","Christened Split Capital, the fund was founded by LedgerPrime alumni Zaheer Ebtikar and Michael Churchouse, along with Nai Boonkongkird. LedgerPrime former chief investment officer Shiliang Tang will serve as an advisor.&nbsp;","\"It's been a long time coming but I'm thrilled to announce the official launch of Split Capital, a liquid digital assets fund,\" Ebtikar <a href=\"https:\/\/twitter.com\/SplitCapital\/status\/1748346913571680691\" data-v-f87c67ca=\"\">posted to X<\/a> on Friday. \"Split Capital, as a concept, has been in my mind for years now and it's been a dream to finally see it come to fruition.\"","Primary backers of the new fund include Novi Loren, UTXO Management and Dan Matuszewski, co-founder of CMS Holdings. Split Capital would not say how big the fund is, citing regulatory restrictions.","Fortune <a href=\"https:\/\/fortune.com\/crypto\/2024\/01\/19\/ledgerprime-alumni-crypto-hedge-fund-split-capital\/\" data-v-f87c67ca=\"\">first reported<\/a> the news earlier on Friday.&nbsp;","Split Capital's investment strategy will involve taking a longer view on token investments, opposed to divesting as soon as digital assets become liquid, a common strategy among many venture capital firms active in crypto, according to Ebtikar. Split Capital is for investors with the appetite to invest for the longer term, the new fund said.","As an example of which type of tokens Split Capital might focus on, Ebtikar pointed to a <a href=\"https:\/\/twitter.com\/SplitCapital\/status\/1620937578097836033?t=wLEMyJP2WpvFwb72cRfqfA&amp;s=19\" data-v-f87c67ca=\"\">recommendation<\/a> he and his team made in December 2022, when they recommended buying Solana, Lido and Synapse.","Defunct crypto exchange FTX acquired LedgerPrime in 2021. Ebtikar worked as a portfolio manager for a year before leaving in September 2023, according to his LinkedIn profile.&nbsp; Churchouse also used to work on the DeFi investment team at Nickel Digital Asset Management.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"LedgerPrime","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Churchouse","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Novi Loren","content":"PERSON"},{"type":"UTXO Management","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Michael Churchouse","content":"PERSON"},{"type":"Nai Boonkongkird","content":"ORGANIZATION"},{"type":"Shiliang Tang","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Nickel Digital Asset Management","content":"ORGANIZATION"},{"type":"Zaheer Ebtikar","content":"PERSON"},{"type":"Lido","content":"LOCATION"},{"type":"December 2022","content":"DATE"},{"type":"CMS Holdings","content":"ORGANIZATION"},{"type":"September 2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Dan Matuszewski","content":"PERSON"},{"type":"Solana","content":"PERSON"}],"hashtag":[],"authors":["RT Watson","The Block"]}