{"summary":"The Securities and Exchange Commission on Friday asked for new written comments on a proposed spot bitcoin application from ARK Invest and 21Shares in an apparent delay.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244297\/sec-asks-for-new-comments-about-ark-bitcoin-etf-in-apparent-delay","publishDate":"2023-08-11T10:26:44","id":8202,"type":null,"title":"SEC asks for new comments about ARK bitcoin ETF in apparent delay","category":["COMPANIES"],"content":["The Securities and Exchange Commission on Friday asked for <a href=\"https:\/\/www.sec.gov\/files\/rules\/sro\/cboebzx\/2023\/34-98112.pdf\" data-v-f87c67ca=\"\">new written<\/a> comments on a proposed spot bitcoin application from ARK Invest and 21Shares in an apparent delay that was widely expected.","Interested parties were invited to submit \"written data, views, and arguments\" due in 21 days. The regulator had in June said it would either \"approve or disapprove, or institute proceedings to determine whether to disapprove\" the application by Aug. 13.","While a <a href=\"https:\/\/www.sec.gov\/comments\/sr-cboebzx-2023-028\/srcboebzx2023028.htm\" data-v-f87c67ca=\"\">comment period<\/a> for the initial application period had already come and gone, the SEC is now specifically seeking comments on an <a href=\"https:\/\/cdn.cboe.com\/resources\/regulation\/rule_filings\/pending\/2023\/SR-CboeBZX-2023-028-Amendment-No-3.pdf\" data-v-f87c67ca=\"\">amendment<\/a> filed in July by the Cboe exchange that added a surveillance sharing agreement similar to those seen in more recent proposals that have come from asset management giants like BlackRock and Fidelity.&nbsp;","Anyone wishing to file a rebuttal to any submission has a 35-day period, meaning the process looks set to be dragged out for at least another month.&nbsp;","The SEC has so far received <a href=\"https:\/\/www.theblock.co\/post\/242986\/sec-hears-from-cricketer-musician-and-physicist-on-proposed-bitcoin-etfs\" data-v-f87c67ca=\"\">letters<\/a> from a musician, a former cricket player, a city planner, a mechanic and a physicist in the public comment process for multiple applications for spot bitcoin funds.&nbsp;","Bitcoin's price was little changed on the news. It's up 0.2% over the past 24 hours to $29,478, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" data-v-f87c67ca=\"\">CoinGecko<\/a>.&nbsp;","Ark CEO Cathie Wood said earlier in the month that she had been expecting the delay.","\"I think you're probably right that Aug. 13 will come and go,\" Wood said on&nbsp;<a href=\"https:\/\/www.bloomberg.com\/news\/videos\/2023-08-07\/wood-sec-could-approve-more-than-one-bitcoin-etf-video\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Bloomberg Television<\/a>. \"I think the SEC, if it's going to approve a bitcoin ETF, will approve more than one at once.\"","The regulator is currently reviewing applications for at least eight other funds, having acknowledged most of the recent wave from asset managers including BlackRock, Fidelity, VanEck and Invesco <a href=\"https:\/\/www.theblock.co\/post\/243635\/cathie-wood-expects-another-delay-for-arks-proposed-bitcoin-etf\" data-v-f87c67ca=\"\">last month<\/a>. The ARK 21Shares Bitcoin ETF was ahead of the pack, with public comment periods for the other applications just wrapping up.&nbsp;","The latest move from the SEC appears to put all the filings on a fairly similar timeline.&nbsp;","Excitement about the possibility of a spot fund triggered a rally in the price of bitcoin, which skyrocketed around 20% in the days after BlackRock's filing, but SEC Chair Gary Gensler has expressed concern about fraud and manipulation in the sector.","Grayscale, which had its proposal to convert its flagship GBTC fund into a spot bitcoin ETF rejected by the SEC, has also&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/241839\/grayscale-pours-cold-water-on-wave-of-new-spot-bitcoin-etf-applications\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">argued<\/a> that any possible approval should include previous funds that have been disapproved.","(<em data-v-f87c67ca=\"\">Updates with additional details.<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aug. 13","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Bloomberg Television","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"0.2%","content":"PERCENT"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"Cathie Wood","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"Cboe","content":"ORGANIZATION"},{"type":"$29,478","content":"MONEY"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"CoinGecko","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}