{"summary":"SSV Network has introduced its partner mainnet with distributed validator technology for decentralized staking services.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251004\/ssv-network-mainnet","publishDate":"2023-09-14T09:59:17","id":8207,"type":null,"title":"SSV Network launches decentralized staking mainnet with partner apps","category":["INFRASTRUCTURE"],"content":["SSV Network has launched its partner mainnet — introducing the first major large-scale application of distributed validator technology aimed at offering decentralized staking services to users.","The SSV mainnet launch features over ten launch partners who will integrate their staking dApps with SSV — including Stader, Ankr, Stakestar, 01node, Metapool, StakeTogether, XHash, Chainup, Coindelta and Claystack.","SSV’s mainnet deployment occurred in multiple phases, starting with a limited launch last month. The current stage permits the public to stake in SSV via launch partner apps.","During this launch phase, users can only stake through the partner staking applications. In the fourth quarter, when the network begins the final phase of the rollout called “permissionless launch,” users will be able stake directly with SSV Network and also become a node operator.","<span data-v-f87c67ca=\"\">The SSV Network offers a decentralized staking mechanism by connecting users to a network of “operators” responsible for jointly managing Ethereum validator nodes in a trust-minimized fashion. It offers an alternative to conventional staking services offered via either centralized exchanges or liquid staking that can potentially introduce issues by requiring <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.18%\n    <\/span><\/a> <!----><\/span> holders to give up custody of their holdings.<\/span>","Other challenges arise when integrating multiple users onto a single staking validator, especially concerning validator key storage and management. The SSV team said its DVT facilitates the sharing of each validator managing 32 ETH among several operators with the help of BLS signatures. Simply put, it employs a distinct cryptographic protocol to distribute operational and key management tasks across multiple users.&nbsp;","As a result, the team claims the network can also assist existing staking protocols to further decentralize.","“Our goal is to onboard even more users who would be otherwise wary of trusting single entities, while not wanting to go through the relatively complex process of staking independently,” said Alon Muroch, Protocol Lead at SSV. “In one stroke, DVTs can alleviate all of the staking centralization concerns we’ve heard in recent years.”","In Feb. 2022, SSV Network <a href=\"https:\/\/cryptobriefing.com\/ssv-network-raises-10m-boost-ethereum-staking-infrastructure\/\" data-v-f87c67ca=\"\">raised<\/a> $10 million from Digital Currency Group, Coinbase, and other investors.","The project competes with other DVT developers such as <a href=\"https:\/\/www.theblock.co\/post\/120960\/obol-technologies-seed-funding-crypto-staking-protocol\" data-v-f87c67ca=\"\">Obol<\/a> and Diva.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BLS","content":"ORGANIZATION"},{"type":"Feb. 2022","content":"DATE"},{"type":"-0.18%","content":"PERCENT"},{"type":"Metapool","content":"LOCATION"},{"type":"Alon Muroch","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"LOCATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Stader","content":"PERSON"},{"type":"Stakestar","content":"PERSON"},{"type":"Chainup","content":"LOCATION"},{"type":"Claystack","content":"PERSON"},{"type":"fourth quarter","content":"DATE"},{"type":"SSV Network","content":"ORGANIZATION"},{"type":"SSV","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}