{"summary":"The two new executive hires will help Kraken&#x27;s product launches, global expansion and regulatory compliance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274563\/kraken-hires-n26-coinbase-leaders-lead-compliance-global-expansion","publishDate":"2024-01-25T14:01:51","id":8209,"type":null,"title":"Kraken hires former N26 and Coinbase execs to help bolster compliance and global expansion","category":["COMPANIES"],"content":["Crypto exchange Kraken announced two strategic hires on Thursday <a href=\"https:\/\/blog.kraken.com\/news\/kraken-strengthens-leadership-team-with-two-key-appointments\" data-v-f87c67ca=\"\">it said<\/a> would help position the company for \"continued growth amid evolving global regulatory environments.\"","The first to join is Gilles BianRosa, who will serve as Chief Operating Officer and Chief Product Officer, reporting to the exchange's CEO David Ripley. BianRosa <a href=\"https:\/\/www.linkedin.com\/in\/gillesbianrosa\/?originalSubdomain=de\" data-v-f87c67ca=\"\">previously<\/a> held CPO positions at European neobank <a href=\"https:\/\/www.theblock.co\/amp\/post\/178539\/neobank-n26-cryptocurrency-bitpanda-partnership\" data-v-f87c67ca=\"\">N26<\/a>, audio platform SoundCloud and technology firm Samsung Electronics.&nbsp;","Marcus Hughes will take lead as Kraken's Global Head of Regulatory Strategy after serving as Managing Director of Europe and General Counsel for international expansion at Coinbase for one and a half years, <a href=\"https:\/\/www.linkedin.com\/in\/marcus-hughes-7b3876\/?originalSubdomain=uk\" data-v-f87c67ca=\"\">according<\/a> to his LinkedIn profile.&nbsp;","\"As we get ready for the next phase of growth in crypto markets, we need to ensure we can quickly adapt to rapidly changing market trends while navigating an increasingly complex and divergent regulatory landscape,” <a href=\"https:\/\/www.theblock.co\/post\/171847\/krakens-jesse-powell-stepping-down-as-ceo-of-crypto-exchange\" data-v-f87c67ca=\"\">Ripley<\/a> said a statement.","\"We will be innovating, launching new products, entering new markets and continuously improving our offering, all while ensuring compliance with applicable regulatory requirements across the many markets we operate in,\" he added.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Marcus Hughes","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"CPO","content":"ORGANIZATION"},{"type":"Samsung Electronics","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Kraken's Global Head of Regulatory Strategy","content":"ORGANIZATION"},{"type":"Ripley","content":"PERSON"},{"type":"Gilles BianRosa","content":"PERSON"},{"type":"David Ripley","content":"PERSON"}],"hashtag":["COINBASE","KRAKEN"],"authors":["MK Manoylov","The Block"]}