{"summary":"The pseudonymous trader has doubled down on his bet against LUNA by shorting the coin with an additional $10 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/145739\/trader-doubles-down-on-10-million-bet-against-do-kwon-by-shorting-luna","publishDate":"2022-05-09T10:27:50","id":8219,"type":null,"title":"Trader doubles down on $10 million bet against Do Kwon through LUNA short position","category":["CRYPTOCURRENCY"],"content":["Gigantic Rebirth, a pseudonymous crypto trader <a href=\"https:\/\/twitter.com\/GiganticRebirth\" data-v-f87c67ca=\"\">also known as GCR<\/a> who made a $10 million wager over the future price of LUNA, has doubled down on his bearish bet by shorting the coin to the tune of another $10 million.","GCR challenged Do Kwon, the CEO of LUNA creator Terraform Labs, to a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/137832\/terraform-labs-ceo-do-kwon-seals-10-million-bet-over-luna-price\" data-v-f87c67ca=\"\">$10 million bet in March<\/a> that LUNA would be trading below $88 in March 2023. Kwon accepted and transferred $10 million worth of stablecoins to be held in escrow pending the outcome of the wager.","GCR says he later sought to <a href=\"https:\/\/twitter.com\/GiganticRebirth\/status\/1522904319619747841\" data-v-f87c67ca=\"\">up the ante<\/a> by proposing bets of $50 million and then $20 million — although Kwon didn't respond to either offer. After being rebuffed, GCR says he's turned to the financial markets to profit if LUNA declines.","“Update on ‘the bet’,\" GCR <a href=\"https:\/\/twitter.com\/GiganticRebirth\/status\/1522903921492168705\" data-v-f87c67ca=\"\">tweeted<\/a> to his 114,000 followers on May 7. \"Since my 20 million wasn't able to be matched on LUNA, I made the bet by myself with derivatives.”&nbsp;","Speaking to The Block on Monday, GCR said he believes LUNA will decline under the pressure of other Layer 1 networks launching their own high-yield decentralized stablecoins. GCR likened the situation to how OlympusDAO forks contributed to taking market share from the original — as the success of one project tends to spawn imitators who will drain liquidity from the original.","GCR advertised the trade on his Twitter account, showing a $10.3 million short position on LUNA at an open price of about $90.","The trade is sitting on a 33% profit, based on the current price of LUNA, netting GCR about $3.5 million in unrealized gains. GCR says he is not worried that advertising his short position could spur efforts to liquidate him.","\"I think for LUNA to liquidate me, the market cap would have to reach the level of Saudi Aramco or something; [I] have quite a good amount of margin,\" GCR told The Block. Saudi Aramco, the world's biggest oil producer, is worth more than $2 trillion.","LUNA enjoyed a significant price run-up following Kwon’s bet and reached an all-time high of $119 in early April.","Since then, the price of LUNA has fallen sharply, down almost 50% from its peak, a situation further exacerbated by UST, he most popular stablecoin on the Terra ecosystem, temporarily <a href=\"https:\/\/www.theblockcrypto.com\/linked\/145676\/ust-stablecoin-struggles-to-maintain-1-parity-amid-crypto-market-turbulence\" data-v-f87c67ca=\"\">becoming de-pegged<\/a> over the weekend. The token was trading for just over $60 at 10:15 a.m. ET on Monday, according to CoinGecko.","Terra has not responded to The Block’s request for comments about GCR’s short position as of the time of publishing.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"Kwon","content":"PERSON"},{"type":"$3.5 million","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"LUNA","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"10:15 a.m.","content":"TIME"},{"type":"April","content":"DATE"},{"type":"$60","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"$2 trillion","content":"MONEY"},{"type":"$119","content":"MONEY"},{"type":"Saudi Aramco","content":"LOCATION"},{"type":"$88","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"May 7","content":"DATE"},{"type":"33%","content":"PERCENT"},{"type":"March 2023","content":"DATE"},{"type":"March","content":"DATE"},{"type":"$10.3 million","content":"MONEY"},{"type":"GCR","content":"ORGANIZATION"},{"type":"$20 million","content":"MONEY"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"},{"type":"$90","content":"MONEY"}],"hashtag":["DO KWON"],"authors":["Osato Avan-Nomayo","The Block"]}