{"summary":"Congressman Michael Conaway has introduced a new bill that, if passed, would offer a way for the Commodity Futures Trading Commission (CFTC) to regulate U.S.-based crypto exchanges.\nThe wide-ranging bill outlines the regulatory requirements for so-called Digital Commodity Exchanges.\nIf passed, the voluntary regulatory framework would provide an alternative to the state-by-state, money transmitter-centric approach that is taken today by U.S. crypto exchanges.","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/78723\/cftc-crypto-exchanges-congress-bill","publishDate":"2020-09-24T12:00:08","id":822,"type":null,"title":"CFTC-registered crypto exchanges? A new bill proposes a voluntary path for that","category":["Regulation"],"content":["New legislation has been proposed that, if passed, would create an opt-in pathway to regulate U.S. cryptocurrency exchanges under a new, national-level framework.","The Digital Commodity Exchange Act (DCEA) endeavors to “regulate the trading venues which list emerging digital commodities, such as Bitcoin, Ether, their forks, and other similar digital assets, for trading.”&nbsp;The wide-ranging legislation — introduced by Representative Michael Conaway — is the first of its kind to emerge from Congress, which to date has largely focused on adding definitions for digital assets to the federal code.","At the center of the bill is a proposed designation for crypto exchanges: a registered Digital Commodity Exchange, or DCE. Under the auspices of the Commodity Futures Trading Commission (CFTC), such a designation would exist alongside classifications for Swap Execution Facilities and Designation Contract Markets. What’s more, the designation would offer an alternative to the state-by-state, money transmitter-centric approach that prevails today. The CFTC has considered cryptocurrencies like bitcoin to be commodities<a href=\"https:\/\/www.coindesk.com\/cftc-ruling-defines-bitcoin-and-digital-currencies-as-commodities\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> since 2015<\/a>.&nbsp;","Conaway told The Block in a statement:","As Peter Van Valkenburg, director of research for the D.C.-based Coin Center, highlighted in a <a href=\"https:\/\/www.coincenter.org\/two-new-bills-in-congress-would-clarify-agency-jurisdiction-over-cryptocurrency\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">blog post<\/a> published Thursday, U.S.-based exchanges “are free to continue relying on state money transmission licenses or state bank and trust charters; choosing CFTC regulation would be an optional alternative path.”","“If an exchange applied and was approved, then it would no longer be subject to state-by-state money transmission licensing requirements,” he continued.","Conaway’s office framed the voluntary path as the one with a better approach compared to the current state of affairs. “Trading venues will be incentivized to choose CFTC regulation in order to reduce their regulatory burdens by facing only one regulator, be eligible to offer leveraged trading, and be the point of entry for new digital commodities to the retail public.” As noted in the actual legislative text, such exchanges would not be able to offer derivatives under the DCE registration alone.","That latter element — the introduction of new assets — also forms part of the DCEA. As before, the bill is trying to draw a line of demarcation between things that fall under the remit of the Securities and Exchange Commission — that is, digital assets that are securities — and digital commodities akin to bitcoin and others.","The legislation lays out how a “digital asset presale” can be conducted, with such assets sold to accredited investors. Indeed, if the approved, DCEs would ultimately be able to offer trading for such presold tokens.","Another key facet of the bill: exchanges regulated in this fashion would only be allowed to list digital commodities that “are not readily susceptible to manipulation.”","As the text outlines:","The bill outlines how such exchanges would be required to have safeguard measures in place, shielding customers from potential harm and manipulation on their trading venues. It also includes language about information reporting requirements for DCEs and procedures for a potential wind-down, including how much financial resources a DCE must have on hand at a given time.","On the question of asset custody, the bill also provides for certain firms to be designated “Qualified Digital Commodity Custodians,” for which the CFTC would “set minimum standards for supervision and regulation a regulator would have to impose for an entity regulated under the regime to be deemed ‘qualified.”","In sum, Conaway’s bill attempts to cast a wide net and, if successful, would represent a novel framework and provide the kind of regulatory clarity that many U.S. crypto businesses have long sought.&nbsp;","“This one bill addresses all three of these policy issues: the need for a federal alternative to state licensing, the need for clarity over SEC jurisdiction, and the issue of cryptocurrency price manipulation and the need for spot-market supervision,” Van Valkenburgh wrote.","It should be noted that the timing of the bill — coming at the end of a Congressional session amid a presidential election year — virtually assures that it won't be passed during the calendar year. But Conaway's office told The Block that industry businesses and stakeholders weighed in on the measure during its drafting, signifying that there's momentum behind it and that it may see success in the next Congress.&nbsp;","<em data-v-f87c67ca=\"\">The draft text of the legislation can be found below:<\/em>","&nbsp;","<a title=\"View Draft Bill2 on Scribd\" href=\"https:\/\/www.scribd.com\/document\/477334244\/Draft-Bill2#from_embed\" data-v-f87c67ca=\"\">Draft Bill2<\/a> by <a title=\"View MichaelPatrickMcSweeney's profile on Scribd\" href=\"https:\/\/www.scribd.com\/user\/265494999\/MichaelPatrickMcSweeney#from_embed\" data-v-f87c67ca=\"\">MichaelPatrickMcSweeney<\/a> on Scribd","<iframe id=\"doc_94961\" class=\"scribd_iframe_embed\" title=\"Draft Bill2\" src=\"https:\/\/www.scribd.com\/embeds\/477334244\/content?start_page=1&amp;view_mode=scroll&amp;access_key=key-fqmwy6GZRccNLoOg8GC0\" width=\"100%\" height=\"600\" frameborder=\"0\" scrolling=\"no\" data-auto-height=\"false\" data-aspect-ratio=\"0.75\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["CFTC","CONGRESS"]}