{"summary":"Built by former Meta employees previously working on Diem, Aptos is designed with scalability, safety, reliability, and upgradeability as its key principles while relying on the capabilities of Move, a Rust-based programming language designed to provide higher security and flexibility for developers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226850\/aptos-releases-core-delegation-pool-functionality-through-the-release-of-aip-6-developed-by-the-team-at-bware-labs","publishDate":"2023-04-20T09:00:36","id":8223,"type":null,"title":"Aptos releases core delegation pool functionality through the release of AIP-6 developed by the team at Bware Labs.","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">It is hardly the case that any Web3 enthusiast has never heard about Aptos, an L1 aiming to be one of the safest and most scalable blockchains in the Web3 space. Built by former Meta employees previously working on Diem, Aptos is designed with scalability, safety, reliability, and upgradeability as its key principles while relying on the capabilities of Move, a Rust-based programming language designed to provide higher security and flexibility for developers.<\/span>","<span data-v-f87c67ca=\"\">Since its mainnet launch, in October 22, Aptos has benefited from substantial popularity among both builders as well as general blockchain enthusiasts, and not without a good reason. The principles behind the project sound pretty good even from a non-technical perspective, while the technical team behind it, is “one of the most professional and technically savvy we have ever had the chance to work with”, says Alexandru Filip, one of the founders at Bware Labs and the lead developer for the AIP-6 initiative.<\/span>","<span data-v-f87c67ca=\"\">Bware Labs is an infrastructure, development tools, and service provider created with the goal of bringing true reliability and performance to all the developers in the Web3 space and with a stated mission of supporting and boosting the blockchain development ecosystems of the networks it partners with.<\/span>","<span data-v-f87c67ca=\"\">&nbsp;With a substantial involvement in the Aptos ecosystem which ranges from validator services to decentralized API support and a free-to-use Snapshot service, Bware Labs recognized the need to provide the Aptos community with a delegation mechanism that would lower barriers for new validators joining the network and allow token holders to participate in the protocol by staking their assets and earning rewards.<\/span>","<span data-v-f87c67ca=\"\">As stated in the Aptos Implementation Proposal 6 (AIP-6), only token holders of more than 1M APT were able to stake tokens and earn rewards previously. With the current release of the AIP-6, everyone in the Aptos community will be granted access to the staking rewards and be allowed to participate and support the protocol. Moreover, AIP-6 will enable multiple parties to contribute to the minimum stake required by a validator to enter the active set and start validating blocks leading to the further decentralization of the network and improved security<\/span>","<span data-v-f87c67ca=\"\">“Even since we joined the Aptos testnet as validators we were able to see a common set of values and beliefs between us and the team behind Aptos. This is actually one of the main things that we look at when we decide to support a new chain and be part of their journey. Even though we offer a whole range of tools and services for Aptos and its developers, being able to contribute on a deeper technological level to further enhance the entire ecosystem, and to work with the Aptos team, represents a great achievement for Bware Labs. In the end, this is the amazing thing about the Web3 space, the fact that different teams with different objectives are able and willing to collaborate and work together for the same goal.” - says Flavian Manea, the CEO of Bware Labs.<\/span>","<span data-v-f87c67ca=\"\">The Bware Labs mission revolves around tackling Web3 challenges and increasing its worldwide adoption by providing some of the industry’s most reliable infrastructure services and development tools.<\/span>","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/bwarelabs.com\/team\" data-v-f87c67ca=\"\">The team<\/a> comprises more than 40 engineers with high technical backgrounds in Web3 and Web2 development.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bware Labs is also the creator of <a href=\"https:\/\/blastapi.io,\" data-v-f87c67ca=\"\">Blast<\/a> -<\/span><span data-v-f87c67ca=\"\">&nbsp;a decentralized API platform powered by the upcoming INFRA token. Blast provides support for 41 blockchain networks while featuring one of the best performances in terms of speed and reliability without sacrificing decentralization.<\/span>","&nbsp;","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by BWare Labs<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aptos","content":"LOCATION"},{"type":"AIP","content":"ORGANIZATION"},{"type":"6","content":"DATE"},{"type":"Flavian Manea","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Alexandru Filip","content":"PERSON"},{"type":"October 22","content":"DATE"},{"type":"Bware Labs","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}