{"summary":"The creator of popular NFT collection Chromie Squiggles Erick Calderon is looking to a future where NFTs are valuable without scarcity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214961\/we-can-have-a-lot-of-nfts-and-not-dilute-value-says-artblocks-founder","publishDate":"2023-02-24T12:05:11","id":8228,"type":null,"title":"We can have a lot of NFTs and not dilute value, says ArtBlocks founder","category":["METAVERSE & NFT"],"content":["We can have a lot of NFTs and they can still be worth a lot of money. At least, that's what the founder of ArtBlocks hopes.","The creator of the popular NFT collection Chromie Squiggles, Erick Calderon, is looking to a future where NFTs are valuable without scarcity, and products can be tailor-made for consumers.","“We as humans have a tendency to lean towards individuality,” he said speaking at the NFT Paris conference on Friday. Despite this, he posed the question: What will it take for NFTs to be valuable without the promise of scarcity?","The crypto winter caused NFT trading volumes, by U.S. dollar value, to plummet by more than 90% last year. Even marquee collections like Bored Ape Yacht Club and Azuki suffered from the downturn. At the same time, however, the number of transactions has steadily risen as cheaper NFTs billed as \"digital collectibles\" and offered by traditional companies like Reddit or Hollywood studio Warner Bros. Discovery are gobbled up by consumers.","Calderon wants to move beyond \"fomo-based\" mechanics in the market where companies have the ability to serve individuals with products that are unique to them.","For example, he said tourist attractions such as the Eiffel Tower could use blockchain tech to take a snapshot of a specific sparkling light sequence, and sell that as an NFT memento, with revenue from the sale going back to maintaining the building and to the artist.","ArtBlocks is \"dedicated to bringing compelling works of contemporary generative art to life,\" uniting artists, collectors and blockchain technology \"in service of groundbreaking artwork and remarkable experiences.\" It has carved out a space as a marketplace that creates and sells unique works.","Calderon created Chromie Squiggles in 2020. The current price floor of the collection is 12.5 ETH (about $20,000), according to NFT Price Floor.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Reddit","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"NFT Price Floor","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"$20,000","content":"MONEY"},{"type":"NFT Paris","content":"ORGANIZATION"},{"type":"Chromie Squiggles","content":"ORGANIZATION"},{"type":"Warner Bros","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Erick Calderon","content":"PERSON"},{"type":"2020","content":"DATE"}],"hashtag":[],"authors":["Lucy Harley-McKeown","RT Watson","The Block"]}