{"summary":"Yuga Labs, creators of Bored Ape Yacht Club NFTs, is reportedly facing a probe by the U.S. Securities and Exchange Commission.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176301\/bayc-creator-yuga-labs-faces-sec-probe-bloomberg","publishDate":"2022-10-11T12:44:37","id":8230,"type":null,"title":"BAYC creator Yuga Labs faces SEC probe: Bloomberg","category":["GAMING AND METAVERSE"],"content":["Yuga Labs, creators of Bored Ape Yacht Club NFTs, is facing a probe by the U.S. Securities and Exchange Commission into whether sales of some of its offerings violate federal law, according to a report by Bloomberg.","The regulator is looking into whether certain assets could be treated more like stocks and therefore should follow the same rules, according to the report. It is also looking at the distribution of APEcoin, the token linked to the collection.&nbsp;","Yuga Labs, a heavyweight of the NFT world, controls collections such as Bored Ape Yacht Club, CryptoPunks and Meebits.&nbsp;","\"It’s well-known that policymakers and regulators have sought to learn more about the novel world of web3. We hope to partner with the rest of the industry and regulators to define and shape the burgeoning ecosystem,\" Yuga Labs told The Block in an emailed statement. \"As a leader in the space, Yuga is committed to fully cooperating with any inquiries along the way.\"","The opening of the probe is not a foregone conclusion; Yuga Labs has not been accused of wrongdoing and the probe may not result in a legal battle. It sits within the concept of a wider scrutiny by the regulator over crypto-related activities.&nbsp;","The price of APEcoin had declined by 7.5% as of press time following Bloomberg's report, according to CoinGecko data.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7.5%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Yuga","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club NFTs","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["BAYC","YUGA LABS"],"authors":["Lucy Harley-McKeown","The Block"]}