{"summary":"Txbit announced its closure, citing &quot;adverse market shifts, including tightening regulations and ambiguity.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244668\/txbit-closure","publishDate":"2023-08-14T08:47:47","id":8233,"type":null,"title":"Crypto exchange Txbit halts trading, announces permanent closure","category":["EXCHANGES"],"content":["Netherlands-based cryptocurrency exchange Txbit is shutting down.","In an announcement, the firm said uncertain regulatory conditions and \"adverse market shifts\" have made it difficult for it to turn a profit and operate.&nbsp;","\"In an environment where compliance costs are rising, and our product margins constantly face pressure, continuing as before has become untenable for us,\" the crypto exchange said in an official announcement, <a href=\"https:\/\/txbit.medium.com\/the-txbit-journey-ends-here-txbit-will-be-closing-down-on-september-14th-2023-4c546ddb8f8f\" data-v-f87c67ca=\"\">explaining<\/a>: \"We began our journey with a distinct vision, but regrettably, the current environment prevents us from continuing.\"","In 2018, the firm <a href=\"https:\/\/txbit.medium.com\/12-reasons-why-txbit-io-differs-from-other-altcoin-exchanges-8c87a54aa8ad\" data-v-f87c67ca=\"\">described<\/a> the Netherland's as having \"favourable laws and regulations for cryptocurrency businesses.\"","At the time of writing, Txbit's website is offline for a planned outage — during which time it will cancel all open orders and shut down its trading feature. Afterward, it will reinstate withdrawals.","<span data-v-f87c67ca=\"\">Txbit's website is currently down for a planned outage relating to its permanent closure. Source: txbit.io<\/span>","The website will shut down on Sept. 14. \"We kindly ask all our customers to withdraw their funds before 12:00 PM UTC on September 14th, 2023.\"","\"We recommend completing this process as soon as possible,\" the firm added. \"Any funds left after September 14th, 2023, will not be retrievable.\"","Txbit has its own token and plans to burn the remaining non-circulated supply — accounting for more than 95% of the total supply. \"Txbit token will still be available for trading on Pancakeswap in the future,\" the exchange noted.","\"We sincerely apologize for any inconvenience this shutdown may cause, and thank you for your understanding and support throughout this journey,\" Txbit concluded, adding: \"We wish all the projects the best and hope they will succeed in their journey.\"","Based in Amsterdam, Txbit was founded in 2016 and launched in 2019.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Amsterdam","content":"LOCATION"},{"type":"2016","content":"DATE"},{"type":"Sept. 14","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Netherland","content":"ORGANIZATION"},{"type":"Txbit","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"September 14th, 2023","content":"DATE"},{"type":"95%","content":"PERCENT"}],"hashtag":[],"authors":["Adam James","The Block"]}