{"summary":"Bitcoin&#x27;s production cost has plunged as analysts improve efficiency, price may follow.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157568\/jpmorgan-analysts-say-bitcoins-production-cost-has-dropped-to-13000-and-price-could-follow","publishDate":"2022-07-14T13:13:28","id":8236,"type":null,"title":"JPMorgan analysts say bitcoin’s production cost has dropped to $13,000 — and price could follow","category":["MINING"],"content":["<span data-v-f87c67ca=\"\">JPMorgan Chase analysts estimate that bitcoin’s production cost has dropped to about $13,000, which may imply further negative price movement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The investment bank estimated bitcoin’s average production cost was $20,000 at the beginning of June, dropping this to $15,000 by the end of the month and $13,000 as of Wednesday. Analysts have attributed the drop to the decline in electricity use.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Thursday’s report said the “decline of the production cost estimate has been driven almost entirely by the decline in electricity use as proxied by the Cambridge Bitcoin Electricity Consumption Index (CBECI).” It went on to say that miners are making a strong effort to protect their profitability by deploying more efficient mining rigs instead of a mass exodus of less efficient miners.<\/span>","","","In order to estimate a quantifiable production cost for bitcoin JPMorgan treats it as a commodity and bases it on the marginal cost of production. The marginal cost of production is estimated using daily price data, hash rate and difficulty from bitinfocharts.com, the bank said in a note on June 24.&nbsp;","JPMorgan then uses the Cambridge Centre for Alternative Finance's estimates for electricity consumption in the CBECI, and the hash rate to infer an implied efficiency estimate of mining hardware.","The report added that the decline in production cost could be perceived as negative for bitcoin's price. During a bear market, the production cost is perceived by some market participants as the lower bound of the price range.","<span data-v-f87c67ca=\"\">Bitcoin recently registered its worst quarterly decline in 11 years, dropping 56% during the second quarter of this year. Meanwhile, cryptocurrencies have fallen across the board, impacted by the collapse of the Terra blockchain in May and a liquidity crisis for crypto lending platforms in June. <\/span>","<span data-v-f87c67ca=\"\">Macroeconomic conditions continued to worsen throughout this period, with US inflation hitting a 40-year high on Wednesday, up 9.1% in June. Amid this ongoing turmoil, JPMorgan reported that its net income had dropped almost 30% during the year's second quarter. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cambridge Centre for Alternative Finance","content":"ORGANIZATION"},{"type":"9.1%","content":"PERCENT"},{"type":"second quarter of this year","content":"DATE"},{"type":"Cambridge Bitcoin Electricity Consumption","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$20,000","content":"MONEY"},{"type":"56%","content":"PERCENT"},{"type":"$15,000","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"$13,000","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"second quarter","content":"DATE"},{"type":"June 24","content":"DATE"}],"hashtag":["BITCOIN","JPMORGAN"],"authors":["Adam Morgan McCarthy","The Block"]}