{"summary":"Circle sent a letter to U.S. senators, refuting claims that it participated in illicit financing activities.\nIn the letter, Circle also said it did not provide banking services to Justin Sun, the TRON Foundation or HTX.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265512\/circle-says-it-doesnt-service-justin-sun-as-it-refutes-us-senators-claims","publishDate":"2023-11-30T14:46:06","id":824,"type":null,"title":"Circle says it doesn&#x27;t service Justin Sun in letter to US senators refuting claims about illicit financing activities","category":["People"],"content":["In a letter to U.S. Senators Sherrod Brown and Elizabeth Warren, Circle refuted what it said were false claims it facilitated illicit financing activities. It also said it does not provide banking services to Justin Sun, the TRON Foundation or Huobi Global, which now goes by <a href=\"https:\/\/www.theblock.co\/post\/250701\/crypto-exchange-huobi-rebrands-to-htx-for-tenth-anniversary\" data-v-f87c67ca=\"\">HTX<\/a>.","\"Circle does not facilitate, directly or indirectly, or finance Hamas (or any other illicit actors). Nor does Circle bank Justin Sun,\" the company <a href=\"https:\/\/www.circle.com\/blog\/circle-refutes-false-claims-on-illicit-financing\" data-v-f87c67ca=\"\">said in the letter<\/a>. \"Neither Mr. Sun nor any entity owned or controlled by Mr. Sun, including the TRON Foundation or Huobi Global, currently have accounts with Circle.\"","\"To date, the U.S. government has not specifically designated Mr. Sun or his entities as Specially Designated Nationals,\" the letter continued. \"Nonetheless, Circle terminated all accounts held by Mr. Sun and his affiliated companies in February 2023.\"","TRON Foundation and HTX did not immediately respond to emailed requests for comment.&nbsp;","The crypto finance company's Chief Strategy Officer and Head of Global Policy Dante Disparte penned the letter in an effort to refute \"false claims\" made by the Campaign for Accountability, which earlier this month&nbsp;<a href=\"https:\/\/campaignforaccountability.org\/watchdog-asks-senators-to-include-tron-circle-in-crypto-terror-financing-probe\/\" data-v-f87c67ca=\"\">sent a letter<\/a> to Senators Brown and Warren and advised them to \"turn their attention to the role crypto entrepreneur Justin Sun, his blockchain TRON, and the US-based stablecoin issuer Circle may be playing in the financing of terrorist organizations.\"","The alleged role crypto organizations may play in facilitating the financing of terror groups has been a <a href=\"https:\/\/www.theblock.co\/post\/265227\/u-s-treasurys-wally-adeyemo-calls-for-more-authority-to-go-after-bad-actors-in-crypto\" data-v-f87c67ca=\"\">contentious topic<\/a> ever since Hamas attacked Israel last month. The Securities and Exchange Commission sued Sun <a href=\"https:\/\/www.theblock.co\/post\/222077\/sec-charges-trons-justin-sun-and-celebrities-including-lindsay-lohan-jake-paul\" data-v-f87c67ca=\"\">in March<\/a> over the unregistered offer and sale of two \"crypto asset securities.\"&nbsp;","(<em data-v-f87c67ca=\"\">Corrects headline to show letter was sent to U.S. senators.<\/em>)"],"hashtag":[]}