{"summary":"Dynamic Labs announced it has secured $13.5 million in Series A funding from a16z crypto and Founders Fund, among other investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267208\/dynamic-labs-secures-13-5-million-of-series-a-funding-in-round-led-by-a16z-crypto","publishDate":"2023-12-13T12:57:45","id":8248,"type":null,"title":"Dynamic Labs secures $13.5 million of Series A funding in round led by a16z crypto","category":["COMPANIES"],"content":["Dynamic Labs secured Series A funding from prominent backers including a16z crypto and Founders Fund.","Dynamic Labs said Wednesday that it had secured $13.5 million in a Series A funding round led by a16z crypto.","According to the web3 firm, the funding is being directed toward the introduction of a suite of new non-custodial wallet tools. The new features will assist wallet developers to \"abstract away the complexities of crypto,\" the company announced on Wednesday.","\"We are thrilled to announce our $13.5 million Series A, led by a16z crypto and joined by Founders Fund, Castle Island Ventures, Breyer Capital, Nikil Viswanathan Joe Lau from Alchemy, and others. This funding will help accelerate our work of supporting these incredible builders,\" Dynamic Labs said in a statement.","Dynamic Labs intends to release new non-custodial wallet tools to offer developers the ability to incorporate FaceID and TouchID into web3 wallet design. This will aid in facilitating the creation of a wallet login process tailored for mobile users.","Dynamic Labs also announced the official rollout of its SDK v1 on Wednesday.","This new software development kit includes underlying architecture improvements, reduced package size, and a move to the Viem TypeScript library.","The new SDK also includes customization options, a multi-wallet linking functionality in both authenticate and connect modes, and an email login that can be combined with embedded wallet solutions.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"SDK","content":"ORGANIZATION"},{"type":"$13.5 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Alchemy","content":"ORGANIZATION"},{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"\" Dynamic Labs","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Nikil Viswanathan Joe Lau","content":"PERSON"},{"type":"Breyer Capital","content":"ORGANIZATION"}],"hashtag":["FINTECH","INVESTMENT FIRMS","WALLET MAKERS"],"authors":["Brian McGleenon","The Block"]}