{"summary":"BTC dominance broke out to new year-to-date highs, nearly reaching 70% of the entire crypto market cap\nVolatility fell off a cliff after news of the CFTC’s investigation of Bitmex hit the wires\nSome traders are positioning themselves for activity with the soft launch of Bakkt while others are focused on the huge drop in wallet outflows from BitMEX","author":["Contributor Network","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/32935\/alts-bleed-bitcoin-leads","publishDate":"2019-07-22T11:38:05","id":825,"type":null,"title":"Alts bleed, Bitcoin leads","category":["Markets"],"content":["<i data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\"><a href=\"https:\/\/twitter.com\/joemccann?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Joe McCann<\/a>&nbsp;is the Founder and Chairman of the Board of NodeSource and f<\/em>ormer quant trader for Passport Capital. This piece is purely for informational purposes; nothing in this post should be construed as investment advice.<\/i>","With so much in the news this past week surrounding bitcoin, for traders, the biggest story of was bitcoin’s market capitalization dominance (BTC Dominance) breakout and how it relates to altcoins.","BTC Dominance broke out to new year-to-date highs, nearly reaching 70% of the entire crypto market cap, yet this happened while the price of bitcoin was <em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">dropping. <\/em>Anyone holding any cryptoasset but bitcoin got absolutely crushed this past week and I don’t see a recovery any time soon. The last time bitcoin’s market cap dominance was this high was the week of Dec. 4, 2017.","A big bottoming candle was put in the past week on strong volume, implying some short term capitulation from sellers and strength from buyers.","The broader market structure is still questionable as we’ve now experienced a 34% peak-to-trough down move from the YTD high of $13,868 down to last week’s low of $9,071.","As I mentioned on <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/el2.convertkit-mail2.com\/c\/preview\/xwixor2zu6h8\/aHR0cHM6Ly90d2l0dGVyLmNvbS9qb2VtY2Nhbm4vc3RhdHVzLzExNTE1MTk1MDA3NzQyMDMzOTM=\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/el2.convertkit-mail2.com\/c\/preview\/xwixor2zu6h8\/aHR0cHM6Ly90d2l0dGVyLmNvbS9qb2VtY2Nhbm4vc3RhdHVzLzExNTE1MTk1MDA3NzQyMDMzOTM=\" data-v-f87c67ca=\"\">Twitter<\/a>, bitcoin was due for a bounce as it breached the lower Bollinger Band (BB) and two out of the three major momentum indicators, <a href=\"https:\/\/www.investopedia.com\/terms\/w\/williamsr.asp\" data-v-f87c67ca=\"\">Williams %R<\/a> and <a href=\"https:\/\/www.investopedia.com\/terms\/s\/stochasticoscillator.asp\" data-v-f87c67ca=\"\">Stochastic Oscillators<\/a>, were both oversold.","Immediate resistance is right back at the mid-point of the BB which is the 20 DMA.","Volatility fell off a cliff after the CFTC investigation news of BitMEX hit the wires. I don’t expect it to last long.","A bullish MACD crossover appears to be in the making but it is too early to tell.","The current trading range is quite tight and rather straightforward: the 20-day moving average is acting as resistance while the 50-day moving average is offering up support. Which one gets breached first?","For the coming week, some traders are positioning themselves for some activity with the soft launch of Bakkt while others are focused on the <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/twitter.com\/thetokenanalyst\/status\/1152473212900597760\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/twitter.com\/thetokenanalyst\/status\/1152473212900597760\" data-v-f87c67ca=\"\">huge drop in wallet outflows<\/a> from BitMEX dragging down every exchange’s volume with it. Volatility, while currently muted, is due to for a pop. Given the drop in volume and liquidity, expect a bumpy ride.","Good luck!"],"hashtag":[]}