{"summary":"Roughly 114 million walbt, AllianceBlock&#x27;s wrapped native token, were stolen during the exploit.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207799\/bonqdao-exploited-for-88-million-allianceblock-tokens-stolen-during-the-exploit","publishDate":"2023-02-01T17:05:30","id":8253,"type":null,"title":"BonqDAO exploited for $88 million, Allianceblock tokens stolen during the exploit","category":["SECURITY"],"content":["Crypto protocols BonqDAO and AllianceBlock have been exploited for approximately <a href=\"https:\/\/debank.com\/profile\/0xcacf2d28b2a5309e099f0c6e8c60ec3ddf656642\" data-v-f87c67ca=\"\">$88 million <\/a>due to an exploit in one of BonqDAO's smart contracts.","The exploit occurred around 1 p.m. EST today. The hacker removed around 114 million walbt, AllianceBlock's wrapped native token, and 98 million beur tokens from one of BonqDAO's <a href=\"https:\/\/bonq-docs.gitbook.io\/protocol-overview\/protocol-documentation\/welcome-to-bonq\" data-v-f87c67ca=\"\">troves<\/a>. The trove is controlled by users and used to mint its payment token beur, which is pegged to the euro. The technical cause of the exploit is still unknown.","The hacker has sold roughly $1.2 million in tokens so far but is having trouble converting the entire amount into stablecoins or ETH due to <a href=\"https:\/\/twitter.com\/spreekaway\/status\/1620866156688187392?s=20&amp;t=JfjlE5VyJWr6mv1nLOS9YQ\" data-v-f87c67ca=\"\">illiquidity.<\/a>","AllianceBlock <a href=\"https:\/\/twitter.com\/allianceblock\/status\/1620887759656460289\/photo\/1\" data-v-f87c67ca=\"\">said<\/a> on Twitter the incident is isolated to the BonqDAO troves and no smart contracts were breached. Both teams worked on removing liquidity to mitigate the hacker converting the stolen tokens into other assets, and have stopped all exchange trading. AllianceBlock also paused bridging on the AllianceBlock Bridge until the situation is resolved.&nbsp;","AllianceBlock is working on a resolution to compensate affected albt holders. It has taken a snapshot of holders before the attack and will mint and airdrop new albt tokens to affected users.&nbsp;","BonqDAO is a non-custodial borrowing and lending platform. AllianceBlock is a decentralized crypto infrastructure platform that <a href=\"https:\/\/www.allianceblock.io\/ecosystem\" data-v-f87c67ca=\"\">connects<\/a> fintech providers and traditional finance institutions to decentralized finance applications.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1 p.m. EST","content":"TIME"},{"type":"$88 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"$1.2 million","content":"MONEY"},{"type":"euro","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}