{"summary":"The Arbitrum airdrop claiming process has begun as the project becomes the latest Ethereum Layer 2 network to have a governance token.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222205\/arbitrum-airdrop-token-claim-live","publishDate":"2023-03-23T09:04:34","id":8255,"type":null,"title":"Arbitrum airdrop token claim goes live","category":["CRYPTO ECOSYSTEMS"],"content":["Recipients of the long-awaited Arbitrum airdrop have begun to claim their tokens, giving them governance powers on the DAO that will control the Arbitrum One and Nova networks.","The claim process began at about 9 a.m. EDT at block height 16,890,400. There are 1.16 billion ARB tokens in the airdrop, representing 11.6% of the total supply of 10 billion tokens. A further 113 million tokens are available to be claimed by some DAOs in the Arbitrum ecosystem.","Arbitrum, a Layer 2 scaling project on the Ethereum network, is rewarding early users while also handing control of future governance decisions to tokenholders.&nbsp;The ARB token will grant governance rights to holders, although it won't have other use case like, for example, paying transaction fees on the network.&nbsp;","The project will now transition to a <a href=\"https:\/\/www.theblock.co\/post\/220486\/arbitrums-long-awaited-airdrop-to-go-live-next-week-with-self-executing-dao\" data-v-f87c67ca=\"\">self-executing DAO<\/a>, which will automatically execute governance votes on-chain. There is, however, a 12-member council that can intervene in the case of emergencies like malicious governance actions being forced through.","The ARB token is set to trade on <a href=\"https:\/\/www.theblock.co\/post\/222022\/coinbase-will-soon-support-the-arbitrum-arb-usd-trading-pair\" data-v-f87c67ca=\"\">several centralized exchanges<\/a>, including Coinbase, Binance, KuCoin, Bybit and OKX. There was also significant bidding for the token on decentralized exchanges prior to the claim process going live. Speculative activity also included over-the-counter deals, IOUs and options for the ARB token.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"OKX","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"1.16 billion","content":"MONEY"},{"type":"11.6%","content":"PERCENT"},{"type":"9 a.m. EDT","content":"TIME"}],"hashtag":["ARBITRUM"],"authors":["Osato Avan-Nomayo","The Block"]}