{"summary":"The funding will be used to expand the peaq DePIN ecosystem ahead of a public offering and mainnet launch.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285001\/depin-layer-1-peaq-raises-15-million-in-pre-launch-funding","publishDate":"2024-03-27T06:00:03","id":8258,"type":null,"title":"DePIN Layer 1 peaq raises $15 million in pre-launch funding","category":["VENTURE CAPITAL"],"content":["Blockchain project peaq, a Layer 1 for decentralized physical infrastructure networks (DePINs), has raised $15 million in a pre-launch multi-tranche funding round co-led by Generative Ventures and Borderless Capital.","Spartan Group, HV Capital, CMCC Global, Animoca Brands, Moonrock Capital, Fundamental Labs, TRGC, DWF Labs, Crit Ventures, Cogitent Ventures, NGC Ventures, Agnostic Fund, Altana Wealth, also participated in the round, among others.&nbsp;","The funding will be used to expand peaq’s ecosystem of more than 20 DePINs in areas including multi-chain machine IDs, AI agents and data verification, according to a statement shared with The Block.","More specifically, the capital will be allocated toward developing peaq’s Modular DePIN functions and SDK, enabling DePIN projects to build and deploy their applications on peaq more efficiently.","DePIN protocols are one of the newest growth niches for the crypto industry. DePINs leverage token incentives, composable with the broader DeFi ecosystem, to help bootstrap hardware networks, offering distributed networks of computers offering services like computing power and storage.","Existing peak-based projects include Silencio, an app for measuring noise pollution with smartphones, ELOOP, a fleet of tokenized car-sharing Teslas, and Wingbits, a network of community-run antennas listening to plane location data.","“The novelty of DePINs is in linking web3 with real-world infrastructure that is productive and generates value that can provide sustainable income for the community,” Borderless Capital Partner Álvaro Gracia said.","“As we are nearing mainnet launch and public offering, this is the period that will largely define peaq’s future success,” peaq co-founder Till Wendler said. “Our plan is to further open peaq up to the community, giving it access to the tokens, and walk the extra distance to support the projects building on peaq.”&nbsp;","A public offering and token listing for peaq are expected in the coming weeks, with its mainnet launch scheduled for May. An incentivized program aimed at supporting the development and adoption of DePINs on peaq is also planned, including gamified challenges with rewards for participants.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"HV Capital","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Generative Ventures","content":"ORGANIZATION"},{"type":"Altana Wealth","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Cogitent Ventures","content":"ORGANIZATION"},{"type":"Borderless Capital Partner Álvaro Gracia","content":"ORGANIZATION"},{"type":"NGC Ventures","content":"ORGANIZATION"},{"type":"SDK","content":"ORGANIZATION"},{"type":"Till Wendler","content":"PERSON"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Borderless Capital","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"Moonrock Capital","content":"ORGANIZATION"},{"type":"Crit Ventures","content":"ORGANIZATION"}],"hashtag":[],"authors":["James Hunt","The Block"]}