{"summary":"Acting Comptroller of the Currency Michael Hsu sees less urgency in crypto regulations after the spring market collapse.\nSays regulators moving forward methodically to ensure they “get it right.” ","author":["Colin Wilhelm","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168311\/urgency-to-draft-u-s-crypto-regs-has-slowed-since-market-collapse-top-banking-regulator-says","publishDate":"2022-09-07T10:41:35","id":826,"type":null,"title":"Urgency to draft U.S. crypto regs has slowed since market collapse, top banking regulator says","category":["Policy"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A top U.S. official says American financial regulators are moving with less urgency in drafting new digital asset regulations due to the current crypto winter.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Acting Comptroller of the Currency Michael Hsu, the current head of one of the U.S. federal banking regulatory agencies, told a gathering of bankers in New York that he sees the collapse of digital asset market prices as granting regulators more “time to get it right.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“This industry was growing extremely rapidly and there was a lot of intense curiosity and questions,” Hsu told the annual Bank Policy Institute conference. Then the Terra collapse “sparked contagion” in the markets, and in the aftermath of the collapse, the amount of interest the regulator has seen in digital assets from the banking industry began to cool. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Hsu said that an interagency regulatory process to create broader ground rules for banks to interact with cryptocurrencies remains active, but at a slower pace. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“The general road map is the same. But now there’s a little more breathing space to get that right,” said Hsu. “If it can be safe, sound, and fair, it will happen, and we want it to happen. But it’s got to be there, and for those that are in that industry, there are a lot of red flags for what’s going on.” <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Hsu added that regulators had to be conscious of the fact that “crypto is a very hype-driven thing,” and that they should avoid the appearance that they are endorsing or promoting it while talking about how to regulate it. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">After his talk, a banking industry representative pressed Hsu about a Securities and Exchange Commission <a href=\"https:\/\/www.sec.gov\/oca\/staff-accounting-bulletin-121\" data-v-f87c67ca=\"\">guidance memo<\/a> issued earlier this year pertaining to custody of digital assets and how to account for crypto-related business. The questioner said the guidance discourages most banks from participating in cryptocurrency custody. Hsu declined to comment directly on the work of another regulatory agency but cautioned that custody for cryptocurrencies is more complicated than for other securities. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Custody for crypto is different than custody for other assets,” Hsu asserted, because of the keys that have to be handled for digital wallets, and the decentralized approach of blockchains. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“It’s not that it can’t be solved, It requires a lot of careful thought,” Hsu added.<\/span>"],"hashtag":[]}