{"summary":"A judge has denied two motions from former OpenSea employee Nathaniel Chastain in his ongoing wire fraud case.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179740\/opensea-employee-loses-motion-to-strike-the-term-insider-trading","publishDate":"2022-10-25T12:42:31","id":8263,"type":null,"title":"OpenSea employee loses motion to strike the term &#x27;insider trading&#x27;","category":["POLICY"],"content":["A judge in the Southern District of New York has declined to strike the term \"insider trading\" and suppress evidence from an FBI raid in the fraud case against the former OpenSea product manager accused of illegally using his position to make a profit on the posting of non-fungible tokens to the platform.","Nathaniel Chastain filed to strike the term \"insider trading\" from the indictment against him and bar the Justice Department from further using the term in a Sept. 30 filing, claiming it was, \"inflammatory, unduly prejudicial, and irrelevant to the crimes charged,\" in his argument.&nbsp;","Judge Jesse Furman also denied Chastain's motion to suppress evidence that came from an FBI search of his home. The defendant argued that the search violated his Fourth Amendment right against unreasonable search and seizure and Fifth Amendment right against self-incrimination due to the way the search was conducted.&nbsp;","The DOJ's case contends that Chastain turned a profit on NFTs he knew would be listed on OpenSea's homepage due to his position at the firm, essentially profiting on insider information. While the alleged activity is similar to the securities violation of insider trading, the DOJ levied wire fraud charges against him due to uncertainty over whether an NFT constitutes a security, though prosecutors maintain he committed acts similar to insider trading.&nbsp;","A third motion to <a href=\"https:\/\/www.theblock.co\/post\/174566\/opensea-employee-accused-of-fraud-wants-to-subpoena-the-nft-marketplace\" data-v-f87c67ca=\"\">subpoena OpenSea<\/a> remains open. Chastain wants documents from his former employer that he says could show that executives were aware of the activity, and whether the information he allegedly used to turn a profit is considered \"property\" of OpenSea.&nbsp;","Furman's order said he would further explain the reasons for the denials at a Thursday conference. That conference will also set the schedule and length for a future trial.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sept. 30","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"Chastain","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Jesse Furman","content":"PERSON"},{"type":"FBI","content":"ORGANIZATION"},{"type":"Nathaniel Chastain","content":"PERSON"}],"hashtag":["OPENSEA"],"authors":["Aislinn Keely","The Block"]}