{"summary":"Fuel Labs is planning the upcoming mainnet of its Rollup OS, featuring parallel transaction execution and FuelVM.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278351\/fuel-labs-rollup-os-mainnet-q3","publishDate":"2024-02-21T11:00:03","id":8266,"type":null,"title":"Fuel Labs unveils &#x27;Rollup OS&#x27; strategy ahead of Q3 2024 mainnet release","category":["LAYER 2S AND SCALING"],"content":["Fuel Labs, the developer of the optimistic rollup project Fuel V1, today announced the evolution of the project into the “Rollup OS” ahead of its mainnet release in Q3 2024. The transition to an “operating system” is specifically aimed at addressing critical limitations in current rollup architectures on Ethereum, according to a statement.","With the mainnet launch later this year, Fuel will introduce a purpose-built virtual machine designed to improve performance for Ethereum rollups (developed using the platform) by enabling parallel transaction execution, allowing multiple transactions to be processed concurrently.&nbsp;","The project will also use state minimization techniques to combat state bloat — referring to the ever-increasing accumulation of data that must be entirely stored and managed by nodes in a blockchain to ensure proper chain validation and state transitions. These state minimization techniques will also aid in enhancing performance for rollups.","Such offerings, Fuel claims, will allow Fuel-powered rollups to scale — inheriting Ethereum-level security while maintaining the lowest node operation overheads.","“As rollups mature, it’s clear that an operating environment optimized for their unique requirements is a non-negotiable next step. Fuel is that evolution: the ‘Rollup OS’ solves critical bottlenecks, future-proofing both rollup technology and the Ethereum ecosystem,” said Nick Dodson, CEO and co-founder of Fuel Labs.","The Ethereum Layer 2 ecosystem has been increasingly pivoting towards modularity, allowing rollups and other chains to utilize separate platforms for individual tasks such as data availability, consensus and execution.","Initially launched as a Layer 2 optimistic rollup on Ethereum in 2020, Fuel evolved into a more modular approach — acting as an execution layer for various blockchain configurations like rollups.","Fuel Network offers a modular execution layer (a blockchain focused on handling transactions), offering parallel transactions achieved through the <a href=\"https:\/\/www.theblock.pro\/research\/fuelvm-an-alternative-to-the-ethereum-virtual-machine-156527\" data-v-f87c67ca=\"\">FuelVM<\/a>, an alternative to the Ethereum Virtual Machine.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Nick Dodson","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","PROTOCOLS","SIDECHAINS"],"authors":["Vishal Chawla","The Block"]}