{"summary":"Anatomy of a rug: Hydrogen and its CEO, Michael Kane, must pay $2.8 million for their role in the sale of a worthless token that should have been registered as a security.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227950\/hydro-hydrogen-michael-kane-tyler-ostern-internal-messages","publishDate":"2023-04-25T05:23:55","id":8269,"type":null,"title":"Hydro internal messages describe pump-and-dump for a worthless token","category":["LEGAL"],"content":["Hydrogen, a platform that offered a token called hydro that was supposed to grant holders the ability to build apps and businesses on a set of “Hydro protocols” on the Ethereum blockchain, has been <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.587007\/gov.uscourts.nysd.587007.20.0.pdf\" data-v-f87c67ca=\"\">forced to pay $2.8 million in fines and damages after an enforcement action by the U.S. Securities and Exchange Commission<\/a>.","The settlement, which received <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.587007\/gov.uscourts.nysd.587007.20.0.pdf\" data-v-f87c67ca=\"\">a final judgment from a New York federal district court<\/a> judge on April 20, also requires former Hydrogen Chief Executive Michael Kane to pay $260,000 in fines and interest.","It follows <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.587007\/gov.uscourts.nysd.587007.7.0.pdf\" data-v-f87c67ca=\"\">a final judgment in September last year<\/a> in which Tyler Ostern, the former CEO of Moonwalkers, a company that acted as a \"market maker\" for newly issued tokens, was forced to pay $42,000 after he was accused of manipulating the market by using a bot that issued multiple buy and sell orders, often canceling them before they were executed, to fake the appearance of robust trading in hydro.","The case is just the latest in <a href=\"https:\/\/www.cornerstone.com\/wp-content\/uploads\/2023\/01\/SEC-Cryptocurrency-Enforcement-2022-Update.pdf\" data-v-f87c67ca=\"\">more than 127 actions since 2013<\/a> in which the SEC has made the argument that standard crypto marketing and trading activity is the equivalent of issuing unregistered securities.","The parts of SEC v. Hydrogen Technology Corp. that will be of most interest to crypto companies are the sections in the complaint that describe how the SEC regards routine token launch activity. It says that bounty programs (where users must complete a marketing task to receive free tokens), employee compensation and sales on secondary markets, should all have been registered as securities. Failing to register the sale of a security with the SEC is against the law.","“The hydro distributed by Hydrogen and Kane through the bounty programs, employee compensation and sales in the crypto asset trading market, including through Ostern, were offered and sold as investment contracts, and therefore were securities whose offer or sale required registration with the SEC unless an exemption from registration was available. Hydrogen and Kane did not file a registration statement with the SEC for their offers or sales of hydro, and no exemption from registration was available,” the complaint states.","The company considered launching as an <a href=\"https:\/\/www.theblock.co\/linked\/79838\/john-mcafee-sec-lawsuit-ico\" data-v-f87c67ca=\"\">initial coin offering<\/a>, but decided against that to avoid “causing SEC problems,” according to the complaint. Instead, a majority of the tokens were allocated to employees, developers and Hydrogen’s own treasury. An airdrop was then planned in hopes of creating a broad market into which the company and its executives could sell their tokens.","Hydro was listed on 17 different platforms and exchanges: “Hydrogen and Kane used a strategy of listing hydro on as many low-trading volume platforms as possible in order to able to eventually have hydro listed on larger-volume and more-established trading platforms,” the complaint says.","With that done, Kane and Hydrogen began selling their tokens while Moonwalkers’ bot began buying them. The SEC quotes from their internal conversations, which describe a classic pump-and-dump scheme:","For example, on October 11, 2018, just days after the hydro market manipulation began, Ostern told Kane that he was “starting off slow, trying to keep the sell pressure minimal until [he could] build enough capital to really get the market moving upward” and indicated that they would “have plenty of excuses to pump price and sell into the FOMO [fear of missing out] guys down the road.” Two weeks later, Ostern told Kane about his “volume shenanigans” on a popular, high-volume crypto asset trading platform, and bragged that it had taken his bot “about 3 seconds” to generate the illusion that “a million” hydro tokens had been bought and sold — “[a]round half” of which Ostern admitted was “fake.”","Worse, although Hydrogen marketed hydro as having the ability to become an \"API key\" to a non-blockchain business built on one of the Hydro platforms' on-chain apps, it turned out to have no functionality at all, according to the SEC:","… as Kane acknowledged in a private communication with Ostern in late January 2019, Hydrogen’s “API clients” were not required to use hydro in any part of the Hydrogen platform. Ostern replied, “Oh really? So everything is fiat [currency] and the token has no real utility?” — to which Kane responded, “not right now...”","The company made $2.2 million in profit from the scam.","Another giveaway that Hydrogen knew it should have registered hydro with the SEC was Kane’s skittishness about whether hydro actually provided any value or not. The complaint says that Kane told one Hydrogen board member that hydro “WILL have value.” Then, in a February 17, 2018, email, the same board member wrote to Kane: “[a]s everyone has acknowledged that these digital assets [hydro] may accrete in value over time, your contention that this [the airdrop] was merely a software delivery is tenuous.”","“A few days later, at a Hydrogen board meeting, the same investor and board member insisted several times that it was ‘ridiculous’ for Hydrogen to continue to claim hydro tokens had no value.”","Here's Hydrogen's internal chart showing how it saw the legal risks of launching its token:","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kane","content":"PERSON"},{"type":"Ostern","content":"PERSON"},{"type":"$2.2 million","content":"MONEY"},{"type":"Tyler Ostern","content":"PERSON"},{"type":"SEC v. Hydrogen Technology Corp.","content":"ORGANIZATION"},{"type":"September last year","content":"DATE"},{"type":"April 20","content":"DATE"},{"type":"$260,000","content":"MONEY"},{"type":"October 11, 2018","content":"DATE"},{"type":"January 2019","content":"DATE"},{"type":"Ostern","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Hydrogen","content":"ORGANIZATION"},{"type":"$42,000","content":"MONEY"},{"type":"Michael Kane","content":"PERSON"},{"type":"$2.8 million","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"February 17, 2018","content":"DATE"},{"type":"Moonwalkers","content":"ORGANIZATION"}],"hashtag":[],"authors":["Jim Edwards","The Block"]}