{"summary":"The GameFi market cap has increased by over 6% in the past 24 hours, outperforming the rest of the cryptocurrency sector.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281636\/gamefi-market-cap-outperforms-combined-crypto-sector-in-past-24-hours","publishDate":"2024-03-11T10:39:00","id":827,"type":null,"title":"GameFi market cap outperforms combined crypto sector in past 24 hours","category":["MARKETS"],"content":["The GameFi market cap has increased by over 6% in the past 24 hours, outperforming the rest of the cryptocurrency sector, which has risen by 2.2% in the same period. The total value of tokens associated with web3 gaming now stands at $32.7 billion, according to CoinGecko <a href=\"https:\/\/www.coingecko.com\/en\/categories\/gaming\" data-v-f87c67ca=\"\">data<\/a>.","In the past 24 hours, GameFi tokens such as Gala have rallied by over 3%, according to <a href=\"https:\/\/www.theblock.co\/prices\" data-v-f87c67ca=\"\">The Block's Prices Page<\/a>. Gala acts as a medium of exchange for in-game purchases and voting rights within the Gala Games community.","However, when we pull back to the monthly view, the rally in web3 gaming becomes more pronounced. In the past 30 days, Gala has increased by 228%, The Sandbox's Sand token has gained 91%, and Axie Infinity's&nbsp;AXS has spiked 71%.","<span data-v-f87c67ca=\"\">Gala token prices have increased by over 3% in the past 24 hours. Image: The Block.<\/span>","According to Nansen analyst Edward Wilson, the out-performance indicates that significant investor activity is moving out along the risk curve. \"As the market begins to heat up, investors seek higher yields beyond major cryptocurrencies such as bitcoin and ether,\" Wilson told The Block.","Major tokens associated with the AI-related cryptocurrency sub-sector have also posted substantial gains in the past week. RNDR, the native token of <span data-v-f87c67ca=\"\">Render, a platform that helps artists access computing power for rendering generative AI artwork, has<\/span><span data-v-f87c67ca=\"\"> gained over 64% in the past week and is now <\/span><a href=\"https:\/\/www.theblock.co\/price\/248420\/render-rndr-usd\" data-v-f87c67ca=\"\">trading<\/a> at $11.99.","<span data-v-f87c67ca=\"\">Joining the recent rally of AI-related tokens is GRT, t<\/span><span data-v-f87c67ca=\"\">he native token of The Graph protocol. Its price has gained 42% in the past week to now <\/span><a href=\"https:\/\/www.theblock.co\/price\/248393\/the-graph-grt-usd\" data-v-f87c67ca=\"\">trade<\/a> at $0.44. GRT's price has increased by 164% in the past month.","The&nbsp;<a href=\"https:\/\/www.theblock.co\/indices\/top\/277090\/gmci-30-gm30\" data-v-f87c67ca=\"\">GM 30 Index<\/a>, representing a selection of the top 30 cryptocurrencies, has increased by 2.76% to 156.67 in the past 24 hours.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"GM","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"91%","content":"PERCENT"},{"type":"3%","content":"PERCENT"},{"type":"past 30 days","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2.76%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"228%","content":"PERCENT"},{"type":"64%","content":"PERCENT"},{"type":"42%","content":"PERCENT"},{"type":"2.2%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"71%","content":"PERCENT"},{"type":"Wilson","content":"PERSON"},{"type":"$32.7 billion","content":"MONEY"},{"type":"$11.99","content":"MONEY"},{"type":"Edward Wilson","content":"PERSON"},{"type":"164%","content":"PERCENT"},{"type":"Nansen","content":"ORGANIZATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"$0.44","content":"MONEY"}],"hashtag":["CRYPTO MOVERS"],"authors":["Brian McGleenon","The Block"]}