{"summary":"Binance’s BNB tokens will soon be purchasable on Switzerland’s biggest stock exchange as an exchange-traded product (ETP).  The cryptocurrency exchange","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/43304\/bnb-can-now-be-traded-on-swiss-six-exchange-as-etp","publishDate":"2019-10-15T03:00:20","id":8273,"type":null,"title":"BNB can now be traded on Swiss SIX exchange as ETP","category":["EXCHANGE TOKEN"],"content":["<span data-v-f87c67ca=\"\">Binance’s BNB tokens will soon be purchasable on Switzerland’s biggest stock exchange as an exchange-traded product (ETP).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The cryptocurrency exchange has partnered with Switzerland-based ETP issuer Amun to launch the BNB ETP (ABNB). The trading of ABNB starts on Tuesday and it is available on the SIX Swiss Exchange, which Amun has been working with to launch several crypto ETP products.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">An ETP is publicly-traded security that tracks an underlying financial instrument or index. In the case of ABNB, the product is tracking the price of BNB, the native token of Binance Chain. By wrapping BNB within a financial structure that is widely available in traditional asset classes, Binance and Amun hope to appeal to the wider retail market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Our partnership with Amun in launching the BNB ETP will provide investors with a new and regulated asset class with a unique dimension to utility tokens, making them more accessible and reliable through a traditional financial infrastructure,” said Binance CEO Changpeng Zhao \"CZ\" in a statement. “This will provide traditional investors access with diversified exposure and segue into the global cryptocurrency market and its innovative products.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">There have been controversies in the past surrounding whether BNB is a security. Potentially due to regulatory concerns, the exchange even quietly <\/span><a href=\"https:\/\/www.theblockcrypto.com\/daily\/19958\/binance-quietly-removed-some-wall-street-jargon-from-its-tokens-white-paper\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">changed<\/span><\/a><span data-v-f87c67ca=\"\"> some language in its token white paper in April.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the company statement, Binance stressed that BNB, instead of a security, is a utility token that has more than 120 use cases. However, ABNB, as an ETP, is a security, meaning that investors can now “buy into the Binance eco-system” with ABNB without directly holding BNB, according to Amun CEO Hany Rashwan.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“On my end, our ETPs are securities - they are securities by design. That doesn’t have any weighing on what BNB is, you can securitize non-security,” said Rashwan.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A BNB ETP may also further solidify BNB’s dominance in exchange token market. According to The Block’s <a href=\"https:\/\/www.theblockresearch.com\/despite-a-recent-40-decline-exchange-tokens-are-still-up-about-200-in-2019-42894\" data-v-f87c67ca=\"\">research<\/a>, the market cap of exchange tokens has grown by 255% to $5.5 billion since the beginning of the year, with Binance leading the pack and contributes over 49.4% of the total market cap. With ABNB available on the Swiss stock exchange, BNB may pick up additional traction from the retail and European market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We are so excited to partner up with the world’s largest crypto exchange and make their native token accessible to institutional and retail investors in a secure, affordable, and regulated Swiss exchange-traded product,” said Rashwan in the statement.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hany Rashwan","content":"PERSON"},{"type":"Changpeng Zhao \"","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Rashwan","content":"PERSON"},{"type":"255%","content":"PERCENT"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Swiss Exchange","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$5.5 billion","content":"MONEY"},{"type":"49.4%","content":"PERCENT"},{"type":"ETP","content":"ORGANIZATION"},{"type":"BNB ETP","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Binance","content":"PERSON"}],"hashtag":["BINANCE","BNB"],"authors":["Celia Wan","The Block"]}