{"summary":"Flood, an Ethereum ecosystem-focused decentralized exchange aggregator, has raised $5.2 million in a seed funding round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276664\/bain-capital-crypto-flood-ethereum-funding","publishDate":"2024-02-08T09:00:04","id":8275,"type":null,"title":"Bain Capital Crypto leads $5.2 million seed round for DEX aggregator Flood","category":["VENTURE CAPITAL"],"content":["Flood, an Ethereum ecosystem-focused decentralized exchange aggregator, has raised $5.2 million in a seed funding round.","Bain Capital Crypto led the round, with Archetype and Robot Ventures participating, Flood said Thursday. The round closed in the summer of 2023, Flood co-founder and CEO Francesco told The Block, adding that it was structured as equity with token warrants. He declined to comment on valuation but said there was also a \"small\" funding round one year ago with the same investors and a few angel investors.","Francesco, a former software engineer at UMA Protocol, declined to share his and his co-founder Jan's full name. Jan is a crypto developer and the author of Neuronika, a rust machine learning library, Flood said.","As part of leading the round, <a href=\"https:\/\/www.theblock.co\/linked\/136753\/bain-capital-ventures-first-crypto-fund-560-million\" data-v-f87c67ca=\"\">Bain Capital Crypto<\/a> has one observer seat on Flood, Francesco said.","Flood is a DEX aggregator that is currently live on Arbitrum One and is planning to expand to Ethereum, Base and Optimism in the coming months.","Francesco said Flood's key unique proposition is optimal routing that fills trades mathematically at the best prices. \"Most aggregators are moving toward an RFQ [request for quote] model; we see that as a suboptimal model, as people can collude to fill trades at a bad price,\" Francesco said.","Flood users will be able to independently verify in the future that they received the best price with an easy-to-compute proof, Francesco said. \"This is similar to what is done for zero-knowledge proofs; verifying the proof is easy, but producing it is not,\" he said, adding, \"We are coming up with some custom computations.\"","Flood also operates its own DEX, FloodSwap. Flood went live last November and has seen over $1.3 million in trading volume, according to <a href=\"https:\/\/dune.com\/bidflood\/flood\" data-v-f87c67ca=\"\">a Dune data dashboard<\/a>.","Francesco said other key features of Flood include gasless and <a href=\"https:\/\/www.theblock.co\/learn\/245701\/what-is-maximal-extractable-value-mev\" data-v-f87c67ca=\"\">maximal extractable value<\/a>-free trading.","\"Flood is wholly intent-based, meaning users state their desired outcome, and fulfillers take care of executing their trades at the optimal price. This means users don't need to send transactions themselves. Instead, they just sign a message which does not require them to pay gas fees directly,\" he noted. \"And because our routing is optimal, trades on Flood don't open the door to any profitable backrunning.\"","If there is any arbitrage in the network when a Flood user trades, the Flood optimal fulfiller will try to capture it and return it to the users in the form of a \"surplus,\" Francesco said.","Flood users captured over $8,000 of surplus last month, according to the Dune dashboard.","While Flood remains focused on the Ethereum ecosystem in the short term, it is open to exploring more chains in the future, Francesco said.","There are currently six people working for Flood, and with fresh funding in place, the project plans to hire more people across business development and engineering functions, Francesco said.","<em data-v-f87c67ca=\"\">This article has been updated after Flood said Bain Capital Crypto solely led the round, with Archetype participating.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$8,000","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Neuronika","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"$5.2 million","content":"MONEY"},{"type":"UMA Protocol","content":"ORGANIZATION"},{"type":"Flood","content":"ORGANIZATION"},{"type":"$1.3 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"summer of 2023","content":"DATE"},{"type":"Bain Capital Crypto","content":"ORGANIZATION"},{"type":"Francesco","content":"PERSON"},{"type":"last November","content":"DATE"},{"type":"Robot Ventures","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["DEXS","MEV","PROTOCOLS","SEED &AMP; PRE-SEED"],"authors":["Yogita Khatri","The Block"]}