{"summary":"Leaders at the CFTC say their agency needs to be taking warnings about cryptocurrency seriously and called for rules to govern the sector. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263417\/cftc-commissioner-johnson-says-rules-are-needed-to-protect-crypto-customers-assets","publishDate":"2023-11-16T16:57:26","id":8276,"type":null,"title":"CFTC Commissioner Johnson says rules are needed to protect crypto customers&#x27; assets","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Leaders at the Commodity Futures Trading Commission say their agency needs to be taking warnings about cryptocurrency seriously and called for rules to govern the sector.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Christy Goldsmith Romero and Kristin Johnson, both Democratic CFTC commissioners, have pushed the agency to issue rules or guidance to address conflicts of interest in crypto and protect consumers over the past week.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The downfalls of FTX, Binance, Celsius and Voyager show the need to protect customers through segregating and preserving customer deposits, Johnson said on Monday at the Federal Reserve Bank of Atlanta. Therefore, the CFTC should \"immediately develop regulation\" around the custody of assets, Johnson said, adding that rules to govern crypto could come in the next few weeks.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"There is an immediate path for the CFTC to reinforce the protection of customer assets with segregation or separation of customer property rules,\" Johnson told The Block. \"These are rules that simply say you cannot commingle house money and the proprietary funds of your customers.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">LedgerX, a crypto derivatives platform formerly owned by FTX, for example, has oversight from the CFTC and so answers to the regulator about separating customer funds. LedgerX was seen as one of the few parts of FTX that remained liquid following its collapse.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Meanwhile CFTC Chair Rostin Behnam has called for clarity from Congress on how to handle spot market assets. Currently, the agency has enforcement authority when tied to fraud or manipulation and has regulatory authority just in terms of derivatives contracts and not spot markets.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Others have taken different perspectives about whether or not there is a lack of clarity,\" Johnson said. \"I won't comment on that, I'll simply say for us in the context of certain assets in the spot market, it's not clear.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">In her speech, Johnson also noted that the CFTC will take \"important first steps introducing market structure reforms\" in both the crypto and voluntary carbon markets in the next few weeks.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"These critical reforms will establish customer property protections in non-intermediated clearing markets (a reform that is increasingly important as market participants seek to adopt this approach to offer leveraged, crypto-products to retail investors) and long-awaited guidance on voluntary carbon markets,\" Johnson said on Monday.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Commissioner Romero echoed Johnson's call for regulation in a speech on Thursday at a Consumer Federation of America's Financial Services Conference.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Following the CFTC's <a href=\"https:\/\/www.cftc.gov\/PressRoom\/SpeechesTestimony\/romerostatement062823\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">release<\/span><\/a> of a request for comment on changing a more traditional market structure of separating out entities such as an exchange or broker to a structure that would instead combine those, many commenters raised warnings about the potential risks, Romero said.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">\"T<\/span><span class=\"s1\" data-v-f87c67ca=\"\">he CFTC should take these warnings seriously and issue guidance or rules related to this market structure, as well as <\/span><span class=\"s4\" data-v-f87c67ca=\"\">coordinate with other regulators,\"&nbsp; the commissioner said.&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"Consumer Federation of America's Financial Services Conference","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Romero","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Rostin Behnam","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Johnson","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Christy Goldsmith Romero","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Federal Reserve Bank of Atlanta","content":"ORGANIZATION"},{"type":"Kristin Johnson","content":"PERSON"}],"hashtag":["CFTC","FTX"],"authors":["Sarah Wynn","The Block"]}