{"summary":"ConstitutionDAO2 is crowdfunding with NFTs in a new attempt to buy a rare copy of the U.S. Constitution. But will it work in this bear market?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192901\/constitutiondao2-selling-nfts-in-revived-bid-to-buy-us-constitution","publishDate":"2022-12-07T12:14:03","id":8288,"type":null,"title":"ConstitutionDAO2 selling NFTs in fresh bid to buy US Constitution copy","category":["CRYPTO ECOSYSTEMS"],"content":["A new group called <a href=\"https:\/\/contribute.constitutiondao2.com\/\" data-v-f87c67ca=\"\">ConstitutionDAO2<\/a> is trying to buy a copy of the U.S. Constitution, a year after the original attempt by a different group.&nbsp;","The original <a href=\"https:\/\/www.theblock.co\/post\/124288\/a-dao-is-trying-to-buy-a-rare-print-of-the-us-constitution\" data-v-f87c67ca=\"\">ConstitutionDAO<\/a> shot to fame last year as it <a href=\"https:\/\/www.theblock.co\/linked\/124720\/this-crypto-group-now-has-a-shot-at-buying-a-rare-copy-of-the-us-constitution\" data-v-f87c67ca=\"\">raised $47 million<\/a> to buy a copy via auction house operator Sotheby’s. Yet it was <a href=\"https:\/\/www.theblock.co\/linked\/124872\/crypto-group-loses-bid-to-buy-rare-us-constitution-copy-in-record-breaking-sothebys-auction\" data-v-f87c67ca=\"\">outbid<\/a> by Citadel CEO Ken Griffin, who was aware of how much money the DAO had raised for its bid.&nbsp;","After the bid failed, the original team stepped down from the project and a separate team was voted in by token holders to take up the mantle. Called PeopleDAO, the new team is running the latest attempt. The group is crowdsourcing with NFTs instead of tokens this time around, with some of the fundraising amounts kept private in the hope that it can avoid another usurping.","“ConstitutionDAO2 wants to buy the printing from Sotheby's so that it can start a collection of civic artifacts that are totally run by the people,\" the project <a href=\"https:\/\/twitter.com\/WAGBTC\/status\/1600327983402811392\" data-v-f87c67ca=\"\">said<\/a> on Twitter. \"We are going to teach the world about democratic innovations found in history and on web3.”&nbsp;","This copy of the U.S. Constitution is also <a href=\"https:\/\/www.sothebys.com\/en\/articles\/sothebys-to-auction-one-of-only-two-first-printings-of-the-u-s-constitution-remaining-in-private-hands\" data-v-f87c67ca=\"\">on sale<\/a> at Sotheby’s. It’s one of only two first prints of the Constitution in private hands, according to the auction house, and one of only 13 copies to exist. The sale will take place on Dec. 13. The last copy of the Constitution sold for $43.2 million.","Working with PeopleDAO on this latest attempt are Nucleo, Juicebox and Aztec Network. Juicebox is the crowdfunding platform that was used by the original ConstitutionDAO and allows anyone to contribute funds to the project in cryptocurrency, rewarding them with the selected NFTs.&nbsp;","<span data-v-f87c67ca=\"\">The rare copy of the U.S. Constitution. Image: Sotheby's.<\/span>","Nucleo and Aztec Network are two privacy-focused crypto projects that are supporting the ability for people to fund the project privately. This should help to hide how much the project has raised in total, giving it a fairer chance at the auction.","Yet while ConstitutionDAO has improved some aspects of its fundraising strategy, it's raising funds in a drastically different market. Last time, the crypto market cap was near all-time highs of $2.9 trillion, tokens were at their peak overblown valuations and everyone was flush with cash. Between then and now, there’s been the <a href=\"https:\/\/www.theblock.co\/post\/146762\/luna-supply-soared-to-6-5-trillion-coins-before-terras-latest-halt\" data-v-f87c67ca=\"\">implosion of Luna<\/a>, the collapse of crypto exchange FTX and widespread <a href=\"https:\/\/www.theblock.co\/category\/bankruptcy\" data-v-f87c67ca=\"\">bankruptcies.<\/a>","“Given they’re required to raise a dollar amount in ETH and ETH is roughly a third of the value it was back then, they will need to raise more ETH,” said pseudonymous crypto trader Hedgedhog, founder of Fisher8 Capital and co-founder of eGirl Capital. They added that raising more ETH in this sort of market is fairly impossible.","“It's also more likely that anyone holding ETH still is a long-term believer of ETH and less of a speculator of NFTs,” they said.","Hedgedhog said the use of NFTs instead of tokens shouldn't matter, as the rise of NFT pools provides a level of liquidity that didn't exist in the past.","“I think the number of contributors to the campaign could be similar as they have already built a community, however the dollar amount will be significantly smaller than the previous effort due to the market,” said James Ross, a managing director at Hype Partners who has worked on 20 KickStarter and equity campaigns.","So far, ConstitutionDAO2 has raised 14.9 ETH ($18,500) in public contributions, while the amount of private contributions is unknown. There have been 97 contributions so far, and the crowdfunding campaign ends on the day of the auction.","Following the announcement of ConstitutionDAO2 and news that it’s favoring NFTs instead of its token called PEOPLE, the price of the token dropped 4%. One token is currently worth $0.025, down from all-time highs of $0.16.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aztec Network","content":"ORGANIZATION"},{"type":"Sotheby’s","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Sotheby","content":"ORGANIZATION"},{"type":"James Ross","content":"PERSON"},{"type":"Hype Partners","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$2.9 trillion","content":"MONEY"},{"type":"4%","content":"PERCENT"},{"type":"KickStarter","content":"DATE"},{"type":"Hedgedhog","content":"PERSON"},{"type":"Dec. 13","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Luna","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Citadel","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$43.2 million","content":"MONEY"},{"type":"Sotheby's","content":"ORGANIZATION"},{"type":"$0.025","content":"MONEY"},{"type":"$0.16","content":"MONEY"},{"type":"$47 million","content":"MONEY"},{"type":"Ken Griffin","content":"PERSON"},{"type":"$18,500","content":"MONEY"}],"hashtag":["AUCTION HOUSES","DECENTRALIZED INFRASTRUCTURE","GOVERNANCE VOTES","SMART CONTRACTS"],"authors":["Tim Copeland","The Block"]}