{"summary":"A proposal from the dYdX team asked the community to consider and vote on the formation an autonomous Operations SubDAO.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182829\/dydx-introduces-proposal-for-autonomous-subdao-based-infrastructure","publishDate":"2022-11-03T16:44:09","id":8289,"type":null,"title":"dYdX introduces proposal for autonomous subDAO-based infrastructure","category":["GOVERNANCE"],"content":["<span data-v-f87c67ca=\"\">A proposal from the dYdX team invited the community to consider the creation of an Operations subDAO.<\/span>","<span data-v-f87c67ca=\"\">If created, the Operations SubDAO could introduce parameters for the creation of additional subDAOs.<\/span>","<span data-v-f87c67ca=\"\">The decentralized autonomous organization attached to the dYdX derivatives protocol could see the formation of a number of autonomous subDAOs with infrastructure changes, the foundation proposed in an <\/span><a href=\"https:\/\/dydx.foundation\/blog\/a-take-on-the-dydx-daos-near-future\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announcement<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">The prospective roadmap comes in anticipation of the launch of dYdX V4, slated for the third quarter of 2023, and builds on the organization’s previous steps toward fully decentralizing the protocol, the foundation said. <\/span><span data-v-f87c67ca=\"\">Proposed for community consideration is an Operations subDAO that would complement a previously established dYdX Grants Program that, through an eight-person multi-signature trustee committee, oversees control over some 5,401,080 DYDX tokens (~$5.4 million).<\/span>","<span data-v-f87c67ca=\"\">Listed among the potential Operations subDAO’s responsibilities are the creation of a bank payment system, facilitation and maintenance of DAO communication, and the building of relationships with vendors and service providers. T<\/span><span data-v-f87c67ca=\"\">he Operations subDAO would also create a framework for the future creation and management of subDAOs, and in time form a year-round, 24\/7 dYdX user support service.<\/span>","<span data-v-f87c67ca=\"\">To advance the suggested initiative, dYdX community members must vote to form the subDAO and decide on resource allocation to accommodate the associated costs.<\/span>","<span data-v-f87c67ca=\"\">In October, dYdX <\/span><a href=\"https:\/\/www.theblock.co\/post\/175875\/dydx-hires-former-consensys-director-as-foundation-ceo\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">hired<\/span><\/a><span data-v-f87c67ca=\"\"> former ConsenSys director Charles d’Haussy as CEO, whose objectives include expanding the dYdX DAO ecosystem, community, and protocol in general. <\/span><span data-v-f87c67ca=\"\">MakerDAO last month passed a vote to fragment its autonomous infrastructure into MetaDAOs, similar to dYdX’s proposal. The decision came amidst contention that MetaDAO founder Rune Christensen <\/span><a href=\"https:\/\/www.theblock.co\/post\/180991\/maker-founder-uses-influence-to-pass-vote-that-breaks-up-the-dao\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">influenced<\/span><\/a><span data-v-f87c67ca=\"\"> the ultimate outcome.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Charles d’Haussy","content":"PERSON"},{"type":"third quarter of 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$5.4 million","content":"MONEY"},{"type":"Rune Christensen","content":"PERSON"},{"type":"October","content":"DATE"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}