{"summary":"New York Attorney General Letitia James filed a petition against cryptocurrency exchange CoinEx on Wednesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214174\/new-york-attorney-general-sues-coinex-crypto-exchange-over-registration","publishDate":"2023-02-22T17:43:26","id":8290,"type":null,"title":"New York Attorney General sues CoinEx crypto exchange over registration","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">New York Attorney General Letitia James is suing cryptocurrency exchange CoinEx for allegedly failing to register with the state. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“CoinEx offered, sold, purchased and effected transactions in cryptocurrencies that are commodities and securities, without having been registered as a commodity broker dealer and a securities broker or dealer in New York,” according to a petition filed in the Supreme Court of the State of New York on Wednesday. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">New York has been an active player in the crypto space with lawsuits against others, including Alex Mashinsky, the former CEO of <a href=\"https:\/\/www.theblock.co\/post\/199522\/new-york-sues-former-celsius-ceo-for-fraud\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">crypto lender Celsius<\/span><\/a> and in the past, <a href=\"https:\/\/ag.ny.gov\/press-release\/2021\/attorney-general-james-ends-virtual-currency-trading-platform-bitfinexs-illegal\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">actions<\/span><\/a> against Bitfinex and Tether.&nbsp;<\/span><span class=\"s1\" data-v-f87c67ca=\"\">The petition alleged that CoinEx “represented itself as an exchange” while not being registered with the state. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The exchange also failed to comply with a subpoena served in January, according to the petition. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The attorney general said some of the crypto offered by CoinEx counted as commodities and securities under the Martin Act, a New York securities law, because “they represent investments of money in common enterprises with profits to be derived primarily from the efforts of others”.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The attorney general’s office listed four tokens that included AMP, the LBRY token (“LBC”), LUNA and the Rally (“$RLY”). The p<\/span>etition seeks to stop CoinEx from engaging in unauthorized activities in state and wants to have New York IP addresses blocked from using exchange.","<span class=\"s1\" data-v-f87c67ca=\"\">&nbsp;James is also seeking &nbsp;“a full accounting of New York accounts and all fees received from New York customers.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">CoinEx did not immediately respond to a request for comment. &nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"Rally (","content":"ORGANIZATION"},{"type":"Letitia James","content":"PERSON"},{"type":"AMP","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"January","content":"DATE"},{"type":"$RLY","content":"MONEY"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"the Supreme Court of the State of New York","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}