{"summary":"The rule change removes a barrier for corporations in diversifying their treasury holdings into bitcoin, Sazmining COO Kent Halliburton said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253631\/bitcoin-fair-value-accounting-rules-sazmining-coo","publishDate":"2023-09-29T11:43:32","id":8300,"type":null,"title":"Bitcoin accounting rules &#x27;hugely positive&#x27; for adoption: Sazmining COO","category":["COMPANIES"],"content":["New fair value accounting rules will be \"hugely positive\" for corporate bitcoin adoption, removing a barrier in diversifying treasury holdings into the digital asset, according to Sazmining President and COO Kent Halliburton.","\"Michael Saylor held a symposium for corporate leaders looking to add bitcoin to their balance sheet in 2021,\"&nbsp;Halliburton told The Block in a recent interview. \"That so many showed up is a testament to corporate interest. But it was clear from the symposium that the accounting rules for bitcoin were prohibitive for adoption.\"","The Financial Accounting Standards Board, a U.S. regulating body that sets general accounting practices, recently <a href=\"https:\/\/www.theblock.co\/post\/249557\/accounting-regulator-will-let-firms-report-crypto-at-fair-market-value-bloomberg-law\" data-v-f87c67ca=\"\">approved the new rules<\/a> allowing companies to report their crypto holdings at fair market value. The rules will be published by the end of 2023 and become active in 2025, but companies can apply the rules early, Bloomberg Law <a href=\"https:\/\/news.bloomberglaw.com\/crypto\/long-awaited-bitcoin-accounting-rules-to-capture-rises-dips\" data-v-f87c67ca=\"\">reported<\/a> earlier this month.","While the new accounting method won’t address concerns on bitcoin's price volatility, it does mean that corporations wanting to add bitcoin to their balance sheets can reflect bitcoin's upward and downward price action, Halliburton added. Previously, it was only measured at impairment, adjusting for when the price went down but not up, whereas fair market value describes an asset's most recent valuation.","With this \"accounting stigma\" removed, Halliburton argued corporations now have the same incentives as individuals to hold bitcoin. \"I see corporations diversifying a portion of their treasury holdings into bitcoin from dollars as a result in the same way individuals are doing so,\" he said.","Whether or not corporations will adjust their strategies toward holding bitcoin on their balance sheet before the rules become active will depend on bitcoin's price action, the Sazmining COO added. \"Corporations also feel fear of missing out and if they start to believe that a bull run is around the corner, I can see more aggressive corporations acquiring bitcoin ahead of the rules activating in 2025.\"&nbsp;","In terms of the specific impact on Sazmining and other bitcoin miners, Halliburton saw the consequences as quite promising. \"Since bitcoin has an immutably fixed supply, adoption inevitably increases the price over time. A second order consequence for higher prices is more profitable mining,\" he said.","Notably, NFTs and wrapped tokens, allowing crypto assets from one blockchain to be used on another, are exempt from the accounting rule change. As are stablecoins, that, theoretically, shouldn’t change in value.","Halliburton attributed this to bitcoin's classification as a commodity by the Commodity Futures Trading Commission, a distinction not shared by NFTs and wrapped tokens.","Since adopting its bitcoin acquisition strategy in 2020, business intelligence company MicroStrategy reported <a href=\"https:\/\/www.theblock.co\/post\/249557\/accounting-regulator-will-let-firms-report-crypto-at-fair-market-value-bloomberg-law\" data-v-f87c67ca=\"\">$2.23 billion of cumulative impairment losses<\/a> and is a <a href=\"https:\/\/www.theblock.co\/post\/231716\/microstrategy-supports-proposed-new-accounting-rules-for-crypto\" data-v-f87c67ca=\"\">strong proponent<\/a> of the new rules it long pushed for, first <a href=\"https:\/\/www.theblock.co\/post\/177149\/proposed-accounting-rules-could-benefit-companies-holding-crypto\" data-v-f87c67ca=\"\">proposed<\/a> in 2022.","\"While the current model offers a distorted picture of an entity’s crypto asset holdings that may confuse investors unfamiliar with the accounting standard it reflects, fair value accounting provides investors with the ability to make clear 'return on investment' calculations, thereby providing the basis for economic reality-driven investment decisions,\" the company wrote in May.","The largest public company holder of bitcoin <a href=\"https:\/\/www.theblock.co\/linked\/131229\/sec-rebuffs-microstrategys-non-gaap-bitcoin-accounting-approach-report\" data-v-f87c67ca=\"\">faced pushback<\/a> from the Securities and Exchange Commission in 2022 when it used non-GAAP (generally accepted accounting principles) measures to try and adjust bitcoin impairment charges.","In July, <a href=\"https:\/\/www.theblock.co\/post\/241731\/sazmining-renewable-bitcoin-mining\" data-v-f87c67ca=\"\">Sazmining expanded its operations into South America<\/a>, announcing a new bitcoin mining facility in Paraguay using surplus renewable electricity from the Itaipu Dam. The Paraguay mining center is Sazmining's second such venture after <a href=\"https:\/\/www.prweb.com\/releases\/sazmining_launches_hydroelectric_renewable_energy_bitcoin_mining_facility_in_wisconsin\/prweb19113309.htm\" data-v-f87c67ca=\"\">opening<\/a> a hydro-powered facility in Wisconsin in January.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Financial Accounting Standards Board","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"May","content":"DATE"},{"type":"Wisconsin","content":"LOCATION"},{"type":"January","content":"DATE"},{"type":"Bloomberg Law","content":"ORGANIZATION"},{"type":"Kent Halliburton","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"$2.23 billion","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"South America","content":"LOCATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Paraguay","content":"LOCATION"},{"type":"Halliburton","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"},{"type":"Itaipu Dam","content":"ORGANIZATION"}],"hashtag":["BITCOIN","MINING COMPANIES"],"authors":["James Hunt","The Block"]}