{"summary":"Crypto exchanges have been rushing to verify their reserves following the high-profile collapses of FTX and Alameda Research.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192062\/kucoin-engages-auditor-mazars-to-provide-factual-findings-report","publishDate":"2022-12-05T06:22:31","id":8302,"type":null,"title":"KuCoin engages auditor Mazars to provide factual findings report","category":["EXCHANGES"],"content":["Crypto exchange KuCoin is engaging auditor Mazars to verify its proof of reserves in a third-party factual findings report.","The firm will report on whether KuCoin's in-scope assets are collateralized, according to an <a href=\"https:\/\/www.kucoin.com\/blog\/kucoin-engages-mazars-to-conduct-third-party-proof-of-reserves\" data-v-f87c67ca=\"\">announcement<\/a> on KuCoin's official blog. Mazars aims to provide information showing KuCoin's reserves and customer liability. This will include margin and other accounts and will be focused on bitcoin, ether and the two stablecoins USDT and USDC.","\"This move is the next step in our efforts to provide transparency on our users’ funds, highlighting our commitment to transparency and strengthening industry trust,\" KuCoin CEO Johnny Lyu in an announcement. \"I always say that KuCoin is a People's Exchange where we place the safety and security of users' funds as our top priority,\" he <a href=\"https:\/\/twitter.com\/lyu_johnny\/status\/1599708746317705218\" data-v-f87c67ca=\"\">added<\/a> on Twitter.","The factual findings report is expected to be published in a few weeks.","KuCoin isn't exactly early in its efforts to provide further transparency into its operations. Industry-wide, centralized exchanges have been <a href=\"https:\/\/www.theblock.co\/post\/187240\/exchanges-rushed-to-show-proof-of-reserves-its-not-enough\" data-v-f87c67ca=\"\">rushing<\/a> to verify their proofs of reserves following the high-profile collapses of the once-leading crypto exchange FTX and its associated trading firm Alameda Research.","Crypto exchange Bitfinex <a href=\"https:\/\/www.theblock.co\/post\/186328\/bitfinex-publishes-details-of-reserves-after-rival-ftx-files-for-bankruptcy-protection\" data-v-f87c67ca=\"\">published<\/a> details of its reserves in the first half of November while rival Binance <a href=\"https:\/\/www.theblock.co\/post\/189946\/binance-releases-proof-of-reserves-system-starting-with-bitcoin\" data-v-f87c67ca=\"\">put out<\/a> its own proof-of-reserves system, starting with bitcoin, near the end of November. Most recently, crypto derivatives exchange Bitmex began <a href=\"https:\/\/www.theblock.co\/post\/191330\/bitmex-to-allow-depositors-to-self-verify-liabilities\" data-v-f87c67ca=\"\">providing<\/a> users with the ability to self-verify their liabilities in its total liability balance sheet.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"People's Exchange","content":"ORGANIZATION"},{"type":"the first half of November","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Johnny Lyu","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"}],"hashtag":[],"authors":["Adam James","The Block"]}