{"summary":"Cryptocurrency was left out of a must-pass, year-end legislative package that appropriates funds for defense.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266570\/end-of-year-us-defense-authorization-bill-leaves-out-crypto-provisions","publishDate":"2023-12-07T11:12:43","id":8308,"type":null,"title":"End-of-year US defense authorization bill leaves out crypto provisions","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The U.S. Congress released a final National Defense Authorization Act on Wednesday night, which authorizes appropriations for defense-related activities, but the package does not include any crypto or blockchain provisions, said <span class=\"s2\" data-v-f87c67ca=\"\"> Cody Carbone, vice president of policy for the Chamber of Digital Commerce.<\/span>&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The package excluded an amendment <\/span><span class=\"s2\" data-v-f87c67ca=\"\">from Sens. Cynthia Lummis, R-Wyo., Kirsten Gillibrand, D-N.Y., Roger Marshall, R-Kan., and Elizabeth Warren, D-Mass., that would have required regulators to set up examination standards for financial institutions engaged in crypto activities while also requiring the Treasury Department to come up with recommendations to Congress on crypto mixers.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Another provision would have created an independent working <a href=\"https:\/\/www.budd.senate.gov\/press-releases\/budd-gillibrand-introduce-bipartisan-financial-technology-protection-act\/\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">group<\/span><\/a> to \"combat terrorism and illicit financing.\" That bill was introduced in April by Sens. Ted Budd, R-N.C. and Gillibrand.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"We're extremely disappointed that the FY24 NDAA failed to include bipartisan and common-sense digital asset and blockchain legislation,\" Carbone said. \"This was a missed opportunity.\"&nbsp;<\/span>","Sen. Lummis said she was disappointed to see her illicit finance provision cut out of the NDAA and said Congress needs to \"pass <span class=\"s1\" data-v-f87c67ca=\"\">meaningful crypto asset legislation to provide robust consumer protections and create a well-regulated and safe crypto asset market in the United States.\"&nbsp;<\/span>","Lummis also said she planned her work to pass her bill with Sen. Gillibrand to regulate crypto.","<span class=\"s1\" data-v-f87c67ca=\"\">\"I will continue to work tirelessly to pass the Lummis-Gillibrand Responsible Financial Innovation Act to ensure the United States remains the global financial leader,\" Lummis said in an emailed statement.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Crypto legislation still faces some major headwinds in 2024 as lawmakers will try to push forward bills that would regulate stablecoins on the federal level and take a comprehensive approach to regulating crypto. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Both bills passed out of the House Financial Services committee in July, but would need to be brought to the Senate Banking Committee, which could prove to be a challenge next year.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Election season could also throw a wrench in plans, or could put crypto at the forefront. Republican presidential candidates have taken crypto stances, particularly when discussing central bank digital currencies.&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Updated at 12:30 p.m. ET to include comments from Sen. Lummis<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"Lummis","content":"PERSON"},{"type":"12:30 p.m.","content":"TIME"},{"type":"National Defense Authorization","content":"ORGANIZATION"},{"type":"Kirsten Gillibrand","content":"PERSON"},{"type":"Roger Marshall","content":"PERSON"},{"type":"Carbone","content":"PERSON"},{"type":"Ted Budd","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"House Financial Services","content":"ORGANIZATION"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Gillibrand Responsible Financial","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"N.Y.","content":"LOCATION"},{"type":"Mass.","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Cody Carbone","content":"PERSON"},{"type":"Wyo.","content":"LOCATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"night","content":"TIME"},{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"Kan.","content":"LOCATION"},{"type":"Gillibrand","content":"PERSON"},{"type":"NDAA","content":"ORGANIZATION"}],"hashtag":["ANTI-MONEY LAUNDERING"],"authors":["Sarah Wynn","The Block"]}