{"summary":"A new report from Chainalysis finds that ransomware scammers increasingly use mining pools to launder funds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234774\/ransomware-hackers-increasingly-look-to-mining-pools-for-money-laundering-chainalysis","publishDate":"2023-06-15T09:00:06","id":832,"type":null,"title":"Ransomware hackers are using mining pools to launder funds: Chainalysis","category":["LEGAL"],"content":["Ransomware criminals are increasingly using mining pools to launder illicit funds, Chainalysis said in a report released Thursday.&nbsp;","\"<span data-v-f87c67ca=\"\">Since the start of 2018, we’ve seen a large, steady increase in value sent from ransomware wallets to mining pools,\" Chainalysis said in the report, explaining what it said were sophisticated attempts to funnel funds through mining pools to avoid triggering compliance alarms at exchanges.<\/span>","The use of mining pools to launder ransomware funds surpassed that of peer-to-peer exchanges.","<span data-v-f87c67ca=\"\">Ransomware actors have been abusing mining pools since 2018, according to the blockchain forensics firm Chainalysis.<\/span>","Though more ransomware scammers look to mining pools to launder funds, crypto funds stolen during in ransomware attacks largely decreased. Cryptocurrency revenue derived from such extortions decreased 40.3% in 2022, primarily because victims are increasingly <a href=\"https:\/\/www.theblock.co\/post\/204471\/ransomware-crypto-revenue-declines-as-victims-refuse-to-pay-chainalysis\" data-v-f87c67ca=\"\">refusing<\/a> to pay.","\"Cryptocurrency mining is a crucial part of our industry, but it also holds special appeal to bad actors, as it provides a means to acquire money with a totally clean on-chain original source,\" Chainalysis wrote in the report.","\"<span data-v-f87c67ca=\"\">The first and most important fix would be for mining pools and hashing services to enact more strenuous wallet screening measures in addition to KYC, using blockchain analysis to check users’ origins of funds and reject crypto coming from illicit addresses,\" it added.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"40.3%","content":"PERCENT"},{"type":"Chainalysis","content":"PERSON"}],"hashtag":["CRIME"],"authors":["MK Manoylov","The Block"]}