{"summary":"Revenue from selling XRP is used to increase the value of a corporate entity, Ripple Labs. XRP was created as an anti-sybil mechanism for the Ripple protocol with the intention to continuously sell XRP to fund operations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/4547\/do-ripple-executives-statements-imply-that-xrp-is-a-security","publishDate":"2018-12-06T11:13:11","id":8320,"type":null,"title":"Do Ripple executives&#x27; statements imply that XRP is a security?","category":["RIPPLE"],"content":["In the slow dance between the SEC and cryptocurrencies, nothing has garnered more interest - or more confusion - than a single question: \"Is this token a security?\" Due to recent SEC enforcement and comments, the conditions required to answer that question are becoming a bit clearer. Yet, murky origins and numerous public comments ensure that it is still an opaque question in the case of Ripple and XRP.","Despite the legal uncertainty around XRP, the large investment firm Grayscale offers its customers&nbsp;the ability to gain exposure to the price movement of the asset through <a href=\"https:\/\/grayscale.co\/xrp-investment-trust\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">XRP Investment Trust<\/a>, which currently has&nbsp;$4.6M in assets under management.&nbsp;R3 recently&nbsp;<a href=\"https:\/\/www.r3.com\/news\/r3-launches-universal-corda-settler-application\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">launched Corda Settler<\/a>, an open source application that allows Corda users to settle using any payment method, with XRP&nbsp;being the first payment rail. The Ripple management team regularly <a href=\"https:\/\/ambcrypto.com\/xrapid-coming-next-month-what-do-pilot-results-say-for-future-xrp-hodlers\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">talks up pilots<\/a> of product that require the XRP token in their public statements.&nbsp;","<span data-v-f87c67ca=\"\">Given the investment in and usage of XRP, currently the 2nd largest cryptocurrency by market cap, with a value of $13.7 billion as of December 6, 2018, it is important to understand how the asset is classified. Our exploration today is simple. We assess whether XRP could qualify as a security based on what Ripple executives have said publicly in the past. This piece can be read in conjunction with <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/ripples-changing-narrative-around-the-creation-of-xrp\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">our recent exploration<\/a> of Ripple's evolving narrative around the genesis of XRP.<\/span>","<span data-v-f87c67ca=\"\">William Hinman, Director of the SEC’s Division of Corporation Finance, said <\/span><a href=\"https:\/\/www.sec.gov\/news\/speech\/speech-hinman-061418\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">in a speech in June<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;that Ethereum is a sufficiently decentralized network. As a result, current offers and sales of Ether are not securities transactions. There was a considerable amount of confusion at that time about what ‘sufficiently decentralized’ means in the eyes of the SEC.<\/span>","Recently, however, the SEC had even more to say about the concept of decentralized currencies.","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“When a store of value becomes truly decentralized - not one person or group of people control its supply or control trading or they have access to asymmetric information - we have said that that’s distributed and therefore you don’t have to re-register those transactions,\" <\/span><\/i><span data-v-f87c67ca=\"\">said&nbsp;SEC Chairman Jay Clayton at Consensus Invest in late November.<\/span>","<span data-v-f87c67ca=\"\">Clayton also said that tokens and their networks can 1) evolve from one use to another, 2) become more or less decentralized over time and 3) go from being security offerings to not being security offerings. It’s therefore possible that the sale of a token was a securities offering at the time of initial sale but has transformed into a commodity by becoming ‘sufficiently decentralized.’<\/span>","<span data-v-f87c67ca=\"\">When asked whether XRP was a security, Clayton didn’t respond directly. He did, however follow up with a statement that the SEC is open to projects of all kinds and that his door was always open. He continued by saying that the issues around whether a specific token is a security often require a lot of information in order to get to a definitive position.<\/span>","<span data-v-f87c67ca=\"\">It’s important to point out that the SEC does not make laws but rather gives guidance and enforces laws. Any of the SEC’s Commissioners and lawyers cannot say anything that’s binding. In fact, the SEC can take an enforcement action and then lose in court, which happens on a somewhat regular basis.&nbsp;<\/span>","So what are the rules of thumb in analyzing tokens as securities? <a href=\"https:\/\/www.sec.gov\/news\/speech\/speech-hinman-061418\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">According to Hinman<\/a>, we need to consider the growth of a functional network.","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“Has the promoter raised an amount of funds in excess of what may be needed to establish a functional network, and, if so, has it indicated how those funds may be used to support the value of the tokens or to increase the value of the enterprise? Does the promoter continue to expend funds from proceeds or operations to enhance the functionality and\/or value of the system within which the tokens operate?”<\/span><\/i>","<span data-v-f87c67ca=\"\">Applying this to XRP, we can look at the words of Ripple Labs themselves. Ripple Labs is and will continue to be a regular seller of XRP, while according to Ripple management, the XRP Ledger is already a functional and decentralized network (this statement has been highly <a href=\"https:\/\/github.com\/petertodd\/ripple-consensus-analysis-paper\/blob\/master\/paper.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">contested by industry experts as well<\/a>). In Q3 2018, <\/span><a href=\"https:\/\/ripple.com\/insights\/q3-2018-xrp-markets-report\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ripple Labs sold $163 million in XRP<\/span><\/a><span data-v-f87c67ca=\"\">, which accounted for 0.43% of global XRP volume.&nbsp;<\/span><span data-v-f87c67ca=\"\">Moreover, the revenue from selling XRP is further used to increase the value of Ripple Labs. Per Ripple's CTO:<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“The higher the price of XRP, the more money Ripple makes by selling XRP, the more money Ripple is worth, the more power Ripple has to incentivize partners, and so on,\" <\/span><\/i><span data-v-f87c67ca=\"\">~&nbsp;<\/span><span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.reddit.com\/r\/XRP\/comments\/7mhsdo\/difficult_question_about_xrp\/dru9dxi\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">David Schwartz<\/a>&nbsp;on December 27, 2017.<\/span>","<span data-v-f87c67ca=\"\">In 2013, OpenCoin’s (Ripple predecessor) business model and source of revenue was said to be the sale of XRP. OpenCoin’s co-founder Arthur Britto said this&nbsp;<\/span><a href=\"https:\/\/forum.ripple.com\/viewtopic.php?f=1&amp;t=3593\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">multiple<\/span><\/a> <a href=\"https:\/\/forum.ripple.com\/viewtopic.php?f=1&amp;t=3609\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">times<\/span><\/a><span data-v-f87c67ca=\"\">. When asked about OpenCoin’s business model, David Schwartz <\/span><a href=\"https:\/\/forum.ripple.com\/viewtopic.php?f=1&amp;t=1196\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">responded in 2013<\/span><\/a><span data-v-f87c67ca=\"\">: <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“We promote and develop Ripple into a massive and successful open source, decentralized payment system. Our source of revenue is the sale of XRP.”<\/span><\/i>","<span data-v-f87c67ca=\"\">[related id=1]<\/span>Further, many leaders at Ripple through the years have claimed that XRP sales were of upmost importance to the company's strategy, business plan and operations:","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“Ripple is being created by a for-profit company called OpenCoin, and that’s the company I work for. We’re sort of software producers; we’re making the protocol. Our business model is we’re keeping 25% of the XRP that exists and we’ll use that to fund operations, repay investors, pay employees; that’s our business model,\"<\/span><\/i><span data-v-f87c67ca=\"\"> said&nbsp;<\/span><span data-v-f87c67ca=\"\">Chris Larsen, co-founder and former CEO of Ripple, <a href=\"https:\/\/youtu.be\/22Cr_CD2lJw?t=3120\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">in 2013<\/a>.<\/span>","<span data-v-f87c67ca=\"\">&nbsp;<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“Ripple holds over 60 billion XRP. Given the way that's being escrowed, Ripple will almost certainly be the largest holder of XRP for the foreseeable future. For every penny the price of XRP goes up, the notional value of Ripple's XRP goes up by six hundred million dollars. Ripple can only materialize that value for its shareholders if that value and liquidity are preserved over the next several years. Sure, Ripple makes money by selling software to banks. But how many banks do you think Ripple would have to close to make six hundred million dollars in license\/support fees? That would equal the value of a sustained one cent increase in the price of XRP,\"<\/span><\/i><span data-v-f87c67ca=\"\"> <a href=\"https:\/\/bitcointalk.org\/index.php?topic=1381669.msg19780668\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">said Schwartz in 2017<\/a>.<\/span>","<span data-v-f87c67ca=\"\">One of the qualifications of a security is that there is an expectation of profits from the investment:<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“Therefore as the protocol grows, since there’s a limited amount of XRP, the value of XRP should go up, because it’s in demand by market makers,\" said Chris Larsen<a href=\"https:\/\/paymentweek.com\/2014-4-14-digging-deeper-with-ripple-the-internet-of-money-4534\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">&nbsp;in an interview in 2014.<\/a>&nbsp;<\/span><\/i>","<span data-v-f87c67ca=\"\">&nbsp;<\/span><b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">“After all, the reason we’re doing this is to increase demand for XRP to increase the value we can extract from our stash of XRP” said&nbsp;<a href=\"https:\/\/www.quora.com\/Considering-that-the-banks-dont-use-XRP-coins-for-their-transactions-how-can-the-XRP-price-go-high-even-if-the-banks-adopt-the-Ripple-platform\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Schwartz in 2017.<\/span><\/a><\/i><\/b>","<span data-v-f87c67ca=\"\">Schwartz's comments must be viewed in the context of Ripple's actions earlier in 2017. At that point, Ripple committed to placing 55 billion XRP in an escrow account to establish 55 contracts of 1 billion XRP each that will expire on the first day of every month from months 0 to 54. As each contract expires, the XRP becomes available for Ripple’s use. If Ripple wants to maximize their revenues from selling the XRP that it has available, it’s in their best interest to try to increase the price of XRP.<\/span>","<span data-v-f87c67ca=\"\">As seen in the chart below, over the past 2 years, Ripple Labs has sold over $617 million XRP in the public markets and to private institutions<\/span>","","","<span data-v-f87c67ca=\"\">When studying XRP's history and its relationship to Ripple Labs from genesis through today, it’s nearly impossible to make the argument that XRP is truly decentralized. It is clear from their own statements and actions that a group of people, in this case Ripple Labs, clearly control XRP supply and trading, while also being in possession of asymmetric information about current and future prospects for usage of the XRP token.<\/span>","<span data-v-f87c67ca=\"\">Ripple is already a functional network, yet they continue to sell XRP in quantities significantly exceeding that which was necessary to establish a functional network. XRP was created as an anti-sybil mechanism for the Ripple protocol with the intention to continuously sell XRP to fund operations, repay investors, and pay employees. As demonstrated by their own comments, Ripple is clearly incentivized to increase the value of XRP and therefore XRP holders’ investments. This is a necessity because Ripple's XRP holdings are held in escrow, and the sale of XRP is their main source of revenue.<\/span>","The Block is not in a position to determine whether XRP is or is not a security, but we present the relevant information to help inform the discussion. At the current moment, the matter of whether XRP is a security is being discussed in court. Ripple is facing a class action lawsuit&nbsp;alleging that the XRP token is a security issued by Ripple. In November, <a href=\"https:\/\/www.law.com\/therecorder\/2018\/11\/08\/ripple-labs-bumps-up-xrp-security-suit-to-federal-court\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Ripple Labs filed to consolidate<\/a> the class-action lawsuit to a federal court because: (1) there are 100 or more members; (2) any member of a class of plaintiffs is a citizen of a state different from any defendant; (3) the amount in controversy exceeds $5 million. If approved, the long controversy will likely be decided in federal court down the line. In any case, Ripple's attorneys will have their hands full in explaining the historical and recent statements of Ripple executives with respect to XRP and Ripple's relationship to the cryptocurrency.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Corda Settler","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"William Hinman","content":"PERSON"},{"type":"Jay Clayton","content":"PERSON"},{"type":"1 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"Clayton","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"$4.6","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"$13.7 billion","content":"MONEY"},{"type":"25%","content":"PERCENT"},{"type":"Consensus Invest","content":"ORGANIZATION"},{"type":"Schwartz","content":"PERSON"},{"type":"David Schwartz","content":"PERSON"},{"type":"XRP","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"},{"type":"SEC’s Division of Corporation Finance","content":"ORGANIZATION"},{"type":"0.43%","content":"PERCENT"},{"type":"XRP Investment Trust","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"December 27, 2017","content":"DATE"},{"type":"Chris Larsen","content":"PERSON"},{"type":"Ripple Labs","content":"ORGANIZATION"},{"type":"Corda","content":"ORGANIZATION"},{"type":"Hinman","content":"PERSON"},{"type":"December 6, 2018","content":"DATE"},{"type":"June","content":"DATE"},{"type":"$163 million","content":"MONEY"},{"type":"late November","content":"DATE"},{"type":"six hundred million dollars","content":"MONEY"},{"type":"$617 million","content":"MONEY"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Arthur Britto","content":"PERSON"},{"type":"one cent","content":"MONEY"}],"hashtag":["SEC","XRP"],"authors":["Larry Cermak","The Block"]}