{"summary":"The most popular NFT marketplace by number of traders stops trading of Ether.Fi&#x27;s staked-ether tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240297\/opensea-halts-trading-of-staked-ether-nfts-as-creator-calls-marketplace-unlicensed-casino","publishDate":"2023-07-18T15:11:30","id":8324,"type":null,"title":"OpenSea halts trading of staked-ether NFTs as creator calls marketplace &#x27;unlicensed casino&#x27;","category":["NFT COLLECTIONS"],"content":["Ether.Fi said Tuesday that OpenSea, the most popular digital marketplace by number of traders, has stopped the trading of its staked-ether NFTs.&nbsp;","\"We launched ether<a class=\"af my\" href=\"https:\/\/ether.fan\/\" target=\"_blank\" rel=\"noopener ugc nofollow\" data-v-f87c67ca=\"\">.<\/a>fan, which is an NFT collection backed by staked ETH,\" CEO Mike Silagadze said in an open letter published on Medium. \"By all measures it was wildly successful. We minted out all 3,000 NFTs within a day, with over 6200 ETH staked.\"","Silagadze went on to say that listings \"immediately\" began appearing on OpenSea, with Ether.Fi then directing to those listings so that they could trade.","\"Then we got hit with a gut punch. All listings on OpenSea disappeared,\" Silagadze said in the letter. \"New listings were seemingly disabled (with a cryptic error message.) We didn’t get any notice or warning. None of the many people we’d been speaking with at OpenSea had reached out. The collection was just inexplicably disabled.\"","Silagadze said OpenSea eventually replied with a \"form letter\" explanation, with the marketplace stating that it \"doesn’t allow NFT collections that 'carry out any financial activities subject to registration or licensing.'\"","When asked for comment, OpenSea told The Block it would not address \"enforcement actions\" regarding specific collections.","\"Our terms of service govern the type of content and behavior that's permissible on OpenSea,\" an OpenSea's spokesperson said by email. \"When we find collections or content to be in violation of our Terms of Service, we enforce our policy in various ways, including delisting collections and in some instances, banning accounts.\"","Silagadze said \"ether.fan NFTs are just wrapped staked ETH with a PFP.\"","Silagadze also took a decidedly contentious tone in the letter.&nbsp;","\"OpenSea has been running a de facto unlicensed casino where people engage in ruinous gambling and spend millions on pictures of monkeys and such,\" he said. \"This is all great and ok apparently, but listing a collection that actually has utility is disallowed because it has utility.\"","Ethereum stakers that use Ether.Fi are given NFT representations of every validator generated. The NFTs allow for the storage of metadata, which the company hopes developers will use to build out further staking infrastructure. The <a href=\"https:\/\/www.theblock.co\/post\/215620\/etherfi-raises-funding\" data-v-f87c67ca=\"\">company raised<\/a> a $5.3 million in February.","Silagadze appeared on CNBC last week to better explain Ether.Fi while describing what he believes sets his company apart from its competitors.","\"Lido of course is the dominant player. They are by far the largest staking player in the world ... there's certainly a huge first-mover advantage,\" he said, reiterating that his company only launched its staking mechanism last week.","\"Ether.Fi is the only staking protocol that I would describe as truly non-custodial. So in other words we are the only protocol where the stakers get to control their own keys,\" he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silagadze","content":"PERSON"},{"type":"Terms of Service","content":"ORGANIZATION"},{"type":"PFP","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"OpenSea","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"$5.3 million","content":"MONEY"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Mike Silagadze","content":"PERSON"}],"hashtag":[],"authors":["RT Watson","The Block"]}