{"summary":"Changpeng Zhao, Binance’s ex-CEO, represents a substantial risk of flight given his minimal ties with the U.S., prosecutors said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264457\/prosecutors-seek-to-keep-cz-in-the-u-s-until-february-sentencing","publishDate":"2023-11-23T01:40:49","id":8329,"type":null,"title":"Prosecutors seek to keep CZ in the U.S. until February sentencing","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">U.S. prosecutors are asking Changpeng Zhao, Binance founder and ex-CEO, not to leave the country ahead of his sentencing hearing scheduled for February 2024.<\/span>","<span data-v-f87c67ca=\"\">In a filing on Wednesday, prosecutors said that Zhao, a citizen of the United Arab Emirates and Canada, should not be permitted to return to his home in the UAE before sentencing on February 23 next year given “the substantial risk of flight posed by Zhao.”<\/span>","<span data-v-f87c67ca=\"\">The motion from the prosecutors — for review of the presentence bond conditions imposed earlier this week — comes after <\/span><a href=\"https:\/\/www.theblock.co\/post\/264272\/how-czs-exit-and-binances-4-billion-fine-could-shape-the-future-of-crypto\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Zhao pled guilty<\/span><\/a><span data-v-f87c67ca=\"\"> on Tuesday to one count of causing Binance to fail to maintain an effective anti-money laundering program.<\/span>","<span data-v-f87c67ca=\"\">The prosecutors argued that Zhao, with substantial wealth outside the U.S. and minimal ties with the country, poses a serious risk of flight.<\/span>","<span data-v-f87c67ca=\"\">Zhao said that he should be allowed to return to the UAE “pursuant to an appearance bond of $175 million, secured by $15 million in cash held in trust and three responsible persons who pledged property or cash.”<\/span>","<span data-v-f87c67ca=\"\">Magistrate Judge Brian Tsuchida previously ruled that Zhao would be allowed to return to the UAE on the appearance bond — unless the court determines it will review the decision before 5 p.m. Pacific Standard Time on November 27. The judge required Zhao to return to the U.S. by February 9, 2024.<\/span>","<span data-v-f87c67ca=\"\">The prosecutors, however, argued in the Wednesday filing that Zhao has not established by clear and convincing evidence that he is not likely to flee if he returns to the UAE. “Zhao’s significant assets and strong ties to the UAE, as well as the government’s inability to extradite him from the UAE, favor a ruling from this court that he be required to remain in the United States until his sentencing on February 23, 2024,” the prosecutors added.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February 2024","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$175 million","content":"MONEY"},{"type":"Brian Tsuchida","content":"PERSON"},{"type":"February 9, 2024","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Zhao","content":"PERSON"},{"type":"November 27","content":"DATE"},{"type":"United Arab Emirates","content":"ORGANIZATION"},{"type":"February 23 next year","content":"DATE"},{"type":"February 23, 2024","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"$15 million","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"5 p.m.","content":"TIME"},{"type":"United States","content":"LOCATION"},{"type":"UAE","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"},{"type":"Pacific Standard Time","content":"ORGANIZATION"}],"hashtag":["BINANCE","CZ"],"authors":["Timmy Shen","The Block"]}