{"summary":"The crypto market could use some &quot;disinfectant&quot; said SEC Chair Gary Gensler, marking his latest dig at the industry.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284208\/sec-chair-gary-gensler-says-crypto-markets-could-use-a-little-disinfectant","publishDate":"2024-03-22T12:16:02","id":8330,"type":null,"title":"SEC Chair Gary Gensler says crypto markets &#x27;could use a little disinfectant&#x27;","category":["POLICY"],"content":["&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">The crypto market could use some \"disinfectant,\" said Securities and Exchange Commission Chair Gary Gensler, making his latest dig at the industry.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">During a speech on Friday at the Columbia Law School conference, Gensler spoke about the need and benefits of disclosures in general in the financial markets, such as on climate and cyber risks. Gensler said that disclosures provide for more efficient markets and ultimately protect investors.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"There are participants in crypto securities markets that seek to avoid these registration <\/span><span class=\"s1\" data-v-f87c67ca=\"\">requirements,\" Gensler said in his prepared remarks. \"No registration means no mandatory disclosure. Many would agree that the crypto markets could use a little disinfectant.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Gensler has consistently warned that crypto exchanges need to register with the agency and that <\/span><span class=\"s2\" data-v-f87c67ca=\"\">crypto firms are subject to the same rules as traditional finance.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Over the past year, the SEC charged Coinbase, Kraken and others for allegedly operating as an unregistered exchange, broker, dealer and clearinghouse. Meanwhile, crypto firms have argued that it's not possible to register with the agency.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Gensler also focused on the need for disclosures related to executive compensation, climate and cyber risks in his prepared remarks on Friday. The SEC voted earlier this month to adopt <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2024-31\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">rules<\/span><\/a> requiring companies to disclose climate-related risks.&nbsp;<\/span>","Gensler said during a question and answer period after his speech that crypto serves as a reminder of how important disclosures are. He also remarked that both the SEC and its fellow regulator, the Commodity Futures Trading Commission, have a role in regulating crypto.","\"If something doesn't have that group of entrepreneurs or some group that the public is relying upon,\" Gensler said. \"They're [CFTC] a wonderful derivatives regulator as well, so Chair Behnam and I talk on a regular basis.\"","Recently, the agencies have appeared to be at odds on whether ether is a security, which would fall under the SEC's jurisdiction, or a commodity, which would fall under the CFTC's realm. Behnam has said ether is a commodity, though the SEC has not been as clear.","Behnam told&nbsp;<a class=\"c-link\" href=\"https:\/\/www.theblock.co\/post\/280952\/legislation-needed-to-regulate-crypto-cftc-chair-behnam-says-citing-cryptos-recent-uptick-in-value\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/280952\/legislation-needed-to-regulate-crypto-cftc-chair-behnam-says-citing-cryptos-recent-uptick-in-value\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">lawmakers<\/a> earlier this month that if the SEC were to say ether is a security, it would put the CFTC's registrants who list ether as a futures contract in noncompliance with SEC rules rather than CFTC rules.","&nbsp;","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Update (March 22 at 18:00 UTC)<\/strong>: Added remarks by Gensler regarding the CFTC.&nbsp;<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"March 22","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Columbia Law School","content":"ORGANIZATION"},{"type":"Gensler","content":"PERSON"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}