{"summary":"Kadena wants to incentivize developers to improve its scalable POW codebase with a $100 million grant from its treasury.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142837\/kadena-announces-100-million-grant-program-for-web3-developers","publishDate":"2022-04-21T09:00:02","id":8331,"type":null,"title":"Kadena announces $100 million grant program for web3 developers","category":["LAYER 1S"],"content":["Kadena, a proof of work (POW) blockchain, today announced a $100 million grant program funded by its treasury to support web3 development.","The program will be administered by Kadena Eco, the blockchain’s innovation network, and used to attract talented developers to contribute to the Layer 1 network’s codebase.","According to a company news release, the grant will focus on supporting builders in areas including NFTs, DeFi, gaming, metaverse and DAOs among others.","Kadena Eco will evaluate grant applicants based on technical strength, experience of teams and usefulness of the projects to the Kadena ecosystem.","Developers applying for grants must be willing to abide by the blockchain’s “build in the open philosophy” and submit detailed explanations about their protocols.","“Our goal at Kadena Eco is to onboard as many builders as possible, and grant applications from skilled builders and founder teams will be considered equally.&nbsp; Grants are a stepping stone to potential future funding as part of other Kadena Eco initiatives such as our incubator, accelerator and venture fund programs,” Kadena Eco CEO Francesco Melpignano told The Block.","Kadena <a href=\"https:\/\/www.theblockcrypto.com\/post\/45644\/kadena-launches-mainnet-and-two-token-sales-to-raise-up-to-20m\" data-v-f87c67ca=\"\">launched its blockchain mainnet<\/a> in November 2019 and has grown to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/kadena\" data-v-f87c67ca=\"\">reach<\/a> a current $968 million market capitalization.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2019","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"Kadena Eco","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Francesco Melpignano","content":"PERSON"},{"type":"$968 million","content":"MONEY"},{"type":"Kadena","content":"LOCATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}