{"summary":"S&amp;P Global&#x27;s hiring for the space signals how mainstream interest continues to grow despite cryptocurrencies that have tumbled from their 2021 highs and the myriad bankruptcies that have shattered the sector.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224573\/sp-global-hiring-defi-director","publishDate":"2023-04-03T12:59:08","id":8339,"type":null,"title":"S&amp;P Global plans decentralized finance push as it looks for DeFi director","category":["COMPANIES"],"content":["S&amp;P Global is on the hunt for a director of DeFi as the business and analytics firm looks to firm up its strategy around decentralized markets.","The successful candidate will work with Chuck Mounts, S&amp;P's chief DeFi officer and help build and implement the firm's strategies in the space, according to the job <a href=\"https:\/\/www.linkedin.com\/jobs\/view\/3545478721\/\" data-v-f87c67ca=\"\">posting<\/a>. \"A crypto market participant with a deep understanding of the disruption it represents both for our company and our customers\" is how the firm describes what it's looking for.","S&amp;P Global's hiring for the space signals how mainstream interest continues to grow despite cryptocurrencies that have tumbled from their 2021 highs and the myriad bankruptcies that have shattered the sector.","As well as understanding S&amp;P Global's business and product lines, potential candidates should have a \"solid foundation in crypto finance and DeFi.\" The salary range for the role is between $107,100 to $212,975, depending on location, experience and qualifications.&nbsp;","The DeFi team covers at S&amp;P Global covers blockchain, web3 and the metaverse, as well as decentralized finance. It plays a \"critical role in identifying and navigating\" future disruption risks. It also identifies and facilitates new investment and partnership opportunities, according to the listing.&nbsp;","S&amp;P, founded more than 100 years ago, is the latest mainstream company to explore cryptocurrency and blockchain technology.&nbsp;","Last month, Nasdaq announced <a href=\"https:\/\/www.theblock.co\/post\/222866\/nasdaq-says-institutional-appetite-in-crypto-is-steady-as-it-plots-push-into-custody-trading\" data-v-f87c67ca=\"\">plans<\/a> to offer crypto custody and trading solutions, citing institutional appetite as one of the key drivers behind the decision. The 52-year-old firm is hopeful it will gain regulatory approval during this quarter.&nbsp;","And last week, Boerse Stuttgart was granted a crypto custody license by the German financial regulator. The stock exchange, which is over 160 years old, now offers trading and custody solutions to European banks, brokers, asset managers and family offices for their digital asset offerings.&nbsp;","Oliver Vins, who oversees Boerse Stuttgart Digital and Blocknox, said the regulatory approval reinforces the firm's goal to provide European institutions with secure access to the growing digital asset market.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Oliver Vins","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Boerse Stuttgart Digital","content":"ORGANIZATION"},{"type":"this quarter","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"S&amp;P Global","content":"ORGANIZATION"},{"type":"Boerse Stuttgart","content":"PERSON"},{"type":"$107,100","content":"MONEY"},{"type":"Chuck Mounts","content":"PERSON"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"$212,975","content":"MONEY"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["CRYPTO BANKS AND LENDERS","FINTECH","INVESTMENT FIRMS","PAYMENTS","TRADFI BANKS"],"authors":["Adam Morgan McCarthy","The Block"]}