{"summary":"One of the co-founders of Rebase, a web3 startup behind a collection of Bella Hadid-themed NFTs, is suing the other founder for $77 million. \nKrzysztof Gagacki alleged that Edmond Truong stole millions of dollars of crypto and took control of the company without permission.","author":["Andrew Rummer","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227298\/bella-hadid-nft-lawsuit","publishDate":"2023-04-20T13:31:16","id":834,"type":null,"title":"Bella Hadid NFT co-founder says his partner has &#x27;gone rogue&#x27;","category":["Policy"],"content":["The co-founder of the startup behind last year's <a href=\"https:\/\/www.reuters.com\/technology\/top-model-bella-hadid-joins-metaverse-with-nft-collection-2022-07-28\/\" data-v-f87c67ca=\"\">Bella Hadid-themed NFT collection<\/a> is suing his business partner for $77 million, accusing him of having \"gone rogue,\" stealing millions in crypto and taking control of the company.","Krzysztof Gagacki, the co-founder of online <a href=\"https:\/\/twitter.com\/REBASEgg\" data-v-f87c67ca=\"\">NFT game Rebase<\/a>, alleged that Edmond Truong stole about $2 million in crypto in October from a wallet they both controlled, according to a 22-page <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.cacd.881632\/gov.uscourts.cacd.881632.1.0.pdf\" data-v-f87c67ca=\"\">document filed with a U.S. court<\/a> this week. Truong has also allegedly excluded Gagacki from the company's operations, including starting talks to issue Rebase’s planned token on the <a href=\"https:\/\/www.theblock.co\/post\/226561\/arbitrum-proposal-return-funds-failed\" data-v-f87c67ca=\"\">Arbitrum blockchain<\/a> without his co-founder's knowledge.&nbsp;","Truong \"has ousted Mr. Gagacki from their joint venture and is now holding himself out to third parties as the sole owner and decisionmaker for the Rebase app,\" the filing alleges.&nbsp;","Gagacki estimates that Rebase is worth more than $150 million and is seeking damages of at least $77 million, plus interest.&nbsp;","\"I care deeply about the Rebase community, and I wish this action had not become necessary. But Mr. Troung refused reply to multiple requests from me and my team,\" Gagacki said in an email. \"Moreover, Mr. Troung's actions are egregious, defamatory and — taking into account the wealth of evidence we have shared with the FBI and U.S. Attorney — potentially criminal. We look forward to fully presenting our case via the legal process.\"","Truong referred a request for comment to his lawyers, who said that he \"strenuously denies the accusations made by Mr. Gagacki in his complaint, which lack merit and should not go forward.\"","The conflict among the co-founders is the latest in a young industry being led generally by younger executives with little professional experience who find themselves at odds. <a href=\"https:\/\/www.theblock.co\/post\/218867\/umami-labs-ceo-alex-odonnell-addresses-legal-battle\" data-v-f87c67ca=\"\">Umami Labs is in the midst of an internal battle<\/a> and former <a href=\"https:\/\/www.coindesk.com\/business\/2023\/04\/09\/former-ftx-us-president-reportedly-quit-after-protracted-disagreement-with-bankman-fried\/\" data-v-f87c67ca=\"\">FTX U.S. President Brett Harrison resigned<\/a> last year in part as a result of a “protracted disagreement” with Chief Executive Officer Sam Bankman-Fried.","Hadid launched a collection of 11,111 NFTs last year. Known as CY-B3LLA, the collection featured artwork based on 3-D scans of the U.S. supermodel's face and body. The project currently appears dormant, with its <a href=\"https:\/\/cybella.xyz\/\" data-v-f87c67ca=\"\">website URL<\/a>&nbsp;dead and its <a href=\"https:\/\/twitter.com\/cybellaxyz\" data-v-f87c67ca=\"\">Twitter account<\/a> unused since October.&nbsp;","The model pulled out after Truong \"contacted Bella Hadid’s agent and misrepresented that things had gotten 'a bit out of hand' at Rebase and that Mr. Gagacki was no longer 'employed' by Rebase,\" according to this week's court filing.&nbsp;The NFTs were never actually sold.&nbsp;","The model received about $1.5 million for her involvement in the project, the filing states.&nbsp;","The case is number 2:23-cv-02876 in the U.S District Court for the Central District of California.&nbsp;","<em data-v-f87c67ca=\"\">Update: story updated with comment from Truong's lawyers.&nbsp;<\/em>"],"hashtag":["LAWSUITS"]}