{"summary":"In an apparent hustle, someone has set up a fake Discord server for The Block and is impersonating several members of our staff.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214307\/discord-scam-sees-the-block-come-knocking","publishDate":"2023-02-23T03:56:42","id":8346,"type":null,"title":"Discord scam sees The Block come knocking with fake &#x27;Article Writer&#x27; promises","category":["COMPANIES"],"content":["“Hello there, I am Rummer. from theblock.co where I work as a Article Writer. Our team is intrigued by your NFT project and we would like to request permission to write an article about your project.”","That’s the Discord message that greeted Elton Penguin, a pseudonymous project lead for the <a href=\"https:\/\/twitter.com\/TheNoundles\" data-v-f87c67ca=\"\">Noundles<\/a> NFT collection, on Sunday, purporting to come from, well, me.","Unfortunately for Elton, however, that beautifully crafted missive hadn’t been penned by me at all. Someone had set up a fake Discord server for The Block and fake profiles for several of our staff, including Frank Chaparro, Lucy Harley-McKeown and Editor-in-Chief Sarah Kopit.","Elton wasn’t alone. Dozens of people had been <a href=\"https:\/\/twitter.com\/steviepxyz\/status\/1628238813825847301\" data-v-f87c67ca=\"\">contacted<\/a> by fake accounts purporting to be employees of The Block.","Exactly what these imposters were after wasn’t immediately clear, though the consensus from those targeted was that the efforts at chumminess would result in an eventual phishing attempt.","“My take is they want to get me to feel good and tell them about the project. And then social engineer me for a bit to feel like it’s safe to click links. Then hack my stuff,” said Jake Baker, another victim, who runs the Twitter <a href=\"https:\/\/twitter.com\/ShaqGivesBack\" data-v-f87c67ca=\"\">account<\/a> behind the Shaq Gives Back NFT collection.","For the record: <strong data-v-f87c67ca=\"\">The Block has no official presence on Discord.<\/strong>","“The attackers are likely attempting to compromise existing Discord accounts,” said Sacha Tememe, a security engineer at The Block. “The verification link to join their server leads to a malicious site which may try and steal a user's authorization token, essentially granting the attackers full access to the user's account.”","A Discord spokesperson said it \"takes the safety of all users seriously\" and the account impersonating me has now been deleted.","\"Our community guidelines prohibit users from coordinating or participating in malicious impersonation of an individual or an organization, and our Trust &amp; Safety team takes action when we become aware of this kind of behavior,\" they added.&nbsp;","Discord is a messaging and chat tool founded in 2015, where users can build communities — called servers — around a specific activity. After first finding an audience among video gamers, the app has more recently become one of crypto’s social networks of choice. It’s <a href=\"https:\/\/www.theblock.co\/post\/163228\/tornado-cashs-discord-server-and-governance-forum-shuttered-amid-arrest\" data-v-f87c67ca=\"\">rare<\/a> to find a DAO or NFT project that doesn’t have an affiliated Discord server.","There is an irony here, of course. In targeting projects like Noundles and Shaq Gives Back with the promise of coverage in The Block, the hackers have inadvertently given them coverage in The Block. In this article.","The second irony is that in attempting to report out this story, I found myself sending Twitter DMs that — on reflection — sounded distinctly scammy.","“How should I refer to you? Do you go by Elton Penguin or do you prefer to be called by your real name in the article?” I found myself typing, just an imagined step or two away from asking for his private keys.","Elton had some advice for me on that front.","“Just work on making your grammar worse, then you'll have it nailed.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"Discord spokesperson","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Shaq Gives Back","content":"ORGANIZATION"},{"type":"Elton Penguin","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Lucy Harley","content":"PERSON"},{"type":"Jake Baker","content":"PERSON"},{"type":"Sarah Kopit","content":"PERSON"},{"type":"Shaq Gives Back NFT","content":"ORGANIZATION"},{"type":"McKeown","content":"PERSON"},{"type":"Noundles<\/a> NFT","content":"ORGANIZATION"},{"type":"Sacha Tememe","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["HACKS","SOCIAL MEDIA"],"authors":["Andrew Rummer","The Block"]}