{"summary":"Usually, when bitcoin’s price rallies to all-time highs, spot prices for mining hardware do as well. But right now, it’s a different situation.\nThe ongoing shortage of hosting availability worldwide has triggered a lag in mining rig prices relative to the price of the asset.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123701\/bitcoin-miner-lag-rack-crunch","publishDate":"2021-11-10T15:32:19","id":835,"type":null,"title":"Spot bitcoin mining hardware prices are lagging behind BTC&#x27;s rally because of a rack space crunch","category":["Bitcoin"],"content":["Spot prices for bitcoin mining hardware on the market are lagging behind BTC's rally to all-time highs in a rare situation — all thanks to a global hosting capacity crunch following China's crackdown.","Bitcoin's price has been trending up since last weekend, briefly hitting $69,000 on Coinbase on Wednesday. That comes three weeks after it surged to nearly $67,000 following a six-month downward period since an earlier all-time-high in April.","During the same period, while the spot prices for Bitcoin mining equipment have also bounced back, they are still at a discount compared to record highs seen in April.&nbsp;","That means whoever has available power and rack capacity to plug in mining rigs right now would have access to cheap hardware to shorten the payback period.","According to <a href=\"https:\/\/www.hashrateindex.com\/machines\/sha256-rig-index\" data-v-f87c67ca=\"\">data<\/a> compiled by Luxor, one of the top 10 bitcoin mining pools, all generations of spot equipment on the market are still 15% to 20% off their records from six months ago.","Similarly, based on quotes seen by The Block on WeChat, Chinese mining rig brokers have been asking for $100 per terahashes per second (TH\/s) for Bitmain's AntMiner S19 Pro. The price for the same model in April and May was about $120 per TH\/s.","\"The continued shortage of physical rack space to plug in ASICs has resulted in a lag of rig prices relative to Bitcoin,\" said Ethan Vera, co-founder and COO at Luxor. \"Many mining companies still have ASICs sitting in their warehouses, waiting to get plugged into racks. These companies are prioritizing dollars spent on infrastructure and future ASIC orders, rather than spot buys.\"","Typically, mining hardware manufacturers and brokers will increase the prices for both spot and future stocks swiftly and proportionately based on any price rallies.","During bitcoin's bull run at this point last year, the supply for both spot and future equipment started to run dry, causing rig prices to climb, The Block <a href=\"https:\/\/www.theblockcrypto.com\/post\/84781\/bulk-preorders-bitcoin-miners-spring-2021\" data-v-f87c67ca=\"\">reported<\/a> at the time.","Between mid-December to mid-April, Bitcoin's price and Bitcoin rig spot price both increased by about 2.5 times from around $19,000 to nearly $66,000.","But China's crackdown on the mining space has altered the balance between <a href=\"https:\/\/www.theblockcrypto.com\/post\/109301\/secondhand-bitcoin-miner-supply-spiking-bitmain\" data-v-f87c67ca=\"\">supply and demand<\/a>.&nbsp;","\"In addition to the recent influx of equipment that has hit the market from China, which is likely attributing to the lag, we are seeing purchases of machines from groups that have no power available... [who] are then left with the decision to either sell the units for a premium today or hold them until power becomes available,\" said Zach Bradford, CEO at CleanSpark, a Nasdaq-listed Bitcoin mining firm, adding:","Although Bitcoin's price has more than doubled since its July low of just below $30,000, spot rig prices have only bounced back by around 50%, Luxor's data shows.&nbsp;","The Block mapped out in August a <a href=\"https:\/\/www.theblockcrypto.com\/news+\/115158\/mapping-north-america-crypto-mining-infrastructure-boom\" data-v-f87c67ca=\"\">Bitcoin mining infrastructure boom<\/a> in North America, with multiple companies either building or planning to build nearly 3 gigawatts of power capacity. Since then, more companies have announced plans to develop additional capacity."],"hashtag":["MINING"]}