{"summary":"Immutable is rolling out a solution on Ethereum that it says will help enforce the payment of creator royalties for NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183010\/immutablex-solution-enforce-royalties-ethereum","publishDate":"2022-11-04T08:00:38","id":8350,"type":null,"title":"Immutable unveils tool to enforce NFT royalties on Ethereum","category":["NFTS"],"content":["Immutable is rolling out a product on Ethereum that it says will help enforce the payment of creator royalties.","It will work as a community-governed whitelist and blacklist for smart contracts that honor royalty fees, according to a release. NFT creators will be able to use these lists to control the smart contracts which can transfer or receive NFTs from their collection, ensuring that users will only be able to trade through royalty-respecting contracts.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The solution is already in use on ImmutableX, the company’s Ethereum-scaling Layer 2 NFT platform. The lists will be controlled by IMX token holders.","Immutable co-founder Robbie Ferguson has come out in <a href=\"https:\/\/twitter.com\/0xferg\/status\/1581869940516143104\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">support of NFT royalties<\/a> even as major marketplaces began to make them optional. Buyers can now opt out of paying royalties on NFTs on almost all major marketplaces, the largest exception being market leader OpenSea.","In October, Ferguson said that NFT royalties on Immutable are guaranteed and that this was enforced at a protocol-wide level on any marketplace.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","\"Our vision is an ecosystem where creators have a choice over their royalty model and level of enforceability, and users can vote with their feet when it comes to the projects they feel strike the best balance. Soft-enforced royalties only serve to punish users who are trying to support projects and massively reduce the confidence creators and game studios can have in their revenue streams,” Alex Connolly, co-founder and CTO of Immutable, said in today's release.&nbsp;","While creators will have to decide how strictly they want to enforce royalty payments, Immutable's new tool takes the burden of enforcement from marketplaces — something the likes of <a href=\"https:\/\/www.theblock.co\/post\/178362\/magic-eden-coo-calls-0-royalties-a-prisoners-dilemma\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Magic Eden<\/a> have been pushing for. Previous proposed systems, such as Magic Eden’s own MetaShield product, have been able to identify NFTs that have bypassed royalty payment, but it’s been left up to a third party to take action.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ferguson","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Alex Connolly","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Robbie Ferguson","content":"PERSON"},{"type":"CTO","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}