{"summary":"The agency&#x27;s multi-factor authentication on its X account had been disabled over the summer until a false post went out.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273847\/sec-says-multi-factor-authentication-had-been-turned-off-in-run-up-to-false-x-post-about-bitcoin-etf-approval","publishDate":"2024-01-22T16:00:05","id":8354,"type":null,"title":"SEC says multi-factor authentication had been turned off in run-up to false X post about bitcoin ETF approval","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission said Monday that multi-factor authentication on its X account had been disabled in the run-up to a <a href=\"https:\/\/www.theblock.co\/post\/271373\/secs-x-account-compromised-to-post-fake-spot-bitcoin-etf-approval\" data-v-f87c67ca=\"\">false post<\/a> earlier this month before spot bitcoin ETFs had been formally approved.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"While multi-factor authentication (MFA) had previously been enabled on the @SECGov X account, it was disabled by X Support, at the staff’s request, in July 2023 due to issues accessing the account,\" the SEC said in a statement on Monday. \"Once access was reestablished, MFA remained disabled until staff reenabled it after the account was compromised on January 9.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">MFA is enabled now for all SEC social media accounts that offer it, the agency's spokesperson added.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">X <a href=\"https:\/\/www.theblock.co\/post\/271440\/x-reveals-sec-account-breach-stemmed-from-unprotected-phone-number\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">confirmed<\/span><\/a> in a <a href=\"https:\/\/twitter.com\/Safety\/status\/1744924042681897343\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">post<\/span><\/a> on Jan. 9 that the SEC's X account was compromised, as someone obtained control over a phone number associated with the account. The platform's security team noted that the SEC did not set up two-factor authentication for its account when it was compromised.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The agency's lack of MFA garnered criticism from some in Washington D.C., who have called for an investigation into the matter.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">The SEC said Monday that an <\/span><span class=\"s1\" data-v-f87c67ca=\"\">\"unauthorized party\" obtained control of an SEC cell phone number associated with the account in an apparent \"SIM swap\" attack. SIM swapping is a technique used to transfer someone's phone number to another device without authorization, they added.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Access to the phone number occurred via the telecom carrier, not via SEC systems,\" the spokesperson said. \"SEC staff have not identified any evidence that the unauthorized party gained access to SEC systems, data, devices, or other social media accounts.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">After getting control of the phone number, the unauthorized party reset the password for the SEC's X account, the spokesperson said on Monday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Among other things, law enforcement is currently investigating how the unauthorized party got the carrier to change the SIM for the account and how the party knew which phone number was associated with the account,\" the spokesperson said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC spokesperson also said the agency's staff is continuing to work with the SEC's Office of Inspector General, the FBI, the Commodity Futures Trading Commission, the Department of Justice, among other law enforcement entities.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"MFA","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Washington D.C.","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"FBI","content":"ORGANIZATION"},{"type":"January 9","content":"DATE"},{"type":"Jan. 9","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"SIM","content":"ORGANIZATION"},{"type":"July 2023","content":"DATE"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}