{"summary":"Hidden Road is currently the only prime broker holding both an investment firm license and digital asset firm registration from the FCA.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197430\/hidden-road-uk-registration","publishDate":"2022-12-22T08:13:01","id":8356,"type":null,"title":"Hidden Road&#x27;s UK entity receives digital asset firm registration","category":["COMPANIES"],"content":["Global credit network Hidden Road's UK entity has been granted registration as a digital asset firm by the Financial Conduct Authority (FCA).","The institutional-focused Hidden Road is currently the only prime broker holding both an investment firm license and digital asset firm registration from the FCA, according to a press release — providing it with the opportunity to <a href=\"https:\/\/www.prnewswire.com\/news-releases\/hidden-road-secures-digital-asset-firm-registration-from-the-uks-fca-301708770.html\" data-v-f87c67ca=\"\">offer<\/a> spot and derivatives products for both foreign exchange and digital assets.","\"Our institutional client base has long sought like-minded partners who embrace regulatory infrastructure, and this latest approval further demonstrates our commitment to positively shaping the digital asset markets,\" said <span class=\"xn-person\" data-v-f87c67ca=\"\">Michael Higgins<\/span>, global head of business development for Hidden Road.","Higgins also gave a nod to the UK's financial regulatory body, stating that the company is \"pleased that our UK digital asset operations will be overseen by a regulator as respected as the FCA, and we look forward to partnering with the authority to bring greater stability and institutional adoption to the asset class.\"","There are currently 41 firms <a href=\"https:\/\/register.fca.org.uk\/s\/search?predefined=CA\" data-v-f87c67ca=\"\">registered<\/a> as digital asset firms by the FCA, which has proven to be highly selective of the applications it processes and approves.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Michael Higgins","content":"PERSON"},{"type":"Hidden Road","content":"ORGANIZATION"},{"type":"Higgins","content":"PERSON"}],"hashtag":["FCA","INVESTMENT FIRMS"],"authors":["Adam James","The Block"]}