{"summary":"Locus Finance is a DeFi protocol that gives users access to high yield-bearing tokenized vaults.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240980\/founder-of-defunct-midas-foundation-launches-new-defi-investment-platform-locus-finance","publishDate":"2023-07-24T05:00:03","id":8357,"type":null,"title":"Founder of defunct Midas Investments launches new DeFi investment platform Locus Finance","category":["DEFI"],"content":["Iakov Levin, founder of the defunct custodial crypto investment platform Midas Investments, has launched a new decentralized finance platform.","Locus Finance will give users access to high yield-bearing tokenized vaults, the company said in a statement. Locus will initially offer three yield-bearing products pinned on Ethereum staking, DeFi growth and Arbitrum trading.&nbsp;","\"Investors don’t want to worry about blockchains, protocols, transaction costs, and daily portfolio management,\" Levin said in a statement. \"They need specific exposure in a set-and-forget style. Vaults represent a unique approach necessary for maturing the retail yield market, allowing for optimal wealth generation for retail investors.\"","Founded in 2018, Midas Investments amassed over $250 million assets under management at its height in 2021. However, after market conditions turned in 2022, Midas lost over $50 million.","Levin announced the closure of Midas Investments in December of the same year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Iakov Levin","content":"PERSON"},{"type":"Levin","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"$250 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Midas","content":"ORGANIZATION"},{"type":"Midas Investments","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}