{"summary":"Several notable crypto hacks and exploits in 2023 affected entities like Multichain, Euler Finance, Heco, Poloniex, Mixin, and Atomic Wallet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268831\/the-10-largest-crypto-hacks-and-exploits-of-2023","publishDate":"2024-01-01T12:04:02","id":8363,"type":null,"title":"The 10 largest crypto hacks and exploits of 2023","category":["CRYPTO ECOSYSTEMS"],"content":["The crypto industry has consistently encountered challenges from hacks and protocol exploits over the years.","This trend continued into 2023. There was, however, a sliver of good news: hack volumes fell year-on-year by over 50%.","The amount of cryptocurrency funds stolen by hackers this year was estimated at $1.7 billion, less than half of the $4 billion recorded in 2022, <a href=\"http:\/\/www.trmlabs.com\/post\/hack-hauls-halve-from-2022?utm_campaign=FY22Q4%20-%20Social%20Media%20Promotions%20-%20Grow%20social%20following&amp;utm_content=274925881&amp;utm_medium=social&amp;utm_source=twitter&amp;hss_channel=tw-1039361782593155073\" data-v-f87c67ca=\"\">according to TRM Labs<\/a>. Despite a decrease in overall losses, large sums of money were still stolen from individual projects.","The year witnessed several high-profile hacking incidents, impacting prominent entities such as Multichain, Euler Finance, Mixin Network, and Atomic Wallet.","Then in the month of November, three crypto projects associated with Tron founder Justin Sun — Poloniex, HTX, and Heco Bridge — lost over $200 million collectively in a series of exploits.","A recurring problem in many of these incidents involved private key exploits, enabling perpetrators access to user funds. Throughout the year, the North Korean hacking group Lazarus was implicated in multiple attacks, collectively resulting in losses exceeding $300 million.","The article delves into the biggest cryptocurrency thefts of the year, examining the impacted projects and factors that contributed to each attack.","Mixin Network, a Hong Kong-based crypto project, was hit with the largest crypto exploit of the year.","On Sept. 23, the firm had to abruptly cease operations after hackers plundered a staggering $200 million from users’ hot wallets.","Mixin <a href=\"https:\/\/twitter.com\/MixinKernel\/status\/1706139175018529139\" data-v-f87c67ca=\"\">reported<\/a> that \"the database of its cloud service provider was attacked by hackers.\" While the firm provided no further explanation, it's believed among analysts the impacted database may have held the private keys to users' accounts — the secret phrases unlocking their crypto holdings.","Few events captured the audacity and vulnerability of DeFi as vividly as the March 2023 exploit on lending protocol Euler. This is when <a href=\"https:\/\/www.theblock.co\/post\/219196\/euler-finance-flash-loan-attacked-for-an-estimated-197-million\" data-v-f87c67ca=\"\">$197 million<\/a> worth of crypto vanished in a weird sleight of hand.","The culprit? A hacker who exploited a vulnerability on the lending protocol by manipulating the exchange rates between Euler-issued stablecoins: eDAI and dDAI. By repeatedly calling the \"donateToReserves\" function using DAI, the attacker was able to inflate the eDAI\/dDAI rate.","They utilized a flash loan, a type of loan repaid within the same Ethereum transaction, to disrupt the balance of the liquidity pools holding the two tokens. This triggered liquidations of dDAI-denominated borrower positions to siphon funds from the protocol.","But the story doesn’t end there. Later in a twist — dubbed a “white hat” move — the attacker <a href=\"https:\/\/www.theblock.co\/post\/224705\/euler-hacker-returns-funds\" data-v-f87c67ca=\"\">returned<\/a> the stolen funds. Almost all but a small bounty from the loot trickled back to the team, providing relief for the victims.","In July, cross-chain bridge Multichain was reportedly exploited for $125 million in cryptocurrencies across different blockchains it supported, with the largest amount of funds taken on Fantom. This occurred right after the bridge was halted amid the team <a href=\"https:\/\/twitter.com\/MultichainOrg\/status\/1663941611380965376?t=agzfDEy6MWrrId1YoBpWfg\" data-v-f87c67ca=\"\">citing<\/a> \"multiple issues due to unforeseeable circumstances.\"","The exact cause of the hack remains unclear to this date, as no conclusive post-mortem reports have been made available yet.","One likely factor, as <a href=\"https:\/\/www.halborn.com\/blog\/post\/explained-the-multichain-hack-july-2023\" data-v-f87c67ca=\"\">explained<\/a> by security firm Halborn, suggests that the private keys of the bridge's smart contracts were compromised with hackers exploiting bugs in its code.","Concerns have been raised that the team itself may have been responsible for the incident, a fear fueled by the <a href=\"https:\/\/www.theblock.co\/post\/232754\/multichain-team-says-it-cant-contact-ceo-amid-protocol-problems\" data-v-f87c67ca=\"\">disappearance<\/a> of Multichain’s CEO Zhaojun right before the hack.","Prior to the event, he was arrested by Chinese authorities, and it was <a href=\"https:\/\/www.theblock.co\/post\/239589\/multichain-ceases-operations-as-ceos-sister-is-detained-in-china-while-holding-220-million-of-funds\" data-v-f87c67ca=\"\">revealed<\/a> that he had exclusive control over the protocol’s funds, contradicting Multichain’s earlier decentralization claims. The Multichain bridge is currently no longer operational.","In November 2023, suspected North Korean Lazarus Group hackers <a href=\"https:\/\/www.theblock.co\/post\/262563\/justin-suns-crypto-exchange-poloniex-seemingly-hit-by-60-million-hack\" data-v-f87c67ca=\"\">siphoned<\/a> a staggering $120 million from Poloniex's hot wallets, likely by gaining access to private keys.","The immediate fallout was predictable: trading and withdrawals halted. The exchange says it will reimburse affected users. Poloniex has operated as a centralized exchange since 2014. Tron founder Justin Sun acquired the exchange in 2019.","In June 2023, crypto wallet app Atomic had its user wallet accounts emptied. Hackers stole over $100 million worth of assets from roughly 5,500 users.&nbsp;The primary cause behind the incident remains unclear as Atomic has not yet provided an explanation.","It's suspected the exploit may have been caused by code vulnerabilities <a href=\"https:\/\/web.archive.org\/web\/20220210153123\/https:\/\/leastauthority.com\/blog\/disclosure-of-security-vulnerabilities-in-atomic-wallet\/\" data-v-f87c67ca=\"\">flagged<\/a> by security analysts at Least Authority a year prior to the incident. Analysts at SlowMist also <a href=\"https:\/\/twitter.com\/IM_23pds\/status\/1668886220435509249\" data-v-f87c67ca=\"\">found<\/a> potential issues.","On-chain analytics firm Elliptic, which tracked over 5,500 wallets targeted in the attack, <a href=\"https:\/\/www.elliptic.co\/blog\/analysis\/north-korea-linked-atomic-wallet-heist-tops-100-million\" data-v-f87c67ca=\"\">said<\/a> that the North Korean hacking association Lazarus Group was behind it.","In August, a group of victims in Russia <a href=\"https:\/\/www.intellinews.com\/russian-investors-launch-action-after-being-stung-in-100mn-crypto-heist-288989\/?source=russia\" data-v-f87c67ca=\"\">filed<\/a> a class action against the company behind Atomic for failing to protect user assets. A few months later, the firm replied with a motion to dismiss the lawsuit in a US court.","In November, the primary cross-chain bridge on Heco — a blockchain set up by the HTX exchange — witnessed a large exploit. The perpetrator gained control over the bridge’s primary smart contract or operator account, resulting in the theft of over <a href=\"https:\/\/www.theblock.co\/post\/264271\/heco-bridge-appears-to-have-been-drained-of-86-6-million\" data-v-f87c67ca=\"\">$86 million<\/a> in various cryptocurrencies.","Initial analyses suggest that the intruder manipulated the smart contract code of the bridge and circumvented its security protocols. This manipulation allowed the hacker to mint unauthorized tokens (via the bridge contract), which were then exchanged for ether and subsequently transferred out of the bridge.","HTX (previously Huobi) also suffered a loss of $12 million from its hot wallet. Justin Sun, an advisor to HTX and founder of Tron, <a href=\"https:\/\/www.theblock.co\/post\/255372\/htx-hacker-returns-funds-justin-sun-confirms-250-eth-whitehat-bonus\" data-v-f87c67ca=\"\">stated<\/a> a white hat bounty reward was offered to the attacker. This offer was seemingly accepted — leading to the recovery of $8 million (of the $12 million stolen) by the platform.&nbsp;","July saw an attack on Curve Finance, one of DeFi's largest decentralized exchanges. Several liquidity pools on the platform were exploited due to a vulnerability in the Vyper programming language it had used, resulting in hackers stealing around $73 million in various crypto assets.","A security flaw allowed attackers to drain funds maliciously by exploiting its smart contract logic. This involved a reentrancy attack, where the hacker manipulated smart contracts to withdraw funds in rapid succession.","A malfunctioning reentry guard within Vyper facilitated this attack. Projects built on top of Curve’s factory pools, including JPEG’d, Metronome, and Alchemix, were impacted.","The Curve team quickly patched the vulnerability and eventually ended up <a href=\"https:\/\/www.theblock.co\/post\/244438\/curve-finance-has-recovered-70-of-hacked-funds-with-distribution-planned\" data-v-f87c67ca=\"\">recovering<\/a> about $50 million — 70% of the stolen funds — alleviating concerns for many users and stakeholders. Recovered funds were either directly given back by ethical hackers involved or saved with the assistance of operators of MEV bots, such as <a href=\"https:\/\/www.theblock.co\/post\/242136\/mev-bot-runner-c0ffeebabe-eth-returns-5-4-million-amid-curve-exploit\" data-v-f87c67ca=\"\">c0ffeebabe.eth<\/a>.","In September, Hong Kong-based centralized cryptocurrency exchange CoinEx reported a large hack. Hackers infiltrated the exchange’s hot wallets, designed for immediate transactional use, and absconded with <a href=\"https:\/\/www.theblock.co\/post\/250691\/north-korean-lazarus-group-likely-behind-coinexs-55-million-hack-zachxbt\" data-v-f87c67ca=\"\">over $55 million<\/a> in various cryptocurrencies.","The North Korean group Lazarus was again suspected of involvement in this incident. Investigators <a href=\"https:\/\/www.theblock.co\/post\/250691\/north-korean-lazarus-group-likely-behind-coinexs-55-million-hack-zachxbt\" data-v-f87c67ca=\"\">identified<\/a> a connection between the CoinEx hack and a separate theft at the betting platform Stake.com, which the US Federal Bureau of Investigation said was connected to the Lazarus hacking group. Analysis revealed that the wallet address which received the pilfered funds from Stake.com had direct interactions with the CoinEx hacker's wallet.&nbsp;","Decentralized exchange (DEX) aggregator KyberSwap was exploited via an attack on its Elastic platform that siphoned off some $54 million in crypto.","The Nov. 22 exploit stemmed from a vulnerability in the tick interval boundaries of Kyber's concentrated liquidity pools, allowing the perpetrator to artificially double the liquidity and drain its value.","In a negotiation attempt, Kyber&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/264579\/kyberswap-offers-10-bounty-to-hacker-following-47-million-exploit\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">offered a 10% white hat bounty<\/a>&nbsp;to the hacker in exchange for returning the funds. However, the hacker showed no interest in accepting the bounty and made other demands in a&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/265429\/kyber-hacker-control-message\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">bizarre on-chain message<\/a>, including asking the team for complete control over the project.","The team separately&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/264756\/kyberswap-recovers-4-7-million-after-exploit\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">recovered<\/a> $4.7 million in drained funds that were taken by third-party MEV bots.","Crypto-based betting platform Stake.com fell victim to a likely private key exploit of its wallets. On Sept. 4, 2023, an estimated $41 million worth of cryptocurrencies were stolen from the platform.","The FBI <a href=\"https:\/\/www.fbi.gov\/news\/press-releases\/fbi-identifies-lazarus-group-cyber-actors-as-responsible-for-theft-of-41-million-from-stakecom\" data-v-f87c67ca=\"\">attributed<\/a> the attack to Lazarus in a report, based on its analysis of the addresses receiving stolen funds from Stake.com on Ethereum, BNB Chain and Polygon networks.&nbsp;","<em data-v-f87c67ca=\"\">Update: An unknown hacker <a href=\"https:\/\/www.theblock.co\/post\/269809\/orbit-chains-bridge-reportedly-hacked-for-81-5-million?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">exploited<\/a> a cross-chain bridge called Orbit for $81 million on Dec. 31.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lazarus","content":"PERSON"},{"type":"$41 million","content":"MONEY"},{"type":"TRM Labs","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"US Federal Bureau of Investigation","content":"ORGANIZATION"},{"type":"$4 billion","content":"MONEY"},{"type":"$86 million","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Halborn","content":"PERSON"},{"type":"Euler","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Justin Sun — Poloniex","content":"PERSON"},{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"Heco Bridge","content":"ORGANIZATION"},{"type":"$54 million","content":"MONEY"},{"type":"Least Authority","content":"ORGANIZATION"},{"type":"$1.7 billion","content":"MONEY"},{"type":"Poloniex","content":"ORGANIZATION"},{"type":"$73 million","content":"MONEY"},{"type":"August","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Dec. 31","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"March 2023","content":"DATE"},{"type":"$8 million","content":"MONEY"},{"type":"HTX","content":"ORGANIZATION"},{"type":"$120 million","content":"MONEY"},{"type":"$300 million","content":"MONEY"},{"type":"Sept. 4, 2023","content":"DATE"},{"type":"$81 million","content":"MONEY"},{"type":"$50 million","content":"MONEY"},{"type":"2014","content":"DATE"},{"type":"$12 million","content":"MONEY"},{"type":"Multichain","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Fantom","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"North Korean Lazarus Group","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"Euler Finance","content":"ORGANIZATION"},{"type":"$125 million","content":"MONEY"},{"type":"$55 million","content":"MONEY"},{"type":"$200 million","content":"MONEY"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"$197 million","content":"MONEY"},{"type":"Justin Sun","content":"PERSON"},{"type":"Mixin Network","content":"ORGANIZATION"},{"type":"FBI","content":"ORGANIZATION"},{"type":"$4.7 million","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Sept. 23","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"SlowMist","content":"ORGANIZATION"},{"type":"Nov. 22","content":"DATE"},{"type":"June 2023","content":"DATE"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Vishal Chawla","The Block"]}