{"summary":"Sports Illustrated is turning to Polygon to take on the ticketing industry dominated by big names including Ticketmaster, Live Nation and Eventbrite. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229374\/sports-illustrated-polygon-event-ticketing","publishDate":"2023-05-03T16:50:39","id":8365,"type":null,"title":"Sports Illustrated sets sights on Ticketmaster with Polygon ticketing service","category":["COMPANIES"],"content":["Sports Illustrated is turning to the Polygon blockchain for a new platform to attempt to take on the event ticketing industry dominated by big names including Ticketmaster, Live Nation and Eventbrite.&nbsp;","The company's ticketing site SI Tickets is partnering with web3 development firm ConsenSys to launch a service called \"Box Office\" that includes an NFT ticket solution to let event hosts offer collectibles and loyalty benefits.&nbsp;","It could also upend the way tickets are resold on secondary markets and give event hosts a bigger portion of profits that typically go to scalpers or primary issuers, depending on the resale platform. The <a href=\"https:\/\/boxoffice.sitickets.com\/\" data-v-f87c67ca=\"\">company's website<\/a> says the service can be as much as 50% cheaper than current competition, and it also highlights the promise of increased revenue by \"monetizing every resale of your tickets.\"&nbsp;","\"We have been preparing to enter and disrupt the primary ticket market,” SI Tickets CEO David Lane <a href=\"https:\/\/www.businesswire.com\/news\/home\/20230502005488\/en\/Sports-Illustrated-Tickets-Partners-With-ConSensys-to-Launch-%E2%80%98Box-Office%E2%80%99%C2%A0An-All-new-Self-service-Event-Management-Platform-and-Primary-Blockchain-Ticketing-Solution-Powered-by-Polygon\" data-v-f87c67ca=\"\">said in a statement<\/a> on Tuesday. “Blockchain is the future of ticketing, and now owners, promoters, hosts and attendees have access to an advanced ticketing experience that transforms the antiquated barcode into engaging and collectible content.\"","A much-hyped feature of NFTs allows creators to use smart contracts to pre-program royalties for subsequent transfers that occur on-chain. SI Tickets will share resale revenue in a 50\/50 cut, according to a company spokesperson.","Blockchain technology, meanwhile, will help reduce fraud in \"one of the most significant benefits NFTs can deliver to any event,\" the spokesperson added.&nbsp;","\"The SI Tickets gate scanning software works on any Android or iPhone and verifies the authenticity of the tickets,\" the spokesperson said in an emailed response to questions on Wednesday, adding the entire web3 backend was built by ConsenSys and runs on Polygon, the network that has also been favored by big brands including <a href=\"https:\/\/www.theblock.co\/post\/228809\/mastercard-crypto-credential-standards\" data-v-f87c67ca=\"\">Mastercard<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/226809\/starbucks-polygon-new-nft-collection\" data-v-f87c67ca=\"\">Starbucks<\/a>.&nbsp;","NFT Tickets and specialty event content are minted and kept on-chain, according to the spokesperson.&nbsp;","\"As event demand increases additional inventory is minted, the contract amended and pushed out to the SI Tickets marketplace for sale,\" the spokesperson added.&nbsp;","Box Office by SI Tickets is aiming to target event organizers in industries including sports, health and fitness, concerts, comedy and nightlife, industry functions, and philanthropy and faith.","The company says its blockchain technology \"transforms used barcodes into content that lets you engage, reward and stay connected to guests long after the event.\"","“Blockchain technology offers significant benefits for consumers, particularly ticketing, including enhancing payment security, and eliminating scalping and fraud,” Polygon Labs North American business development head Brian Trunzo said in the statement.&nbsp;","While SI Tickets is aiming high, it's announcement touted a launch that included \"everything from youth football, basketball, hockey, cheer and dance competitions to fashion shows and live music bars.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Live Nation","content":"ORGANIZATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"SI Tickets","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Blockchain","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"David Lane","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Brian Trunzo","content":"PERSON"},{"type":"Ticketmaster","content":"ORGANIZATION"},{"type":"Starbucks","content":"ORGANIZATION"}],"hashtag":["NFT INFRASTRUCTURE","UTILITY NFT"],"authors":["Nathan Crooks","The Block"]}