{"summary":"OKX has opened a crypto exchange in Turkey named OKX TR. OKX’s web3 wallet is also available to Turkish users via its global platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279264\/okx-turkey","publishDate":"2024-02-27T04:00:05","id":8373,"type":null,"title":"OKX opens crypto exchange in Turkey, expanding its international footprint","category":["EXCHANGES"],"content":["OKX officially launched a crypto exchange in Turkey on Tuesday as part of its international expansion plans.","OKX TR offers Turkish Lira direct deposits and withdrawals as well as bilingual support in both Turkish and English, according to a statement shared with The Block. OKK’s web3 non-custodial wallet is also now available to Turkish customers via its global platform.","OKX — one of the largest crypto exchanges by trading volume — first announced its intention to expand into Turkey in May 2023, subsequently opening an office and hiring a local team in the market.","OKX TR offers users a platform to trade major cryptocurrency pairs, including USDT\/TRY, BTC\/TRY and ETH\/TRY, the company said.","The move follows remarks from Turkey’s Finance Minister Mehmet Simsek last month, <a href=\"https:\/\/www.reuters.com\/technology\/turkeys-draft-rules-crypto-assets-final-stage-minister-says-2024-01-10\/\" data-v-f87c67ca=\"\">stating<\/a> that the country’s crypto asset regulations — designed to bring licensing and operating standards to trading platforms — were entering the final stage.","“With a crypto adoption rate close to 50%, Türkiye represents a very dynamic and promising market for the industry as it continues to develop,” OKX President Hong Fang said. “The population's high level of engagement and understanding of digital assets makes it an ideal environment for OKX, and we're strongly committed to helping continue to grow this already vibrant ecosystem.\"","OKX’s latest expansion follows the <a href=\"https:\/\/www.theblock.co\/post\/276521\/okx-launches-exchange-services-and-crypto-wallet-in-argentina\" data-v-f87c67ca=\"\">launch<\/a> of its crypto exchange services and web3 wallet in Argentina earlier this month. \"The immense promise of crypto and blockchain is expanding across Latin America, and Argentina represents a crucial launch pad for our regional growth strategy,” Fang said at the time.","In January, OKX also obtained a <a href=\"https:\/\/www.theblock.co\/post\/272779\/okx-vasp-dubai\" data-v-f87c67ca=\"\">VASP license<\/a> in Dubai to operate crypto exchange services.","However, as The Block previously <a href=\"https:\/\/www.theblock.co\/amp\/post\/276404\/okx-south-korea-probe\" data-v-f87c67ca=\"\">reported<\/a>, the firm is also <a href=\"https:\/\/www.theblock.co\/post\/276404\/okx-south-korea-probe\" data-v-f87c67ca=\"\">facing<\/a> a potential probe from South Korean authorities after a local council of crypto exchanges alleged that OKX promoted its Jumpstart program to South Korean investors without proper registration in the country.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Türkiye","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Turkey","content":"LOCATION"},{"type":"South Korean","content":"LOCATION"},{"type":"May 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"VASP","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Hong Fang","content":"PERSON"},{"type":"Argentina","content":"LOCATION"},{"type":"OKX","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Dubai","content":"LOCATION"},{"type":"Mehmet Simsek","content":"PERSON"},{"type":"Fang","content":"PERSON"}],"hashtag":["OKX"],"authors":["James Hunt","The Block"]}