{"summary":"The NYAG claims Genesis, Michael Moro and Barry Silbert conspired to fraudulently represent Genesis&#x27; financial condition.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258365\/nyag-files-complaint-against-gemini-genesis-dcg-michael-moro-and-barry-silbert-over-earn-product-and-covering-up-1-billion-hole","publishDate":"2023-10-19T07:07:17","id":8377,"type":null,"title":"NYAG files complaint against Gemini, Genesis, DCG, Michael Moro and Barry Silbert over Earn product and covering up $1 billion hole","category":["COMPANIES"],"content":["New York Attorney General Letitia James filed a complaint against crypto exchange Gemini, crypto lending firm Genesis, crypto investment company DCG and two executives: former Genesis CEO Michael Moro and DCG CEO Barry Silbert.","According to the complaint, Gemini lent funds to Genesis as part of its Earn program. These funds were ultimately lent out to counterparties including Three Arrows Capital and Alameda. When multiple bankruptcies in the space caused defaults to Genesis, it was left with a $1 billion hole. In covering up this hole, DCG claimed it had absorbed the losses when it had only made a promissory note to its subsidiary Genesis.","The NYAG took aim at both sides, claiming there were two fraudulent schemes. For Gemini, it claimed the exchange took money from the public claiming Earn was a highly liquid investment and that Genesis was creditworthy based on Gemini's risk monitoring. For the other entities — DCG, Genesis and the two named executives — it claimed that they \"disguised $1.1 billion in losses through a months-long campaign of misstatements, omissions, and concealment.\"","The NYAG claimed that Gemini made false assurances that Genesis' loans were overcollateralized. It provided data that showed Genesis' loans were between 60-90% collateralized between December 2020 and September 2022. It pointed to a claim in a Gemini press release in February 2021 that said Genesis' loans were overcollateralized.","The NYAG said Gemini’s risk management team determined in May 2021 that Genesis was highly leveraged and had low liquidity. Around February 2022, it projected that a market downturn could see a 50-60% default rate and said the financials were similar to companies with a credit rating of CCC — which, per Fitch Ratings, suggests a substantial credit risk with a real possibility of default.","The complaint provides multiple public statements by Genesis and Moro that said it had mitigated its losses and that the Genesis balance sheet was strong. It claimed that this was misleading because the Genesis' client funds had been impacted, its balance sheet was weak and that the risk hadn't been removed — it was simply hidden by the promissory note, which was stated as an asset on its balance sheet.","\"The tweets were false, misleading, and omitted material facts. DCG did not simply “assume” the $1.1 billion, open-term liability related to Three Arrows, which could be called at any time; it replaced that liability with an illiquid ten-year Promissory Note,\" the complaint stated.","The NYAG stated that Genesis' CFO told employees not to disclose the promissory note to Gemini and that the company concealed and suppressed information that would have revealed the note or the losses.","On October 28, 2022, Silbert authorized Genesis to disclose the promissory note to Gemini, two weeks before Genesis suspended withdrawals.","The complaint supports previous claims made by Cameron Winklevoss that Gemini was <a href=\"https:\/\/www.theblock.co\/post\/203913\/genesis-creditors-back-winklevoss-promissory-note-claim-as-possible-bankruptcy-looms\" data-v-f87c67ca=\"\">misled about the financial health<\/a> of Genesis, particularly in relation to the promissory note. \"He chose not to fill the $1.2 billion hole,\" <a href=\"https:\/\/www.theblock.co\/post\/200442\/gemini-ceo-winklevoss-escalates-dcg-spat-demands-removal-of-silbert\" data-v-f87c67ca=\"\">Winklevoss wrote on X<\/a> in January 2023. \"Instead he pretended to.\"","The NYAG also claimed that DCG borrowed more than $800 million from Genesis between January 2022 and July 2022. On July 25, 2022 a DCG executive said that DCG \"literally\" did not have the money to pay back a $100 million loan that had reached its maturity date. The loan maturity date was then pushed back to May 2023.","The complaint asks for the defendants to be restricted from being involved in the sales of securities and commodities in the state of New York and to pay damages, penalties, and to give up any profits made from the activities.","\"We fully intend to fight the claims and look forward to being vindicated in this case,\" DCG said in an emailed response to The Block. \"DCG has always conducted its business lawfully and with integrity. We have actively cooperated for months with the Attorney General's investigation in an open and transparent manner. We were blindsided by the filing of the complaint, and there is no evidence of any wrongdoing by DCG, Barry Silbert, or its employees.\"","Silbert said he was \"shocked by the baseless allegations\" and intends to fight the the claims in court.&nbsp;","\"Honesty and integrity have always been my guiding principles,\" he said. \"Last year, my and DCG's goal was to help Genesis weather the storm caused by the collapse of Three Arrows and position Genesis for success going forward. It is unfortunate that this lawsuit omits that fundamental fact.\"","For its part, Genesis said, \"While there is no basis for the NYAG’s claims against Genesis, we have been cooperating with all authorities and intend to continue doing so. With its rush to file this lawsuit, the NYAG has risked significant harm to Genesis’s creditors for the reasons we have explained to the NYAG on multiple occasions, including in a letter we sent to the NYAG last night. Genesis has not violated the law and continues to focus on maximizing recoveries for creditors in its Chapter 11 cases.\"","(<em data-v-f87c67ca=\"\">Updates with response from DCG, Barry Silbert and Genesis.)<br data-v-f87c67ca=\"\">\n<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"DCG","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"Letitia James","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"January 2022","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"January 2023","content":"DATE"},{"type":"Silbert","content":"PERSON"},{"type":"60%","content":"PERCENT"},{"type":"Barry Silbert","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"February 2022","content":"DATE"},{"type":"February 2021","content":"DATE"},{"type":"Genesis","content":"PERSON"},{"type":"Fitch Ratings","content":"ORGANIZATION"},{"type":"Michael Moro","content":"PERSON"},{"type":"May 2021","content":"DATE"},{"type":"NYAG","content":"ORGANIZATION"},{"type":"October 28, 2022","content":"DATE"},{"type":"Gemini","content":"PERSON"},{"type":"NYAG last night","content":"TIME"},{"type":"May 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"December 2020","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"July 25, 2022","content":"DATE"},{"type":"Cameron Winklevoss","content":"PERSON"},{"type":"September 2022","content":"DATE"},{"type":"$1.1 billion","content":"MONEY"},{"type":"$800 million","content":"MONEY"},{"type":"$1.2 billion","content":"MONEY"},{"type":"Winklevoss","content":"PERSON"},{"type":"July 2022","content":"DATE"}],"hashtag":["GEMINI","THREE ARROWS CAPITAL"],"authors":["Tim Copeland","The Block"]}