{"summary":"Coinshares, the European crypto asset manager, unveiled its trading business, CoinShares Capital Markets (CSCM)\nThe new unit is a rebranding of GABI Trading, which CoinShares is in the final steps of acquiring\nCSCM traded over $3 billion worth of crypto in 2019, according to Thursday’s announcement","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64376\/coinshares-unveils-trading-unit-says-it-traded-over-3-billion-in-crypto-during-2019","publishDate":"2020-05-07T12:56:32","id":838,"type":null,"title":"CoinShares unveils trading unit, says it traded over $3 billion in crypto during 2019","category":["The Block"],"content":["Coinshares, the European cryptocurrency asset manager, announced Thursday the launch of a new trading and market business, CoinShares Capital.&nbsp;","The new unit is essentially a rebranding of GABI Trading, &nbsp;a company CoinShares is in the late stages of acquiring, according to a press release.","Whereas Coinshares offers a suite of exchange-traded products, CoinShares Capital will offer a \"suite of trading tools and services.\" Coinshares Capital Markets has been an active proprietary trading shop of Global Advisors Group. In 2019, CSCM traded more than $3 billion in crypto assets, according to the company.&nbsp;","As part of the rebrand, the firm said the trading unit will now open up its flow to qualifying counter-parties.","In the first quarter, the business traded $1.58 billion worth of crypto, according to chief strategy officer Meltem Demirors, who told The Block 2020 is \"going to be a monster year.\"","\"These initiatives are part of CoinShares' mission to provide clients with a sophisticated, fit-for-purpose suite of products and services designed specifically for digital assets,\" the release said. \"This acquisition is part of a larger strategic realignment under the firm's new leadership comprised of Chief Executive Officer, Jean-Marie Mognetti; Chief Strategy Officer, Meltem Demirors; and Chief Revenue Officer, Frank Spiteri.\"","The announcement follows reporting from The Block's Celia Wan that a broker-dealer registered under Group Capital <a href=\"https:\/\/www.theblockcrypto.com\/daily\/48483\/crypto-asset-manager-coinshares-snags-broker-dealer-license-a-move-experts-say-is-to-strengthen-its-us-presence\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">underwent a name change to CoinShares Capital<\/a>. The broker-dealer is now registered under CoinShares' Demirors.&nbsp;","In a message to The Block, Demirors said that CoinShares Capital Markets (CSCM) is not associated with the broker-dealer. Pending regulatory approvals, the firm will be expanding to another region and the broker-dealer will focus on mining.&nbsp;"],"hashtag":[]}