{"summary":"Bakkt has yet again a new CEO. Board member Andy Main will helm Bakkt starting March 26.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283225\/beleaguered-bakkt-replaces-ceo-days-after-nyse-warns-of-delisting","publishDate":"2024-03-18T17:45:46","id":839,"type":null,"title":"Beleaguered Bakkt replaces CEO days after NYSE warns of delisting","category":["COMPANIES"],"content":["Bakkt, the once-promising darling of traditional finance entering the crypto world, has yet again a new CEO. Board member Andy Main, who was briefly CEO of the advertising agency Ogilvy and held senior positions at Deloitte Digital, will helm Bakkt starting March 26.","Current CEO Gavin Michael, who has been in the job for a little more than three years, \"is stepping down to pursue other opportunities,\" <a href=\"https:\/\/www.businesswire.com\/news\/home\/20240318740515\/en\/Bakkt-Announces-Leadership-Transition\" data-v-f87c67ca=\"\">the company said in a press release<\/a>. Bakkt added that Michael \"will serve in an advisory role through March 2025\" to help with the transition.&nbsp; &nbsp;","Main, who joined the board of directors in October 2021, will be the company's fifth CEO since it was founded nearly six years ago.&nbsp; The bitcoin platform, owned mostly by the New York Stock Exchange's parent company, the Intercontinental Exchange (ICE), <a href=\"https:\/\/www.theblock.co\/post\/282390\/bakkt-threatened-with-delisting-by-sister-exchange-nyse\" data-v-f87c67ca=\"\">was alerted last week<\/a> that it could be delisted for having its stock price trading below $1 for 30 days. Several weeks ago, Michael had warned the company would have trouble continuing as a going concern, though it has since raised $50 million, with Main saying that the funding “alleviated the conditions that raise the doubt about us as a going concern,\" according to Bloomberg.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Intercontinental Exchange","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Deloitte Digital","content":"ORGANIZATION"},{"type":"Michael \"","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March 26","content":"DATE"},{"type":"$1","content":"MONEY"},{"type":"Ogilvy","content":"PERSON"},{"type":"Andy Main","content":"PERSON"},{"type":"October 2021","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"March 2025","content":"DATE"},{"type":"Michael","content":"PERSON"},{"type":"Gavin Michael","content":"PERSON"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["Lawrence Lewitinn","The Block"]}