{"summary":"Blockstream&#x27;s Core Lightning rolled out a Splicing feature, paving the way for a cheaper and simplified Bitcoin Lightning wallet experience.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247459\/blockstream-core-lightning-splicing-bitcoin-wallets","publishDate":"2023-08-25T09:25:22","id":8390,"type":null,"title":"Blockstream&#x27;s Core Lightning adds Splicing, enabling unified balances","category":["COMPANIES"],"content":["Blockstream's Core Lightning implementation has rolled out a Splicing feature, paving the way for a cheaper and simplified user experience in setting up and using their Bitcoin Lightning wallets.","The feature was added as an experimental option as part of Core Lightning’s latest <a href=\"https:\/\/github.com\/ElementsProject\/lightning\/releases\/tag\/v23.08\" data-v-f87c67ca=\"\">release<\/a>, v23.08, codenamed \"Satoshi's Successor\" — marking its first release to offer Splicing support, Blockstream CEO Adam Back told The Block.","Splicing technology enables users to add or remove funds to a single channel, eliminating the need for multiple channels per user which scatters liquidity. It also enables wallet providers using the implementation to abstract away the distinction between users’ on-chain bitcoin and Lightning Network balances through unified wallets — making the distinction largely irrelevant.","\"One of the biggest pain points for Lightning users is unreliable transaction throughput — channel liquidity constraints are a big part of the equation there,\" Blockstream developer Lisa Neigut said in a statement. \"Splicing is an incredible new tool for alleviating liquidity constraints, which should result in making transactions significantly cheaper and more reliable for users.\"","The Lightning Network is a second-layer solution of bi-directional payment channels built on top of the Bitcoin blockchain, designed to enable fast and low-cost transactions. Lightning implementations refer to the various software projects that build and maintain interoperable versions of the Lightning Network protocol used by node operators, app developers and wallet providers, among others.&nbsp;","Core Lightning is one of four popular Lightning implementations alongside Lightning Labs' Lightning Network Daemon, ACINQ's Eclair and Lightning Development Kit — developed by Spiral, a subsidiary of Jack Dorsey’s Block.","\"The goal is to make wallets 'just work' instead of users having to bear the brunt of managing different account balances for different protocols,\" independent Core Lightning contributor Dusty Daemon said. \"In the future, everyday users won’t need to understand the difference between Lightning and bitcoin — these protocols will simply be 'spliced' together on the backend.\"","Dusty Daemon developed Splicing as an independent developer, collaborating with Blockstream engineers Lisa Neigut and Rusty Russell, as well as ACINQ's CTO Bastien Teinturier, according to the statement. His work on Splicing is funded by private grants, including a <a href=\"https:\/\/opensats.org\/\" data-v-f87c67ca=\"\">recent<\/a> contribution from the Jack Dorsey-backed Bitcoin-focused non-profit OpenSats.","Core Lightning’s upgrade follows ACINQ Eclair's <a href=\"https:\/\/github.com\/ACINQ\/eclair\/blob\/master\/docs\/release-notes\/eclair-v0.9.0.md\" data-v-f87c67ca=\"\">release<\/a> of a custom prototype for Splicing in June. ACINQ's Bitcoin Lightning wallet Phoenix <a href=\"https:\/\/www.theblock.co\/post\/239098\/phoenix-wallet-lightning\" data-v-f87c67ca=\"\">integrated<\/a> the Splicing feature in July, enabling it to reduce fees on receiving Bitcoin payments from 1% to just miner fees and a transparent 0.4% fixed rather than variable fee for sending Lightning payments.","Phoenix's Splicing technology allows users to add or remove funds from a single dynamic channel without incurring future risk as it can be priced at the current cost, ACINQ said at the time.","Self-custodial Bitcoin Lightning wallet Mutiny, which reached its public beta phase in July also <a href=\"https:\/\/www.theblock.co\/post\/239615\/mutiny-normie-ready-lighting-wallet-avoiding-apple-google-app-stores\" data-v-f87c67ca=\"\">said<\/a> a unified wallet was the end goal, adding that when Splicing becomes more widely available it would help solve the complexities of unified balances.","Last month, the Lightning Network hit a <a href=\"https:\/\/www.theblock.co\/post\/236315\/lightning-network-capacity\" data-v-f87c67ca=\"\">record-high<\/a> capacity of 5,640 BTC ($175 million) before falling back, according to The Block's data dashboard. The current capacity stands at 4,870 BTC ($127 million).","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/lightning-networks-capacity-daily\/embed\" title=\"Lightning Network's Capacity\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lightning Development","content":"ORGANIZATION"},{"type":"Blockstream","content":"ORGANIZATION"},{"type":"Bastien Teinturier","content":"PERSON"},{"type":"Lisa Neigut","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Phoenix","content":"LOCATION"},{"type":"Satoshi","content":"PERSON"},{"type":"Spiral","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"0.4%","content":"PERCENT"},{"type":"$175 million","content":"MONEY"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"$127 million","content":"MONEY"},{"type":"Adam Back","content":"PERSON"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Rusty Russell","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"1%","content":"PERCENT"},{"type":"Daemon","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["James Hunt","The Block"]}