{"summary":"Binance will discontinue all services for Nigeria&#x27;s fiat currency, the naira, amid an ongoing regulatory conflict in the country.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280577\/binance-nigeria-naira-support","publishDate":"2024-03-05T05:48:49","id":8394,"type":null,"title":"Binance cuts support for Nigerian naira amid regulatory dispute","category":["EXCHANGES"],"content":["Binance will discontinue all services for Nigeria’s fiat currency, the naira, amid an ongoing regulatory conflict in the country.","The crypto exchange will automatically convert naira balances to USDT from March 8 at 8:00 a.m. UTC but will cease support for deposits after 14:00 UTC today. Withdrawals will become unsupported after March 8 at 6:00 a.m. UTC.","The conversion rate for automatic conversions will be 1 USDT per 1,515.13 naira, according to an <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-to-discontinue-all-nigerian-naira-ngn-services-f9857dc2fea4448ba1fb8815d87d8144\" data-v-f87c67ca=\"\">announcement<\/a>.","All spot trading pairs against the naira will be delisted on March 7 at 3:00 a.m. UTC. Open spot orders for these pairs will be automatically closed.","Binance Convert, Binance P2P, the exchange’s Auto Invest feature, and Binance Pay will also cease support for the naira at various dates and times.","The news follows a disputed <a href=\"https:\/\/www.theblock.co\/post\/280139\/binance-10b-usd-fine-nigeria\" data-v-f87c67ca=\"\">report<\/a> from the BBC that the Nigerian government demanded a minimum of $10 billion from Binance for “illegal transactions” that allegedly harmed the country. Multiple reports also claim the crypto exchange has been under investigation by Nigerian authorities and that multiple executives have been detained.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"8:00 a.m.","content":"TIME"},{"type":"November 2023","content":"DATE"},{"type":"BBC","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"6:00 a.m.","content":"TIME"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"3:00 a.m.","content":"TIME"},{"type":"Binance P2P","content":"ORGANIZATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"March 8","content":"DATE"},{"type":"March 7","content":"DATE"}],"hashtag":["BINANCE"],"authors":["Adam James","The Block"]}