{"summary":"Kyber Network has launched a dynamic market-making (DMM) protocol, which is designed to be more capital efficient than its automated market-making (AMM) protocol.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/100531\/kyber-network-launches-dynamic-market-making-dmm-protocol","publishDate":"2021-04-05T09:00:06","id":8396,"type":null,"title":"Kyber Network launches dynamic market-making protocol for higher capital efficiency","category":["DEX"],"content":["Decentralized exchange protocol Kyber Network has launched a dynamic market-making (DMM) protocol, which it says is designed to be more capital efficient than its automated market-making (AMM) protocol.","Kyber DMM is also expected to optimize fees and maximize earnings for liquidity providers, Kyber Network announced Monday. That is because of the DMM's two new features — \"dynamic fees\" and \"programmable pricing curve.\"","With the programmable pricing curve, Kyber DMM allows a liquidity provider to customize the price curve for any token pair with a \"specific amplification factor (AMP),\" Kyber Network CTO Victor Tran told The Block.","\"This AMP will virtually amplify the token balance in the pool whenever tokens are added,\" said Tran. \"This means that given the same liquidity pool and trade size, Kyber DMM can provide much better liquidity and slippage compared to AMMs.\"","Slippage can potentially be \"100X better\" than AMMs for more stable pairs (e.g., USDT\/USDC), Tran told The Block. Slippage is the difference between the expected price and the execution price of a trade.","Tran, however, said that the trade-off with the DMM model is that there will be a tradable price range for the token pair in that pool. \"If the price goes out of the tradable range, the pool becomes inactive,\" he said.","On dynamic fees, Tran said, each liquidity pool will support dynamic fees rather than a fixed fee model.","\"With Kyber DMM, fees will increase during high market volatility and decrease during low market volatility to encourage trading and volume,\" Tran told The Block. \"Overall, this optimizes potential returns for liquidity providers. This is similar to how professional market makers are operating to get the most returns out of their trades.\"","Kyber Network said the DMM protocol is the first of many new liquidity protocols that will be launched on Kyber 3.0.","Kyber is currently the tenth-largest decentralized exchange by trading volumes, <a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/dex-non-custodial\/dex-volume-monthly\" data-v-f87c67ca=\"\">according to data compiled by The Block<\/a>.","<iframe title=\"DEX Volume\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/dex-non-custodial\/dex-volume-monthly\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","Decentralized exchange protocols have been working to improve their systems. Last month, <a href=\"https:\/\/www.theblockcrypto.com\/post\/99100\/uniswap-v3-capital-efficiency-details-dex-ethereum\" data-v-f87c67ca=\"\">Uniswap said its V3 platform is launching in May<\/a>, which will be 4000x more capital efficient than its current V2 platform.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kyber DMM","content":"ORGANIZATION"},{"type":"Uniswap","content":"PERSON"},{"type":"Kyber Network","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Tran","content":"PERSON"},{"type":"DMM","content":"ORGANIZATION"},{"type":"AMP","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Kyber Network CTO Victor Tran","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}