{"summary":"The IRS plans to expand reporting expectations for crypto brokers, including exchanges, to meet the needs of President Joe Biden&#x27;s budget.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/106596\/the-us-treasury-wants-to-expand-crypto-reporting-to-fight-offshore-tax-evasion","publishDate":"2021-05-28T14:47:28","id":8405,"type":null,"title":"The US Treasury wants to expand crypto reporting to fight offshore tax evasion","category":["REGULATION"],"content":["On May 28, the Biden administration released its <a href=\"https:\/\/www.whitehouse.gov\/omb\/budget\/\" data-v-f87c67ca=\"\">budget proposal<\/a> for 2022. Alongside the new budget, the Treasury released <a href=\"https:\/\/home.treasury.gov\/system\/files\/131\/General-Explanations-FY2022.pdf\" data-v-f87c67ca=\"\">explanations<\/a> for the administration's revenue proposals.&nbsp;&nbsp;","As the administration has been saying for months now, the new spending package is big, and the Biden team's ambitions for expanding the IRS to pay for the new spending are proportionate.","Notably, the Treasury spotlighted new goals of expanded crypto reporting requirements to combat tax evasion.&nbsp;","\"Tax evasion using crypto assets is a rapidly growing problem,\" the Treasury's explanation contends. \"The global nature of the crypto market offers opportunities for U.S. taxpayers to conceal assets and taxable income by using offshore crypto exchanges and wallet providers.\"","The Treasury proposes to expand requirements of crypto brokers, including exchanges and custodial wallets, to report the beneficial owners of accounts, which would then go into the automated international reporting networks to which the U.S. is already a party. The proposal aims to make this mandatory for tax returns filed starting in 2023.&nbsp;","As the proposal is outlined in full:","\"The proposal would expand the scope of information reporting by brokers who report on crypto assets to include reporting on certain beneficial owners of entities holding accounts with the broker. This would allow the United States to share such information on an automatic basis with appropriate partner jurisdictions, in order to reciprocally receive information on U.S. taxpayers that directly or through passive entities engage in crypto asset transactions outside the United States pursuant to a global automatic exchange of information framework. The proposal would require brokers, including entities such as U.S. crypto asset exchanges and hosted wallet providers, to report information relating to certain passive entities and their substantial foreign owners when reporting with respect to crypto assets held by those entities in an account with the broker. The proposal, if adopted, and combined with existing law, would require a broker to report gross proceeds and such other information as the Secretary may require with respect to sales of crypto assets with respect to customers, and in the case of certain passive entities, their substantial foreign owners.\"","The broad aims of identifying underlying beneficial ownership of businesses and legal entities have grown enormously in prominence over the past decade. At the beginning of 2021, the U.S. passed legislation to restrict anonymous ownership of corporations nationwide, part of combatting the same problem of money laundering.&nbsp;","The Treasury has already begun targeting crypto as another front of this same war. The Financial Crimes Enforcement Network has <a href=\"https:\/\/www.theblockcrypto.com\/post\/99898\/what-comes-next-for-the-us-treasury-departments-plans-to-monitor-crypto-wallets\" data-v-f87c67ca=\"\">been mulling over rules<\/a> on knowing counterparty information on self-hosted wallets transacting with exchanges, to the dismay of the crypto industry.&nbsp;","Crypto exchanges operating in the U.S. are already expected to keep information on their clients, so the real shift the Treasury anticipates appears to be in the exchange of that information between exchanges internationally.","At the same time, in its breakdown of estimated revenue from the shifts, the Treasury estimated that the expanded reporting requirements for crypto brokers will have a \"negligible revenue effect.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"May 28","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Financial Crimes Enforcement Network","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"the United States","content":"LOCATION"},{"type":"Biden","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["IRS"],"authors":["Kollen Post","The Block"]}