{"summary":"Coinbase said the US Treasury’s proposed rulemaking on cryptocurrency mixing fails to adequately address a regulatory gap.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273887\/coinbase-urges-us-treasury-to-reconsider-proposed-crypto-mixing-rules","publishDate":"2024-01-22T21:32:38","id":8407,"type":null,"title":"Coinbase urges US Treasury to reconsider bulk data reporting in proposed crypto mixing rules","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Coinbase said the U.S. Treasury’s proposed rulemaking on cryptocurrency mixing fails to adequately address a regulatory gap while demanding unnecessary amounts of data and resources from crypto platforms.<\/span>","<span data-v-f87c67ca=\"\">In a <\/span><a href=\"https:\/\/assets.ctfassets.net\/c5bd0wqjc7v0\/68ReA5Fygo9vUHcc1JzM0F\/1ac7e172b64b881f6713ee94bf2f078e\/Coinbase_Response_to_NPRM_re._Mixing.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">comment<\/span><\/a><span data-v-f87c67ca=\"\"> filed Monday to the Treasury Department's Financial Crimes Enforcement Network (FinCEN), Coinbase suggested that regulated crypto platforms are already obligated to recordkeeping and reporting rules on suspicious activities and illicit crypto mixing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Coinbase said that the proposed requirement for crypto platforms to report all crypto mixing activities, including those with legitimate purposes, is not an efficient use of companies’ resources. The filing also took issue with there being no monetary threshold for recordkeeping and reporting.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Paul Grewal, chief legal officer of Coinbase, wrote in an X <\/span><a href=\"https:\/\/twitter.com\/iampaulgrewal\/status\/1749569076710801686\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\"> that the absence of a monetary threshold will “just lead to bulk reporting of non-suspicious transactions.”<\/span>","<span data-v-f87c67ca=\"\">“Congress has said that kind of data dump is a waste of time and resources,” Grewal said.<\/span>","<span data-v-f87c67ca=\"\">Coinbase’s comment came in response to FinCEN’s <\/span><a href=\"https:\/\/www.theblock.co\/post\/258785\/fincen-issues-warning-about-virtual-currency-being-used-to-finance-terrorist-organizations\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">proposed rulemaking<\/span><\/a><span data-v-f87c67ca=\"\"> in October that aims to improve transparency surrounding crypto mixing activities.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“This is FinCEN’s first ever use of the Section 311 authority to target a class of transactions of primary money laundering concern, and, just as with our efforts in the traditional financial system, Treasury will work to identify and root out the illicit use and abuse of the CVC ecosystem,” said FinCEN Director Andrea Gacki in an October <\/span><a href=\"https:\/\/www.fincen.gov\/news\/news-releases\/fincen-proposes-new-regulation-enhance-transparency-convertible-virtual-currency\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Many illicit actors, such as North Korean hackers and Russia-based ransomware attackers, have <a href=\"https:\/\/www.chainalysis.com\/blog\/crypto-mixer-sinbad-sactioned-north-korean-laundering\/\" data-v-f87c67ca=\"\">used<\/a> crypto mixers for money laundering activities. While FinCEN said in its proposal that such mixers could promote money laundering, it <a href=\"https:\/\/www.federalregister.gov\/documents\/2023\/10\/23\/2023-23449\/proposal-of-special-measure-regarding-convertible-virtual-currency-mixing-as-a-class-of-transactions\" data-v-f87c67ca=\"\">acknowledged<\/a> that crypto mixing can be used for “legitimate and innovative purposes.”<\/span>","<span data-v-f87c67ca=\"\">“If Treasury wants to focus on this issue, they should help Exchanges meet their existing obligations to report suspicious activity involving mixing,” Grewal said on X. “This is what Treasury has done elsewhere, and specific guidance is more effective than mandatory bulk reporting rules.”<\/span>","<span data-v-f87c67ca=\"\">In light of these issues, Coinbase suggested that FinCEN should add a threshold to eliminate bulk reporting of small transactions. Coinbase also recommended requiring recordkeeping at most, rather than reporting, to bypass privacy and security risks.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Andrea Gacki","content":"PERSON"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"CVC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"Grewal","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"Paul Grewal","content":"PERSON"},{"type":"Treasury Department's Financial Crimes Enforcement Network (FinCEN","content":"ORGANIZATION"}],"hashtag":["ANTI-MONEY LAUNDERING","COINBASE","CONGRESS","CRIME","TREASURY DEPARTMENT"],"authors":["Danny Park","The Block"]}