{"summary":"At Anthropic&#x27;s latest $18 billion valuation, FTX&#x27;s stake would be worth nearly $1.5 billion — a significant recovery for creditors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275898\/ftx-seeks-permission-to-speedily-sell-8-stake-in-anthropic","publishDate":"2024-02-03T12:29:44","id":8408,"type":null,"title":"FTX seeks permission to speedily sell 8% stake in Anthropic","category":["COMPANIES"],"content":["Bankrupt cryptocurrency exchange FTX is preparing to sell its most significant remaining illiquid asset: the 8% stake the company holds in valuable AI startup Anthropic, which received a $500 million investment from FTX's former CEO, Sam Bankman-Fried, in October 2021.&nbsp;","The company, now led by CEO John Ray III, has filed a motion asking a judge to approve the sale of FTX's stake in Anthropic. The company also filed a separate motion shortening the deliberation period for the sale motion so that it can be heard at the bankruptcy court's next hearing on February 22. Objections to the motion are due by February 15.&nbsp;","The <a href=\"https:\/\/restructuring.ra.kroll.com\/FTX\/Home-DownloadPDF?id1=MzA1NzAzMA==&amp;id2=-1\" data-v-f87c67ca=\"\">filing<\/a> discloses the exact size of FTX's stake in Anthropic, 7.84%, and lays out the two main procedures by which the stake can be sold: an auction or a private sale. FTX's lawyers redacted the price they're seeking for the Anthropic shares, arguing, \"The public disclosure of the Reference Price could be detrimental to the Debtors’ goal of obtaining higher and better offers for the Anthropic Shares.\"","Anthropic's latest reported valuation was as high as <a href=\"https:\/\/www.cnbc.com\/2023\/12\/21\/openai-rival-anthropic-in-talks-to-raise-750-million-funding-round.html\" data-v-f87c67ca=\"\">$18 billion<\/a> in December 2023, which would give FTX's stake a value of around $1.4 billion.&nbsp;The value of the Anthropic shares has proved to be a <a href=\"https:\/\/www.theblock.co\/post\/254667\/anthropics-new-raise-could-mean-full-payout-for-ftx-creditors-lawyer\" data-v-f87c67ca=\"\">considerable hope<\/a> for victims of the FTX collapse, and FTX does in fact anticipate that the company has <a href=\"https:\/\/www.theblock.co\/post\/275405\/bankrupt-ftx-wont-be-restarting-but-former-customers-will-get-money-back-in-full\" data-v-f87c67ca=\"\">enough funds<\/a> to pay all customer and creditor claims in full.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"February 15","content":"DATE"},{"type":"$18 billion","content":"MONEY"},{"type":"$1.4 billion","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"8%","content":"PERCENT"},{"type":"February 22","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"7.84%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"October 2021","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"John Ray III","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"December 2023","content":"DATE"}],"hashtag":["FTX"],"authors":["Zack Abrams","The Block"]}