{"summary":"Riot Platforms received a record monthly $31.7 million in power and demand response credits in August.\nThe company curtailed its power usage by over 95% during peak demand, aiding the Texas energy grid during the summer heatwave.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249674\/texas-riot-30-million-bitcoin-miners","publishDate":"2023-09-07T08:11:39","id":841,"type":null,"title":"Riot compensated $30 million to shut off Texas bitcoin miners in August","category":["Companies"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.18%\n    <\/span><\/a> <!----><\/span><\/span> mining and data center hosting firm Riot Platforms received a new monthly record of $31.7 million of energy credits in August, aiding the Texas energy grid after an electricity demand spike during the summer heatwave.<\/span>","Riot, who runs North America’s largest bitcoin mining facility in Rockdale, <a href=\"https:\/\/www.riotplatforms.com\/news-media\/press-releases\/detail\/159\/riot-announces-august-2023-production-and-operations-updates\" data-v-f87c67ca=\"\">curtailed its power usage by over 95%<\/a> during peak demand to earn the power and demand response credits, according to a statement released Wednesday. The company also runs a mining facility at Corsicana in the state.","\"Riot achieved a new monthly record for power and demand response credits, totaling $31.7 million in August, which surpassed the total amount of all credits received in 2022,\" Riot CEO Jason Les said. \"Based on the average bitcoin price in August, power and demand response credits received equated to approximately 1,136 bitcoin.\"","While Riot sacrificed potential revenue from its bitcoin mining operations to provide energy resources back to the power grid, it still earned 333 bitcoin ($8.5 million) from mining revenue in August and $40.2 million including the energy credits.","Compared to the 410 bitcoin ($10.5 million) and $7.8 million power and demand credits received in July, the company was better off after receiving the credits in August. Riot’s energy credits were also substantially higher than the $3.2 million it received in August last year.","\"The effects of these credits significantly lower Riot’s cost to mine bitcoin and are a key element in making Riot one of the lowest cost producers of bitcoin in the industry,\" Les added. \"Riot’s power strategy is a key competitive advantage, and puts Riot in a leading position heading into the upcoming Bitcoin 'halving' event next year.\"","After repairing damage caused to one of its buildings at Rockdale in 2022, the company expects to achieve a total self-mining hash rate capacity of 12.5 EH\/s at the facility by the end of the year. After the deployment of a new MicroBT bitcoin mining machines order mid-next year, its Corsican facility expects to reach 20.1 EH\/s, the company said.","Last month, <a href=\"https:\/\/www.theblock.co\/post\/244050\/bitcoin-miner-riot-platforms-narrows-losses-in-q2-earns-more-power-credits\" data-v-f87c67ca=\"\">Riot reported a net loss of $27.7 million in the second quarter<\/a>, compared with a net loss of $353.6 million in the same period last year. The miner earned $13.5 million in energy credits during the quarter, up from $5.7 million in Q2, 2022.","Riot's shares have risen 222% year-to-date to trade at $11.24, having previously fallen 95% from a peak of $71.33 in February 2021."],"hashtag":["BITCOIN","MINING COMPANIES"]}