{"summary":"Versatus is developing a &quot;stateless rollup&quot; aimed at improving Ethereum&#x27;s scalability. Its partners include EigenLayer and Stader Labs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266311\/ethereum-scaling-startup-versatus-seed-funding","publishDate":"2023-12-06T12:05:07","id":8410,"type":null,"title":"Ethereum scaling startup Versatus raises seed round at $50 million valuation","category":["DEALS"],"content":["<span data-v-f87c67ca=\"\">Versatus Labs, a blockchain scaling startup currently focused on <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.37%\n    <\/span><\/a> <!----><\/span><\/span>, has raised $2.3 million in a seed funding round at a valuation of $50 million.<\/span>","Investors in the round include NGC Ventures, Republic Crypto and Hyperithm. There was no lead investor in the round, and it was an equity plus token warrant round, Andrew Smith, founder and CEO of Versatus, told The Block.","Versatus, formerly known as VRRB Labs, began raising for the round in June and closed it in August, Smith said.","The seed round brings Versatus's total funding to $3.7 million after a $1.4 million <a href=\"https:\/\/www.theblock.co\/post\/209609\/vrrb-labs-raises-pre-seed-round-at-20-million-valuation-as-it-builds-its-own-layer-1\" data-v-f87c67ca=\"\">pre-seed round at a $20 million valuation<\/a> in February. At the time, Versatus was working on a Layer 1 blockchain network, but it has now pivoted to a blockchain scaling platform due to a \"lack of market demand\" for an alternative Layer 1, Smith said.","Versatus is now building a \"stateless rollup\" called LASR. The rollup chain doesn't maintain the entire state or data, which can lead to enhanced scalability. A stateless rollup takes \"only the absolutely necessary data\" of transactions and settles it on the base layer.","LASR, which will settle on Ethereum for now, is layer agnostic and can work with any layer or blockchain, Smith noted. \"LASR can be a Layer 2 on top of a Layer 1, or it can be a Layer 3 on top of a Layer 2, and it can be an off-chain execution environment for Layer 1s,\" Smith said. As LASR is currently focused on Ethereum scaling, Smith added that it aims to reduce \"cost and inefficiencies of Ethereum, eliminate the friction and centralization associated with optimistic rollups, all while delivering a 100x better developer experience.\"","Versatus has partnered with several projects, including Ethereum restaking protocol <a href=\"https:\/\/www.theblock.co\/post\/222901\/eigenlayer-series-a\" data-v-f87c67ca=\"\">EigenLayer<\/a> and liquid staking platform <a href=\"https:\/\/www.theblock.co\/linked\/130977\/crypto-staking-firm-stader-labs-funding-three-arrows-capital-others\" data-v-f87c67ca=\"\">Stader Labs<\/a>. EigenLayer founder Sreeram Kannan said stateless verifiers, like Versatus LASR, \"are a key milestone in the future of <a href=\"https:\/\/www.theblock.co\/learn\/244950\/a-brief-history-of-ethereums-upgrade-roadmap\" data-v-f87c67ca=\"\">the Ethereum scaling roadmap.<\/a>\"","LASR is currently in the alphanet stage and is expected to launch on the Ethereum testnet in the first week of January, with the mainnet launch scheduled for mid-March, Smith said. There are currently 15 people working for Versatus, and Smith plans to keep the team lean in the near future.","LASR will be the first product of Versatus, and the startup plans to launch more products that will help bring more web2 developers into the web3 space, Smith said.","Besides working for Versatus, Smith still serves on the board of and owns equity in his first startup OWL ESG, a tech-driven environmental, social and governance data provider, but he said he hasn't worked there day to day since founding Versatus.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"Smith","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Versatus","content":"PERSON"},{"type":"Smith","content":"PERSON"},{"type":"Versatus","content":"ORGANIZATION"},{"type":"$3.7 million","content":"MONEY"},{"type":"$2.3 million","content":"MONEY"},{"type":"-0.37%","content":"PERCENT"},{"type":"Versatus, Smith","content":"ORGANIZATION"},{"type":"Republic Crypto","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"Versatus LASR","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Sreeram Kannan","content":"PERSON"},{"type":"NGC Ventures","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"$20 million","content":"MONEY"},{"type":"ESG","content":"LOCATION"},{"type":"$1.4 million","content":"MONEY"},{"type":"Andrew Smith","content":"PERSON"},{"type":"$50 million","content":"MONEY"}],"hashtag":["ETHEREUM","SEED &AMP; PRE-SEED"],"authors":["Yogita Khatri","The Block"]}