{"summary":"As they get installed in the coming months, the new machines will bring the company&#x27;s hashrate back up to 5.5 EH\/s — similar to 2022 levels, before it unplugged machines collateralizing a loan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211061\/bitcoin-miner-iris-energy-will-nearly-triple-hashrate-after-buying-4-4-eh-s-in-machines","publishDate":"2023-02-13T11:08:09","id":8412,"type":null,"title":"Bitcoin miner Iris Energy will nearly triple hashrate after buying 4.4 EH\/s in machines","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitcoin miner Iris energy bought 4.4 EH\/s worth of machines with $67 million in Bitmain prepayments and now expects to nearly triple its hashrate.","The company <a href=\"https:\/\/www.theblock.co\/post\/188756\/bitcoin-miner-iris-energy-unplugs-hardware-collateralizing-over-100-million-in-loans\" data-v-f87c67ca=\"\">turned off<\/a> about 3.6 EH\/s worth of machines collateralizing over $100 million in loans in November after <a href=\"https:\/\/www.theblock.co\/post\/182307\/iris-energy-faces-default-by-nov-8-on-financed-bitcoin-miners\" data-v-f87c67ca=\"\">getting a default<\/a> notice from its lender.","The new miners (S19j Pro) will be installed \"over the coming months\" and bring Iris's hashrate up to 5.5 EH\/s, the company <a href=\"https:\/\/www.globenewswire.com\/news-release\/2023\/02\/13\/2606469\/0\/en\/Iris-Energy-Increases-Self-Mining-Capacity-From-2-0-EH-s-to-5-5-EH-s.html\" data-v-f87c67ca=\"\">said<\/a>.","\"This is a significant milestone for Iris Energy. We are delighted to have been able to utilize our remaining Bitmain prepayments to acquire new miners without any additional cash outlay,\" said co-founder and co-CEO Daniel Roberts.","The company is also considering selling any surplus miners over 5.5 EH\/s of self-mining capacity \"to re-invest in growth initiatives and\/or corporate purposes.\"","Iris is debt free after extinguishing its loans at the end of last year.","The firm said in November that given mining economics, the machines used as collateral weren't making enough money to pay for loans, generating around $2 million in BTC per month in gross profit, versus the $7 million in debt obligations.","\"The facilities were intentionally structured for prudent risk management to protect the underlying business and data center infrastructure the Group has built (i.e., without a parent company guarantee and without recourse to any other Group entities),\" the firm said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Iris","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Bitmain","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$7 million","content":"MONEY"},{"type":"$2 million","content":"MONEY"},{"type":"$67 million","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"last year","content":"DATE"},{"type":"Daniel Roberts","content":"PERSON"},{"type":"Iris Energy","content":"ORGANIZATION"},{"type":"the Group","content":"ORGANIZATION"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}