{"summary":"Publicly available data suggests that Binance Labs investments have ground almost to a total halt this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233440\/binances-venture-deals-in-the-us-dried-up-in-months-before-sec-lawsuit","publishDate":"2023-06-07T07:02:06","id":8418,"type":null,"title":"Binance’s venture deals in the US dried up in months before SEC lawsuit","category":["DEALS"],"content":["Binance Labs, the $9 billion venture arm of the crypto exchange operator, largely eschewed dealmaking in the United States this year as its disputes with local regulators heated up.&nbsp;","In previous quarters, the U.S. had proven a fertile hunting ground for Labs, as the chart below shows. But it has backed just one startup in the region — California-based Polyhedra Network — so far this year, according to publicly available information tracked by The Block Research’s deals dashboard.&nbsp;","“Binance Labs’ venture capital investment in U.S.-registered crypto projects has been significantly decreasing over the last 12 months with only one investment year-to-date,” said Edvinas Rupkus, a research analyst at The Block Research.&nbsp;","<span data-v-f87c67ca=\"\">Binance Labs investments over the last two years. Image: The Block Research<\/span>","Labs’ last accelerator program had just 3 U.S.-based startups involved, down from 7 the previous quarter, according to the data.&nbsp;","The stateside slowdown coincides with regulatory tensions in the U.S. coming to a head. Amid a wider crackdown on the sector, <a href=\"https:\/\/www.theblock.co\/post\/233154\/sec-files-suit-against-binance\" data-v-f87c67ca=\"\">the SEC sued Binance<\/a> and CEO Changpeng Zhao earlier this week over multiple alleged violations of the country’s securities laws. Binance said it <a href=\"https:\/\/www.theblock.co\/post\/233186\/binance-says-it-will-defend-our-platform-vigorously-from-sec-lawsuit\" data-v-f87c67ca=\"\">intends to defend its platform<\/a> “vigorously.” Zhao, or “CZ” as he is widely known, and Binance were also <a href=\"https:\/\/www.theblock.co\/post\/223015\/cftc-sues-binance\" data-v-f87c67ca=\"\">sued in March<\/a> by the Commodity Futures Trading Commission for allegedly violating federal laws and not registering the exchange in the U.S.&nbsp;&nbsp;&nbsp;","Labs, which oversees the company’s venture and incubation activities, is a behemoth in the crypto venture space.&nbsp;","As of the first quarter this year, it had amassed $9 billion in assets, up from $7.5 billion in August of last year, according to a spokesperson. Its money is invested in over 200 projects from more than 25 countries in six continents. Of those, 50 have been incubated by Labs.","In <a href=\"https:\/\/www.theblock.co\/post\/228565\/binance-labs-yibo-ling-investments\" data-v-f87c67ca=\"\">an interview<\/a> with The Block in April, Binance’s chief business officer Yibo Ling, who leads investments and M&amp;A for Labs, said the idea driving the venture arm’s activities is that “a rising tide lifts all boats.”&nbsp;","“We think that the value of that core business is going to dramatically increase as the web3 ecosystem continues to develop — so our role is to help seed that ecosystem and help it mature,” he said.&nbsp;","But Labs also has a mandate, through its investments, to bolster activity on BNB Chain — for which BNB, a cryptocurrency issued by Binance, serves as the native token.&nbsp;","The SEC homed in on BNB in its suit, claiming that from the time of Binance’s ICO in 2017 to the present, “BNB was offered and sold as an investment contract and, therefore, as a security.”","While the watchdog largely left Binance Labs out of the complaint, its role promoting BNB came under scrutiny. The SEC noted that Binance had “worked to increase demand for BNB by seeking to create additional ways in which BNB can be used — thereby further increasing demand for the token and its value,” with the creation of Labs’ serving as a prime example.&nbsp;","“Binance Labs has invested more than $500 million in grants to individuals and entities developing applications for Binance blockchains, including BNB-related applications,” the regulator said.&nbsp;","In April, Ling told The Block that regulatory pressure in the U.S. “doesn’t really touch Labs in any way.” Yet the evidence increasingly seems to suggest otherwise.&nbsp;","A Binance spokesperson did not immediately respond to a request for comment for this piece.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last 12 months","content":"DATE"},{"type":"earlier this week","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Edvinas Rupkus","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Binance Labs","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"first quarter this year","content":"DATE"},{"type":"$7.5 billion","content":"MONEY"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Yibo Ling","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"last two years","content":"DATE"},{"type":"March","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"$9 billion","content":"MONEY"},{"type":"Polyhedra Network","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Ryan Weeks","The Block"]}