{"summary":"Bitcoin successfully passed its &quot;first real&quot; stress test during March’s global economic turmoil caused by the coronavirus (COVID-19) outbreak, according to JPMorgan strategists.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/68225\/jpmorgan-says-bitcoin-passed-its-first-real-stress-test-during-marchs-global-economic-turmoil","publishDate":"2020-06-15T05:46:14","id":842,"type":null,"title":"JPMorgan says bitcoin passed its &#x27;first real stress test&#x27; during March&#x27;s global economic turmoil","category":["BITCOIN"],"content":["Bitcoin successfully passed its \"first real stress test\" during March’s global economic turmoil caused by the coronavirus (COVID-19) pandemic, according to JPMorgan strategists.","In their report published last week and obtained by The Block, strategists at the bank led by Joshua Younger and Nikolaos Panigirtzoglou, said that bitcoin rarely deviated from its intrinsic value or mining cost in the past few months, and outperformed other traditional asset classes, proving its resilience.","There was also little sign of a flight to liquidity within the cryptocurrency market, and the market structure was “more resilient” than forex, equities, treasuries, and gold, according to the strategists.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBitcoin saw one of the “most severe” drops in liquidity around the peak of the crisis in March, “but that disruption was cured much faster than other asset classes. At this point, Bitcoin market depth is above its 1-year trailing average, while liquidity in more traditional asset classes has yet to recover,” said the strategists.","“That cryptocurrencies largely survived the stresses of March point to longevity as an asset class,” they added, “but price action points to their continued use more as a vehicle for speculation than medium of exchange or store of value.”","","“Though correlations were modest and mostly mean-reverting around zero for much of the past couple of years, in recent months they have moved sharply higher in some cases (equities) and lower in others (U.S. dollar, gold). [...] That suggests that...cryptocurrencies have traded more in line with risk assets since early March,” said the strategists.<br data-v-f87c67ca=\"\">\n","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"19","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nikolaos Panigirtzoglou","content":"PERSON"},{"type":"Joshua Younger","content":"PERSON"}],"hashtag":["BITCOIN","JPMORGAN"],"authors":["Yogita Khatri","The Block"]}