{"summary":"Polygon launches zkEVM mainnet beta on Monday.\nMetaverse Fashion Week returns for its second year.\nAustralia’s central bank kicks off CBDC pilots on Friday. ","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222848\/three-crypto-stories-this-week","publishDate":"2023-03-26T08:57:06","id":842,"type":null,"title":"Three important crypto stories to look out for this week","category":["Crypto Ecosystems"],"content":["While U.S. regulators crack down on crypto and the industry struggles within a broader banking crisis, new projects continue to flourish and push the sector forward.","Polygon will launch zkEVM mainnet beta on March 27, and developers may look to integrate their platforms. Metaverse Fashion Week, hosted by Decentraland, returns this week for its second year, and 15 projects testing various use cases for an Australian CBDC begin a two-month trial on March 31.&nbsp;","<span data-v-f87c67ca=\"\">Here are the crypto events to mark in your calendars for the coming week.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Polygon's<\/span><a href=\"https:\/\/www.theblock.co\/post\/197324\/polygons-zkevm-launched-its-second-testnet-the-last-step-before-mainnet-goes-live\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> zkEVM<\/span><\/a><span data-v-f87c67ca=\"\"> mainnet beta will go live on Monday, after a year under development. This network will offer a scalability solution for the Ethereum ecosystem with a zero knowledge-rollup performing off-chain computations on a secondary layer for faster and cheaper transactions, while prioritizing security.<\/span>","<span data-v-f87c67ca=\"\">The network will support the same code as Ethereum, which allows developers to onboard Ethereum applications without needing to make significant changes. In the coming weeks, more developers may show interest in integrating their platforms with the zkEVM.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Decentralized lending protocol Aave was <\/span><a href=\"https:\/\/www.theblock.pro\/news\/post\/216830\/aave-starts-governance-discussion-to-deploy-on-upcoming-polygon-zkevm-mainnet\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">considering<\/span><\/a><span data-v-f87c67ca=\"\"> deploying a minimum viable version of Aave version 3 on the Layer 2 network, The Block previously reported. The protocol also proposed to include a consideration for issuing Aave's GHO stablecoin on the zkEVM.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Other partnerships are already on the table. Polygon and web3 game builder Immutable announced last week they are <\/span><a href=\"https:\/\/www.theblock.co\/post\/221420\/polygon-to-help-develop-immutable-zkevm-secured-by-matic-stakers\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">collaborating<\/span><\/a><span data-v-f87c67ca=\"\"> to launch a Layer 2 blockchain network called Immutable zkEVM.<\/span>","<span data-v-f87c67ca=\"\">Metaverse Fashion Week is back for another year. Decentraland will host a series of runways, design competitions, boutiques and panels in the virtual world March 28-31, following the<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span><span data-v-f87c67ca=\"\">curatorial theme “future heritage.”<\/span>","<span data-v-f87c67ca=\"\">This marks the second iteration of the event. This year, there is focus on bridging between the physical and the digital, and enabling interoperability between virtual worlds. Brands like Adidas and Coach will join for the first time, while returning participants include Dolce&amp;Gabbana, Tommy Hilfiger and DKNY. <\/span>","<span data-v-f87c67ca=\"\">Apart from luxury firms, Dencentraland’s own designer community, or neo designers, will take the virtual stage. <\/span><span data-v-f87c67ca=\"\">“We are seeing the return of many luxury fashion houses, and also the emergence and elevation of digitally native fashion,”<\/span> <span data-v-f87c67ca=\"\">said Dr. Giovanna Graziosi Casimiro, head of Metaverse Fashion Week at Decentraland Foundation.<\/span>","<span data-v-f87c67ca=\"\">Fashion brands are taking up more space in the metaverse. For example, companies including <\/span><a href=\"https:\/\/www.theblock.co\/post\/153785\/gucci-buys-into-superrare-dao-eyes-new-virtual-art-space\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Gucci<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/www.theblock.co\/post\/174617\/hugo-boss-to-launch-nft-and-360-degree-metaverse-experience-with-imaginary-ones\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Hugo Boss<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/www.theblock.co\/post\/142276\/louis-vuitton-releases-new-nfts-as-fashion-brands-continue-experiments-in-gaming\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Louis Vuitton<\/span><\/a><span data-v-f87c67ca=\"\"> have already appeared or shown interest in entering metaverse spaces.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A selection of 15 projects will launch a two-month experimentation period to test different use cases for an Australian central bank-backed digital currency on March 31. Examples include using CBDCs for offline payments, tokenized foreign exchange settlements and livestock auctions.<\/span>","<span data-v-f87c67ca=\"\">A public-private partnership between the Reserve Bank of Australia and Digital Finance Cooperative Research Centre are orchestrating the project. The study will examine use cases for a CBDC and involve Mastercard, ANZ and the Commonwealth Bank as partners.<\/span>","<span data-v-f87c67ca=\"\">The trial period for experimenting with the selected pilot projects is set to stretch until the end of May. After the program is complete, a report will compile the results and outline the next steps, expected in mid-2023.<\/span>","<span data-v-f87c67ca=\"\">The pilot will “contribute to hands-on learning by industry, and it will add to policymakers’ understanding of how a CBDC could potentially benefit the Australian financial system and economy,” Brad Jones, Reserve Bank of Australia assistant governor for financial systems, said in a release. <\/span>"],"hashtag":["POLYGON","ZKEVM"]}