{"summary":"Earlier this month, Pinata, the NFT media company known across the industry as a prominent leader in NFT storage and management, announced the release of their newest product feature dubbed ‘Submarining.’ ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117790\/pinata-launches-submarining-for-nft-community","publishDate":"2021-09-15T15:37:39","id":8421,"type":null,"title":"Pinata Launches Submarining for NFT community","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Earlier this month, <\/span><a href=\"https:\/\/bit.ly\/2XlkivO\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Pinata<\/span><\/a><span data-v-f87c67ca=\"\">, the NFT media company known across the industry as a prominent leader in NFT storage and management, announced the release of their newest product feature dubbed ‘<\/span><a href=\"https:\/\/bit.ly\/3ElWM23\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Submarining<\/span><\/a><span data-v-f87c67ca=\"\">.’&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Since 2018, Pinata has been a household name that users have relied on for their interplanetary file system (IPFS) needs while serving a growing NFT user base. Pinata’s powerful but easy-to-use product allows users to upload, share, and manage files with unmatched speed throughout the IPFS network. One problem that was brought to their attention by their user base was that since IPFS is a public network, it lacks the privacy and security many users need. Through user research and customer feedback, Pinata knew that there were many users in the NFT space that required more protection for their content, without losing the ability to share and display their work anywhere.<\/span>","<b data-v-f87c67ca=\"\">An Added Layer of Protection for NFTs<\/b>","<span data-v-f87c67ca=\"\">Thus, the introduction of Pinata’s newest feature, Submarining, came in. Submarining will allow users on Pinata’s Professional Plan to turn on and off the submarining feature when they are uploading a file to the platform. If a user does not want the file to be available to the IPFS public network, they can simply turn on “Submarine” which will hide the information from the network. While the feature is still in beta, the company continues to expand on its offerings for users’ needs. With Submarining, users can now set properties such as who can view the NFT files that are submarined, how long they can view them, and more. For technical users, the team put together a guide on <\/span><a href=\"https:\/\/bit.ly\/3En5tt2\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">how to manage the Submarine feature<\/span><\/a><span data-v-f87c67ca=\"\"> for their needs.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Growing in popularity<\/b>","<span data-v-f87c67ca=\"\">Since the launch of Submarining, Pinata’s seen a steady increase in new users on the platform. More than 22 million files have been stored on the IPFS network through Pinata, with this number increasing daily. With over 49,000 users already on Pinata, many have upgraded their plans to include the new capabilities and more users continue to join by the day. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“People who use Pinata have always been on the leading edge of NFTs. Talking with them, they have consistently told us that they need the ability to easily manage who has access to files based on NFT ownership. Submarining was designed directly from their feedback. We can't wait to see what the NFT space does with it.” -Kyle Tut, CEO of Pinata<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<b data-v-f87c67ca=\"\">About Pinata<\/b>","<span data-v-f87c67ca=\"\">Pinata is the first multimedia hub for NFT creators, builders, and artists in the decentralized world of web 3. Pinata's vision to foster a sense of place for every creator on the internet that is uniquely theirs has been the company's goal since 2018. Building the largest pinning service on IPFS, Pinata gives users the ability to upload, manage, and share their content whenever, wherever and, with whomever they want.<\/span>","<span data-v-f87c67ca=\"\">For more information about Pinata and the newest capability of their solution, visit <\/span><a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=3278220-1&amp;h=1319550241&amp;u=https%3A%2F%2Fpinata.cloud%2F&amp;a=https%3A%2F%2Fpinata.cloud\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/pinata.cloud<\/span><\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Added Layer of Protection","content":"ORGANIZATION"},{"type":"Kyle Tut","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"Pinata","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}