{"summary":"In the newly created position, Ranasinghe will oversee the company’s relationship with the music industry, take a lead role on innovation and develop reporting, analytics, and other tools to help make artists, labels and rightsholders successful.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216323\/decentralized-music-platform-audius-names-sirius-xm-pandora-exec-as-chief-business-officer","publishDate":"2023-03-02T09:00:46","id":8422,"type":null,"title":"Decentralized music platform Audius names Sirius XM\/Pandora exec as chief business officer","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Decentralized music platform Audius named Shamal Ranasinghe as chief business officer.<\/span>","<span data-v-f87c67ca=\"\">In the newly created position, Ranasinghe will oversee the company’s relationship with the music industry, take a lead role on innovation and develop reporting, analytics and other tools to help make artists, labels and rightsholders successful.<\/span>","<span data-v-f87c67ca=\"\">Ranasinghe, who has been an advisor to the company for several years, was previously an executive at Sirius XM\/Pandora where he oversaw product development for artists, labels, rightsholders, managers and live music partners.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Shamal built some very sophisticated tools at Pandora that enable artists to leverage the platform to build their fan bases in very powerful ways,” said Roneil Rumburg, co-founder and CEO of Audius.&nbsp;&nbsp;&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The platform is among those seeking to provide exclusive experiences to users through the use of blockchain-empowered tokens and connections. Sports teams, including Premier League football clubs, have tapped into fan fever with digital assets providing access and experiences only to token-holders.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Audius allows artists to generate immutable records for their creative works, and also offer premium features for curated engagement that can be unlocked with the native platform token $AUDIO. The platform is owned and operated by users, with voting weight directly correlated to $AUDIO staked for value-added services.<\/span>","<span data-v-f87c67ca=\"\">Audius said it currently has seven million unique monthly users.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sirius XM\/Pandora","content":"ORGANIZATION"},{"type":"Shamal Ranasinghe","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Roneil Rumburg","content":"PERSON"},{"type":"Pandora","content":"ORGANIZATION"},{"type":"Ranasinghe","content":"ORGANIZATION"},{"type":"$AUDIO","content":"MONEY"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}