{"summary":"After a phishing attack exposed wallets held by DeFiance Capital founder Arthur Cheong, a large amount of vested tokens were at risk.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139162\/defiance-capital-rescues-13-3-million-at-risk-of-being-stolen","publishDate":"2022-03-24T14:17:54","id":8423,"type":null,"title":"DeFiance Capital rescues $13.3 million at risk of being stolen","category":["HACKS"],"content":["It’s been a bad week for DeFiance Capital.&nbsp;","On Tuesday, it was <a href=\"https:\/\/www.theblockcrypto.com\/post\/138724\/hacker-steals-1-7-million-in-nfts-from-defiance-capital-founder-cheong\" data-v-f87c67ca=\"\">reported<\/a> that DeFiance Capital founder Arthur Cheong fell foul to a phishing attack by clicking a malicious link in an email. His personal crypto wallet was compromised, losing $1.7 million in NFTs and cryptocurrency. What wasn’t reported is that a second wallet was also <a href=\"https:\/\/etherscan.io\/token\/0x5a98fcbea516cf06857215779fd812ca3bef1b32?a=0x48acf41d10a063f9a6b718b9aad2e2ff5b319ca2\" data-v-f87c67ca=\"\">compromised<\/a>, initially losing more than 200,000 Lido tokens ($720,000) of money belonging to the firm.","And worse: it contained a further 3.7 million of vested Lido tokens, worth $13.3 million, that were steadily getting unlocked — which either the hacker or DeFiance Capital could transfer out of the wallet, whoever got there first.","The vesting did, however, provide some respite. Even though the hacker had access to the staked Lido tokens, they could not sell them all because they were locked in a ‘linear vesting’ contract. Linear vesting is a system in which crypto protocol holds funds for a scheduled period and a tiny amount is released with each new block.&nbsp;","Only a small number of Lido tokens kept getting unlocked at a time. Cheong told The Block that it used flashbots — a messaging protocol that can enable you to get priority when making transactions — to <a href=\"https:\/\/etherscan.io\/address\/0x48acf41d10a063f9a6b718b9aad2e2ff5b319ca2#tokentxns\" data-v-f87c67ca=\"\">rescue<\/a> most of the funds that were getting unlocked.","In an effort to stop the bleeding, a representative from DeFiance Capital by the name of ‘jacob.defiance’ made a <a href=\"https:\/\/mainnet.lido.fi\/#\/lido-dao\/0x2e59a20f205bb85a89c53f1936454680651e618e\/vote\/119\/\" data-v-f87c67ca=\"\">governance proposal<\/a> to the Lido DAO community on voting platform Aragon. As discussed on Lido’s governance forum, they <a href=\"https:\/\/research.lido.fi\/t\/proposal-to-freeze-vesting-for-compromised-address\/1864\/15\" data-v-f87c67ca=\"\">proposed<\/a> to burn the vested Lido tokens and mint them to a new wallet in the fund’s control.","On Wednesday, Lido DAO members voted to pass the proposal, following which the team <a href=\"https:\/\/etherscan.io\/tx\/0x209e9ef26e4847cfe70c8d052f0771a031f2d47461b05a76565ce36d34d9e929\" data-v-f87c67ca=\"\">burned<\/a> the entire sum of vested tokens. The tokens will now be returned to the fund's control.","So in all, Cheong and the fund lost more than $2.42 million but saved a further $13.3 million from getting stolen, a small silver lining.","<em data-v-f87c67ca=\"\">This story has been updated to show that DeFiance Capital managed to rescue most of the funds that were in the process of getting unlocked rather than the hacker.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DeFiance Capital","content":"ORGANIZATION"},{"type":"Lido DAO","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$13.3 million","content":"MONEY"},{"type":"$2.42 million","content":"MONEY"},{"type":"$1.7 million","content":"MONEY"},{"type":"Cheong","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Lido","content":"LOCATION"},{"type":"Arthur Cheong","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$720,000","content":"MONEY"},{"type":"Aragon","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","Tim Copeland","The Block"]}