{"summary":"Celsius filed a complaint against the former head of its staking subsidiary and the firm it acquired, KeyFi.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/165200\/celsius-countersues-keyfi-former-employee-for-being-thieves","publishDate":"2022-08-23T13:33:56","id":8428,"type":null,"title":"Celsius countersues KeyFi, former employee for being &#x27;thieves&#x27;","category":["LEGAL"],"content":["Celsius accused staking firm KeyFi and its founder in a lawsuit of stealing, losing and laundering millions of dollars worth of cryptocurrency.","The embattled lender filed a complaint in the US Bankruptcy Court for the Southern District of New York today demanding restitution of property and damages alleging that KeyFi and founder Jason Stone stole millions of dollars in coins from Celsius wallets by transferring them to wallets controlled by the defendants. Celsius says Stone and KeyFi used recently-sanctioned Tornado Cash to launder the assets.&nbsp;&nbsp;","The suit comes six weeks after Stone sued Celsius, accusing the firm of mismanagement and fraud, and claiming it is owed money based on hundreds of millions in profits generated. Celsius acquired part of KeyFi in 2020.&nbsp;","Celsius filed for Chapter 11 bankruptcy protection last month after significant market volatility led to liquidity issues forcing the firm to halt withdrawals and enter bankruptcy proceedings.&nbsp;","Celsius said it lent KeyFi coins to stake but later asked for them back. After multiple asks, including a formal request from the Celsius board, Celsius recovered the majority of its coins from Stone, but it says a \"substantial gap remained.\"","\"As Celsius only later would learn, Stone’s repeated assurances that he could, and would, return all of Celsius’ coins (plus “profits” due to Celsius) were lies designed to conceal the fact that he either had lost or stolen a substantial number of coins,\" said the filing.&nbsp;","Celsius contends Stone and KeyFi also bought hundreds of NFTs with Celsius's coins, which violated the agreement that KeyFi would only stake the tokens pending approval from Celsius. Stone and KeyFi contended in their complaint that the NFTs were a form of compensation authorized by Celsius CEO Alexander Mashinsky.&nbsp;&nbsp;","To hide his activities, Celsius contends Stone was using mixer Tornado Cash. The firm alleges Stone transferred $1.4 million from a Celsius wallet through Tornado Cash to wallets he controls in late September, months after he had left the company.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"laundering millions of dollars","content":"MONEY"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Alexander Mashinsky","content":"PERSON"},{"type":"Stone","content":"ORGANIZATION"},{"type":"Celsius","content":"LOCATION"},{"type":"Celsius","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Jason Stone","content":"PERSON"},{"type":"stole millions of dollars","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"$1.4 million","content":"MONEY"},{"type":"US Bankruptcy Court","content":"ORGANIZATION"}],"hashtag":["STAKING"],"authors":["Aislinn Keely","The Block"]}