{"summary":"So-Col (Social Collectables), a web3 social platform founded by crypto influencer Irene Zhao, raised $4.5 million in two rounds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223353\/so-col-funding-irene-zhao-web3-social-platform","publishDate":"2023-03-28T12:00:14","id":8434,"type":null,"title":"Irene Zhao&#x27;s web3 social platform So-Col unveils $4.5 million in new funding","category":["DEALS"],"content":["So-Col (Social Collectables), a web3 social platform founded by crypto influencer Irene Zhao, unveiled $4.5 million in fresh funding across in two rounds.","The most recent round, worth $1.5 million, was solely backed by DWF Labs, the web3 investment firm said Tuesday. So-Col also <a href=\"https:\/\/www.theblock.co\/post\/145703\/irene-zhaos-influencer-platform-so-col-is-raising-funds-at-a-100-million-valuation\" data-v-f87c67ca=\"\">raised<\/a> $3 million last May in a round led by Blockchain Capital, Zhao disclosed to The Block in an interview. The May round was raised at a $100 million valuation, Zhao said, declining to comment on the latest valuation with the DWF round.","The DWF round brings So-Col's total funding to date to $6.25 million, after the startup raised $1.75 million in seed funding in February 2022. All three funding rounds were token rounds, Zhao said, meaning investors purchased So-Col's simp tokens.","DWF Labs has been increasingly backing token rounds lately. It has invested in over 15 startups in the last few months, inlcuding in <a href=\"https:\/\/www.theblock.co\/post\/215934\/conflux-raises-10-million-dwf-labs-token-round?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">Conflux Network<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/219598\/layer-3-network-orbs-raising-10-million-from-dwf-labs-in-token-round\" data-v-f87c67ca=\"\">Orbs<\/a> and Synthetix. Tokens of most of these startups rose in price after DWF, which is also a market maker, disclosed its investment. DWF originally invested in So-Col in February of this year, Zhao said. Its investment has a one-year vesting period, which ends in February 2024, Zhao added.","With fresh investment from DWF, Ethereum-based So-Col plans to go multichain and support more Layer 1 and Layer 2 blockchains, including Starkware, according to Zhao. As a web3 social platform, So-Col lets creators and brands use NFTs, known as \"collectables\" on its platform, as a basis for memberships and exclusive content.","So-Col currently has about 300 creators using its platform, according to Zhao, who said the plan is onboard more creators by incentivizing them with simp tokens and\/or cash payments. The startup doesn't have a set targeted incentives amount, according to Zhao.","So-Col's simp token was listed on KuCoin in January and the platform aims to list the token on more exchanges, including Binance, OKX, ByBit and Bitget, said Zhao.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"Irene Zhao","content":"PERSON"},{"type":"Conflux Network","content":"ORGANIZATION"},{"type":"last May","content":"DATE"},{"type":"May","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"$4.5 million","content":"MONEY"},{"type":"February 2024","content":"DATE"},{"type":"$3 million","content":"MONEY"},{"type":"Zhao","content":"PERSON"},{"type":"$6.25 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"February 2022","content":"DATE"},{"type":"$1.75 million","content":"MONEY"},{"type":"Col","content":"ORGANIZATION"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["STRATEGIC INVESTMENTS"],"authors":["Yogita Khatri","The Block"]}