{"summary":"The DEX, which is expected to launch its v2 next quarter, has surpassed other protocols on Polygon by enabling permissionless listings.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/138224\/synfutures-surfaces-as-leading-derivatives-exchange-on-polygon","publishDate":"2022-03-17T08:36:27","id":8435,"type":null,"title":"SynFutures Surfaces as Leading Derivatives Exchange on Polygon","category":["SPONSORED"],"content":["<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The DEX, which is expected to launch its v2 next quarter, has surpassed other protocols on Polygon by enabling permissionless listings.<\/span><\/i>","<span data-v-f87c67ca=\"\">While there is no shortage of decentralized finance (DeFi) projects across the Polygon ecosystem, one decentralized derivatives exchange is seeing dramatic growth on the platform —and it’s still in v1 beta.<\/span>","<a href=\"https:\/\/bit.ly\/3wlzQ1J\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">SynFutures<\/span><\/a><span data-v-f87c67ca=\"\">, a decentralized exchange (DEX) with an aim to make derivatives trading more accessible to the masses, launched last year and is seeing traction across its four deployed chains, Ethereum, Polygon, Arbitrum, and BNB Chain. However, Polygon is its most active, accounting for over $800 million in monthly average trading volume. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><b data-v-f87c67ca=\"\">Polygon’s Growing DeFi Ecosystem<\/b>","<span data-v-f87c67ca=\"\">Polygon has a robust DeFi ecosystem with more than 7,000 decentralized applications (dApps) deployed on its network, including major DeFi players such as Aave, Curve, and Uniswap. The network offers a wide range of secure, fast, affordable and energy-efficient Ethereum scaling and infrastructure solutions for dApps—one of the reasons SynFutures co-founder and CEO Rachel Lin credits with SynFutures’ early decision to deploy on Polygon. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“We initially deployed on Ethereum but the barriers to trading on the network were too large to ignore, namely, cost and speed. It was evident that to reach our goals and create a truly accessible platform, we had to deploy on networks like Polygon to address these scaling issues at hand.”<\/span>","<b data-v-f87c67ca=\"\">Making Derivatives Trading Accessible<\/b>","<span data-v-f87c67ca=\"\">Despite the variety of leading dApps on the platform, including many popular DEXs, SynFutures has risen to the top of the derivatives protocols. Today, more than 26,000 users have made trades on Polygon, and 80-plus Polygon assets have been listed on SynFutures.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“SynFutures’ user-friendly platform combined with Polygon’s scalability and low fees was really a game changer for not only our ecosystem but anyone who wants to get into derivatives trading,'' Lin added.<\/span>","<span data-v-f87c67ca=\"\">SynFutures has two key features that separate it from other DeFi derivatives exchanges. Traders can list any futures pair in just a few clicks, supporting any asset with a price feed from cryptocurrencies and traditional equities to gold, indices, or any other real-world asset. To enable permissionless listings, SynFutures takes an approach similar to Uniswap V3, allowing anyone to list and provide liquidity to new pairs. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">The platform also offers a highly-intuitive user experience with a clean and minimal user interface that makes it easy for new retail traders to explore derivatives. SynFutures’ sAMM model also enables single token liquidity, allowing liquidity providers to provide liquidity to pairs using a single token. <\/span>","<b data-v-f87c67ca=\"\">Driving Adoption with Long-tail Assets<\/b>","<b data-v-f87c67ca=\"\"><\/b><b data-v-f87c67ca=\"\"><\/b><span data-v-f87c67ca=\"\">A main focus for SynFutures is addressing the unmet demand for long-tail assets, which is a significant driver of growth in the derivatives market. As it expands its products and listings, the derivatives DEX is committed to its growth on Polygon but also expanding its multi-chain strategy to create a more robust derivatives market that supports assets across all networks. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“Derivatives play an important role in any healthy financial market. As DeFi continues to evolve, so will the need for permissionless platforms like ours. We look forward to continuing to expand our partnerships within the Polygon ecosystem to the greater benefit of our users and the broader DeFi ecosystem,” said Lin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">After recently releasing its <\/span><a href=\"https:\/\/medium.com\/synfutures\/synfutures-releases-2022-roadmap-4920d1f0829e\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">2022 roadmap<\/span><\/a><span data-v-f87c67ca=\"\">, SynFutures is expected to launch its v2 testnet in the coming weeks. Registration for early access is <\/span><a href=\"https:\/\/synfutures.wufoo.com\/forms\/m1qosqcy0ib2hfq\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">now available.&nbsp;<\/span><\/a>","<span data-v-f87c67ca=\"\">For more information, visit <\/span><a href=\"https:\/\/www.synfutures.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">synfutures.com<\/span><\/a><span data-v-f87c67ca=\"\"> and follow SynFutures on Twitter (<\/span><a href=\"https:\/\/twitter.com\/synfuturesdefi\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">@SynFuturesDeFi<\/span><\/a><span data-v-f87c67ca=\"\">).&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lin","content":"PERSON"},{"type":"SynFutures","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Uniswap V3","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Arbitrum","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$800 million","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"},{"type":"Rachel Lin","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}