{"summary":"Current CBDC models are &quot;not a viable cash equivalent that people could use in daily transactions,&quot; according to Fadi Aboualfa, head of research at Copper.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237656\/cbdcs-are-not-yet-a-viable-replacement-for-cash-says-head-of-research-at-copper","publishDate":"2023-07-04T05:25:55","id":8438,"type":null,"title":"CBDCs are not yet a viable replacement for cash, says head of research at Copper","category":["CRYPTO INFRASTRUCTURE"],"content":["Current CBDC models are \"not a viable cash equivalent that people could use in daily transactions,\" according to Fadi Aboualfa, head of research at crypto brokerage Copper.","Central banks are either researching or trialing CBDC pilots, with the <a href=\"https:\/\/www.theblock.co\/post\/235800\/bis-makes-case-for-unified-ledger-but-describes-crypto-as-a-flawed-system\" data-v-f87c67ca=\"\">Bank of International Settlements (BIS)<\/a> progressing a \"unified ledger\" system for global interoperability.","However, Aboualfa questioned the feasibility of current models. \"There hasn't been an actual CBDC model that is technically a replacement for cash, they all have several flaws and a central bank issuing a CBDC would be a mammoth undertaking for multiple reasons,\" he told The Block.","The researcher explained that central bank digital currencies (CBDCs) can be issued in two different ways, directly from a central bank, or via commercial banks. He said central banks don't have the talent or the infrastructure to run a fully automated decentralized equivalent to cash. \"Each central bank design is creating its own siloed approach, and the retail wallet infrastructure isn't there yet,\" he added.","In the case of CBDCs issued by intermediary banks, Aboualfa said consumer confidence issues could arise if tokens have specific commercial bank branding. \"Commercial bank-issued CBDCs could lead to chaos in decentralized open markets if scandalous news hits one of the banks,\" he added.","He outlined the complexity of establishing trading pairs and difficulty in maintaining a peg between CBDC brands issued by commercial banks. Aboualfa used <a href=\"https:\/\/www.theblock.co\/post\/225635\/usdc-stablecoin-supply-stabilizes\" data-v-f87c67ca=\"\">Silicon Valley Bank as an example,<\/a> saying that if it had issued a CBDC, consumers would have lost confidence as soon as it fell into distress, causing its token to lose parity with other dollar-pegged CBDCs.","He added that the crucial factor of CBDC interoperability has not been adequately considered. Arguing current designs point to multiple blockchains with intermediaries controlling the flow. \"In the erroneous pursuit of common standards and blockchain use, how is everyone supposed to agree on the design and structure of a CBDC worldwide at the same time? The designs and models need to allow for integration, not vendor lock-in, and every central bank will have different considerations and requirements,\" he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fadi Aboualfa","content":"PERSON"},{"type":"Bank of International Settlements (BIS","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"CBDC","content":"ORGANIZATION"},{"type":"Aboualfa","content":"PERSON"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":["BOE","CBDCS","DECENTRALIZED INFRASTRUCTURE","ECB","FEDERAL RESERVE","WALLET MAKERS"],"authors":["Brian McGleenon","The Block"]}