{"summary":"The feature comes as one integral part of the digital yuan ecosystem that China is building ahead of the formal launch of its DC\/EP system.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/95266\/beijing-digital-yuan-cash-atm","publishDate":"2021-02-18T11:17:59","id":8440,"type":null,"title":"Latest Beijing test features ATMs that convert digital yuan to cash","category":["CHINA"],"content":["The latest digital yuan test in Beijing featured automatic teller machines that could convert China's central bank digital currency to physical cash and vice-versa.","The Chinese capital is the latest city to conduct a real-world digital yuan test. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/94144\/beijing-digital-yuan-test-china-15m\" data-v-f87c67ca=\"\">The $1.5 million trial<\/a> took place during the Lunar New Year holiday in early February.&nbsp;","As part of the test, the Industrial and Commercial Bank of China (ICBC) debuted eight ATMs in two of its branches in Beijing that had the icon of e-CNY (electronic Chinese yuan) on them.","A video clip from local business media Financial News offers a first-hand look at how the conversion between digital yuan and physical cash works in practice.","The feature is an integral part of the digital yuan framework that China is building ahead of a formal launch of its Digital Currency \/ Electronic Payment system.","Based on the video clip, the eight ATMs sport a feature called 'digital transaction.' By selecting the feature, users can choose whether they want to convert cash into digital yuan or the other way around.","The banker demonstrating the function suggested that to deposit cash, customers must first type in the phone numbers they used to activate their digital yuan wallets. The process then takes a few seconds to credit the balance to the users’ mobile wallets.","To convert digital yuan into cash, users must scan a QR code on the ATM screen using their digital yuan wallet app and then type in the cash amount that they want to withdraw. After a few seconds, the teller machine delivers the requested cash.","","","Another new feature from the Beijing test — compared to previous ones conducted in Shenzhen and Suzhou — was the option to use digital yuan hardware wallets, including a regular one and an advanced version with fingerprint verification.","Images from China Economy Daily show that the hardware looks similar to the card-based prototype that was introduced in a Shanghai test in a limited environment.","The pitch is that the hardware wallet will be useful for senior citizens and others who aren’t savvy with mobile phones and applications, although, just like a traditional wallet, it carries the risk of getting lost or stolen.","According to China Economy Daily, <a href=\"http:\/\/www.ce.cn\/xwzx\/gnsz\/gdxw\/202102\/12\/t20210212_36312501.shtml\" data-v-f87c67ca=\"\">the Postal Savings Bank of China<\/a> debuted a more advanced version of the card-based wallet that features fingerprint verification. Only the card owner can use it to pay for goods in digital yuan after verifying their fingerprints on the card itself, the outlet added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Beijing","content":"LOCATION"},{"type":"Postal Savings Bank of China","content":"ORGANIZATION"},{"type":"$1.5 million","content":"MONEY"},{"type":"Commercial Bank of China (ICBC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Shenzhen","content":"LOCATION"},{"type":"February","content":"DATE"},{"type":"Digital Currency \/ Electronic","content":"ORGANIZATION"},{"type":"Suzhou","content":"LOCATION"},{"type":"China Economy Daily","content":"ORGANIZATION"},{"type":"Shanghai","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"Financial News","content":"ORGANIZATION"},{"type":"ATM","content":"ORGANIZATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}