{"summary":"Canaan is poised to significantly increase its self-mining capacity after a testing period of nearly six months.\nThe firm has 0.85 EH\/s of computing power that’s waiting for deployment and another 1 EH\/s is set to ship by end of January.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124438\/bitcoin-miner-canaan-self-hash-rate","publishDate":"2021-11-16T09:27:04","id":845,"type":null,"title":"Bitcoin mining hardware maker Canaan to boost its self-mining hash rate to 1.8 EH\/s","category":["Mining"],"content":["China-based Bitcoin mining hardware manufacturer Canaan is set to increase its self-mining hash rate to 1.8 exahashes per second, which would account for 1% of the network's current total.","The scaling plan positions Canaan to become a major Bitcoin mining company as it seeks to adjust the balance between the sales of its spot and future orders and proprietary mining capacity.","Nangeng Zhang, founder and chairman of Canaan, said in the firm's Q3 earnings call on Tuesday that its current operating hash rate has been kept at 0.032 EH\/s since the inception of its self-mining business in Q2 in its bid to sort out operation, compliance and taxation issues.&nbsp;","Another batch of Canaan's Avalon miners with a total computing power of 0.85 EH\/s have already arrived in the facility of its hosting partners in Kazakhstan, waiting to be deployed, Zhang added.","He said Canaan has also signed additional contracts to host another 1 EH\/s of proprietary hash rate and the scheduled shipments will start by the end of January. In comparison, Canaan said in its Q3 earnings report that it sold 6 EH\/s of computing power over the past three months.","Meanwhile, the firm is holding negotiations on hosting deals with North American facilities for around 200 megawatts of power capacity, Zhang said.","The self-mining business – with a gross margin of 61% – has so far generated 23.86 BTC for Canaan's balance sheet as of Q3, worth about $1.4 million at BTC's current prices.","\"Our current strategy is to hold our Bitcoin and we will not trade them in the short term,\" Zhang said in the earnings call. \"However, we do not rule out the possibility of trading them in the future.\"","Prior to the earnings call, Canaan also released its Q3 financial results, which featured the largest quarterly revenue in its history.&nbsp;","Canaan booked $204.5 million in net revenues for Q3, up 21.8% from the previous record high in Q2. The net income for the period has also increased to $75 million.&nbsp;","That figure also reflects the increasing purchasing volume coming from institutional investors into the Bitcoin mining sector.","As of the end of Q3, Canaan said it had contract liabilities of $159.3 million, which represented the down payments made by institutional investors for the pre-orders of its Avalon miners to be delivered in the coming quarters.&nbsp;","Zhang said during the call that the delivery schedule for pre-orders has lined up until the second half of next year, a similar situation seen by other manufacturers like Bitmain and MicroBT.","Perhaps expectedly, Zhang said that next year, an increase in mining hardware prices as a result of the global chip shortage and supply chain constraint might be inevitable.","\"We have to recognize that the continued industry-wide supply chain constraint has created a seller's market [for foundries]. Consequently, increasing wafer prices is natural and inevitable,\" said Zhang. \"Against this backdrop of unstable wafer supply, we are discussing a series of flexible strategies that include accepting price increases under certain conditions to ensure our supply.\"","As The Block <a href=\"https:\/\/www.theblockcrypto.com\/linked\/115708\/bitmain-bitcoin-miner-wafer-price-increase\" data-v-f87c67ca=\"\">reported<\/a> previously, the world's biggest Bitcoin mining hardware maker Bitmain also faced the same issue of the cost increase of raw materials due to the global chip shortage."],"hashtag":[]}