{"summary":"The Bank of England and the FCA have issued a request for feedback on their proposed approach to regulating stablecoins.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261658\/bank-of-england-fca-seek-feedback-on-proposals-for-stablecoin-regulation","publishDate":"2023-11-06T08:22:11","id":845,"type":null,"title":"BoE and FCA seek feedback on proposals for stablecoin regulation","category":["REGULATION"],"content":["The Bank of England and the Financial Conduct Authority are seeking feedback on their proposals for regulating stablecoins.","The <a href=\"https:\/\/www.theblock.co\/post\/237790\/bank-of-england-teams-up-with-wallet-maker-for-cbdc-privacy\" data-v-f87c67ca=\"\">Bank of England<\/a> and the United Kingdom's <a href=\"https:\/\/www.theblock.co\/post\/260456\/paypal-uk-registers-with-fca-for-crypto-services-but-faces-stringent-restrictions\" data-v-f87c67ca=\"\">Financial Conduct Authority<\/a> have requested feedback on their proposed approach to regulating stablecoins.","According to a <a href=\"https:\/\/www.bankofengland.co.uk\/news\/2023\/november\/fca-and-bank-of-england-publish-proposals-for-regulating-stablecoins?utm_source=Bank+of+England+updates&amp;utm_campaign=79ddbf81ca-EMAIL_CAMPAIGN_2023_11_06_08_53&amp;utm_medium=email&amp;utm_term=0_-79ddbf81ca-%5BLIST_EMAIL_ID%5D\" data-v-f87c67ca=\"\">statement<\/a> from the BoE released on Monday, the proposals cover any future payment systems that use stablecoins in the UK at a systemic scale.","The BoE clarified that the necessity for regulating stablecoins arises from the potential risk to financial stability. \"Payments systems using stablecoins, if widely used for retail payments in the UK, could pose risks to financial stability,\" it added.&nbsp;","The proposals come in two discussion papers, one from the <a href=\"https:\/\/www.bankofengland.co.uk\/paper\/2023\/dp\/regulatory-regime-for-systemic-payment-systems-using-stablecoins-and-related-service-providers\" data-v-f87c67ca=\"\">BoE<\/a> and another from the <a href=\"https:\/\/www.fca.org.uk\/publications\/discussion-papers\/dp23-4-regulating-cryptoassets-phase-1-stablecoins\" data-v-f87c67ca=\"\">FCA<\/a>.","The BoE's paper outlines the UK's central bank's intention to regulate operators of systemic payment systems that utilize stablecoins, as well as stablecoin issuers and wallet providers. \"Our proposals aim to support safe innovation so that firms can understand the risks they need to manage and ensure that the public can be confident in all forms of digital money and payments,\" Bank of England Deputy Governor for Financial Stability Sarah Breeden said.","Both discussion papers seek to evaluate the potential benefits stablecoins could provide to UK consumers and retailers — in particular, by making payments faster and cheaper. The FCA paper explores the proposed regulation around issuing and holding <a href=\"https:\/\/www.theblock.co\/post\/259797\/stablecoins-need-to-be-regulated-says-federal-reserves-barr\" data-v-f87c67ca=\"\">stablecoins<\/a>. “Stablecoins have the potential to make payments faster and cheaper for all, and that’s why we want to offer firms the ability to utilize this innovation safely and securely,\" FCA Executive Director of Consumers and Competition Sheldon Mills said.","Mills added that the reason the UK's regulatory bodies are seeking feedback is so that proportionate rules can be created \"that benefit consumers and firms and also meet our objectives.\"","The UK's Prudential Regulatory Authority also issued a <a href=\"https:\/\/www.bankofengland.co.uk\/prudential-regulation\/letter\/2023\/innovations-in-the-use-of-deposits-emoney-and-regulated-stablecoins\" data-v-f87c67ca=\"\">statement<\/a> on Monday aimed at deposit-takers and the risks that arise from deploying multiple forms of digital money. The BoE body that handles prudential regulation statement comes in the form of a letter called \"Innovations in the use by deposit-takers of deposits, e-money and regulated stablecoins.\"&nbsp;","On Monday, the FCA, BoE, and PRA also published a <a href=\"https:\/\/www.bankofengland.co.uk\/paper\/2023\/cross-authority-roadmap-on-innovation-in-payments\" data-v-f87c67ca=\"\">cross-authority&nbsp;roadmap<\/a> that explains how the UK’s current and proposed regulatory regimes for issuers of different forms of digital money or money-like instruments will interact.","Regulating stablecoins is the first phase of the UK's <a href=\"https:\/\/www.theblock.co\/post\/260020\/uk-treasury-releases-final-proposals-for-crypto-asset-regulation\" data-v-f87c67ca=\"\">plans<\/a> to introduce a comprehensive crypto asset regulatory regime. The UK Treasury released its final proposals for regulating crypto assets on Oct. 30, in which the FCA was given powers to oversee the issuance and custody of fiat-backed stablecoins in the UK.","“We welcome the discussion papers jointly published today by the FCA and Bank of England exploring how the UK will regulate stablecoins in the future. CryptoUK will form a Working Group to provide a unified response from the industry and engage bilaterally with key stakeholders to provide the sector’s perspective on these important issues,” a CryptoUK spokesperson said.","The BoE and FCA are seeking feedback from the public and industry by Feb. 6 2024.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"United Kingdom's <a href=\"https:\/\/www.theblock.co\/post\/260456\/paypal-uk-registers-with-fca-for-crypto-services-but-faces-stringent-restrictions\" data-v-f87c67ca=\"\">Financial Conduct Authority","content":"ORGANIZATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"Working Group","content":"ORGANIZATION"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"Sheldon Mills","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"\" Bank of England Deputy Governor for Financial Stability Sarah Breeden","content":"ORGANIZATION"},{"type":"Prudential Regulatory Authority","content":"ORGANIZATION"},{"type":"the Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"Oct. 30","content":"DATE"},{"type":"PRA","content":"ORGANIZATION"},{"type":"UK Treasury","content":"ORGANIZATION"},{"type":"Feb. 6 2024","content":"DATE"}],"hashtag":["FCA"],"authors":["Brian McGleenon","The Block"]}