{"summary":"TrueUSD has sent an email to its clients, warning them about a security breach that led to the exposure of personally identifiable information.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256661\/trueusd-third-party-security-breach-revealed-blockchain-wallet-addresses-of-clients","publishDate":"2023-10-16T08:08:56","id":8450,"type":null,"title":"TrueUSD third-party security breach revealed blockchain wallet addresses of clients","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Stablecoin issuer <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">TrueUSD <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248373\/trueusd-tusd-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/tusd.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">TUSD<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.049%\n    <\/span><\/a> <!----><\/span><\/span> was hit by a third-party security breach that led to the exposure of personally identifiable information of some of its clients.<\/span>","The information included the first and last names of customers, their email addresses, and phone numbers (for customers who were onboarded in 2018-2019.) Client addresses, dates of birth, bank names, transaction histories, and blockchain account public addresses were also exposed.","The breach involved TrueUSD's former banking, customer onboarding, and product management service provider TrueCoin, according to an email seen by The Block.","TrueCoin informed TrueUSD that on September 20, 2023, a third-party vendor notified them about \"an anomalous account change within TrueCoin's organization made by a compromised support vendor.\" TrueCoin added it has no logs of the attacker downloading, altering, or removing personal identifiable information from its systems.","The email said that immediately after this notification, TrueCoin's cybersecurity and engineering teams initiated an investigation to determine the extent of the breach. \"TrueCoin took swift action to prevent any further unauthorized access. TrueCoin's own internal systems were not compromised,\" the message noted.","TrueUSD added that in light of this incident, it recommends that customers carefully monitor their personal accounts for any suspicious activity. TrueUSD added that clients should beware of any phishing attacks, and to contact the company if they notice anything unusual.","\"We would like to clarify that the online hacking was directed towards a third-party vendor that was engaged by TrueCoin, the former operator of TUSD until July 2023. In its previous capacity as the operator, TrueCoin was in possession of certain historical data of TUSD users.<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n\"TUSD is no longer using this vendor, and hence we are not directly affected by the incidence. Nevertheless, we have reached out to relevant users for information purpose and to assure that there is no operational breach of any sort for TUSD. We would like to emphasize that TUSD system is secure and has not be affected by this incident,\" TrueUSD told The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"September 20, 2023","content":"DATE"},{"type":"TrueCoin","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"-0.049%","content":"PERCENT"},{"type":"July 2023","content":"DATE"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Brian McGleenon","The Block"]}