{"summary":"The Nevada Financial Institutions Division said Thursday that crypto custodian Prime Trust could not meet all customer withdrawals.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236097\/nevada-regulator-says-prime-trust-cant-meet-all-client-withdrawals","publishDate":"2023-06-22T18:18:13","id":8451,"type":null,"title":"Nevada regulator says Prime Trust can&#x27;t meet all client withdrawals","category":["COMPANIES"],"content":["The Nevada Financial Institutions Division said Thursday that crypto custodian Prime Trust could not meet all customer withdrawals.","The regulator said it had been monitoring the company's solvency ahead of the planned acquisition by BitGo that was <a href=\"https:\/\/www.theblock.co\/post\/236014\/bitgo-says-its-terminating-acquisition-of-prime-trust\" data-v-f87c67ca=\"\">called off<\/a> on Thursday.&nbsp;","\"Prime failed to safeguard assets under its custody and cannot meet all client withdrawals,\" the regulator said in an emailed response to questions. \"As such, Prime has breached its fiduciary duties to its clients, in violation of Nevada trust laws.\"","\"NFID’s primary objective is to preserve any enterprise value remaining in Prime for the benefit of Prime’s clients,\" the regulator added. It said it sent a cease-and-desist order to the company on June 21, ordering it to stop&nbsp;accepting fiat and cryptocurrency from existing and new clients for custody purposes.&nbsp;","BitGo earlier this month had signed a non-binding term sheet to acquire 100% of the equity of Prime Core Technologies, the parent company of Prime Trust. It said Thursday that the decision to end the deal came \"after considerable effort and work to find a path forward.\"","In the Nevada <a href=\"https:\/\/fid.nv.gov\/uploadedFiles\/fidnvgov\/content\/Opinion\/Prime%20Trust%20-%20C%20and%20D%206.21.23.pdf\" data-v-f87c67ca=\"\">enforcement action<\/a>, the regulator said it started a \"safety and soundness examination\" of the firm on Nov. 7. The firm reported a negative $12.1 million stockholders' equity position in a March report.","\"The overall financial condition of Respondent has considerably deteriorated to a critically deficient level, and Respondent is now in position where it is in an unsafe or unsound condition to transact business and\/or if it were to continue to operate it would be in an inviable and\/or unsafe manner,\" the regulator said.","On around June 21, the firm was not able to honor customer withdrawals due to a shortfall of customer funds, which was caused by a \"significant liability\" on its balance sheet, the regulator added.","\"Additionally, Respondent failed to safeguard assets under its custody and is unable to meet all customer withdrawals,\" it added. \"As such, Respondent has materially and willfully breached its fiduciary duties to its clients.\"","Fiat onramp service Stably, which relies on Prime Trust as its regulated custodian, said earlier in the day that it was forced to pause some services and operations as a result of Prime Trust freezing withdrawals and deposits.&nbsp;","Securitize Markets also said it is temporarily pausing its Cash Balance feature and secondary trading on the Securitize Markets ATS.","\"In the event that you are unable to withdraw any funds from your Prime Trust account, our parent company, Securitize, Inc., will make you whole,\" it wrote in an email sent to customers that was seen by The Block. \"Given today’s events, we have expedited our already planned migration away from Prime Trust to a new cash custodian, and we anticipate that migration to be complete in approximately one month.\"","Coinmetro said in a&nbsp;<a href=\"https:\/\/twitter.com\/CoinMetro\/status\/1671859408031055875\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">post<\/a> on Twitter that it was currently unable to process new USD transactions as a result. TrueUSD, meanwhile, said the TUSD stablecoin was <a href=\"https:\/\/www.theblock.co\/post\/236042\/prime-trust-halted-deposits-withdrawals-after-order-from-nevada-regulator\" data-v-f87c67ca=\"\">not affected<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Respondent","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Nov. 7","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"$12.1 million","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Nevada Financial Institutions Division","content":"ORGANIZATION"},{"type":"Prime Core Technologies","content":"ORGANIZATION"},{"type":"Securitize, Inc.","content":"ORGANIZATION"},{"type":"Nevada","content":"LOCATION"},{"type":"June 21","content":"DATE"},{"type":"Prime Trust","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sarah Wynn","Nathan Crooks","The Block"]}