{"summary":"Farcaster has overtaken FriendTech in weekly revenue as it faces its first big test in creating a sustainable system.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277013\/farcaster-revenue-hits-600000-during-protocols-second-wave-of-attention","publishDate":"2024-02-12T05:08:00","id":8454,"type":null,"title":"Farcaster revenue hits $600,000 during protocol’s second wave of attention","category":["CRYPTO ECOSYSTEMS"],"content":["Farcaster’s total revenue has reached $600,000, showing that not only are crypto individuals interested in using the platform, but they are also willing to pay for it.","The decentralized social media platform’s early success resembles that of FriendTech in some ways. When the latter launched, it experienced <a href=\"https:\/\/www.theblock.co\/post\/252072\/friend-tech-users-have-earned-12-million-in-fees-but-is-it-sustainable\" data-v-f87c67ca=\"\">multiple waves of attention<\/a>, with fees rising in large spikes before ultimately fading away as the attention dissipated and the project failed to find sustainability. While Farcaster is today’s social platform of choice among the crypto community, the question remains whether it will be able to find what FriendTech didn’t: longevity.","Farcaster’s first wave of attention was in early December 2023, when the platform saw a small bump in users paying for platform storage. The second wave started in late January and appears to have peaked in early February. This recent wave was far larger and saw a massive rise in user signups, the number of daily users, and the number of posts per day — largely driven by the launch of the in-app engagement tool Frames.","Frames have helped to drive up demand by bringing native monetization into the app. A common use of Frames is to provide another Farcaster user with an NFT if they follow the original poster’s account and repost their Frame. The lure of grabbing free NFTs and other potential airdrops attracted much of the crypto community to expand from Twitter and Discord to Farcaster in much larger numbers than ever before (despite figureheads like Ethereum co-founder Vitalik Buterin having made the switch to other social media platforms including Farcaster long before).","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/social-decentralized-finance\/farcaster-revenue\/embed\" title=\"Farcaster Revenue\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Yet unlike most social media platforms, Farcaster isn’t free to use. Farcaster charges its users ongoing storage fee costs to host the data that’s generated by daily use.&nbsp;The storage fee is $5 per year for 5,000 posts, 2,500 reactions and 2,500 follows. Part of these fees go to the platform and some are used for paying transaction fees and processing credit card information.","Clients building on Farcaster can also charge their own fees. On Warpcast, the posting fee is $0.01 per post, although there are a number of reward mechanisms that provide free posts.","There is some reasoning for this. The main one is that charging fees per post could help prevent spam. The other is that, in order for the project to be sufficiently decentralized, it needs to work on its own systems without a company paying to store everyone’s data and funding that through advertising. Instead, by having users pay for their own storage costs, the platform is able to escape the trappings of centralized control.","That said, users are clearly attempting to keep fees to a minimum. When making transactions, through Frames for instance, users will still need to pay blockchain transaction fees. These can be on a number of different blockchains, including even the Ethereum mainnet until recently.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/social-decentralized-finance\/farcaster-daily-users\/embed\" title=\"Farcaster Daily Users\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Over the last few weeks, most Farcaster users have switched to using the Coinbase-built Base network for on-chain transactions —&nbsp;peaking at 83% of transactions, according to <a href=\"https:\/\/dune.com\/pixelhack\/farcaster\" data-v-f87c67ca=\"\">data from Dune Analytics<\/a>. This will largely be due to the network’s low fees. It may also have been helped by Farcaster co-founder Dan Romero being a former Coinbase vice president, while current Coinbase protocol lead Jesse Pollak is one of the most popular users on the platform, the data shows.","While Farcaster and FriendTech are very different platforms, with quite different forms of monetization, they do share the experience of being the crypto community social app du jour, largely due to speculation on potential airdrops. Yet Farcaster is about to face the reality that the community won’t stay around for long, unless it manages to find a flywheel effect — something that’s easier said than done.","<em data-v-f87c67ca=\"\">Update: Clarified fees on Farcaster vs clients.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$600,000","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"83%","content":"PERCENT"},{"type":"$5","content":"MONEY"},{"type":"$0.01","content":"MONEY"},{"type":"Twitter","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Farcaster","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"December 2023","content":"DATE"},{"type":"Jesse Pollak","content":"PERSON"},{"type":"Dan Romero","content":"PERSON"}],"hashtag":["FARCASTER"],"authors":["Tim Copeland","The Block"]}