{"summary":"A major driving force of Web3 is the strong belief in community and the need to support one another. For Web3 projects, users aren’t just the customers but a core part of the product.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193873\/for-babylons-its-all-about-the-community","publishDate":"2022-12-10T08:50:20","id":846,"type":null,"title":"For Babylons: It’s All About The Community","category":["SPONSORED"],"content":["A major driving force of Web3 is the strong belief in community and the need to support one another. For Web3 projects, users aren’t just the customers but a core part of the product. The current trend is ‘community-first,’ under which Web3 projects focus on community feedback to improve the product, add more features based on their needs, and exist majorly to incentivize their users.","Babylons, an NFT and GameFi platform, believes that its “community-first” ethos has been crucial to its success, even through the current crypto winter. To appreciate their dedicated community, they’ve established well-laid plans for further incentives.","At the core, every Babylons product was made to reward the users and community. Babylons has always respected creator royalties and used platform\/trading fees for giveback programs.","At the heart of their global community is the BABI Army, the extended voices of Babylons in the ecosystem, and the crypto space in general. The most engaged community members get rewarded through <a href=\"https:\/\/babylons.crew3.xyz\/\" data-v-f87c67ca=\"\">different quests and tasks<\/a>, such as quizzes and polls.","Also, there are whitelists and NFT giveaways alongside different NFT trading competitions based on top traders of selected collections.","Partnerships are the bread and butter of the Web3 space. Babylons value useful partnerships with both Web2 and Web3 projects. They will continue adding to their list of multichain partners to allow their users to enjoy special trade-to-earn and List-to-Earn incentives, a 0% platform fee, and surprise floor sweeps. At the same time, other communities experience the Babylons platform, become part of the community, and enjoy the rewards.&nbsp;","<strong data-v-f87c67ca=\"\">Free Mint Series<\/strong>","Babylons announced the release of a collection of <a href=\"https:\/\/learn.babylons.io\/babylons-free-to-mint-collection-a952ccf7de62\" data-v-f87c67ca=\"\">Free-to-mint NFTs<\/a> to serve as boosters for their upcoming official PFP NFT collection. They also grant their users access to exclusive benefits from their products and services. There will be 155 unique NFTs in the free mint collection with different rarity tiers on each network selected, and the community will be automatically whitelisted.","With a community-first approach, Babylons seeks to create exponential value for their users.","Join the Babylons community today.","<a href=\"https:\/\/twitter.com\/BabylonsNFT\" data-v-f87c67ca=\"\">Twitter<\/a> | <a href=\"https:\/\/t.me\/babylonsnft\" data-v-f87c67ca=\"\">Telegram<\/a> <a href=\"https:\/\/blog.babylons.io\/\" data-v-f87c67ca=\"\">Medium<\/a> | <a href=\"https:\/\/discord.gg\/3URxf7Syfd\" data-v-f87c67ca=\"\">Discord<\/a>","<em data-v-f87c67ca=\"\">This post is commissioned by Lunar Strategy and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"BABI Army","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"PFP NFT","content":"ORGANIZATION"},{"type":"0%","content":"PERCENT"},{"type":"Telegram<\/a> <a href=\"https:\/\/blog.babylons.io\/\" data-v-f87c67ca=\"\">Medium<\/a> | <a href=\"https:\/\/discord.gg\/3URxf7Syfd\" data-v-f87c67ca=\"\">Discord","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}