{"summary":"Albert Meo, a former executive at Morgan Stanley, is joining Prometheum’s ranks as chief financial officer, according to a statement released on Monday\nPrometheum’s Aaron Kaplan said Meo’s hire is a testimony to the firm’s “regulatory first approach,” in an interview on Monday with The Block. ","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280474\/prometheum-hires-ex-morgan-stanley-exec-as-cfo-for-regulatory-first-approach","publishDate":"2024-03-04T14:07:17","id":846,"type":null,"title":"Prometheum hires ex-Morgan Stanley exec as CFO for &#x27;regulatory first approach&#x27;","category":["Companies"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A new addition to Promethem's leadership is a testimony to the firm's \"regulatory first approach,\" s<\/span><span class=\"s2\" data-v-f87c67ca=\"\">aid Aaron Kaplan, co-chief executive officer at what is currently the sole crypto securities platform registered in the U.S.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Albert Meo, formerly an executive at Morgan Stanley &amp; Co., LLC, is joining Prometheum Inc.'s ranks as chief financial officer, according to a <a href=\"https:\/\/www.businesswire.com\/news\/home\/20240304817234\/en\/Prometheum-Appoints-Albert-P.-Meo-CPA-as-Chief-Financial-Officer\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">statement<\/span><\/a> released on Monday. Meo was a executive director of regulatory policy at Morgan Stanley, where he was responsible for overseeing the firm's policy functions for registrants with the Securities and Exchange Commission and the Commodity Futures Trading Commission.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Our appointment of Albert as CFO at Prometheum really stands as a testament to our regulatory first approach that has really long underpinned our strategy,\" Kaplan said in an interview with The Block. \"We've always been regulation first and our thought process was that we have to integrate with the securities laws in order to be compliant, and basically he has deep expertise there.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Kaplan said that Meo will be an excellent addition to the team, and added that the move \"really shows our maturation and moving forward to basically launching regulated financial markets on distributed ledger technology.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Hiring Meo comes at a pivotal time for Prometheum, coming on the heels of last month's announcement that its subsidiary, Prometheum Capital LLC, will provide custodial services for <a href=\"https:\/\/www.theblock.co\/post\/276482\/digital-asset-firm-prometheum-sets-sights-on-offering-ether-custodial-services\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">ether<\/span><\/a>. The firm's plan is to offer trading, clearing and settlement services to retail and institutional clients this year, according to previous statements.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Last year, Prometheum received authorization from the Financial Industry Regulatory Authority (FINRA) to provide crypto clearing and settlement services via a special purpose broker dealer license, which t<\/span><span class=\"s2\" data-v-f87c67ca=\"\">he SEC <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-05-23\/prometheum-capital-sees-path-to-register-with-sec-as-special-purpose-broker\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">granted<\/span><\/a> in May 2023.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Prometheum's steps forward come as the SEC has consistently warned that crypto exchanges need to register with the agency. In the past year, the SEC has brought charges against Coinbase, Binance and Kraken, accusing them of functioning as unregistered exchanges, brokers, dealers, and clearinghouses. Meanwhile, crypto firms have argued that it's not possible to register with the agency.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">After obtaining its license from the SEC several months ago, Prometheum quickly drew the ire of Republican lawmakers and others in the crypto industry.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">In July, the Blockchain Association, an industry group representing Coinbase, Kraken and Ripple among others, <a href=\"https:\/\/www.theblock.co\/post\/239239\/blockchain-association-demands-probe-into-sec-approval-of-prometheum\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">asked<\/span><\/a> the SEC's inspector general to look into the agency's granting of that special purpose broker dealer license.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The association argued that Prometheum had received the license, while applications from other crypto firms were rejected, and said there was a 'sweetheart' deal in exchange for support of the SEC's policy goals. At the time, the group did not present concrete evidence linking Kaplan's congressional testimony in June — where he stated that new, crypto-specific regulations were unnecessary — to the approval of the license a month prior.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Kaplan has <a href=\"https:\/\/www.theblock.co\/post\/268883\/prometheum-gets-the-go-ahead-from-finra-to-offer-digital-asset-securities-clearing-services\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">previously<\/span><\/a> countered claims from crypto firms that registering with the SEC is not possible.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"By keeping your head down and working within the regulation and trying to work within the law as opposed to change the law, one can achieve success when properly registering under the securities law as evidenced by first the approval for the special purpose broker dealer and now the approval to clear and settle,\" Kaplan said in an interview in December.<\/span>"],"hashtag":["CFTC","SEC"]}