{"summary":"Ara, a peer-to-peer content distribution platform, announced that it has added Simon Morris, the former BitTorrent CSO and BitTorrent token designer as an","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/13215\/a-new-p2p-content-distribution-platform-adds-a-former-bittorrent-executive-as-an-advisor","publishDate":"2019-02-22T16:39:10","id":8460,"type":null,"title":"A new P2P content distribution platform adds a former BitTorrent executive as an advisor","category":["PEOPLE"],"content":["<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/ara.one\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/ara.one\/\" data-v-f87c67ca=\"\">Ara<\/a>, a peer-to-peer content distribution platform, announced that it has added Simon Morris, the former BitTorrent CSO and BitTorrent token designer as an advisor.","Regular followers of the crypto industry may know Morris from his <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/breakermag.com\/former-bittorrent-exec-says-theres-no-way-its-token-can-run-on-tron\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/breakermag.com\/former-bittorrent-exec-says-theres-no-way-its-token-can-run-on-tron\/\" data-v-f87c67ca=\"\">Breakermag interview<\/a>, in which he questioned the viability of BitTorrent’s token running on Tron’s blockchain. In the interview, Morris stated there was “no way” Tron’s blockchain could handle the transaction volume on BitTorrent.","Morris is now taking his deep knowledge of peer-to-peer content distribution networks to Ara.","Tony Mugavero, CEO of Ara, tells The Block that Morris joined the company because he wanted content creators to join in the success of distributed content sharing platforms, like BitTorrent. BitTorrent, Mugavero explains, “doesn’t incentivize people to be fans of the network.”","In a press release shared with The Block, Morris states that “the BitTorrent ecosystem evolved into a consumer-dominated insurgency which cut out not just middle-men but creators too,” adding that “Ara is aiming to leverage the power of blockchain and p2p technologies to build a more sustainable and equitable digital content ecosystem for everyone.”","Unlike BitTorrent, which has often <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/en.wikipedia.org\/wiki\/Legal_issues_with_BitTorrent\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/en.wikipedia.org\/wiki\/Legal_issues_with_BitTorrent\" data-v-f87c67ca=\"\">operated<\/a> in the gray areas of copyright laws where users can download copyrighted content without paying for it, Ara is going a different route.","On Ara, consumers will offer their unused computing storage capacity to host and distribute content on behalf of content creators. In return, Ara’s platform rewards these consumers with 10 percent of the revenue generated from the sale of content. The remaining 90 percent will go straight to the content creators. Ara will likely also introduce a reputation feature to track the movement of content and flag illegal downloads.","Traditional content creators and publishers often face a content distribution problem. Publishers can either distribute their content through third-party distribution services or sell their content directly to consumers. The problem with the former is the <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.theverge.com\/2018\/11\/30\/18120577\/valve-steam-game-marketplace-revenue-split-new-rules-competition\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.theverge.com\/2018\/11\/30\/18120577\/valve-steam-game-marketplace-revenue-split-new-rules-competition\" data-v-f87c67ca=\"\">high fees<\/a> these third-parties charge. The problem with the latter is the high cost of developing infrastructure to self-host and distribute. Ara believes its platform provides a solution.","“BitTorrent was only used for one thing: people steal content, and that’s it,” Mugavero said. He argues that by contrast, Ara enables publishers to control their content and distribution and allows consumers to generate revenue from renting their unused storage space.","Early testing of Ara’s network, however, shows sparse interest in the service, with only 30 to 40 companies testing out its platform. However, Ara is currently in its early stages of development. Mugavero tells The Block that Ara will soon leverage its historical business connections with production studios like NBC Studios to onboard new content creators, noting the firm has “paper agreements” with movie studios and broadcast networks.","Whether Ara can succeed in changing human nature for wanting free content, is to be seen, but the addition of Simon Morris as an advisor might prove fruitful.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Simon Morris","content":"PERSON"},{"type":"BitTorrent CSO","content":"ORGANIZATION"},{"type":"BitTorrent","content":"ORGANIZATION"},{"type":"NBC Studios","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Morris","content":"PERSON"},{"type":"Tony Mugavero","content":"PERSON"},{"type":"Mugavero","content":"PERSON"},{"type":"10 percent","content":"PERCENT"},{"type":"90 percent","content":"PERCENT"}],"hashtag":[],"authors":["Steven Zheng","The Block"]}