{"summary":"The Cosmos Hub is preparing for the anticipated Rho network upgrade — set to launch today at around 8 p.m. EST.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212030\/cosmos-hub-to-undergo-rho-network-upgrade-today","publishDate":"2023-02-15T12:03:00","id":8463,"type":null,"title":"Cosmos Hub to undergo Rho network upgrade today","category":["CRYPTO ECOSYSTEMS"],"content":["The Hub, the central chain of the <a href=\"https:\/\/www.theblock.co\/post\/185784\/making-the-cosmos-hub-more-relevant-with-cosmos-co-founder-ethan-buchman\" data-v-f87c67ca=\"\">Cosmos ecosystem<\/a>, is preparing for the anticipated Rho network upgrade that's set to launch today around 8 p.m. EST at a block height of 14,099,412.","The upgrade will bring with it a range of improvements to Cosmos' testing infrastructure, as well as the addition of what's called the \"global fee\" software <a href=\"https:\/\/github.com\/cosmos\/gaia\/blob\/main\/docs\/modules\/globalfee.md\" data-v-f87c67ca=\"\">module<\/a> — an added piece of code that will allow transaction fees to be collected from users and distributed globally.","The aim is to improve the security of the Cosmos network by reducing the likelihood of validators colluding or misbehaving, the core development team at Cosmos <a href=\"https:\/\/medium.com\/the-interchain-foundation\/cosmos-hubs-rho-upgrade-is-coming-110fed68de8a\" data-v-f87c67ca=\"\">said<\/a>.","Cosmos — an ecosystem of more than 200 blockchains — lets developers build new application-specific chains. The network relies on core technologies and frameworks, such as the Tendermint consensus and the Cosmos software development kit, to create individual chains such as Kava, <a href=\"https:\/\/www.theblock.co\/post\/193252\/cosmos-largest-dex-osmosis-launches-a-stableswap-exclusive\" data-v-f87c67ca=\"\">Osmosis<\/a>, Injective, Thorchain, Evmos and <a href=\"https:\/\/www.theblock.co\/post\/206661\/layer-1-blockchain-canto-sees-surge-in-trading-activity\" data-v-f87c67ca=\"\">Canto<\/a>. Such chains are connected with each other using the Cosmos Hub and Inter-Blockchain Communication (IBC) communication protocol.","Rho lays the groundwork for another future upgrade called <a href=\"https:\/\/www.theblock.co\/post\/154482\/cosmos-hub-set-to-introduce-interchain-security-within-three-months\" data-v-f87c67ca=\"\">Interchain Security<\/a> that's planned for release in the first quarter of 2023 and will allow individual chains on Cosmos to secure themselves by using the same security validators that run Cosmos Hub, which functions as a hub for other blockchain networks and allows for cross-chain communication and interoperability.","The Hub team has <a href=\"https:\/\/twitter.com\/cosmoshub\/status\/1625561971268456458\" data-v-f87c67ca=\"\">cautioned<\/a> users that there may be a short downtime period during the network upgrade.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the first quarter of 2023","content":"DATE"},{"type":"8 p.m.","content":"TIME"},{"type":"Cosmos","content":"ORGANIZATION"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Injective","content":"LOCATION"},{"type":"Thorchain","content":"LOCATION"},{"type":"Canto","content":"ORGANIZATION"},{"type":"IBC","content":"ORGANIZATION"}],"hashtag":["COSMOS"],"authors":["Vishal Chawla","The Block"]}