{"summary":"The venture capital giant and largest U.S. crypto exchange want the SEC to go back to the drawing board on a new rule aimed at tightening safeguards around customer assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229944\/a16z-sec-crypto-regulation-investment-advisers-coinbase","publishDate":"2023-05-09T15:56:35","id":8467,"type":null,"title":"A16z, Coinbase push back on SEC investment adviser rule proposal","category":["EXCHANGES"],"content":["Venture capital firm Andreessen Horowitz complained to the U.S. Securities and Exchange Commission that proposed new regulations around custody requirements for registered investment advisers could effectively prevent them from ever using centralized exchanges to hold crypto or make trades for their clients.","Coinbase, the largest U.S.-based centralized exchange, has also written to the SEC to protest the proposed new regulation.","The comments come after <a href=\"https:\/\/www.theblock.co\/post\/211786\/sec-to-vote-on-rule-that-would-tighten-crypto-custody-requirements\" data-v-f87c67ca=\"\">the SEC proposed tweaking its custody rule<\/a> in February to broaden what it covers, in part due to the growth of the crypto industry and major firm failures, and their impact on customers. If approved by the commission, the rule would expand requirements for investment advisers to safeguard \"any client assets of which an adviser has custody\" beyond the current custody rule that covers funds and securities. The rule would affect <a href=\"https:\/\/investmentadviser.org\/industry-snapshots\/\" data-v-f87c67ca=\"\">15,000 investment advisers in the U.S.<\/a> who manage $128.4 trillion in assets of all kinds for 64.7 million clients.","Though crypto is not the only field affected by the proposed rule change, it clearly was top of mind for the commission when it proposed the tweak.","“The current model in the crypto field is a model that takes control, one would say ownership, of those funds, and commingles that with thousands, and often hundreds of thousands or even millions of other customer funds,” SEC Chair Gary Gensler told reporters following a vote to move the proposed rule forward. He <a href=\"https:\/\/www.theblock.co\/post\/212241\/gensler-opens-new-regulatory-front-for-crypto-firms-custody\" data-v-f87c67ca=\"\">singled out crypto exchanges<\/a>, due to how they're modeled, as not meeting current standards for qualified custodians, whether or not the proposed rule change passes.&nbsp;","<a href=\"https:\/\/www.sec.gov\/rules\/proposed\/2023\/ia-6240.pdf\" data-v-f87c67ca=\"\">The SEC’s proposal<\/a> is intended to safeguard the way that investment advisers handle crypto for clients. <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-30\" data-v-f87c67ca=\"\">The SEC wants<\/a> investment advisers who have “custody” of client assets to hold them in “properly segregated” accounts. “These protections are designed, among other things, to ensure client assets are properly segregated and held in accounts to protect the assets in the event of a qualified custodian bankruptcy or other insolvency,” the <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-30\" data-v-f87c67ca=\"\">SEC said in a statement announcing the rules review<\/a>.","In the last year or so, clients of bankrupt firms like Celsius and FTX have discovered to their horror that the funds in their accounts are actually assets that belong to the bankruptcy estate, and not to them, due to commingling of assets and <a href=\"https:\/\/www.theblock.co\/post\/199628\/celsius-ruling-shines-light-on-crypto-user-agreement-fine-print\" data-v-f87c67ca=\"\">terms of service<\/a> that handed control of assets deposited to companies that subsequently failed.&nbsp;","In order to preserve customer accounts in the event of company failure, crypto firms could park customer assets with banks or broker-dealers that provide custodial services, Gensler said. National bank BNY Mellon, as well as crypto-friendly state-chartered Paxos and Custodia, already offer crypto custodial services.&nbsp;","Parts of the crypto industry argue that prohibiting commingling of funds is a problem for centralized exchanges like Coinbase which operate non-segregated or commingled crypto wallets, which the exchange owns and controls. The exchanges make all the necessary trades and credit the customers’ accounts. The bottom line, however, is that “custody” of all customers’ funds is maintained by the centralized exchange, not in a wallet that is solely controlled by the customer or their investment adviser.","“We fear that absent a suitable self-custodial exception, the proposed Rule would effectively ban RIAs [registered investment advisers] from holding and transacting in crypto assets for clients,” a16z <a href=\"https:\/\/api.a16zcrypto.com\/wp-content\/uploads\/2023\/05\/a16z-Safeguarding-Rule-Comment-Letter.pdf\" data-v-f87c67ca=\"\">wrote to the SEC<\/a>. “The Safeguarding Rule would not permit an RIA to trade a crypto asset on a centralized trading platform, because such platforms are not qualified custodians, and trading the asset would entail moving it out of custody.”","<a href=\"https:\/\/www.theblock.co\/post\/226966\/a16z-crypto-orange-ball-andreessen-horowitz\" data-v-f87c67ca=\"\">A16z has dedicated a $7 billion-plus fund to investing in crypto<\/a>, which includes backing for Coinbase.","Coinbase Chief Legal Officer Paul Grewal echoed the venture firm's concerns.","“The proposal would ban RIAs from trading on non-QC [qualified custodian] crypto exchanges,\" he said in <a href=\"https:\/\/twitter.com\/iampaulgrewal\/status\/1655744709543997440\" data-v-f87c67ca=\"\">a tweet early this morning<\/a>. \"This wouldn’t benefit RIAs or their clients and would in fact harm them. Thus the SEC should allow limited non-QC exposure so RIAs can trade crypto for their clients.”","","","\"The Commission uses the requirement to justify banning RIA client trades on crypto exchanges that are not qualified custodians,” Grewal continued.&nbsp;","The criticism is a notable reversal for Grewal, who told Bloomberg two months ago that the proposal would not affect Coinbase.&nbsp;&nbsp;","“I think that when it comes to Coinbase, we see SEC officials recognize that specifically Coinbase is operating in a qualified manner,” Grewal <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-02-15\/coinbase-says-it-already-complies-with-sec-crypto-qualfied-custodian-plan?in_source=embedded-checkout-banner\" data-v-f87c67ca=\"\">said in February<\/a>. “In a lot of ways, this is about bringing the rest of the industry to the standard Coinbase has set for itself.”","The SEC’s comment period closes <a href=\"https:\/\/www.sec.gov\/files\/ia-6240-fact-sheet.pdf\" data-v-f87c67ca=\"\">this month<\/a>.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"RIA","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Grewal","content":"PERSON"},{"type":"BNY Mellon","content":"ORGANIZATION"},{"type":"early this morning","content":"TIME"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"$7 billion","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$128.4 trillion","content":"MONEY"},{"type":"Custodia","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Paul Grewal","content":"PERSON"}],"hashtag":["COINBASE","FTX"],"authors":["Jim Edwards","The Block"]}