{"summary":"Digital Currency Group, which owns Coindesk, Genesis Global Trading and Greyscale Investments, has backed DAO tooling startup Mural. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164945\/digital-currency-group-backs-dao-tooling-startup-mural-in-5-6-million-seed-round","publishDate":"2022-08-23T10:00:42","id":8469,"type":null,"title":"Digital Currency Group backs DAO tooling startup Mural in $5.6 million seed round","category":["WEB3"],"content":["Digital Currency Group has backed Mural, a startup building decentralized autonomous organization (DAO) treasury tools for brands, in a $5.6 million seed round.","Galaxy Ventures, Firstminute Capital, AlleyCorp and 186 Ventures also took part according to an announcement Tuesday. When asked by The Block, the startup chose not to clarify the lead investor in the round nor reveal its valuation.","The deal closed in the second quarter of this year amid a period of turbulence for crypto startups looking to raise venture funding.&nbsp;","A DAO is a decentralized structure that gives investors the ability to vote on proposals ranging from a protocol’s marketing efforts to a new product. Investors are able to vote by using the DAO’s native governance token, which can also be sold to raise funds.","In a sign of the increasing importance of such structures, in March of this year, the total assets under management controlled by DAOs hit more than $8 billion after reaching a high of more than $16 billion previously <a href=\"https:\/\/www.theblockresearch.com\/building-and-running-a-dao-managing-risk-work-and-people-136694\" data-v-f87c67ca=\"\">according to The Block research<\/a>.&nbsp;","","","Mural is building tools so that brands can take advantage of DAOs, offering tooling to ease the launch of DAOs and the management of treasuries. For instance, it allows brands to easily deploy funds to those invested in the community, along with financial reporting tools.&nbsp;","“Mural is laying the foundational technology needed for all enterprises to be able to efficiently and securely manage critical financial infrastructure in an entirely new web3 global economy,” said Giuseppe Stuto of 186 Ventures. “DAOs are leading the way in showing the world how to build decentralized innovation of tomorrow, and the Mural team has all of the necessary ingredients to make this vision a reality.”","The company says that its services are already used by Superf3st, a festival founded by the creator of Outside Lands and Bonaroo. Superf3st already allows holders of its non-fungible tokens (NFTs) to submit and vote on governance proposals for its event, and will use Mural to store, manage and deploy its DAO treasury funds.&nbsp;","As of today, the company has launched its platform in beta and says it's focused on bringing in more customers.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$5.6 million","content":"MONEY"},{"type":"second quarter of this year","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Giuseppe Stuto","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Firstminute Capital","content":"ORGANIZATION"},{"type":"$16 billion","content":"MONEY"},{"type":"March of this year","content":"DATE"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["DIGITAL CURRENCY GROUP"],"authors":["Tom Matsuda","The Block"]}