{"summary":"Hut 8 and US Bitcoin will merge to form Hut 8 Corp.\nThe new company will have 5.6 EH\/s of self-mining and access to 825 megawatts across six sites.","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209265\/bitcoin-miners-hut-8-and-us-bitcoin-merge-to-form-new-us-based-entity","publishDate":"2023-02-07T08:44:10","id":847,"type":null,"title":"Bitcoin miners Hut 8 and US Bitcoin merge to form new US-based entity","category":["Mergers &amp; Acquisitions"],"content":["Bitcoin miners Hut 8 and US Bitcoin (USBTC) are merging to form a new company called Hut 8 Corp, which will be based in the United States.","Hut will have a total self-mining capacity of 5.6 EH\/s, according to <a href=\"https:\/\/www.prnewswire.com\/news-releases\/hut-8-and-us-bitcoin-announce-merger-of-equals-to-create-a-preeminent-digital-asset-mining-hosting-managed-infrastructure-operations-and-high-performance-computing-organization-301740489.html\" data-v-f87c67ca=\"\">a press release<\/a>. The new company will have access to 825 megawatts across six sites with self-mining, hosting and managed infrastructure operations. &nbsp;Shares of Hut 8 were up +2.9% in pre-market on Nasdaq.","\"Our established track record of creating shareholder value through organic growth and strategic acquisitions while maintaining a balance sheet-first approach has positioned us perfectly to advance our growth trajectory through this business combination,\" said Hut 8 CEO Jaime Leverton, who will stay in that role at the new company.","The merger is pending court and regulatory approvals, and will be put to the vote in a special meeting of Hut 8 shareholders — also requiring consent from USBTC stockholders. This is expected to happen in the second quarter.","Meanwhile, Hut 8 will give USBTC a bridge loan ranging from $6.0 to $6.5 million.","\"During the interim period, we plan to cover our operating costs through a combination of selling the Bitcoin we mine, selling from our stack and\/or exploring various debt options, as agreed under the terms of the Business Combination Agreement,\" Leverton also said.","Hut 8 is a public company currently trading on Nasdaq and the Toronto Stock Exchange, and the new company's common stock will require approval for listing on those exchanges.","According to the plan, shareholders of Hut 8 will get 0.2 of a share of common stock for each Hut 8 share, while<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;s<\/span>tockholders of USBTC will get 0.6716 of a share for each or each share of USBTC capital stock That means that “existing Hut 8 shareholders and USBTC stockholders will each collectively own, on a fully-diluted in the money basis, approximately 50% each of the stock of the Combined Company,” the statement said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","While there's been consolidation in the mining industry during the current bear market, it has mostly been in asset acquisitions. US Bitcoin, for instance, recently bought bankrupt Compute North's 50% share of a 280-megawatt wind power facility in Texas."],"hashtag":["MINING COMPANIES","PUBLIC COMPANY M&AMP;A"]}