{"summary":"Treasury official Brian Nelson will tell House lawmakers the agency&#x27;s concerns about crypto in illicit finance and ask for more authority","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277356\/us-treasury-will-outline-fears-about-use-of-crypto-in-illicit-finance-at-upcoming-hearing","publishDate":"2024-02-13T15:23:41","id":8472,"type":null,"title":"US Treasury will outline fears about use of crypto in illicit finance at upcoming hearing","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A U.S. Treasury official will outline the agency's concerns about crypto in illicit finance to House lawmakers and ask for more authority to go after bad actors, according to prepared testimony ahead of a congressional hearing set for Wednesday.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Treasury is deeply concerned about the use of virtual assets for all illicit financial activity,\" Brian Nelson, Treasury's Under Secretary for Terrorism and Financial Intelligence, said in prepared <a href=\"https:\/\/docs.house.gov\/meetings\/BA\/BA00\/20240214\/116841\/HHRG-118-BA00-Wstate-NelsonB-20240214.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">remarks<\/span><\/a> ahead of the House Financial Services Committee hearing focused on terrorism and illicit finance.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lawmakers in Washington have increasingly turned their attention to illicit finance in crypto. Sen. Elizabeth Warren, D-Mass., has been pushing for her anti-money laundering bill, while Senate Banking Committee Chair Sherrod Brown, D-Ohio, has said he is in talks <\/span><span class=\"s3\" data-v-f87c67ca=\"\">&nbsp;about a bill that would target the use of digital assets for money laundering, according to <a href=\"https:\/\/subscriber.politicopro.com\/article\/2024\/01\/brown-lines-up-anti-money-laundering-legislation-00136114\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">Politico<\/span><\/a>.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">Treasury has been working for the past decade on a framework to combat the financing of terrorism that \"mitigates illicit finance risks while promoting responsible innovation,\" Nelson said in his prepared testimony.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">Treasury does have tools to address some issues, including authorities to hold firms accountable that don't comply with the Bank Secrecy Act.<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">\"However, to root out illicit finance by players in virtual asset markets and forums, we need additional tools and resources,\" Nelson said. \"That is why we are eager to work with Congress to adopt common-sense reforms that update our tools and authorities to match the evolving challenges we face today.\"<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Late last year, <\/span><span class=\"s1\" data-v-f87c67ca=\"\">the Treasury Department sent <a href=\"https:\/\/www.theblock.co\/post\/265227\/u-s-treasurys-wally-adeyemo-calls-for-more-authority-to-go-after-bad-actors-in-crypto\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">recommendations<\/span><\/a> to lawmakers to amplify its authorities, including one that calls for new sanctions tools, to go after bad actors in crypto. Treasury also had said that stablecoins need more oversight, though they were not mentioned in Nelson's testimony.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Nelson will also tell lawmakers about Treasury's efforts to block Hamas from moving or raising funds to support terrorism and said the agency is looking out for new methods the group may use.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"While we continue to assess that terrorists’ use of digital assets remains a small fraction of more established mechanisms to move money, we recognize that terrorist groups have and may continue to turn to digital assets to raise, transfer, and store their illicit proceeds,\" Nelson said.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Nelson said Treasury will continue to target financing tied to Hamas in the future.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Nelson's remarks comes a week after Treasury released its 2024 National Risk Assessments on Money Laundering, Terrorist Financing, and Proliferation Financing, which highlighted illicit finance threats and risks in the U.S., including crypto. The <a href=\"https:\/\/www.theblock.co\/post\/276548\/us-treasury-says-criminals-and-scammers-are-increasingly-turning-toward-crypto\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">reports<\/span><\/a> noted that drug laundering, for example, is mostly cash-based, though the agency said bad actors are increasingly turning toward virtual assets.&nbsp;<\/span>","The House Financial Services Committee's digital assets focused panel will also host a <a href=\"https:\/\/financialservices.house.gov\/calendar\/eventsingle.aspx?EventID=409142\" data-v-f87c67ca=\"\">hearing<\/a> on Thursday focused on crypto and illicit activity.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"Proliferation Financing","content":"ORGANIZATION"},{"type":"Financial Intelligence","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sherrod Brown","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"National Risk Assessments on Money Laundering","content":"ORGANIZATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"Politico","content":"LOCATION"},{"type":"Mass.","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Ohio","content":"LOCATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Hamas","content":"ORGANIZATION"},{"type":"Nelson","content":"LOCATION"},{"type":"Brian Nelson","content":"PERSON"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Nelson","content":"PERSON"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}