{"summary":"Binance Korea, a crypto-to-crypto exchange of Binance for Korean users, is shutting down next month. The closure comes just eight months after the platform&#x27;s launch in April 2020.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/89198\/binance-korea-shutting-down-crypto-exchange","publishDate":"2020-12-24T04:00:08","id":8476,"type":null,"title":"Binance Korea is shutting down just eight months after its launch","category":["EXCHANGES"],"content":["Binance Korea, a crypto-to-crypto exchange of Binance for Korean users, is shutting down next month.","In a <a href=\"https:\/\/support.binance.kr\/hc\/ko\/articles\/900004909003--%EA%B3%B5%EC%A7%80-%EB%B0%94%EC%9D%B4%EB%82%B8%EC%8A%A4KR-%EA%B0%80%EC%83%81%EC%9E%90%EC%82%B0-%EA%B1%B0%EB%9E%98%EC%86%8C-%EC%84%9C%EB%B9%84%EC%8A%A4-%EC%A2%85%EB%A3%8C-%EC%95%88%EB%82%B4\" data-v-f87c67ca=\"\">notice published<\/a> Thursday, Binance <a href=\"https:\/\/www.theblockcrypto.com\/linked\/4205\/north-korean-hackers-are-now-targeting-individual-cryptocurrency-users\" data-v-f87c67ca=\"\">Korea<\/a> said it is difficult to operate because of tight liquidity and low transaction volumes. The closure comes just eight months after the exchange's <a href=\"https:\/\/www.theblockcrypto.com\/post\/60384\/binance-is-launching-a-new-exchange-in-south-korea-next-week\" data-v-f87c67ca=\"\">launch in April 2020<\/a>.","Binance Korea <a href=\"https:\/\/www.binance.com\/en\/amp\/blog\/421499824684900487\/Binance-to-Launch-Korean-Crypto-Exchange-on-Binance-Cloud\" data-v-f87c67ca=\"\">was leveraging<\/a> the functionalities of Binance, such as its liquidity and order matching engine. But according to a <a href=\"https:\/\/thenews.asia\/order-book-sharing-to-be-banned-on-korean-exchanges\/\" data-v-f87c67ca=\"\">forthcoming law in South Korea<\/a>, crypto exchanges can no longer share their order books with other exchanges.","\"It is forbidden to allow customers to trade virtual assets with customers of other virtual asset operators through partnerships with other virtual asset operators,\" per the law, which is coming into force on March 25. It could get implemented earlier as well, according to local reports.","Binance <a href=\"https:\/\/www.theblockcrypto.com\/linked\/48093\/south-korea-plans-to-invest-over-380m-for-blockchain-research-and-development\" data-v-f87c67ca=\"\">Korea<\/a> did not directly cite the law as a reason for the closure but said, \"it is difficult to provide smooth transaction liquidity.\"","Deposits are closing Thursday, trading is halting on January 8, and withdrawals are getting disabled on January 29, 2021, per the notice.","Binance Korea's Android mobile app available in the beta version is also shutting down next month.","The exchange provided trading pairs in Binance KRW (BKRW), the exchange's native stablecoin backed by Korean won (KRW). The supported coins included bitcoin (BTC), ether (ETH), and BNB, among others.","It should be noted that Binance had acquired Korean fintech company BxB to launch Binance Korea. It is not clear what's next for that entity. Binance Korea CEO Jiho Kang said: \"We plan to reassess our strategies based on the current market situation.\" He added that the exchange will aim to \"find a balance between providing robust services and offerings to users while ensuring compliance with regulatory requirements.\"","Binance CEO Changpeng Zhao said, \"we will continue looking for ways to improve and provide the best services for users including our KR [Korean] community.\"","Binance rivals Huobi and OKEx also operate local exchanges in Korea. It is not clear whether they will follow suit and shut down their platforms in the country. Huobi and OKEx did not respond to The Block's requests for comments by press time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Jiho Kang","content":"PERSON"},{"type":"April 2020","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Binance <a href=\"https:\/\/www.theblockcrypto.com\/linked\/4205\/north-korean-hackers-are-now-targeting-individual-cryptocurrency-users\" data-v-f87c67ca=\"\">Korea","content":"LOCATION"},{"type":"KRW","content":"ORGANIZATION"},{"type":"March 25","content":"DATE"},{"type":"January 8","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"January 29, 2021","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Binance Korea","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"Huobi","content":"PERSON"}],"hashtag":["BINANCE"],"authors":["Yogita Khatri","The Block"]}