{"summary":"There is a destructive belief in the crypto-ecosystem that a successful decentralized application (dApp) needs a native token to support it. It is because","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254\/no-your-dapp-does-not-need-a-token-to-succeed","publishDate":"2018-08-27T17:10:10","id":848,"type":null,"title":"No, your dApp does not need a token to succeed","category":["LAYER 1S"],"content":["There is a destructive belief in the crypto-ecosystem that a successful decentralized application (dApp) needs a native token to support it. It is because of this belief that many projects raise tens to hundreds of millions of dollars only to find themselves attempting to make their dApps work with their tokens instead of building usable products.","It is hard, however, to blame entrepreneurs in this space. When your competitors are raising, via ICOs, what amounts to Series D rounds for back-of-a-napkin products you can’t help but to take a seat on that same rocket ship. Ultimately, ICOs have done a disservice to entrepreneurs: ICO wealth has blinded many who now believe that successful dApps need native tokens. This is not true.","Tokenless dApps like&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.openbazaar.org\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.openbazaar.org\" data-v-f87c67ca=\"\">OpenBazaar<\/a>&nbsp;and&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/joinmastodon.org\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/joinmastodon.org\" data-v-f87c67ca=\"\">Mastodon<\/a>&nbsp;have succeeded not because have they raised millions of dollar through ICOs (they haven’t) but because they are building products in spaces where needs are unmet. Additionally, instead of making their dApps challenging to use — by incorporating “<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.coindesk.com\/three-definitions-tokenomics\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.coindesk.com\/three-definitions-tokenomics\/\" data-v-f87c67ca=\"\">tokenomics<\/a>” wherever possible — these dApps prioritize easy-to-use interfaces and the frictionless onboarding of users. If you force users to use your native tokens to access your dApps, in hopes of creating utility for your token, users are not going to use your products.","In the last 24 hours, OpenBazaar added&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/openbazaar.com\/discover\/stats\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/openbazaar.com\/discover\/stats\" data-v-f87c67ca=\"\">373<\/a>&nbsp;new nodes onto its platform. This number, alone, is enough to place OpenBazaar as the&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/dappvolume.com\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/dappvolume.com\/\" data-v-f87c67ca=\"\">5th most actively used dApp<\/a> — assuming each node represents a new user. To clarify, this is the number of&nbsp;<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">new&nbsp;<\/strong>nodes that OpenBazaar has added and not the total number of OpenBazaar nodes — <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/openbazaar.com\/discover\/stats\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/openbazaar.com\/discover\/stats\" data-v-f87c67ca=\"\">which is approximately 75K<\/a>. Just think, a dApp without a native token has added more users in a day than the daily-active-users for a majority of dApps with native tokens.","Now the point is not that dApps do not need native tokens (though they really don’t). It is to show entrepreneurs that they can build successful dApps without them. Just take a look at Mastodon: The founder did not seek funding or launch a native token. Instead, he built a great product that people needed and has&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/sp3r4z.fr\/mastodon\/general\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/sp3r4z.fr\/mastodon\/general\" data-v-f87c67ca=\"\">1.5 million users<\/a>. That’s more rewarding than a token no one wants — or needs.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"last 24 hours","content":"DATE"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"}],"hashtag":[],"authors":["Steven Zheng","The Block"]}