{"summary":"But the ruling is a narrow one that may not apply to other NFTs, the judge noted.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214100\/dapper-labs-nba-top-shot-moments-nfts-are-securities-federal-judge-rules","publishDate":"2023-02-22T13:26:21","id":8480,"type":null,"title":"Dapper Labs&#x27; NBA Top Shot Moments NFTs are securities, federal judge rules","category":["LEGAL"],"content":["NBA Top Shot Moments NFTs meet the requirements to be considered a security, a federal judge said in a court filing on Wednesday, giving the green light to a class-action lawsuit against Dapper Labs.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The judge denied a motion by Dapper Labs CEO Roham Gharegozlou to dismiss a lawsuit that alleges his firm violated securities laws by selling NBA Top Shot Moments NFTs without standard registration and disclosure applied to other investment contracts.&nbsp;","Judge Victor Marrero’s decision is narrow, he noted in a court filing, and may not apply to other NFTs.&nbsp;","“Not all NFTs offered or sold by any company will constitute a security, and each scheme must be assessed on a case-by-case basis,” Marrero wrote.","The judge applied the Howey Test, a legal tool for determining whether a transaction counts as an investment contract, as well as more recent case law around initial coin offerings to determine whether the NFTs count as securities. The judge cited the company's control over Top Shots after they are sold, as well as specific tweets promoting the NFTs in his court filing that used emojis to suggest the assets would gain value.","\"Although the literal word ‘profit’ is not included in any of the tweets, the ‘rocket ship’ emoji, ‘stock chart’ emoji, and ‘money bags’ emoji objectively mean one thing: a financial return on investment,” Marrero wrote.","Dapper Labs did not immediately respond to a request for comment.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> The ruling is not a final judgment against Dapper or Gharegozlou, but allows the lawsuit, originally filed in 2021 in the U.S. District Court for the Southern District of New York, to move forward.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Roham Gharegozlou","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Victor Marrero","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Marrero","content":"PERSON"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}