{"summary":"This is the first time a case involving NFTs has been tried through the lens of intellectual property law and is therefore precedent-setting for the digital asset space. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209756\/jury-favors-hermes-in-metabirkin-trademark-dispute-says-nfts-are-not-art","publishDate":"2023-02-08T13:07:01","id":8481,"type":null,"title":"Jury favors Hermes in MetaBirkin trademark dispute, says NFTs are not art","category":["METAVERSE & NFT"],"content":["Luxury handbag maker Hermes won in court against the artist producing an NFT dupe of its flagship trademark Birkin.&nbsp;","A nine-person jury in New York returned the verdict on Wednesday, ordering the artist of the \"MetaBirkin,\" Mason Rothschild, to pay $133,000 in damages. The jury also ruled that the NFTs are not protected under the First Amendment, which protects freedom of speech, according to media reports.","Rothschild had customized blockchain-based images of the iconic handbag, which has been featured in TV shows such as \"Sex and the City\" in its original form and can cost hundreds of thousands of dollars. The NFTs featured one bag with horns, and others swathed in <a href=\"https:\/\/www.instagram.com\/p\/CXMMcJSlCMY\/?hl=en\" data-v-f87c67ca=\"\">fluffy material<\/a> covered in emojis.&nbsp;","Only 100 were released, of the 1,000 designs Rothschild had planned. The project launched in 2021.","This is the first time a case involving NFTs has been tried through the lens of intellectual property law and is therefore precedent-setting for the digital asset space. It tested whether NFTs are commodities or art, under law.&nbsp;","Early last year there was a rush of brands trademarking their IP in the online realm. The volume of companies filing trademarks for the metaverse saw a parabolic decline after <a href=\"https:\/\/www.theblock.co\/post\/199462\/nft-related-trademarks-fall\" data-v-f87c67ca=\"\">March 2022<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"Mason Rothschild","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Rothschild","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Birkin","content":"LOCATION"},{"type":"First Amendment","content":"ORGANIZATION"},{"type":"$133,000","content":"MONEY"},{"type":"Hermes","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}