{"summary":"Those who buy ZigZag&#x27;s governance tokens in an initial sale will decide the requirements for its upcoming airdrop.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153131\/zigzag-dex-to-sell-governance-tokens-with-airdrop-down-the-line","publishDate":"2022-06-20T12:58:14","id":8482,"type":null,"title":"ZigZag DEX to sell governance tokens with airdrop down the line","category":["DEFI"],"content":["Decentralized exchange ZigZag <a href=\"https:\/\/twitter.com\/ZigZagExchange\/status\/1538914642277281793\" data-v-f87c67ca=\"\">announced<\/a> Monday that it intends to conduct an airdrop for early adopters but with a caveat: the requirements of the airdrop will be decided by those who purchase governance tokens in a sale.","ZigZag will be selling the governance tokens — with the ticker ZZ — on its exchange on June 24. It's offering 2 million tokens out of a total supply of 100 million tokens. The token's sale price will be decided by trading on the exchange.","Those who buy the governance tokens will be the initial members of the ZigZag DAO, a community that will help decide how the platform evolves over time. One of the first orders of business will be to decide the details of the airdrop.","Crypto airdrops started out as a large sudden gift of tokens to early adopters of protocols. Yet over time, as traders started to use certain protocols in the hope of qualifying for any potential airdrops, projects had to start being more restrictive, adding in more detailed requirements to be eligible. This meant that some airdrops ended up with a <a href=\"https:\/\/www.theblockcrypto.com\/news+\/124393\/the-delicate-balance-of-getting-a-big-crypto-airdrop-right\" data-v-f87c67ca=\"\">negative response<\/a> from their community.","ZigZag acknowledged in a tweet thread that it faced a similar problem of \"airdrop farmers\" attempting to game the system. This means the airdrop needs to be restricted in some way to make it fair. Yet ZigZag noted that it didn't want to be a centralized party dictating the restrictions.","The exchange is trying to sidestep the issue by having the community decide how the airdrop should work. Yet to do so, it was caught in a catch-22: how to have the community vote on how governance tokens are handed out — without the tokens already being out there? ZigZag's solution is to sell a small percentage and have those token holders decide on the rest.","Yet it does produce an interesting result. Those who have a lot to potentially gain from an airdrop have a greater incentive to buy more governance tokens to have a greater say on how the airdrop is handed out — potentially enabling them to improve the distribution in their favor.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"ZigZag DAO","content":"ORGANIZATION"},{"type":"June 24","content":"DATE"},{"type":"22","content":"DATE"}],"hashtag":["AIRDROP","ETHEREUM","ZKSYNC"],"authors":["Tim Copeland","The Block"]}