{"summary":"Crypto wallet MetaMask appears to have been removed from the Apple App Store. MetaMask has yet to provide comment.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256525\/metamask-appears-to-have-been-removed-from-the-apple-app-store","publishDate":"2023-10-14T10:32:51","id":8486,"type":null,"title":"MetaMask appears to have been removed from the Apple App Store","category":["CRYPTO ECOSYSTEMS"],"content":["<em data-v-f87c67ca=\"\">Update: MetaMask has returned to the App Store.<\/em>","Crypto wallet MetaMask's mobile app appears to have been removed from the Apple App Store.","The app no longer appears in the App Store and direct links to the app — such as the one on <a href=\"https:\/\/metamask.io\/download\/\" data-v-f87c67ca=\"\">MetaMask's download page<\/a> — no longer work.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">We expect MetaMask to be back on the App Store shortly, and we sincerely apologize for any inconvenience this may have caused,\" said the <a href=\"https:\/\/twitter.com\/MetaMask\/status\/1713225787678306731\" data-v-f87c67ca=\"\">MetaMask account on X<\/a>.<\/span>","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">We're aware, working on figuring out what happened, and resolving the issue asap,\" MetaMask Lead Product Manager Taylor Monahan <a href=\"https:\/\/twitter.com\/tayvano_\/status\/1713203148872139109\" data-v-f87c67ca=\"\">said on X<\/a>. \"This issue exclusively impacts those trying to install the app fresh from the Apple App Store. And we will be resolving that issue [very] shortly.\"<\/span>","We have reached out to Apple and MetaMask and will update this article should we hear back.","<em data-v-f87c67ca=\"\">Updated with tweet from Taylor Monahan and MetaMask.<br data-v-f87c67ca=\"\">\n<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Apple App Store","content":"ORGANIZATION"},{"type":"Taylor Monahan","content":"PERSON"}],"hashtag":["WALLETS"],"authors":["Tim Copeland","The Block"]}