{"summary":"The Block&#x27;s data dashboard shows total stablecoin supply has declined from $138 billion at the start of the year to $124 billion on July 3. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237697\/crypto-market-comeback-hasnt-helped-stablecoin-volumes-says-fitch","publishDate":"2023-07-04T09:02:06","id":8488,"type":null,"title":"Crypto market comeback hasn&#x27;t helped stablecoin volumes, says Fitch","category":["MARKETS"],"content":["There's one sector of the crypto market that hasn't fully benefited from the widespread rally that's sent the price of bitcoin to near all-time highs for the year: stablecoins.&nbsp;","As noted in a report by ratings agency Fitch, volumes in stablecoins and the aggregate market capitalization of the sector is lower. The Block's data dashboard shows total stablecoin supply has declined from $138 billion at the start of the year to $124 billion on July 3.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","To be clear, Tether's USDT has bucked this trend — picking up market share from its rivals since USDC's de-pegging event in March.&nbsp;","Still, the monthly average of daily trading volumes of the top ten stablecoins declined from $53 billion in March 2023 to $28 billion in May.&nbsp;","However, Fitch notes that there is better liquidity in the assets backing stablecoins. Stablecoins are meant to trade one to one against a fiat currency — typically the US dollar — but are not backed exclusively by them. The underpinnings of stablecoins include a wide range of assets with different liquidity profiles.&nbsp;","\"Within USDT's reserve portfolio, the portion of treasury bills and repos rose by 6pp and 5pp in 1Q, respectively, reaching 65% and 10% of reserves by end-1Q23,\" the firm noted.&nbsp;","Binance also improved the liquidity position of its stablecoins.&nbsp;\"The repos in the portfolio are overcollateralized by long-term US treasury securities and are callable daily,\" Fitch said.&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"$138 billion","content":"MONEY"},{"type":"Fitch","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"March 2023","content":"DATE"},{"type":"$124 billion","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Tether","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$53 billion","content":"MONEY"},{"type":"July 3","content":"DATE"},{"type":"$28 billion","content":"MONEY"}],"hashtag":["TETHER","USDC"],"authors":["Frank Chaparro","The Block"]}