{"summary":"Bitfinex and Bittrex appear to be stepping up their KYC game\nBoth are embroiled in legal battles with U.S. regulators","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/26592\/bittrex-and-bitfinex-appear-to-step-up-kyc-controls-in-wake-of-regulatory-entanglements","publishDate":"2019-06-12T17:40:58","id":849,"type":null,"title":"Bittrex and Bitfinex appear to step up KYC controls in wake of regulatory entanglements","category":["Exchanges"],"content":["Two cryptocurrency exchanges appear to be taking a more serious approach to vetting customers in the wake of their respective regulatory travails.","Bitfinex, the cryptocurrency exchange that's been duking it out with the New York Attorney General, has been actively locking accounts as it seeks information from certain users. Two days ago, one user took to Reddit to <a href=\"https:\/\/www.reddit.com\/r\/bitfinex\/comments\/by15zs\/bitfinex_is_locking_accounts\/?utm_source=share&amp;utm_medium=ios_app\" data-v-f87c67ca=\"\">share<\/a> an email from Bitfinex in which the firm asked the client to share additional information about his account, including \"a clear and detailed explanation of ... activity and objectives.\"","The firm also asked for a \"scan of your current government issued ID and an image of you holding your photo ID.\" The inquiry by Bitfinex comes weeks after the firm was issued a court order by the New York Attorney General's office accusing the exchange of co-mingling funds to cover up an $850 million loss and unlawfully servicing customers in the state of New York. Bitfinex's chief technology officer Paolo Ardoino said the firm has been inquiring into accounts since before the NYAG launched its inquiry, noting that the firm is \"always working hard to improve our controls in place.\"","Ardoino outlined the \"threats\" that would trigger such an inquiry, which include money laundering, suspicious wallets, users residing in non-permitted jurisdictions, suspicious activity profiles.&nbsp;&nbsp;","\"We always performed these procedures since the beginning of&nbsp;<span class=\"il\" data-v-f87c67ca=\"\">Bitfinex<\/span> and we are always working hard to improve our controls in place and this goes back much beyond the NYAG inquiry,\" Ardoino said. Still, the NYAG's office has reason to believe several New York-based traders transact on the firm's platform, despite Bitfinex saying in 2018 it would no longer cater to clients there.","Another exchange, <a href=\"https:\/\/www.theblockcrypto.com\/post\/14155\/court-grants-expedited-discovery-on-bittrex\" data-v-f87c67ca=\"\">Bittrex<\/a>, also appears to be ramping up its KYC protocol by asking users to fill out a compliance form with personal information to continue using the exchange, according to a Twitter user who <a href=\"https:\/\/twitter.com\/profesorcrypto\/status\/1138532125198692354?s=12\" data-v-f87c67ca=\"\">posted<\/a> the form. The <a href=\"https:\/\/www.theblockcrypto.com\/post\/13194\/bittrex-impostures-no-more\" data-v-f87c67ca=\"\">Bittrex<\/a> form includes requests for proof of employment and retirement income, as well as verification of transactions. A spokesperson for Bittrex did not respond to a request to confirm the veracity of the compliance form. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/7261\/bittrex-opens-otc-trading-desk\" data-v-f87c67ca=\"\">Bittrex<\/a> was recently <a href=\"https:\/\/www.theblockcrypto.com\/2019\/04\/10\/bittrex-customers-were-using-fake-names-like-donald-duck-and-elvis-to-trade-and-now-the-exchange-has-to-leave-new-york\/\" data-v-f87c67ca=\"\">called<\/a> out by the New York Department of Financial Services, which denied its request for a BitLicence to operate in New York. According to the NYDFS, Bittrex allowed users from sanctioned nations, specifically North Korea and Iran, to transact on its platform. Bittrex has denied the credibility of the agency's findings.&nbsp;"],"hashtag":[]}