{"summary":"Coinbase head of institutional sales Brett Tejpaul and head of institutional product Greg Tusar sit down with The Block&#x27;s Frank Chaparro.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116855\/inside-coinbases-game-plan-to-be-a-one-stop-shop-for-wall-streets-biggest-investors","publishDate":"2021-09-08T14:15:57","id":8491,"type":null,"title":"Inside Coinbase&#x27;s game plan to be a one-stop shop for Wall Street&#x27;s biggest investors","category":["PODCASTS"],"content":["Episode <strong data-v-f87c67ca=\"\">54<\/strong> of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Brett Tejpaul, Head of Institutional Sales, and Greg Tusar, <span data-v-f87c67ca=\"\">Head of Institutional Product, at Coinbase.<\/span>","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on&nbsp;<\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vdGhlYmxvY2stdGhlc2Nvb3A?sa=X&amp;ved=0CAMQ4aUDahcKEwionbSO9fbxAhUAAAAAHQAAAAAQAg\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Podcasts<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"89f9e6edeae8fafdc9fde1ecebe5e6eae2eafbf0f9fde6a7eae6e4\">[email&nbsp;protected]<\/a>.<\/i>","<strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/Bakkt.com\" data-v-f87c67ca=\"\">Bakkt<\/a>,&nbsp;<a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>, and&nbsp;<a href=\"https:\/\/www.exodus.com\/\" data-v-f87c67ca=\"\">Exodus<\/a><\/strong>","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bakkt® unlocks the $1.2+ trillion of digital assets that is currently held in cryptocurrencies, rewards and loyalty points, gaming assets and merchant stored value. We began in 2018 with the vision to bring trust and transparency to digital assets. Through the Bakkt Warehouse and Bakkt Bitcoin Futures and Options contracts, we serve institutional clients in an end-to-end regulated market with true price transparency. For consumers, Bakkt aggregates digital assets to enable instant liquidity and to empower users to trade, transfer and pay however they want. Visit <a href=\"http:\/\/Bakkt.com\" data-v-f87c67ca=\"\">Bakkt.com<\/a> for more information<\/span><\/em>","<strong data-v-f87c67ca=\"\">About Kraken<br data-v-f87c67ca=\"\">\n<\/strong><em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit&nbsp;<\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\">&nbsp;to get started today.<\/em>","<strong data-v-f87c67ca=\"\">About Exodus<br data-v-f87c67ca=\"\">\n<\/strong><em data-v-f87c67ca=\"\">Exodus is leading the world out of traditional finance by building beautiful and user-friendly crypto products. Forget having to learn the nuances of different cryptocurrencies. Exodus is designed for everyone and hides the complex details behind a beautiful and intuitive interface.<\/em>","&nbsp;","<span data-v-f87c67ca=\"\">Hundreds of institutions are looking to Coinbase as a trusted, publicly-traded exchange to create tailored crypto solutions for them. Now, as traditional finance firms begin to deploy capital into crypto services, Coinbase sees itself at the forefront of facilitating that institutional adoption.<\/span>","<span data-v-f87c67ca=\"\">“I think we're moving away from the designation of Coinbase as an exchange to being a much more complex organization,” said Coinbase's Greg Tusar, whose crypto brokerage startup <a href=\"https:\/\/www.theblockcrypto.com\/post\/66479\/coinbase-tagomi-acquisition\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Tagomi<\/a> was acquired last year.<\/span>","<span data-v-f87c67ca=\"\">On this episode of The Scoop, Coinbase head of institutional sales Brett Tejpaul and head of institutional product Greg Tusar join for a discussion on Coinbase’s pace of growth to meet client demand and how the company is building itself into a <\/span>full-scale prime broker.","<span data-v-f87c67ca=\"\">“We're focused more on the future of finance and DeFi,” said Tejpaul of Coinbase's goal to combine its custodianship, exchange, brokerage and DeFi services for institutional clients. <\/span><span data-v-f87c67ca=\"\">He went on to say<\/span><span data-v-f87c67ca=\"\"> that they have filled out some 250 requests for proposals from clients to build crypto products for their firms. The longest such RFP is a whopping 800 questions long, according to Tejpaul.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Just think through what it takes to, first of all, to answer 800 questions and think through how many people are working through and processing through that,” said Tejpaul.<\/span>","<span data-v-f87c67ca=\"\">The execs also touched on Coinbase's role in growing retail interest in stablecoins and altcoins, citing how some 75% of clients own more than Bitcoin, 80% own some Ethereum and Tejpaul estimated that 50% of that group also own at least 5 or more cryptocurrencies. “And all that's happened in the course of a year or so.” Said Tejpaul.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Coinbase is growing its business with <\/span>direct investment, expanding its sales team from 7 to 60-odd people in less than half a year, Tejpaul noted. The company is also focusing on growing its product base by<span data-v-f87c67ca=\"\"> creating a variety of familiar instruments for traditional finance institutions, which include <\/span>providing means for institutions to gain sub-custody, tap into stablecoin utility to leverage DeFi protocols, and by creating capabilities for DeFi, smart contracts, and NFTs for broad institutional participation.","<span data-v-f87c67ca=\"\">Beyond that, as Coinbase pushes itself to evolve, demand expansion is evidently applying pressure to provide as many services as possible to a range of institutional clients by facilitating the creation and adoption of their own crypto offerings. According to the execs, this is fueling growth in institutional revenue.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Greg Tusar","content":"PERSON"},{"type":"Bakkt Warehouse","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"$1.2+ trillion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Tejpaul","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"75%","content":"PERCENT"},{"type":"Tejpaul","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Tejpaul of Coinbase","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"RFP","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"Brett Tejpaul","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["COINBASE","DERIVATIVES"],"authors":["Frank Chaparro","The Block"]}