{"summary":"Criminals, scammers and illicit actors are increasingly turning to virtual assets, Treasury said in a trio of reports published on Wednesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276548\/us-treasury-says-criminals-and-scammers-are-increasingly-turning-toward-crypto","publishDate":"2024-02-07T12:29:43","id":8494,"type":null,"title":"US Treasury says criminals and scammers are increasingly turning toward crypto","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Criminals, scammers and illicit actors are increasingly turning to virtual assets, the U.S. Treasury Department said in one of three national risk assessment reports published on Wednesday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The department <a href=\"https:\/\/home.treasury.gov\/news\/press-releases\/jy2080\" data-v-f87c67ca=\"\">released<\/a> its 2024 <\/span><span class=\"s2\" data-v-f87c67ca=\"\">National Risk Assessments on Money Laundering, Terrorist Financing, and Proliferation Financing, which highlighted illicit finance threats, vulnerabilities and risks in the U.S.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The department detailed how bad actors launder funds to conduct fraud, drug trafficking, human smuggling and corruption through the continued use of cash and increasingly crypto. Treasury said it plans to release a strategic plan that will share recommendations for addressing the issues in Wednesday's reports in the coming weeks.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"While the laundering of drug trafficking proceeds is predominantly cash-based, the use of virtual assets is a growing concern for U.S. law enforcement,\" Treasury said in its money laundering report.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Virtual assets have been in a flux since Treasury's 2022 report, but rebounded in the fall of 2023, the department said. Virtual asset service providers have certain anti-money laundering and countering the financing of terrorism requirements and have to abide by certain sanctions rules as well.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Treasury defines VASPs as an exchange between virtual assets and fiat currencies, exchange between one or more forms of virtual assets, the transfer of those assets and the safekeeping, among others. Some VASPs don't comply with U.S. requirements either through saying they are not subject to the rules or not registering correctly, Treasury said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Decentralized finance also presents its own challenges. A DeFi service that is a financial institution under the Bank Secrecy Act has to abide by AML\/CFT rules, Treasury said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"Despite this, many existing DeFi services covered by the BSA fail to comply with AML\/CFT obligations, a vulnerability that illicit actors exploit,\" they said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Criminals are looking to exploit new financial services, including DeFi and online gaming, according to the money laundering report.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"In recent years, legal and technological developments have led to substantial growth in online gaming activity in the United States,\" Treasury said. \"The anonymity afforded by online gaming and the size and rapid growth of this sector now present unique money laundering risks.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Terrorists are experimenting and adapting to changes in technology, though they still stick to what they know, Treasury said in its terrorist financing report.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"Banks and money transmitters are still exploited for their reach and capacity to send large volumes, but some terrorist groups have also increased their capability and understanding of using virtual assets to transfer funds; some groups have also begun experimenting with alternative types of virtual assets,\" according to that report.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Terrorist groups, such as ISIS \"have increased their understanding of virtual assets, Treasury said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"Since the 2022 NTFRA, certain terrorist groups, such as ISIS-K and Hamas, have increased their understanding of and are experimenting with different types of virtual assets,\" Treasury said. \"However, the U.S. government assesses that terrorists still prefer traditional financial products and services.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The partiality to traditional finance is likely due to the price volatility of crypto, Treasury added.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Treasury also drew concerns over the increased use of stablecoins in its terrorist financing report.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"In contrast to the 2022 NTFRA, which identified that terrorist groups most frequently solicited virtual asset donations of bitcoin, terrorist groups soliciting donations of virtual assets are increasingly turning to stablecoins,\" Treasury said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Treasury has voiced its concerns over stablecoins before.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Deputy Secretary Treasury Wally Adeyemo said in a <a href=\"https:\/\/www.theblock.co\/post\/265227\/u-s-treasurys-wally-adeyemo-calls-for-more-authority-to-go-after-bad-actors-in-crypto\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">speech<\/span><\/a> late last year that he was \"increasingly concerned about <\/span><span class=\"s4\" data-v-f87c67ca=\"\">things like dollar-based stablecoins that aren't based here in the United States.\"&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Lawmakers in Washington too have been increasingly concerned over the past year on how bad actors, including Hamas have raised money through crypto. A Wall Street Journal report in October said <\/span><span class=\"s5\" data-v-f87c67ca=\"\">Hamas, along with other militant groups, used <a href=\"https:\/\/www.theblock.co\/post\/257914\/reports-of-hamas-crypto-use-could-blunt-impact-of-coinbase-lobbying-efforts-berenberg\" data-v-f87c67ca=\"\"><span class=\"s6\" data-v-f87c67ca=\"\">crypto as a financing tool<\/span><\/a> ahead of attacks in Israel. Data in that article came from blockchain forensics firm Elliptic, which has since said figures were <a href=\"https:\/\/www.theblock.co\/post\/259527\/elliptic-says-scale-of-crypto-based-terrorism-funding-is-being-misrepresented\" data-v-f87c67ca=\"\"><span class=\"s6\" data-v-f87c67ca=\"\">misrepresented<\/span><\/a> in the piece.&nbsp;<\/span>","<span class=\"s7\" data-v-f87c67ca=\"\">Sen. Elizabeth Warren, D-Mass., along with a hundred other <a href=\"https:\/\/www.theblock.co\/post\/258183\/sen-elizabeth-warren-joins-more-than-100-lawmakers-to-ask-biden-about-plans-to-prevent-crypto-financed-terrorism\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">lawmakers<\/span><\/a> wrote to Treasury and the White House after that report, and Warren said DeFi should be subject to the same AML rules as banks in a subsequent op-ed.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">AML measures could also be brought to a vote this coming year or included in current crypto bills.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Warren","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Proliferation Financing","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"White House","content":"ORGANIZATION"},{"type":"Israel","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"AML","content":"ORGANIZATION"},{"type":"National Risk Assessments on Money Laundering","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"fall of 2023","content":"DATE"},{"type":"Elliptic","content":"ORGANIZATION"},{"type":"Mass.","content":"LOCATION"},{"type":"Bank Secrecy Act","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Wally Adeyemo","content":"PERSON"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"CFT","content":"ORGANIZATION"},{"type":"BSA","content":"ORGANIZATION"},{"type":"Hamas","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"\" Treasury","content":"ORGANIZATION"},{"type":"ISIS","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}