{"summary":"Lubin and Consensys, now valued at over $7 billion, are accused of violating equity promises made in its early startup days.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258689\/ethereum-joseph-lubin-consensys-lawsuit","publishDate":"2023-10-20T08:09:36","id":8497,"type":null,"title":"Ethereum co-founder Joseph Lubin faces lawsuit over Consensys stock value","category":["LEGAL"],"content":["Ethereum co-founder Joseph Lubin is facing a lawsuit from more than two dozen former Consensys employees, accusing him, Consensys and other parties of maneuvering valuable assets out of its Swiss holding company.","The complaint was <a href=\"https:\/\/iapps.courts.state.ny.us\/nyscef\/ViewDocument?docIndex=o_PLUS_Rl1RtTIENwlGHZo2yB1g==\" data-v-f87c67ca=\"\">filed<\/a> in New York state court on Thursday. It claims assets — including its web3 wallet MetaMask, partly developed by some of the plaintiffs — were transferred out of Consensys AG, leaving them with worthless shares.&nbsp;","Lubin allegedly arranged to move the assets to a new U.S.-based company, CSI, in 2020, so it could solicit outside investment, with the help of Consensys General Counsel Matt Corva, enabling Lubin to replace the plaintiffs with Wall Street investors.","Lubin also brought in investment bank JPMorgan, who, in exchange for its own blockchain business, Quorum, received 10% of CSI, according to the complaint. Corva, JPMorgan and Umar Farooq, Global Head of Blockchain at JPMorgan, are also listed as defendants.","When Lubin established Consensys in 2014, many employees accepted lower salaries with the understanding they would receive company equity, according to the suit. Lubin reportedly dedicated 30% of the company to employee stock, with the suing party holding about 9% of that portion.","Legal representatives for the former employees argue that while Lubin prospered, those who believed in his early vision and accepted stock over higher pay ended up with empty promises.&nbsp;“He broke his word,” the lawyers wrote. “In the process, he violated his legal commitments and duties. While Lubin got rich, plaintiffs got nothing.”","“Plaintiffs in an ongoing shareholder case against the Swiss-based web3 incubator and investor Consensys AG, which operates as Consensys Mesh, have just filed suit against U.S. blockchain software developer Consensys Software Inc. in New York state court,” a Consensys spokesperson told The Block via email.&nbsp;","“After two years of getting nowhere with their frivolous claims against Consensys Mesh in a Swiss court, plaintiffs now believe their meritless claims stand a better chance of yielding a pay day if they game U.S. courts and entangle Consensys Software and other unrelated parties in litigation,” the spokesperson added. “We fully expect that the plaintiffs, who were never employees of Consensys Software, will soon find this gambit is another fruitless attempt to enrich themselves from the success of others.”","CSI has raised at least $726.7 million from investors, according to the suit, with its valuation rising to more than $7 billion following Series D financing.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"9%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"$726.7 million","content":"MONEY"},{"type":"Consensys Software","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Global Head of Blockchain","content":"ORGANIZATION"},{"type":"Matt Corva","content":"PERSON"},{"type":"Consensys AG","content":"ORGANIZATION"},{"type":"Lubin","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"Joseph Lubin","content":"PERSON"},{"type":"$7 billion","content":"MONEY"},{"type":"Consensys Software Inc.","content":"ORGANIZATION"},{"type":"Umar Farooq","content":"PERSON"},{"type":"2020","content":"DATE"}],"hashtag":["ETHEREUM","LAWSUITS"],"authors":["James Hunt","The Block"]}