{"summary":"Ikigai Asset Management, which had a majority of its funds at FTX before it collapsed, sold its claim and is now allowing investors to redeem their capital, CIO Travis Kling said.","author":["Anna Baydakova","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269130\/ikigai-sold-its-ftx-bankruptcy-claim-travis-kling-says","publishDate":"2023-12-22T16:01:30","id":850,"type":null,"title":"Ikigai sold its FTX bankruptcy claim, Travis Kling says","category":["Bankruptcy"],"content":["<span data-v-f87c67ca=\"\">Ikigai Asset Management, a crypto investment firm, sold its $65 million claim in the FTX bankruptcy case, chief investment officer Travis Kling said Friday in a <\/span><a href=\"https:\/\/twitter.com\/Travis_Kling\/status\/1738250565988016250?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\"> on X.<\/span>","<span data-v-f87c67ca=\"\">\"We got a price we were happy with and a price that was much, much higher than we were expecting just six months ago,\" Kling wrote. \"Now that we have received the cash proceeds from the sale of the claim, all of our investors that want to redeem from the fund are able to do so. The large majority of the capital is staying in the fund.\"<\/span>","<span data-v-f87c67ca=\"\">Kling <\/span><a href=\"https:\/\/www.theblock.co\/post\/186771\/ikigais-travis-kling-says-hedge-had-large-majority-of-assets-on-ftx\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> last year that the company held a \"large majority\" of its assets on FTX and was not able to withdraw most of them after the exchange filed for bankruptcy protection.<\/span>","<span data-v-f87c67ca=\"\">\"We opened up new subscriptions for existing investors for the first time since FTX collapsed,\" Kling added. \"Our investors are giving us new capital.\"<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Kling said that Ikigai has implemented changes to its business to avoid \"getting caught in something like FTX again.\"<\/span>","<span data-v-f87c67ca=\"\">Kling said he would be interested in a re-launch of the exchange, but he said the process had been moving too slow for him to wait around.<\/span>","<span data-v-f87c67ca=\"\">\"The Debtors have fumbled that process so badly, and progress has been so slow, that it didn't make sense for us to hang around in the claim any longer waiting for something to maybe happen with 2.0,\" Kling wrote.<\/span>","<span data-v-f87c67ca=\"\">Commenting on the broader market, he said it looked like a new bull circle might be around the corner.<\/span>","<span data-v-f87c67ca=\"\">\"<\/span><span data-v-f87c67ca=\"\">It's kinda astonishing TBH,\" he wrote. \"<\/span><span data-v-f87c67ca=\"\">My greatest hope is that we as an industry don't screw that opportunity up. My greatest worry is that if we screw it up again as badly as we did last time, we might not get another shot at it.\"<\/span>"],"hashtag":[]}