{"summary":"After a pilot with payment giant Checkout.com, Fireblocks is launching its digital asset payments engine to all other payment service providers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178764\/fireblocks-expands-digital-asset-payments-engine-product-after-settling-1-billion-with-checkout-com","publishDate":"2022-10-24T09:01:06","id":8508,"type":null,"title":"Fireblocks expands digital asset payments engine product after settling $1 billion with Checkout.com","category":["PAYMENTS AND BANKING"],"content":["Crypto custodian Fireblocks is expanding its digital asset payments engine to a wider number of payment service providers (PSPs), after a pilot with Checkout.com that has so far settled $1 billion in payments.","Fireblocks <a href=\"https:\/\/www.theblock.co\/post\/134423\/fireblocks-acquires-first-dag-crypto-stablecoins-payments\" data-v-f87c67ca=\"\">acquired<\/a> crypto payments processor First Digital Assets Group earlier this year. Now it has set out to give PSPs operating on old rails — using traditional payment systems and 9-to-5 banking systems —&nbsp; the tools to enable merchants, entrepreneurs and creators to accept, manage and settle digital payments across borders.","\"Our ambition in Fireblocks payments and the payments engine is to get all those companies to continue doing what they do today. Just move their rails to faster, cheaper and more transparent payment rails, which means for us, obviously, blockchain,\" said Ran Goldi, Fireblock's vice president and head of payments. \"I would say that over the next year we'll probably go over $10 to $20 billion of merchant settlement.\"","The payments engine is essentially the company's first take on that long-term vision. It includes merchant settlement and soon the addition of cross-border transfers, creator payouts and crypto pay-ins (allowing merchants to accept crypto).","Fireblocks has partnered with FIS's Worldpay, which earlier this year started <a href=\"https:\/\/www.theblock.co\/linked\/140856\/worldpay-to-offer-merchants-direct-settlement-in-usdc\" data-v-f87c67ca=\"\">offering merchants<\/a> the option of USDC settlements. Additionally, it has an onboarding queue of about 50 companies for the payments engine.","The way it differentiates itself from other companies in the same space is by allowing PSPs to create whatever payment flows they want within a blockchain-agnostic infrastructure, as opposed to offering a one-size-fits-all product, Goldi said.","\"We're not saying 'here's a product, here's a solution, you've got to use these banks or these currencies,'\" he said.","That \"optionality\" is key to Checkout.com, which has introduced settlements in USDC but wants to be able to add other stablecoins or even other cryptocurrencies, said Jess Houlgrave, head of crypto strategy at Checkout.com.","\"It's been incredibly positively received, particularly by crypto merchants,\" Houlgrave said of the pilot. \"I expect that growth to continue to the point where a very large proportion of our crypto merchants will end up with this.\"","Non-crypto-native merchants, on the other hand, see this as a \"very different prospect,\" but are still interested in how it can be beneficial to their business.","Goldi said that the roughly 175,000 exiting PSPs are mostly still operating on old rails, meaning that merchants have to wait a few days to receive a payment. PSPs using Fireblock's payment service will be able to automatically convert fiat to stablecoins and send them to the merchant after the transaction is approved.","\"Effectively those merchants are now enjoying their cash flow. They don't have to wait for two, three days to get paid,\" Goldi said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Checkout.com","content":"LOCATION"},{"type":"Goldi","content":"PERSON"},{"type":"Fireblock","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$10","content":"MONEY"},{"type":"FIS","content":"ORGANIZATION"},{"type":"Jess Houlgrave","content":"PERSON"},{"type":"Ran Goldi","content":"PERSON"},{"type":"Houlgrave","content":"PERSON"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$20 billion","content":"MONEY"},{"type":"First Digital Assets Group","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}