{"summary":"Max Boonen is the Founder &amp; Director of B2C2, one of the worlds largest OTC liquidity providers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/47453\/b2c2-founder-max-boonen-on-the-importance-of-competition-amongst-otc-liquidity-providers-regulatory-risk-and-institutional-investors","publishDate":"2019-11-19T16:15:59","id":851,"type":null,"title":"B2C2 founder Max Boonen on the importance of competition amongst OTC liquidity providers, regulatory risk, and institutional investors","category":["PODCASTS"],"content":["<em data-v-f87c67ca=\"\">Episode 29 of The Scoop was recorded on Skype with Frank Chaparro, Celia Wan, and Max Boonen, Founder &amp; Director at B2C2, one of the world's largest OTC liquidity providers. Listen below, and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>,&nbsp;<a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>,&nbsp;<a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>,&nbsp;<a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback and revision requests to&nbsp;<a href=\"\/cdn-cgi\/l\/email-protection#a1d1cec5c2c0d2d5e1d5c9c4c3cdcec2cac2d3d8d1d5ce8fc2cecc\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"40302f242321333400342825222c2f232b23323930342f6e232f2d\">[email&nbsp;protected]<\/span><\/a>.<\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK2411940826\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-mce-fragment=\"1\" data-v-f87c67ca=\"\"><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><\/iframe>","Max Boonen is the Founder &amp; Director of B2C2, one of the world's largest OTC liquidity providers. In this conversation Frank and Max discuss:","<em data-v-f87c67ca=\"\">The transcript is provided for your convenience, please excuse any errors or typos resulting from the transcription process:<\/em>","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Ladies and gentlemen, thank you for joining me today on what is going to be a very special episode of the The Scoop. We have Max Boonen in, all the way from London town, Foggy London town, the CEO at B2C2. They are a market-making and electronic market-making and over the counter trading firm. I'm also joined for the first time on the show with my dear colleague Celia Wan. We're excited to dive into all things: market structure, trading, maybe even tell some old war stories from his FX days at Goldman Sachs are very excited. Have you on, Max, thank you so much.","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>Very glad to be here.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I think the best place to start, especially for folks who might not be familiar with B2C2, would be the origin story, right? You guys launched in 2016? 2015. 40 folks at the firm now, just about. There have been some ups and downs along with the cycle of the crypto market. Tell us a little bit about why you started the company back in 2015. What were you looking to achieve and what's it been like? How's that journey looking?","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>Yeah, the way I started is that I was very lucky when I was 19. I managed to get an internship at Google, and I had no financial background whatsoever. But inside of Google at the time was an internal prediction market. So they had some sort of platform where you could bet on events within Google such as, \"Hey, are we going to reach 600 million users for Gmail this quarter?\" Things like that. And they wanted to harness the power of, the wisdom of the crowd to really sort of try to be able to predict where they were going. And so I was I was 19, knew nothing about trading, but I created a book to arbitrage that platform. And I became the sort of number one trader on Google's platform. It was very interesting, then I published a paper about it, but when I left, I thought, \"Hey, maybe I can make like proper money with this, right?\" So I stumbled upon a platform that I think was very popular in the United States called Intrade.com. That's a platform where you could bet on political elections and other things like Academy Awards in the United States, and they managed to predict every single state where it went to between Obama and John McCain. And they did that to two elections in a row in the United States. So it was quite a popular platform. And with my experience at Google, I actually decided to go and try to make markets on Intrade.com, and I became the main market-maker there. So I had a very good run, especially considering I was just a student at the time. And in late 2012, my flatmate (I'd moved to the bank by then) told me, \"You know, you should look into that Bitcoin thing with your algorithms. You know, there might be something to do because at the end of the day, you know, you're providing liquidity in some sort of political prediction contracts. There's no underlying fundamental you know, Bitcoin is exactly like that. No fundamental. No one knows how to value it. So maybe your stuff would work.\" So I did that in late 2012 and I was running that on the side, well, you know, on the side to my day job. And in 2014, I thought -- now I was a fixed income trader. I traded interest rate swaps and FX swaps -- the market was not doing so hot.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>So in 2014, you're trading, you're making markets on these prediction markets while at the same time--and Bitcoin--working as an FX trader.","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>Yes. Okay. But the market was not doing great. And I'm talking about conventional markets. You know, the banks were making less and less money. I didn't think I was going to get a very big bonus. And so I picked the last bonus and I resigned to start doing what I was doing during the weekends full-time. But early on, our company had to be fully electronic because I was working, you know, at my day job. So everything had to be automated. And so we've kept that sort of ethos: that everything has to be 24\/7, fully automated, very little human intervention because, you know, it was a constraint on our side.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Mm hmm. And when you guys came into the market there, most of the trading that was going on was not electronic. How did you enter a world where most folks were engaging via Skype, via phone via telegram to trade, and here you are with your robust infrastructure, you're trying to get people to almost change their behavior in a sense. How did that sort of pan out?","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>Well, there's two things. So on the one hand, yes, we were one of the first, you know, firms to professionally make markets electronically in crypto. But you have to realize that one of the things that I find extremely interesting about crypto, even though I'm not myself a huge evangelist, is that it's an open playing field. It's open access, right? So back in the day, you had an application in Mongox. People pronounce it different ways. Well Mongox, they had an API that had the website socket you could connect with. And anyone who thought they have some sort of edge, they have some sort of algo they can go and they can trade and connect themselves. They don't need to pay thousands of dollars in fees to the CME or whatever big platform that you're using in the conventional markets. And so I really like that. That's great. That's also why I think, you know, places like Bitmex have been so successful is because of that level playing field, everyone gets the same data. Everyone can run, their algos and the barrier to entry is quite low. Um, now. At the same time, you're also, I think, referring to the OTC market. But the OTC market, I think is a bit of a misnomer. Back in the day, people, when they said OTC, they really meant local bitcoins. And that never made sense to me because you know, local bitcoin is obviously over the counter because it's not on an exchange. But when you ask most traders, what they understand by OTC, it means large institutions trading with one another without going through a venue, trading bilaterally, right? And also clearing, oftentimes, bilaterally. Um, so the OTC market started out as local bitcoin (complete misnomer). Then it became--and that was the big success of of Cumberland and Circle--you know, they turned it into a proper block trading market. But I was a voice market. Voice, meaning, you know, that people trade on the phone, trade on Skype, on telegram and things like that. Um, but the thing is, there was an important need for, uh, for block trades when, for instance, uh, Bitstamp was hacked, I think it was 2014. They were hacked for five million dollars worth of Bitcoin. So when you think about it, those were customer bitcoins. Meaning that they had to replace them. So they had to go out and source those, and it was very difficult at the time to find, you know, 5 million dollars of bitcoin on exchanges. And Bitstamp was one of the main exchanges itself, so they went to an OTC market participants to source that, to source the 5 million. So that's how the market started out. But the way the direction of travel is that everything is going electronic. And that's something that we thought was gonna happen early on at B2C2. That's why in 2016 we rolled out the first as we say \"single-dealer platform\" in the crypto space, which was basically there is a Website, there's two buttons, you can put in your size, click buy or sell and you get a prize back. But you know, that was innovative at the time, although now, it's basically stable states. If you do not have an entry platform today, people can just trade electronically without talking to you. Then you're not even a player in the market.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Mm hmm. Mm hmm. And I think a lot of folks would look at Circle as being an example of what can happen if you don't act quickly enough. And in this market, um, but I'm sure we've seen it in others where people who are late to the party miss out on the punch, right? Talk to me a little bit about what it was like in 2017. You guys were one of the--when I first started reporting on this space--one of the first firms that opened their arms up to me to bring me into this this world of OTC and market-makings. I'm thinking of Kevin Beardsley, in particular, who is now at Kraken, actually. He's jumped around a bit. You guys were doing massive trades at the time. 50 million dollar trades. Hundred million dollar trades. How, when you look back, how did you guys manage such a lean team to, uh, you know, get through all that flow and keep your systems robust and going at all cylinders?&nbsp;","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>Well first of all, you know, I want to make it clear that, you know, I don't want to make it seem like we were bigger than we were at the time. I think, yeah, we were running a big operation, but it's not like people were coming every day to do 50 million dollar trades. And in fact, one thing that I think served us is that when people wanted to do very large trades with us, we were very wary of those because I spent some time on the CVA desk, which means the desk that looks at the interaction between credit risk and market risk. So when someone comes in with a 50 million dollar trade in a market that can easily move 10 percent in a day, you know, by the time they trade and you know, before you get to settlement, the market moves 10 percent. They might be looking at the 5 million dollar loss. And I think one reason we're still around, in spite of having, of all the big liquidity providers, historically, we were, we had the smallest balance sheet, smallest balance sheet, because it's mostly a self-funded firm. You know, we didn't raise that much money, and, you know, whereas others raised like hundreds of millions of dollars from large institutions. So historically we were smaller in terms of balance sheet. Now, the problem when you do large trades is that if these people don't pay, it can really blow up, and I think that some of our competitors really suffered from that. You know, they gave, you know, big credit lines to some of their clients who ended up walking away, and that happened specifically in 2018, which was a difficult year for us, for everyone that you know, people that you that used to be, you know, really crypto rich, and, you know, were making a lot of money and were, you know, stable and reliable credits. Their business models started to turn sour and they couldn't pay. Couldn't. They ended up, you know, some of them, defaulting on trades. So when you say we're doing very big trades, I prefer to say that we were doing very large volumes because the big trades themselves, it's not something that we were actively pursuing. And in fact, that's I think, you know, you mentioned some people have found it difficult to adjust. That's actually, that makes perfect sense to me because we are focused on getting the flow from, you know, zero bitcoin to, you know, yes, hundreds of bitcoin clips. But really, there's so much volume in the small trades because it's a region market, a region-driven market, that that's what we're specifically focusing on, right? You know, where some competitors might be today doing like 10, 15 trades a day, we're doing on an average day probably like 10,000, 20,000 OTC trades, all of them electronic, and maybe it's like a handful of both trades every day. So that's something that we actually have actually went after, you know, the smaller trades, because, you know, the buy is actually bigger on that side.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>In August or rather the summer of 2018, you guys were looking to sell the shop. You guys were having a rough time. I remember when I called you, I was working on the story, and it probably wasn't a standout phone call for you, but for me, it was a hallmark, I think, of my journalism career because I never had a startup CEO respond to something so negative with such frankness and sincerity. You said to me, you know, yeah, I think I reached out, and the story went out in November. But when I reached out to you, you said, \"We're not looking to sell anymore, but it was tough, and it was really tough on me.\" Talk to us a little bit about that bounceback and how are you feeling about the business today?","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>Perhaps you can put yourself in my shoes. So I said earlier, I'm not a big Bitcoin evangelist. I think it's a very interesting market. So it's really interesting day-to-day to be in this market. But at the end of the day, it's a founder-led startup where most of the money is actually ours. You know, we're not spending other people's money. And so one thing that's extremely important to B2C2 is we have to be profitable, right? And we have been extremely profitable. But in 2018, there was a possibility that, you know, yeah, we could be spending a little bit to have to invest in the future, but not to be profitable, and they say on a month-by-month basis. And that's something that I--it's not my style. That's not something I can live with. And I think that we're seeing a little bit of a backlash against businesses that just spend, spend, spend, and don't seem to have a profitable business model. You know, obviously, I'm talking about the likes of WeWork. At B2C2, we were always profitable. And so the possibility in 2018 not to be profitable anymore was not something that I could accept. And because I'm not a huge crypto evangelist, I can do this, or I can do something else. And in fact, you know, I'm you know, I have other interests outside of crypto, as you do. I know you're a big fan of whiskey. And so and so that's where I was coming from.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Take my mind.","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>But, I think that we were, we did a very good job of our distribution effort in Japan. We managed to hire a very senior trader from Goldman Sachs. And then in the United States. That's a market that we only entered this year because it's a you know, the United States, I don't want to say it is a dangerous market, but you need to approach it with a cool head, right? You don't want to send a 25-year-old to run your U.S. operations because they're going to end up in front of the regulator. It's not gonna be good. And we managed to find an absolute monster of the FX market who had been on the Federal Reserve FX Committee for 10 years, someone really senior for an exchange to run our operations here, and it's been an incredible success. You know, we've had an incredible quarter and we've had an extremely good year in 2019. And so now, you know, someone like me, who's really a trader, was, uh, you know, I was thinking of, uh, of what the business model is, where the profit is going to come from, you know, the revenue. I mean, that's music to my ears.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Do you have any sense of what the volumes are? I know we don't really have a precise picture or a full picture of what OTC volumes are. But do you have any sense of what your market share might be globally and then here in the United States?","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>So we have some hints, right? Because actual numbers, people like to keep them close to their chest. Yeah. But I know that one of our, I don't want to say competitors now because they're focused on an exchange or Alameda trading was that very successful exchange FTX. They revealed a couple weeks ago that they were doing around 20, 30 million dollars a day in OTC volume, which is obviously is dwarfed by the volumes on FTX, right? I think they're doing like hundreds of millions a day on their exchange. So you've got one data point, you know, 20 to 30 million dollars a day B2C2 is doing an order of magnitude more than that. In the heyday, Circle had, you know, 200 million dollar days. So when you start thinking of, okay, well, you know, could be low hundreds of millions of dollars a day for like a very big name on, you know, in a good month, not by a slow day, right? And you think that there's a handful of those then? Then, yeah, maybe you can start sizing up the market and thinking, well, maybe a billion dollar a day OTC is a lot. That would surprise me, but definitely more than 100 million. So it's got to be, maybe, I don't know, six hundred million dollars a day, something like that.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Sure. Let's say it's 600 million a day. What would your--well, I don't know if you want to share your market share, but what do you think it might be?","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>I think we would be number one.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Number one? We were talking about--before we turned the mics on--we were talking about market share and who I used the word \"big dog\" might be in the space. 2016, you mentioned, it was definitely Cumberland - early entrant and turned to market 2014 and then 2017 or, excuse me, 2018 was probably Circle. And they put out their numbers. I don't know them off the top of my head, but 2018 was a monster year for them. And now here we are in 2019, about to go into 2020, and you don't think there's a clear \"top dog\" anymore? And you think it's a good thing?","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>Well, I don't know if it's a good thing, but it's more natural, I think, when you look at conventional market, there isn't a single investment bank that's by a mile the number one investment bank, you know, they all have strengths in different, in different segments, right? And I think that's where we're also going to in crypto. In fact, I would think that if B2C2, you know, is by a big distance the number one OTC liquidity provider, that would actually scare me because, you know, with a large footprint also comes specific risk. You know, I don't want to say \"too big to fail,\" but I think you see what I'm hinting at if really you're the center of price formation in the market, then that starts to be a little bit unhealthy. And in fact, when you know, when I traded interest rate swaps, it was very important that, you know, there were other banks in the market who we could hedge with, there was a deep inter-dealer broker inter-dealer market where we could exchange risk with one another. So I would think, in fact, that for a healthy market to exist, we should have--I think OTC is too small compared to exchanges at the time being so that I think that's going to change--but it's important that there's different dealers that trade with one another and move risk around and recycle it rather than one \"top dog.\" I don't think that would be the best outcome.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>If you think about what no one shop is going to be strong in everything or naturally, that's the natural state of things. What is BC--excuse me--B2C2 strong? Where is B2C2 strong, and where are they weak?","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>I start with the weaknesses. Yeah, I think--","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>What is this like a job interview? What is your--tell me what your weakness is. I work too hard. I work too damn hard.","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>Well, I do hope I get the job. In terms of in terms of weaknesses, uh, what we have is, you know, historically, we've had a smaller balance sheet than others. That's something that I deal with mended over time. But the barriers make it so there there's some trades that we couldn't do because, you know, it was gonna be too much pressure on our operations, also because we were historically smaller. I mean, now we're 40 people, but it wasn't always like that. You know, things like 24 hour settlements was not something that we could easily support. And for some of the players in the space, important that, you know, you're able to settle anytime. So that was also, that was also a weakness. Um. And, um, but when you start looking at the strength, I think that our core strength is that our background in OTC market-making in foreign exchange specifically EFX and in interest rates. I studied a lot of things that gives us good color in terms of what the market's going to look like. That's why we had the first single-dealer platform in 2016. That's why in 2017 we went to Japan. And actually in terms of all the things that we were good at were the number one player in Japan by a huge, huge distance. There is no one else who has managed to crack Japan in the way that we have. And the reason that we have achieved that is that we understand the dynamics of OTC markets versus exchange markets. The reason that any--","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>What do you mean by that? What do you mean by that? What do you mean when you say you understand the dynamics between exchange markets and OTC?","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>So if you trade on an exchange in conventional asset classeses, the only reason you do that is because no one wants to trade with OTC. Let's say you're a hedge fund, you want to trade for an exchange. You first you go to J.P. Morgan and you say show me some prices. I want to trade dollar yen to trade some dollar yen against J.P. Morgan, their principal market maker. Meaning that if you win, they lose. If you're too smart and they're not able to hedge the risk on time and they're not making money off you first, they're going to widen the prices that they show to you. So it's gonna become less less attractive for you if you keep trading and to keep making money, losing money, they're just going to kick you out. Yeah. And when they kick you out, what do you do when you go to the exchange? You're going to trade. CME FX futures. So the exchange is where the people who are too smart to trade against the natural OTC liquidity providers because their algos are too sharp, too fast, or whatever--they go to the exchange. So it means that if you have a user base, which is more naturally, let's say like long term investors or retail traders in crypto who just want to buy some crypto, they don't know that the market is going to go up or down in the next, you know, 50 milliseconds or five seconds, right? So it makes a lot of sense for them, it's a lot more economical for them to go to a new OTC equity provider because they're gonna get much better prices. So that's what you find in all conventional markets: if you trade OTC and you have a flow that is manageable because it's not too aggressive, you're not like looking at, you know, making money on the next 50 microseconds or something like that, then you get much better prices than on the exchanges. So that's a dynamic that we understand at B2C2. And so we're really good at understanding the business model of our clients so that we can show them the tightest pricing possible in respect to their business model. And I'll give you a simple example. That's something that our competitors really, really struggling with. Um, you mentioned that, you know the top dogs in the two previous years. They really struggle with people like quant funds that have, you know, alpha models that are gonna tell them that the market's going to go up or down in the next five or something, five minutes, right? So those guys struggle with that, because if they get the risk of those guys with me maybe are predicting that the market is gonna go up because Twitter tweets are, you know, all bullish. They're not, they don't manage to hedge fast enough to be able for at the same time decline to make money because at the end of the day know that it comes right on the horizon of five minutes. Mm hmm. But the market-maker, if you hedged within the first five seconds, you also make money, right? And so trading with smart clients who have a horizon that doesn't overlap with yours as a market-maker is really something that we've nailed at B2C2. And that means we can trade with people that our competitors don't dare trade with, right? And when you start aggregating so much of that flow. So from quant funds, from retail aggregators, uh, you know, from simple, you know, family office punters, when you start having, you know, thousands and thousands of trades a day, then you don't even need to ever hedge on an exchange anymore. So you internalize all the flow when you have a buyer on the one hand, you have a seller coming to you in the next few seconds. You can even skew your prices to set it clients to be able to show them axes that so so that they're gonna be able to take you out of your risk. And when you're able to really of a lot of OTC flow two-way from a diverse client base, then you really start to have a pricing advantage because you don't need to ever go to the exchange to hedge anymore. So that's something that is really a core strength of B2C2. And that's why we can, I think, show the tightest pricing in the industry. But there's something that's important to note. The fact that we can show the tightest pricing in the industry doesn't mean that we showed those prices to everybody because obviously one thing that's really important, and that's how, you know, the big banks make money also for an action based on their asset classes that they're able to to show specific pricing to specific clients. You know, your client does not price sensitive, you need to charge a bit more, because that also allows you to, you know, to pay for a fixed cost and show much tighter pricing to people who are price sensitive. So doing that, you know, sort of tiering and pricing is also very important.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>So are you guys going to the exchange at all on that side of the business?","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>What? Well, we're we have very big footprint on exchanges were I think in the exchange that we trade with normally were, you know, in the top five in terms of market share. But what's important is that, you know, those businesses are in synergy. The fact that we see very, very low overall cost of trading on exchange helps us show the best pricing in OTC, which then in turn, because we see floor that others don't, gives us a bit of an edge on the exchanges. So we have we have those two businesses where, you know, where we have quite a big footprint.","<strong data-v-f87c67ca=\"\">Celia Wan <\/strong>So you mentioned that Japan is a hard market to crack. And do you think those advantages that you just mentioned that B2C2 has is what helped you but not other market makers be successful in Japan?","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>I think Japan is, you know, has a very specific, you know, the culture over there is quite specific, right. Um, and you find that it actually cuts both ways. Japanese companies that want to go international often struggle to do so because because of cultural reasons. You know, the way business is done in Japan is a little bit different. And when you, if you come in quite aggressively and you think that you have the best product and they ought to trade with you because obviously you are the best and you're from the US, and yada-yada-yada, that doesn't usually, you know, go down well in Japan. And so you have to be you have to be attuned to the sensitivities. And that's also why I mean, if you just send someone who's even if they've been, you know, 10 years in Japan, that they're from the U.S., if they're not actually Japanese, there's always gonna be me perhaps a little bit that that's missing, right? You need to atune yourself to the local sensitivities. And as I said, it goes both ways, right? You know, we we know there's obviously a lot of famous Japanese companies that have cracked the U.S. market. But a lot of them have also struggled to do so. Right. And and I think of, you know, on the um in terms of NTT DoCoMo and places like that, you know, are absolutely massive in Japan you've never heard of them out of Japan, or you look at the big FX brokers. You know, the GMO's a good example. In Japan, you have to publish your FX volumes as a broker. So it's all public. GMO does in any given day, in foreign exchange, more than 100 billion dollars in volume on a daily basis. When you look at the bank like a you know, Goldman Sachs from Morgan Stanley in foreign exchange, maybe they do 40 billion. So a fraction of that. All right. So GMO is an absolute monster when it comes to trading volumes. Yet no one here on the table, I would expect, has really heard of them.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I think it's a point that can be also be made in the crypto market in terms of the number of institutional and enterprise companies that are in cryptocurrency here in the States we haven't heard of, but I know you guys are working with a number of these players. I'm thinking of Line, which recently launched an exchange, Rakuten. I hope I'm pronouncing that correctly. No, how do say it? And what did I say? And I apologize to our Japanese listeners--the H is, uh, you're working with a number of these different enterprises on, um, on their cryptocurrency endeavors. How much of a, how much is that part of the business--working with these large firms that are kind of trying to crack and maybe trying to source some Bitcoin liquidity?","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>So one thing I can say is that three quarters of our volume is coming from regulated institutions. So a lot of those would be perhaps not lying because they're a little bit new to the scene, you know, but the likes of of GMO. So when I think of the large players that are getting into the space and have an established business model outside of it, what I think is a common theme is that they all have a strong retail user base. The Rakuten and is like the Amazon of Japan. So, you know, they have millions and millions of clients Line is the WhatsApp of Asia. So they've got millions of users through that. And so for them, it's easy to make a success out of it because it's like a RobinHood, you know, on crypto. People are just going to trade because they trade stocks with you. So that's, uh, so that's why I think those guys have an easier way. And compared to a lot of institutions that are more traditional and like an asset manager, a BlackRock, you know, people for a long time in crypto have been saying, oh, there's a world of institutional money that's just about to get in the market, just about to get in the market. They've been saying that for 2, 3 years, right? Mm hmm. Mm hmm. I think that that's misunderstanding what an institution is. When you think of institutions, you have to realize one thing. There isn't such a thing as a sort of universe that is outside of our reality, where institutions live. All institutions, they and their purpose is to serve, you know, the general population at the end of the day. If you look at insurance companies, massive asset managers. But what do they do? I mean, you just buy fire insurance for your house. When you look at pension funds, absolutely massive like Cal Pearson in California. But who do they serve? They serve, you know, you know, the general population who are investing their savings, right? And so when you think of it, it would be very strange if an institution that served the general population were to decide of its own volition to go and start investing in crypto when really their mandate is not that at all. An insurance company, their mandate is that they're getting the premiums, the premia every month in that they don't need to payout&nbsp; on the policies immediately because obviously, thankfully, your house doesn't burn down every month, and so that pot of money that they need to invest, but it needs to be super safe, because when the house does burn down, they need to make sure that the money is there to pay out, to pay the claims. And so it would be very surprising that, you know, conservative institutions get into the crypto space without having a strong mandate. And today, if you're a retail investor, you can buy crypto. It's not so difficult. You can go to Coinbase. You can go to a Kraken into a lot of places. You don't necessarily you know, you don't necessarily need a BlackRock to put together a mutual fund for you to invest in. And so I think that's one of the reasons that, you know, the institutional money, quote, unquote, if there is such a thing, you know, is slow to come in. In my opinion, the institutions that need to be in crypto, they're already in crypto. So, Robinhood, they're in crypto because I believe that completes their offering.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Mm hmm. Mm hmm. But what do you think's keeping mean? It was funny. I was just up in Greenwich, Connecticut, for a hedge fund private equity conference. And I asked the audience before the panel started, \"How many of you think crypto is a cesspool?\" And 60 percent of the hands in the room shot up. Mm hmm. And then I asked how many people were invested and only, you know, 20 percent, maybe, raised their hand. That area of the market, I do think when I think of like asset managers, to your point, you know, like the BlackRocks of the world and the larger funds are really walled off in a way that trading firms aren't, the retail brokers aren't, the exchanges aren't. Why do you think that is? This is just a risk thing, is it that they don't see the thesis for investing in Bitcoin right now in this market? There's talk of it being a safe haven when it probably isn't at all. There's talk of it being a hedge against runaway inflation and a hedge against political uncertainty. Maybe they're not buying that argument. Or maybe it's the reputational risk. What do you think it is?","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>There is a there's a few types of institutions. You mentioned, um, when it comes to asset managers like a BlackRock. The first question, I think, is one of suitability. They have to think that when it is suitable for the portfolio, that's going to be a question of the mandates. So do they have an actual mandate because they're investing on behalf of people. They're just not investing in stuff that you think is gonna go up. So they need to have a mandate. In order for them to have a mandate, they need to think that there is enough demand out there for there to be a mandate, you know, they can create a fund that people actually can invest in. And I think that, you know, they just don't think that's the case. When you look at hedge funds, I think trends are actually an interesting segment because those guys could potentially, you know, drive a lot of volume to the crypto market. Um, there's two types of hedge funds: hedge funds that are a little bit more aggressive and are happy to set up things like, you know, for entities to start trading on Bitmex and things like that, um, because, you know, otherwise you can't if you're in the US and you have other types of hedge funds, you have to just abide by the local regulations, which would be what you need first. Well, you need to have an official fund that regulated it in Europe as a yes, then you need to have a third party auditor, then you need to have a third party custodian. And when you string all of that together, that stuff doesn't exist in crypto. So that's obviously one thing that makes the market inaccessible to a lot of funds. But if you're a fund that does want to trade crypto, but if you mean you can write actually first Port of call would pretty be depending on the type of hedge fund calling you up, calling you perhaps. But in fact, even before then, you're pretty connected to this me. Right. So you can trade assume future B2C2 is one of the efficient market makers and it's me. So you can just go and trade there and you're going to trade with B2C2 under and others under a sort of like a regulated wrapper. Right. You're training a regulated product by the OTC. It happens to to track Bitcoin. And on the other side, you know, you have fewer firms competing to show to show prices there. So if you're a hedge fund that do want to trade crypto, it's not so difficult. You know, when there's a will, there's a way. But obviously, if you just looked at everything that they need to put in place to start trading crypto on the physical side, then of course, it's a lot more complicated. But it is doable.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>&nbsp;Why? And we've talked about this. We've talked about this with you tons of times, but you might. Might be worth diving into it for the podcast from your perspective as a trader. Um, you guys trade together. Uh, how does it help your operations from a, uh, you know, efficiency standpoint? And why do you think their market share so unbreakable? What is USDC Paxos sterling that is just most traders look at it and say, I don't care. Yeah. And of course, Gemini Dollar, which is a best, basically dead.","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>So, uh, there's a few reasons in my opinion. So, yes, we trade. We trade tether. The reason we do that is not because we gain some efficiency in doing so, but because our clients want it. We have a lot of clients that want to trade against other. So we have to offer that. I think that there is mostly, um, you have to look to Asia to understand why it's so popular. I think there is a big first-mover advantage. It's extremely popular in Asia. And in fact, in a lot of ways it does replace Bitcoin in a lot of the flows in Asia, because as you understand, there's a lot of countries where it's not so easy to invest your own money into and to safeguard it. You know, people are worried about what the return of governments and things like that. And so the idea that you can have a stable asset that you can buy into and you can move it around easily and you can just you know, that it's probably going to be there, you know, in a year's time. That is extremely valuable to a lot of wealthy individuals in Asia. And so to a great extent, people who used to be buying Bitcoin in Asia are now buying tethered directly, which I find fascinating. Right. And at the same time, perhaps a little bit concerning when it comes to the viability of the bitcoin market itself. Right. Because we know that, you know, a lot of the 2017 bubble and everything, you know, originated, uh, to some extent in Asia. Now why haven't, others, um, took over. But I think that there is that first-mover or mover advantage. But also when it comes to issuing a stable coin, what you have to realize is that for people to trade it, they need to be able to have access to it. Right. And if you're gonna trade with Gemini Dollar or something like that, first you need to get a hold of it in order to get a hold of it. You need to send a wire to, uh, to, uh, to some bank and then they show you some Gemini dollars. But in what can you do with it? Not so much because it's not as liquid as tether or so. Liquidity begets liquidity. And so it is just difficult to displace the incumbent. But on top of that, there also is a little bit of a lending market against tether. So that also makes it much easier. Right. So that means that you can actually go and borrow some tether and start trading with it, which I think is much more difficult to do with the US DC or the GUSD because they're naturally averse to just, you know, lending out they're the flows that they have. And also there's just fewer people. There are naturally long, um, U.S., DC and USD that want to lend it out. Whereas when you think of it, if people are using tether to park money outside of jurisdiction that they don't feel comfortable with. I mean, their home jurisdiction, then those guys would be potentially inclined to lend it out to get some yield on it. Right. And I think one thing that's interesting with the stable markets at the moment is that you don't get the interest that comes with having large bank deposits, because when you think of it, if there is 100 million dollars of USD or whatever it is out there, they're earning 2 percent a year on where wherever the particles be that commercial banks are in the repo market, they're getting 2 percent and they're keeping that for themselves, which means that it's two million dollars in revenue annually. Right. So I think then one thing that would be actually innovative in stable coins would be if somehow they managed to pass on part of the interest there that they have done that.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Coinbase is doing that with USDC.","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>They say, oh, that's right, actually. That's right. They announced that maybe like two, three weeks ago or something like that, which I think is really interesting.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>And how many do you think they're getting? 2 percent. So if tethers getting 2 percent and their reserves I mean, that's it's serious money. It's serious money.","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>5 Billion dollars now. Yeah, they probably have a deal with the bank, but they don't make exactly 2 percent because the bank in return for taking you know, I'll take them on as a client we need they would need to be something in it for them. But even if that or you know, keeps 1 percent of the interest that you can earn on Federal Reserve deposits. I mean that's 50 million dollars a year. Mm hmm. Mm hmm. And you don't need to do much. I mean, operationally speaking, I don't. I mean, it's not like there's a lot of tech or something like that behind stable coins. Right. So it's a really interesting business to be in.","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>&nbsp;So regulatory risk. At the same time, you know, at B2C2 We played a very long game. You know, we got the first regulatory license for a crypto market making firm in Europe. Um, and you know, we're we're looking at what we what we're going to do in United States. Um, but at the end of the day, businesses that are decided not to be regulated, to remain offshore, um, to, you know, not to KYC. They've been extremely successful. And in some ways it's a little bit disheartening, right? Because you would think, hey, we know we do these things by the book. It would be nice if they were, you know, some sort of pay out to that. That's, um, but he doesn't mean the case for a long, long time. You know, the fines that we've seen, even, you know, EOS, uh, and in the small Bitfinex fine that they got, uh, some years back. It was nothing. It ends up being a cost of doing business, which is a problem that people also bring up when it comes to banks. You know, if the fines become a way of doing business where your cost of doing business, they just get priced in and it doesn't work as an incentive anymore. So I would think that based on history, the regulatory risk is not that high, because at the end of the day, if you don't touch the mighty U.S. dollar at any point, you know, what can they do to you? And in fact, the emergence of tether and other stable coins, there's talk of I mean, even like, uh, I mean, tether might do Tether Gold. Right. Um, you know, puts it a little bit outside of the reach of U.S. authorities. Mm hmm. So my I think what's the most likely is that businesses that have avoided regulation will keep doing well, that it would be, uh, a long fight for the likes of Coinbase and others who have decided to, you know, to be heavily regulated over. I think they will. They will then make a lot of money, because obviously you're the only game in town. You make money on that. I mean, that's why Coinbase made a billion dollar in revenue in 2017. Apparently, that's because they had everyone they would only game in town more or less. So I think that, uh, you know, the few that managed to do it will be profitable. But if you tell me, hey, I want to start a crypto business today. Should I go down the regulated route or should I not? Then it's difficult to say. Yeah. Do things by the book because look at all those other companies. They've been extremely successful. So I would think that the regulatory risk is low. But there's an interesting element here. What about the 2020 election? What about the 2020 election? One thing that that someone told me, which I thought was quite insightful, is, well, you know, look at the current U.S. administration. There's that new, um, new industry that's creating a lot of jobs in the US. Sure. And, you know, we're in the we're in the era of America first. Do they really want to drive out that new industry and send it to places like China and Singapore? China, right. So that's not I didn't realize that it's possible that there's, you know, a little bit of political pressure in the United States or maybe not pressure because that that sounds improper. But, you know, um, directions or, you know, or, uh, a philosophy that they want to they want to abide by. That we should maybe not come down too hard on crypto. But what's going to happen in 2020 then? Might. Might actually. You know, change things around because, you know, we know one of the main contenders in on the Democratic side is very pro regulation. You know, I'm sure for that reason, I'm sure there is you know, there is you know, it's a I'm not saying it's a bad platform, but that might actually have consequences in terms of industry. Right. So that's something that I think we need to watch, even though Elizabeth Warren, Bernie Sanders, she's one of them. Sure. Um, uh. But possibly Warren is you know, she's been thinking of that stuff for a long time. So it's possible she has a plan. Sure. Others would be, you know, oh, we need to regulate more bidding on this.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Yeah. Yang Guang in there would be in good shape. I'm thinking about exchanges. I'm curious to know. I mean, the fragmentation and saying comparative to U.S. equity markets where you have quality exchanges, 40 some odd dark falls. I think today another crypto exchange launched. I think I saw a headline, but that said there was another one licensing the technology of London Stock Exchange. When is it enough? Enough? Clearly, it's one of the only business models in the space that works. But at a certain point, I don't care. And maybe I'm wrong. I'm not a trader at a certain point. I would be looking at this market from your say and say, all right, I'm done, I'm done considering new exchanges. I've got who I'm linked up to. I don't care if you're licensing this technology. It's like there's hundreds of exchanges. It's maddening to me. Maybe I'm just annoyed because I hate writing up all these press releases about the every single Tom, Dick and Harry who decides he wants an exchange. But the traders I talk to, you voice real frustration with the fragmentation.","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>And I tell you what it is in the United States, the fragmentation of exchanges is coming down in good part to regulation nms. I don't know if you've heard of regulation nms. But that's, uh, regulation that says that you can only trade at the national best bit of any platform. And so that's why if you're starting in your exchange, you're you can't possibly attract a lot of liquidity, even if you're an upstart, because if your prices are better than people, people have to go trade with you. And so even as a new exchange, if you set up your incentives, you know, market making rebates, one way you can get people to trade for what does that have to do with crypto? Well, what that what that has got to do with crypto is this without Reg NMS in United States, there would be at the way fewer exchanges. And so you are seeing in large markets, the natural state of play is to have fewer exchanges like one primary venue and a few secondary venues. And that's what you're seeing for an exchange, for instance, where you have UBS, which is the main market. And there's other secondary venues. But when you look at crypto, it's completely the other way around. People are mostly trading on exchange and they're read it's retail trade or is trading on exchange. So what that tells you is two things. One, for, you know, sophisticated trading firms. That's fantastic because it gives you more opportunities total to actually trade against, you know, some of those traders who don't necessarily have a ton of edge. And, you know, you can be profitable by being, you know, like what I mentioned in the piece I wrote on the four competing newspaper on latency arbitrage. That's right. So, you know, when you see the price move on Big Mac, then you can rush to Coinbase and you can be the first to trade on Coinbase before Rita. Traders, I've managed to take their orders out. So it's quite interesting. On the one hand, you know, it's actually a four tie playing field for electronic trading firms. And on the, um, on the other side, so that that fragmentation is due to the fact that today, because retail traders are not this really very price sensitive. It's mostly a question of marketing and distribution. So you don't necessarily jive better prices or better technology or anything like that. If you can convince if you can provide a good user experience to your traders, then you can potentially have a successful exchange. So that's why I think that the field is more open than what you would normally anticipate. And you see that with a lot of the newcomers. Right. Binance. Incredible success story. How long did it take for Binance to really take off? Less than six months. Right. Mm hmm. You're looking at there. There's a few new exchanges, coinflex, FCX, those guys in in a few months. Have really taken market share and I've referred to it,.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>You know, derivatives versus spot. So maybe not necessarily apples and apples, but certainly all fruit. What will the exchange landscape you think look like in the next two, three years will when more or rather, to put the question differently, when will exchanges start consolidating or start shutting down?","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>I used to think they would consolidate, but don't know. I don't think so.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Interesting. Two reasons. That's well, because they're still being able to raise prices. Yes. Yeah, exactly.","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>Why would they make so much money in 2017? They have a big war chest. Sure. And their user bases are some of them managed to have a somewhat captive user base. And so they're still making money. I mean, Kraken, Coinbase. All those guys dirtying healthy volumes and they don't. Users don't seem to switch so much. And I think that when you look at especially the retail FX market, I think it's possible that in the long run, we're just gonna have a lot of a lot of distributors, a lot of brokers. And that's what you're seeing for an exchange. You know, you have dozens of FX Brokers that you can pick from, obviously some bigger than others. But it's possible that we just never gonna have some continuations or he's gonna be at the margin. He's not necessarily gonna be, you know, exchanges or dying left and right because, sure, it's competed by buy better ones.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>That's too bad, isn't it?","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>It is a little too bad in a way. One thing is important with that is I talk about, you know, sophisticated traders, but it imposes a very high cost even if it's ticket traders, because if you are price sensitive, if you're not a retail investors and you're buying for the long run. If you if you know the basis points matter to you, then if you want to have good liquidity, you need to connect to dozens of venues and ICX.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>And you're constantly changing your IP. They're constantly changing their IP eyes handsomely. You have to know that I find it.","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>Actually, are exchanges going to consolidate I don't think so. Not so much. But ones feel familiar to be worried about is some funds, some crypto funds. Right. They manage to raise a bit of money. Let's see. You raise 20 million dollars. Okay. Well, it doesn't sound like that much. But when you think about it with the leverage that you can get, you know, at least 10x leverage on any platform worth its salt. That means you can start having like 200 million dollar positions. That's plenty. I mean, you don't need more if you're trade. If you're out, your positions are bigger than that. You're pretty, you know, too big for the market. The London Way. Right. But at the same time, if you look at the fees that the management fee that it can charge at 2 percent, I mean, two percent of 20 million dollars. It's 400 thousand dollars a year. That doesn't pay for the tech team that you need to connect to all the exchanges that you need to connect to in order to have good liquidity, which I think is actually one of the big tailwind for OTC trading because there is only a handful of firms. You know, we mentioned a lot of them that have really the wherewithal, the resources to connect to all those platforms and basically recycle. It's part of that liquidity.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>So wrapping this up, I know you have a meeting to get to, even though this is more fun. Let's take a look or examine what the plan is going into 2020. You guys do OTC you market make. You have a CFD contract for difference so that you guys trade differences, whatever. So what other new products are you guys maybe thinking of rolling out or offering to your clients? Should we expect business as usual over the next year or something exciting or crazy?","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>Yes. First of all, we need to focus on what it is that we're best at and going back to, says, 2018. As you mentioned that, you know, a lot of firms overextended, including B2C2 . And you know, if you go to too many directions, then on the one hand, you know, you're losing focus. And on the second hand, you might be the victim of the next crypto winter. There's a lot of people saying that we might be going into a new crypto winter. So maintaining laser focus is important to us. That said, it's important for us to broaden our geographical footprint our entry in the United States in the U.S. market, this year has been an incredible success. So we want to keep grabbing market share from incumbents in the U.S. There's potentially a handful of jurisdictions that we can also access something in places like the Middle East. And but in terms of products, I don't think that you want to change a recipe too much. There's one thing that I'm considering because I was you know, because my background you traded repo I traded FX swaps. Um, we end up B2C2 being a large, uh, a large lender, actually. So I don't want to go into the lending business proper, but it's something that we naturally do because when our institutional clients come in, they want to buy 20 million dollars a bitcoin. Well, guess what? I mean, I don't really want to use 20 million dollars of actual dollars to go and buy bitcoins when really my client is actually long synthetically. You know, they're buying derivatives from us. Um, so naturally I end up doing well, extending credit to a lot of our clients. And I think that's something that we could we could improve on. I think that we could have a slightly better offering than what some others are doing in the market. So yeah, that lending market, repo market, borrow market. There's different names for it. Um, I prefer to call it the funding market. That might be something we might be making a bit more of a public foray into at the moment is really for our clients. You know, we don't do that for outside, you know, people who wouldn't trade with us.","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>So that's something that I'm considering. but first and foremost, we want to maintain a laser focus on what it is that we're good at, which is trading on exchange, providing liquidity and really understanding the business model of our clients so that we can give them the tightest pricing possible. When you think about that, you know we need to remain one step ahead of the game. So showing different prices to different clients. Some competitors, they're not even there yet. Right. When you're doing that, what is the next step? The next step is things like selectively skewing specific clients to try to attract the right flow. It's understanding what it means when you're a trader, when you're your prices are aggregated. So one of the things that people don't really realize is that having too many liquidity providers and that's a Crisp insight, I think having too many liquidity providers can actually be worse for you as a taker. The reason is the following. If you aggregate prices from 10 10 firms, OTC or you are even using an aggregator. There's a few that have come out. Yeah. Togomi. Yeah and Tagomi is a good firm. I don't know. You know, said that their model's not good, but it is more, if you are aggregating too many liquidity providers when you trade the liquidity provider that gets a trade is the one who will have shown the best price out of 10. So it's like a winner's curse. It's like winning. Winning an auction. Right. You don't want to be the winner out of 10. And I remember my days at Goldman. There was a say there was a phrase that people use when you have a very large name that wants to do a big trade and you feel they're going to move the market around, what you want to do is you want to be number two. You want to have the second best price. You have the second best price so that you don't win the trade. You don't lose money, but then you don't hurt the relationship. And the worst thing that you can do on something that's called the bwic, that's bids wanted in competition. So let's say they want to sell some bonds. They get bids from a lot of banks on the Bwic. You don't want to be DFL dead ****** last. So, you know, when you aggregate too much, the people that the market maker that wins the trade, if they win out of 10, then they're always going to lose money. So what people are gonna do, they're going to widen their pricing. And you might actually see worse pricing by aggregating ten rather than aggregating to a tree two or three. So those dynamics are not intuitive, right? You would think, well, the more liquidity I get, the better the pricing I should receive. Right. But it's actually more complicated than that. So I think one of four core strength is to understand the dynamics, the those dynamics and to be, you know, a few steps ahead of the rest of the market.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>It's interesting. IEX has this whole marketing campaign out about wrestling your order. I wanted change as opposed to people. Again, how do I get liquidity trade across multiple venues? But if you just let it rest, you'll actually get a better price is what their point is. It's kind of irrelevant, but just makes me think of that. I think that's a great place to close the conversation. Really interesting to have you on. And next time your New York stop by again and we'll dive into more topics, we could probably keep going for another hour if we wanted to.","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>Yeah. Thanks, Frank. Uh, thanks a lot, Frank and Celia.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>No worries.","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>I appreciate, you know, the efforts that your, uh, your company is making in digging in to know what it is that, you know, crypto trading is and really trying to go beyond the veneer, beyond the surface, which a lot of people are, you know, stop at in terms of, you know, hey, here's gonna be a nice headline. But actually, maybe there's something more interesting if you dig a bit deeper and there's just so many things to dig into.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Keeps me busy, keep young, keeps me from hitting the gym. But maybe that's something we'll work on soon. Thank you so much.","<strong data-v-f87c67ca=\"\">Max Boonen <\/strong>Thank you.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GMO","content":"ORGANIZATION"},{"type":"20 million dollars","content":"MONEY"},{"type":"Max Boonen <\/strong>Thank","content":"PERSON"},{"type":"Rakuten","content":"ORGANIZATION"},{"type":"Amazon","content":"LOCATION"},{"type":"CVA","content":"ORGANIZATION"},{"type":"J.P. Morgan","content":"ORGANIZATION"},{"type":"Max","content":"PERSON"},{"type":"Obama","content":"PERSON"},{"type":"London Stock Exchange","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Gemini Dollar","content":"ORGANIZATION"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Bernie Sanders","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"end of the day","content":"TIME"},{"type":"5 million dollars","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Frank Chaparro <\/strong>Interesting","content":"ORGANIZATION"},{"type":"60 percent","content":"PERCENT"},{"type":"Singapore","content":"LOCATION"},{"type":"California","content":"LOCATION"},{"type":"CFD","content":"ORGANIZATION"},{"type":"Kevin Beardsley","content":"PERSON"},{"type":"Cumberland","content":"LOCATION"},{"type":"10 percent","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"five million dollars","content":"MONEY"},{"type":"ups","content":"ORGANIZATION"},{"type":"2014","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"Cal Pearson","content":"LOCATION"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"2012","content":"DATE"},{"type":"Gemini dollars","content":"MONEY"},{"type":"Frank","content":"ORGANIZATION"},{"type":"summer of 2018","content":"DATE"},{"type":"100 million dollars","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"UBS","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"Bitstamp","content":"PERSON"},{"type":"London","content":"LOCATION"},{"type":"Max Boonen <\/strong>Well","content":"PERSON"},{"type":"Connecticut","content":"LOCATION"},{"type":"Tom","content":"PERSON"},{"type":"1 percent","content":"PERCENT"},{"type":"100 billion dollars","content":"MONEY"},{"type":"50 million dollars","content":"MONEY"},{"type":"today","content":"DATE"},{"type":"America","content":"LOCATION"},{"type":"Japan","content":"LOCATION"},{"type":"5 Billion dollars","content":"MONEY"},{"type":"Chaparro <\/strong>Coinbase","content":"PERSON"},{"type":"400 thousand dollars","content":"MONEY"},{"type":"NMS","content":"ORGANIZATION"},{"type":"ICX","content":"ORGANIZATION"},{"type":"Skype","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"Big Mac","content":"ORGANIZATION"},{"type":"Tagomi","content":"ORGANIZATION"},{"type":"Rita","content":"PERSON"},{"type":"20 million dollars of actual dollars","content":"MONEY"},{"type":"Spotify","content":"LOCATION"},{"type":"KYC","content":"ORGANIZATION"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"20 percent","content":"PERCENT"},{"type":"nms","content":"ORGANIZATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"Mongox","content":"LOCATION"},{"type":"NTT DoCoMo","content":"ORGANIZATION"},{"type":"Dick","content":"PERSON"},{"type":"dollar yen","content":"MONEY"},{"type":"2 percent","content":"PERCENT"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Intrade.com","content":"LOCATION"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"30 million dollars","content":"MONEY"},{"type":"Goldman","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Greenwich","content":"LOCATION"},{"type":"Max Boonen","content":"PERSON"},{"type":"six hundred million dollars","content":"MONEY"},{"type":"Celia Wan","content":"PERSON"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"two million dollars","content":"MONEY"},{"type":"Google","content":"ORGANIZATION"},{"type":"Max Boonen <\/strong>Yeah","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"EFX","content":"ORGANIZATION"},{"type":"Warren","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"next two","content":"DATE"},{"type":"Middle East","content":"LOCATION"},{"type":"two percent","content":"PERCENT"},{"type":"John McCain","content":"PERSON"},{"type":"Founder &amp; Director of B2C2","content":"ORGANIZATION"},{"type":"Harry","content":"PERSON"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"OTC","content":"ORGANIZATION"},{"type":"Celia","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Federal Reserve FX Committee","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}