{"summary":"The U.S. Treasury wants more of a carrot and stick approach to crypto regulation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170620\/treasury-recommends-double-down-on-crypto-enforcement-but-with-more-guidance","publishDate":"2022-09-16T06:00:02","id":8514,"type":null,"title":"Treasury recommends &#x27;double down&#x27; on crypto enforcement, but more guidance too","category":["REGULATION"],"content":["The U.S. Treasury Department wants financial market regulators to aggressively pursue investigations and enforcement actions against digital asset projects that aren't following existing laws, a recommendation that fits with the approach regulators are already taking.&nbsp;","But one of the reports issued Friday, as part of a broader effort towards a unified federal approach towards digital assets, also recommends regulators provide additional rules and guidance for projects that want to comply with the law. That may lead to a slight shift in approach from financial watchdogs, trying to emphasize a carrot of more explicit guidelines to go with the stick of legal action against companies that don't follow them.&nbsp;","Treasury wants agencies to “double down” on existing regulation, a senior official said during a Thursday press call previewing the reports, which were ordered <a href=\"https:\/\/www.theblock.co\/linked\/137013\/white-house-releases-text-of-bidens-crypto-focused-executive-order\" data-v-f87c67ca=\"\">by President Joe Biden in March<\/a>. Senior administration officials requested to speak without direct attribution as a condition for fielding questions.&nbsp;","While calling for increased enforcement, Treasury also wants regulators to provide additional guidance for digital asset developers and other companies involved in cryptocurrencies, so that they better understand how to follow existing rules. In theory that clarity should also reduce the need for future enforcements. That may be welcome news for industry advocates.&nbsp;","“One of the recommendations is that regulators will issue new rules and guidance,” the senior Treasury official said. “That’s a recognition that we see work needed in this space.”","U.S. financial regulators largely operate independent of the White House, though the president nominates leaders to the different agencies, like the Securities and Exchange Commission and Commodity Futures Trading Commission, the primary American regulators of digital assets. The reports are expected to carry weight with agency leaders and Capitol Hill while they contemplate ways to better fit cryptocurrencies into existing financial law.&nbsp;","“This is a new and very rapidly developing product space,\" said a senior official. \"Regulations need to be able to adjust to these new products and activities that are being offered.”","Though Treasury's recommendations include an emphasis on more guidance and rulemaking from regulators, officials said the reports avoid specific legislative proposals. Multiple bills to change current laws that affect cryptocurrencies have been introduced on Capitol Hill, though none are likely to pass before the end of this Congress.","An official committed to, \"working with the Hill closely, to ensure that we’re working arm-in-arm.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Joe Biden","content":"PERSON"},{"type":"White House","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission and Commodity Futures Trading Commission","content":"ORGANIZATION"}],"hashtag":["CONGRESS"],"authors":["Kollen Post","The Block"]}