{"summary":"If former FTX CEO Sam Bankman-Fried had designs on repairing his reputation as a responsible steward of a once multi-billionaire-dollar crypto empire, he’s certainly making that complicated.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187281\/sam-bankman-fried-continues-bizarre-twitter-rambling-says-ftx-us-had-cash-needed-to-repay-clients","publishDate":"2022-11-15T13:48:41","id":8515,"type":null,"title":"Sam Bankman-Fried continues bizarre Twitter rambling, says FTX US had cash needed to repay clients","category":["EXCHANGES"],"content":["If former FTX CEO Sam Bankman-Fried had designs on repairing his reputation as a responsible steward of a once multi-billionaire-dollar crypto empire, he’s certainly <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1592567502911205377\" data-v-f87c67ca=\"\">complicating matters<\/a>.","Bankman-Fried's seemingly incoherent Twitter-stream-of-consciousness thread continued to unfold on Tuesday, most recently with the claim that, “FTX US had enough to repay all customers,” a statement he simultaneously undercuts with the caveats that his memory might be faulty and that \"not everyone necessarily agrees.”","He told the New York Times on Sunday that he <a href=\"https:\/\/www.theblock.co\/post\/186935\/sbf-tells-new-york-times-that-he-could-be-worse\" data-v-f87c67ca=\"\">couldn't explain<\/a> the series of cryptic tweets he'd been posting over the past two days and that he was making it up as he went along. The thread originated on Sunday, when the embattled 30-year-old crypto tycoon simply said “1) What,” which he then followed with eight more tweets spelling out “HAPPENED,” one letter at a time.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","The former MIT graduate founded both FTX and FTX US, a crypto trading empire once worth more than $30 billion. Bankman-Fried and FTX are now the subject of investigations by the U.S. Securities and Exchange Commission and Justice Department amid the company's shock filing for bankruptcy protection last week.","In the Tuesday update to the Twitter thread, Bankman-Fried also wrote that sister trading firm Alameda Research “had more assets than liabilities,” \"but not liquid!\" He said that “Alameda had margin position on FTX” International.","Over the past week, the former CEO of FTX has seemed to want appear apologetic, although his explanations have been short on many details. In one tweet from Nov. 10, Bankman-Fried posted simply “I'm sorry. That's the biggest thing. I f*cked up, and should have done better.”","In the <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1592604699693580289\" data-v-f87c67ca=\"\">latest update<\/a> to the thread, Bankman-Fried said he'd been meeting in-person with regulators and working with teams to \"do what we can for customers.\"","\"My goal—my one goal—is to do right by customers,\" he said. \"And after that, investors. But first, customers.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">(Updates with additional SBF tweet and corrects and removes \"month to month\" depiction of liabilities.)<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"FTX” International","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"MIT","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Alameda Research “","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"last week","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Nov. 10","content":"DATE"},{"type":"$30 billion","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission and Justice Department","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["RT Watson","The Block"]}