{"summary":"Cryptocurrency exchange Coinbase has released its own price oracle that aims to improve the resiliency of the price feed process.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/62858\/coinbase-launches-a-price-oracle-as-it-widens-its-focus-on-defi-space","publishDate":"2020-04-23T13:17:41","id":8517,"type":null,"title":"Coinbase launches a price oracle as it widens its focus on DeFi space","category":["THE BLOCK"],"content":["<span data-v-f87c67ca=\"\">Cryptocurrency exchange Coinbase has released its own price oracle in an effort to improve the resiliency of the price feed process.<\/span>","<span data-v-f87c67ca=\"\">An oracle is a third-party price feed that provides real-world data to a decentralized network. Right now, almost all Open Finance (DeFi) platforms rely on price oracles to offer services like lending, margin trading, and derivatives. Uniswap and Kyber both have oracles that are widely used.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, this price feed process has long been criticized for being maintained by a centralized entity. It also introduces risk since the smart contract cannot verify the accuracy of the data. In a recent high-profile case, DeFi lending protocol bZx, which utilizes Kyber’s price feed, <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/56207\/bzx-attacked-again-645k-in-eth-estimated-to-be-lost\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">suffered an oracle attack<\/span><\/a><span data-v-f87c67ca=\"\"> that resulted in a loss of 2,388 ETH.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Coinbase on Thursday launched Coinbase Oracle, a signed price feed allowing anyone to publish price data on-chain. The data is sourced from the Coinbase Pro API and get updated every minute.&nbsp;<\/span><span data-v-f87c67ca=\"\">Users can leverage the Coinbase Oracle API to obtain signed price data for both BTC-USD and ETH-USD markets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to the <\/span><a href=\"https:\/\/blog.coinbase.com\/introducing-the-coinbase-price-oracle-6d1ee22c7068\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announcement<\/span><\/a><span data-v-f87c67ca=\"\">, getting data from an off-chain source like an exchange usually requires users to trust that the publisher is posting the right prices and that the signing key is uncompromised, which \"historically has proven to be a difficult problem, especially when stakes are high.\"<\/span>","<span data-v-f87c67ca=\"\">With Coinbase Oracle, on the other hand, because the data is already signed by Coinbase's private key, users do not need to trust the publisher. The oracle utilizes the same key security infrastructure as the Coinbase exchange and anyone can verify the data with the Coinbase Price Oracle public key. The oracle also has a filtering mechanism that flags and rejects data points that deviate from either the asset's expected volatility or its last reported price.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Notably, a number of projects besides Coinbase have been trying to come up with more resilient price feed designs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For example, <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/59630\/uniswap-announces-its-next-iteration-set-for-launch-in-q2\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Uniswap Version 2<\/span><\/a><span data-v-f87c67ca=\"\">, set for launch in Q2, will introduce several changes to its price feed model to make it more costly for potential attackers to compromise the oracle. <\/span>","<span data-v-f87c67ca=\"\">tBTC, the bitcoin-pegged ERC-20 token to go live in late April, will implement <\/span><a href=\"https:\/\/www.theblockcrypto.com\/daily\/55284\/inside-tbtc-the-bitcoin-backed-erc-20-token-that-could-go-live-in-march\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a \"third-party challenge system\"<\/span><\/a><span data-v-f87c67ca=\"\"> to makes price feed more decentralized. Compound has also come up with an <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/36460\/compound-launches-an-open-oracle-system-for-decentralized-pricing-data\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">\"Open Oracle System\"<\/span><\/a> <span data-v-f87c67ca=\"\">to introduce more transparency into the process.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase Oracle API","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Open Finance","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Coinbase Price Oracle","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Coinbase Oracle","content":"ORGANIZATION"},{"type":"Oracle","content":"ORGANIZATION"},{"type":"late April","content":"DATE"},{"type":"oracle","content":"ORGANIZATION"}],"hashtag":["COINBASE","UNISWAP"],"authors":["Yilun Cheng","The Block"]}