{"summary":"Liquid staking protocol Rocket Pool pledged to move towards full decentralization for its Protocol DAO (pDAO) governance unit.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237808\/rocket-pool-promises-to-fix-centralization-concerns-related-to-pdao","publishDate":"2023-07-05T10:30:45","id":8523,"type":null,"title":"Rocket Pool promises to fix centralization concerns related to pDAO","category":["CRYPTO ECOSYSTEMS"],"content":["In the face of recent scrutiny over its governance unit protocol DAO (pDAO), Rocket Pool, a prominent liquid staking project, has pledged to move towards full decentralization. This unfolded after Dmitry Gusakov from competitor project Lido Finance flagged issues within pDAO.","Rocket Pool operates under the governance of two primary units: the Oracle DAO (oDAO) and the Protocol DAO (pDAO). The oDAO comprises a permissionless group of Rocket Pool nodes that focus on operational tasks. On the other hand, the pDAO wields control over the smart contracts, thereby determining the operational parameters.","Dmitry Gusakov, community staking lead from Lido Finance, a competitor project, recently <a href=\"https:\/\/twitter.com\/d_gusakov\/status\/1676102652621385731\" data-v-f87c67ca=\"\">voiced<\/a> concerns regarding the governance of Rocket Pool’s contracts under pDAO. Gusakov pointed out that these contracts, managed under the Protocol DAO (pDAO) unit, are currently overseen by a single Externally Owned Account (EOA).","An EOA is just a straightforward crypto wallet typically under the control of a single person — as opposed to a multi-sig, where multiple people are required to approve a transaction. This, according to Gusakov, is a centralized approach that falls short from the desired fully decentralized autonomous organization (DAO) model in a project like Rocket Pool.","Gusakov <a href=\"https:\/\/twitter.com\/d_gusakov\/status\/1676199477432950784\" data-v-f87c67ca=\"\">expressed<\/a> particular unease over the centralized control of the \"guardian\" parameter in Rocket Pool's smart contracts. This parameter provides the EOA with the power to alter other critical variables such as the “RPL token InflationIntervalRate” and “ETH DepositFee” without the need for a governance vote, posing potential risks associated with centralization.","The criticisms extended to the ‘bootstrapMode’ in Rocket Pool’s operations, a typical setting in the early stages of a protocol’s lifecycle that offers more centralized control over certain parameters and functions. This mode presently enabled by Rocket Pool's pDAO underscores the EOA’s significant influence and potential centralization risk within Rocket Pool’s smart contract infrastructure.","In response, Rocket Pool’s official community advocate Jaspreet Kalsi emphasized the protocol’s commitment to a more decentralized model. He acknowledged the need for on-chain governance development for the pDAO in the the forthcoming Saturn upgrade planned for Q4 2023. This upgrade is expected to resolve the existing decentralization gaps and reduce the EOA’s authority.","Kalsi <a href=\"https:\/\/twitter.com\/Jasper_ETH\/status\/1676220737051303941\" data-v-f87c67ca=\"\">admitted<\/a> the initial trade-offs made at its inception but reaffirmed the protocol’s dedication to achieving complete decentralization. He shed light on the ongoing development of a fully decentralized <a href=\"https:\/\/twitter.com\/Jasper_ETH\/status\/1676444916501692416\" data-v-f87c67ca=\"\">on-chain voting<\/a> system for the pDAO and added Rocket Pool would soon transition to being \"<a href=\"https:\/\/twitter.com\/Jasper_ETH\/status\/1676220737051303941\" data-v-f87c67ca=\"\">100% decentralized<\/a>.\" This effort, Kalsi revealed, has been the subject of extensive analysis and planning for a long time, indicating the team’s long-term focus on decentralizing pDAO.","\"On launch, the Rocket Pool team had full control of the pDAO as we had not developed a large set of node operators at that time and we acted as a guardian of the role,\" Kane Wallmann, senior solidity engineer at Rocket Pool, told The Block. \"Currently, the team acts as an executive middle man to execute any pDAO related transactions on behalf of the node operators who vote with a Snapshot off-chain proposal.\"","In the upcoming Saturn upgrade, Wallman added, the team is planning to move this pDAO system completely on chain so that it can operate totally independent of the team.","Gusakov’s comments also included a comparison between Rocket Pool and Lido, the latter being fully controlled by the Lido DAO through on-chain voting through Aragon.&nbsp;As Rocket Pool continues to mature and its community expands, Gusakov <a href=\"https:\/\/twitter.com\/d_gusakov\/status\/1676192811153084416\" data-v-f87c67ca=\"\">expressed hope<\/a> that the bootstrapMode will be phased out.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Oracle DAO","content":"ORGANIZATION"},{"type":"Rocket Pool","content":"ORGANIZATION"},{"type":"RPL","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Lido DAO","content":"ORGANIZATION"},{"type":"Jaspreet Kalsi","content":"PERSON"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Kane Wallmann","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Kalsi","content":"PERSON"},{"type":"EOA","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"Wallman","content":"PERSON"},{"type":"Aragon","content":"LOCATION"},{"type":"Gusakov","content":"PERSON"},{"type":"Dmitry Gusakov","content":"PERSON"},{"type":"Saturn","content":"ORGANIZATION"}],"hashtag":["LIDO FINANCE","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}