{"summary":"State Street VP and Head of Global Markets, Nadine Chakar, is leading the charge of State Street&#x27;s new dedicated crypto unit.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112224\/bitcoin-price-swings-not-impacting-interest-state-street-exec-says","publishDate":"2021-07-23T12:18:36","id":8527,"type":null,"title":"&#x27;They’re readying themselves&#x27;: State Street exec explains why clients are warming up to bitcoin ","category":["BITCOIN"],"content":["<i data-v-f87c67ca=\"\">Episode <\/i><strong data-v-f87c67ca=\"\">42<\/strong><i data-v-f87c67ca=\"\">&nbsp;of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Nadine Chakar, Head of State Street Digital at State Street. <\/i>","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on <\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vdGhlYmxvY2stdGhlc2Nvb3A?sa=X&amp;ved=0CAMQ4aUDahcKEwionbSO9fbxAhUAAAAAHQAAAAAQAg\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Podcasts<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\"> or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"41312e252220323501352924232d2e222a22333831352e6f222e2c\">[email&nbsp;protected]<\/a>.<\/i>","<strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/eventussystems.com\/\" data-v-f87c67ca=\"\">Eventus<\/a>, <a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>, and <a href=\"https:\/\/www.exodus.com\/\" data-v-f87c67ca=\"\">Exodus<\/a><\/strong>","<em data-v-f87c67ca=\"\">Eventus is the leading global provider of multi-asset class trade surveillance, transaction monitoring and market risk solutions. Eventus offers a powerful, award-winning trade surveillance platform that is easy to deploy, customize and operate. Eventus is proven in the most complex, high-volume and real-time environments and supports many of the industry’s leading crypto exchanges including Coinbase, Gemini, ErisX and OSL. The company’s rapidly growing client base relies on Eventus’ responsive support and product development teams to overcome its most pressing regulatory challenges.<\/em>","<strong data-v-f87c67ca=\"\">About Kraken<\/strong>","<em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit <\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\"> to get started today.<\/em>","<strong data-v-f87c67ca=\"\">About Exodus<\/strong>","&nbsp;","<span data-v-f87c67ca=\"\">State Street made headlines last month, announcing a brand new division covering crypto, digital assets, and tokenization.<\/span>","<span data-v-f87c67ca=\"\">State Street VP and Head of Global Markets, Nadine Chakar, is leading that charge. Despite the recent price slump in crypto-assets, interest has not abated, she noted in an interview for the latest episode of The Scoop:<\/span>","<span data-v-f87c67ca=\"\">“T<\/span><span data-v-f87c67ca=\"\">he price depreciation has not impacted demand and interest at all. I think we're still seeing a lot of people enthusiastically embracing digital in general, crypto in certain cases. And there's not a day that goes by that you don't see some large hedge fund or some large investor, you know, outlining their support for digital.”<\/span>","<span data-v-f87c67ca=\"\">To meet that demand, State Street is working with clients on developing solutions that help them allocate to bitcoin and other crypto-assets. It is also a partner to several fund managers looking to offer exchange-traded funds–although, it’s not clear when financial regulators will approve such a product.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Still, Chakar said the bank isn’t ready to dive into the market with a custody offering:<\/span>","<span data-v-f87c67ca=\"\">&nbsp;“We're not going to rush into this unless we can feel very comfortable that we could support the new digital assets with the same rigor that we support the old ones where we're going to continue to work on fine-tuning our models.”<\/span>","<span data-v-f87c67ca=\"\">Chakar also does not believe that a decentralized banking ecosystem will be built to replace banks or traditional finance institutions. Chakar mentioned pensions plans as an example of a traditional finance structure that DeFi may not be able to execute on. Though it's not an impossibility one day, she noted:<\/span>","<span data-v-f87c67ca=\"\">“There’ll always, always be a role for the banks to play, albeit and maybe in a different role. What that role will be, I think it's a bit too early to tell, but I hate to disappoint people that think the banks are just going to up and disappear and be totally replaced by blockchain.”<\/span>","<span data-v-f87c67ca=\"\">Nadine sees the balance between the integration of DeFi traditional finance as that “sweet spot” but sees the industry as still at a starting point.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nadine Chakar","content":"PERSON"},{"type":"Head of State Street Digital","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Gemini","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Chakar","content":"PERSON"},{"type":"State Street","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"OSL","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["Frank Chaparro","The Block"]}