{"summary":"The firm&#x27;s products should have been registered as securities so investors could have received disclosures that would have let them better assess the risks, plaintiffs argue.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/198213\/gemini-winklevoss-twins-facing-potential-class-action-from-investors","publishDate":"2022-12-28T09:43:20","id":8533,"type":null,"title":"Gemini, Winklevoss twins facing potential class action from investors","category":["COMPANIES"],"content":["The Winklevoss twins and their Gemini Trust Co. are facing a potential class action lawsuit for failing to register its interest-bearing accounts as securities.","Investors accused the company and its founders of fraud and violations of the Exchange Act in a proposed class-action complaint filed Tuesday in Manhattan at the U.S. District Court for the Southern District of New York.&nbsp;","\"Gemini marketed GIAs with repeated false and misleading statements, including that GIAs were a secure method of collecting interest,\" the complaint stated, referring to the interest-bearing accounts. \"Gemini also omitted and concealed significant information concerning the risks associated with Gemini Earn, including information concerning its so-called partner and borrower in connection with the program.\"","Gemini Trust Earn products promised returns of as much as 8%. Last month, redemptions were halted because of liquidity issues at Genesis Global resulting from the collapse of the FTX crypto exchange.","Gemini “refused to honor any further investor redemptions, effectively wiping out all investors who still had holdings in the program,” the investors said in the complaint. Had the products been registered, the investors said they would’ve received disclosures that would have let them assess the risks better.","\"Without these disclosures, they were left to fend for themselves as their purportedly safe investments experienced the return characteristics of the unregistered and highly speculative securities that they were,\" the complaint said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gemini Trust Co.","content":"ORGANIZATION"},{"type":"8%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Winklevoss twins","content":"ORGANIZATION"},{"type":"Manhattan","content":"LOCATION"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Gemini Earn","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["GEMINI"],"authors":["Christiana Loureiro","The Block"]}