{"summary":"The Solana Saga device saw huge demand last week amid a surge in the price of bonk, with 30 million tokens included with the phone.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268964\/solana-saga-phone-orders-canceled-inventory-issue","publishDate":"2023-12-22T04:57:45","id":8536,"type":null,"title":"Solana Saga phone orders canceled following &#x27;inventory management&#x27; issue","category":["TECH"],"content":["Some customers' orders for Solana Saga phones have been canceled following an inventory mishap.","Last week, the device saw a <a href=\"https:\/\/www.theblock.co\/post\/267784\/solana-phone-sells-out-in-us-as-traders-spot-arbitrage-with-bonks-skyrocketing-price\" data-v-f87c67ca=\"\">surge in demand<\/a> after a 135% 24-hour jump in the price of the Solana-based memecoin bonk presented traders with an arbitrage opportunity. The Saga phone comes with 30 million bonk tokens, among other incentives — something that became worth more than the device at recent prices. The firm’s limited inventory of 20,000 phones promptly sold out in the U.S. and EU.","“In working to fulfill orders, we learned of an inventory management issue with our third-party distributor that resulted in an inaccurate representation of our inventory,” the Solana Mobile project behind the phone <a href=\"https:\/\/x.com\/solanamobile\/status\/1738043961426456963?s=20\" data-v-f87c67ca=\"\">posted<\/a> on X. “Given this, we are unfortunately unable to fulfill orders that were placed after inventory ran out.”","Solana Mobile said that all affected customers have been informed and will receive a refund in the coming days, apologizing for the inconvenience. Customers who haven’t received a cancelation notice should receive a shipping notice by the end of the year, it added.&nbsp;","Aside from the inventory issue, some orders were also canceled after being flagged for “suspicious activity due to excessive device orders or payment risk,” Solana Mobile said.","Solana-based memecoin bonk went parabolic this month, surging over 800% from $0.0000038 to a peak of $0.000035 on Dec. 15 — the day the phones sold out. However, bonk has since fallen sharply, down 46% to a current price of $0.000019, according to <a href=\"https:\/\/www.theblock.co\/price\/262643\/bonk-bonk-usd\" data-v-f87c67ca=\"\">The Block's bonk price page<\/a>.","<span data-v-f87c67ca=\"\">BONK\/USD price chart. Image: <a href=\"https:\/\/www.theblock.co\/price\/262643\/bonk-bonk-usd\" data-v-f87c67ca=\"\">The Block\/TradingView<\/a>.<\/span>","At its peak, the 30 million bonk tokens that come with the Saga phone, only worth a few dollars when the device first launched, were valued at $1,140 — 90% more than the device’s $599 cost.&nbsp;","At least two Saga phones were reportedly <a href=\"https:\/\/www.theblock.co\/post\/267991\/solana-saga-phone-sells-for-5000-on-ebay-as-bonk-hype-continues\" data-v-f87c67ca=\"\">sold<\/a> for as much as $5,000 on eBay over the weekend as the hype surrounding bonk and potential future airdrops for phone holders continued. Some sellers had the device in hand, while many other sellers still appeared to be waiting for the phone to ship.","However, the subsequent drop in the price of bonk tokens currently places that value at $570, below the phone's price. The arbitrage opportunity was always a risky move given the lead time, with customers buying the phone for that purpose now hoping for a turnaround in the price of bonk tokens by the time they receive their devices.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$0.0000038","content":"MONEY"},{"type":"$599","content":"MONEY"},{"type":"$5,000","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"800%","content":"PERCENT"},{"type":"Dec. 15","content":"DATE"},{"type":"135%","content":"PERCENT"},{"type":"The Block\/TradingView","content":"ORGANIZATION"},{"type":"Solana Saga","content":"ORGANIZATION"},{"type":"Solana Mobile","content":"ORGANIZATION"},{"type":"46%","content":"PERCENT"},{"type":"$0.000019","content":"MONEY"},{"type":"$1,140","content":"MONEY"},{"type":"$0.000035","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$570","content":"MONEY"}],"hashtag":["HARDWARE","SOLANA"],"authors":["James Hunt","The Block"]}