{"summary":"Andy Main has been named as the new CEO of Bakkt. \nGavin Michael will be stepping down on March 26 but will continue in an advisory role.\nA week ago, the company was warned the NYSE could delist it. ","author":["Lawrence Lewitinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283225\/beleaguered-bakkt-replaces-ceo-days-after-nyse-warns-of-delisting","publishDate":"2024-03-18T17:45:46","id":854,"type":null,"title":"Beleaguered Bakkt replaces CEO days after NYSE warns of delisting","category":["Companies"],"content":["Bakkt, the once-promising darling of traditional finance entering the crypto world, has yet again a new CEO. Board member Andy Main, who was briefly CEO of the advertising agency Ogilvy and held senior positions at Deloitte Digital, will helm Bakkt starting March 26.","Current CEO Gavin Michael, who has been in the job for a little more than three years, \"is stepping down to pursue other opportunities,\" <a href=\"https:\/\/www.businesswire.com\/news\/home\/20240318740515\/en\/Bakkt-Announces-Leadership-Transition\" data-v-f87c67ca=\"\">the company said in a press release<\/a>. Bakkt added that Michael \"will serve in an advisory role through March 2025\" to help with the transition.&nbsp; &nbsp;","Main, who joined the board of directors in October 2021, will be the company's fifth CEO since it was founded nearly six years ago.&nbsp; The bitcoin platform, owned mostly by the New York Stock Exchange's parent company, the Intercontinental Exchange (ICE), <a href=\"https:\/\/www.theblock.co\/post\/282390\/bakkt-threatened-with-delisting-by-sister-exchange-nyse\" data-v-f87c67ca=\"\">was alerted last week<\/a> that it could be delisted for having its stock price trading below $1 for 30 days. Several weeks ago, Michael had warned the company would have trouble continuing as a going concern, though it has since raised $50 million, with Main saying that the funding “alleviated the conditions that raise the doubt about us as a going concern,\" according to Bloomberg."],"hashtag":[]}