{"summary":"Arbitrum has partnered with Reddit, which will be the first company to develop on top of Arbitrum Nova.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162299\/reddits-community-points-are-migrating-to-arbitrum-nova","publishDate":"2022-08-09T09:00:47","id":8542,"type":null,"title":"Reddit&#x27;s Community Points are migrating to Arbitrum Nova","category":["THE BLOCK"],"content":["Arbitrum, one of the leading Ethereum Layer 2 scaling platforms, has partnered with Reddit to bring its Community Points system onto a public blockchain.","Arbitrum runs two layers on the Ethereum blockchain: Arbitrum One, which has been around for a while, and Arbitrum Nova, which was recently launched in a beta mode. Arbitrum Nova is a separate network designed specifically for gaming and social applications that maintain security from Ethereum.","Reddit will build its Community Points system on Arbitrum Nova. This will allow developers to build gaming, social, and other applications that make use of Reddit’s token.","The partnership will create opportunities for collaboration among the Ethereum and Reddit communities, and give Reddit users more ways to utilize their community points on the Ethereum blockchain.&nbsp;","“One of the beautiful things about Reddit doing community points on Nova is that it's an open public network where anyone else can launch points, contracts, and applications on,” said Arbitrum CEO Steven Goldfeder.&nbsp;","Tim Rathschmidt, who oversees Reddit’s Consumer and Product communications, told The Block that Reddit has been preparing for the arrival of web3. “Unlike other social platforms that need to entirely rehaul or risk being disrupted by new entrants, Reddit has been building for this all along,” he said.&nbsp; ","Community Points have been in development for almost two years. The three main points Reddit <a href=\"https:\/\/www.reddit.com\/r\/ethereum\/comments\/opi5rg\/scaling_reddits_community_points_with_arbitrum\/\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">emphasized<\/span><\/a> they were looking for was decentralization, developer-friendliness, and broad ecosystem support (other projects in the ecosystem). &nbsp;","“We believe the technology should be in service of something much more foundational and fundamental to human interaction and connection,” Rathschmidt added. “Like everything we do at Reddit, our involvement will be open, self-sustaining, focused on empowerment, and have community at the heart.”&nbsp;","Currently Reddit's community points are held on Ethereum's Rinkeby testnet. While they are on testnet and theoretically shouldn't have any real value, there is a market for these testnet tokens. For instance, Moons from the r\/cryptocurrency subreddit are currently <a href=\"https:\/\/coinmarketcap.com\/currencies\/moon\/\" data-v-f87c67ca=\"\">going for<\/a> $0.08. Yet it is relatively hard to sell the tokens at present since they have to be transferred across blockchains — a friction point that should disappear when they move to Arbitrum Nova.","While this is the first major deployment on Nova, many other firms are participating in the chain’s highly anticipated launch.&nbsp;","FTX, Consensys, P2P, and QuickNode will be inaugural members of Nova's so-called Data Availability Committee, which will help Nova achieve cost savings by sending data to the committee versus putting data on-chain.&nbsp;","Other prominent DeFi protocols, including Maker's DAI token and Sushiswap also plan to deploy on Nova.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arbitrum Nova","content":"ORGANIZATION"},{"type":"Nova","content":"ORGANIZATION"},{"type":"Reddit","content":"LOCATION"},{"type":"Sushiswap","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Steven Goldfeder","content":"PERSON"},{"type":"Tim Rathschmidt","content":"PERSON"},{"type":"Data Availability Committee","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Community Points","content":"ORGANIZATION"},{"type":"Nova","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"$0.08","content":"MONEY"}],"hashtag":["ARBITRUM","ETHEREUM"],"authors":["Mike Truppa","The Block"]}