{"summary":"Ethereum Layer 2 Optimism will release its first major upgrade, aimed at improving network performance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208043\/optimism-plans-major-network-upgrade-called-bedrock-in-march","publishDate":"2023-02-02T08:49:05","id":8544,"type":null,"title":"Optimism eyes major network upgrade called Bedrock in March","category":["CRYPTO ECOSYSTEMS"],"content":["The Ethereum Layer 2 network, Optimism, is aiming to release Bedrock, its first major upgrade this month, with the goal of enhancing network performance.","The upgrade, tentatively planned in March, will enable improvements in transaction costs, speeds, and compatibility with the Ethereum Virtual Machine. In addition to these performance enhancements, the upgrade will also create a foundation for future improvements, such as decentralizing sequencing — the part that collates the transactions together — and improving on-chain security. Sequencing allows the network to derive security from Ethereum.","The team at Optimism stated that the majority of users will not be impacted by the upgrade. However, users and projects that run full nodes will need to take action to prepare for the upgrade.","The team estimates that the upgrade to Bedrock will take less than four hours and will not require a network reset, also known as “regenesis.” Historic chain data will still be accessible after the upgrade, ensuring that users will not lose any important information. The Optimism Goerli testnet has already successfully upgraded to Bedrock.","Optimism is a Layer 2 scaling solution for Ethereum, designed to provide faster and cheaper transactions while maintaining the security and compatibility of the Ethereum mainnet.","It uses optimistic rollups, a technology that allows for the bundling of many transactions into a single transaction that is then recorded on the Ethereum blockchain. By doing so, Optimism reduces the number of transactions that need to be processed by the Ethereum network, leading to lower transaction fees and faster transaction times.","Optimism also provides developers with a platform to build and deploy decentralized applications with scalability. Currently, the network has more than 50 decentralized applications running on its chain and close to <a href=\"https:\/\/defillama.com\/chain\/Optimism\" data-v-f87c67ca=\"\">$745 million<\/a> in total value of assets staked.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"$745 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["OPTIMISM"],"authors":["Vishal Chawla","The Block"]}