{"summary":"Called Tweet DAO, members are paying to get the right to tweet and it’s resulting in a multifaceted Twitter profile.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/140334\/a-dao-is-selling-nfts-for-the-right-to-tweet-in-a-bizarre-experiment","publishDate":"2022-04-03T07:56:24","id":8545,"type":null,"title":"A DAO is selling NFTs for the right to tweet — in a bizarre experiment","category":["NFTS"],"content":["With the emergence of NFTs and DAOs, along with the ubiquity of Twitter, it was only a matter of time before someone put all three together.","Meet <a href=\"https:\/\/twitter.com\/TheTweetDao\" data-v-f87c67ca=\"\">Tweet DAO<\/a>, a collective of individuals forming around an NFT collection and a single Twitter account.","The basic idea is that the creators of the d<span class=\"ILfuVd\" data-v-f87c67ca=\"\"><span class=\"hgKElc\" data-v-f87c67ca=\"\">ecentralized autonomous organization<\/span><\/span> are selling NFTs in the form of eggs. Those who buy the egg NFTs are able to make one tweet from the account per day. But there doesn’t seem to be any vetting over the quality of the tweets. It’s a free-for-all.","“I believe in taking care of myself, and a balanced diet and a rigorous exercise routine. In the morning, if my face is a little puffy, I'll put on an ice pack while doing my stomach crunches. I can do a thousand now,” says one <a href=\"https:\/\/twitter.com\/TheTweetDao\/status\/1510539868799213568\" data-v-f87c67ca=\"\">tweet<\/a>, quoting Patrick Bateman in American Psycho.","A lot of tweets are, unsurprisingly, full of praise for the idea itself. Many of them are promoting the eggs, potentially trying to pump the value of their own NFTs — while the authors stay hidden behind the shared account. “This twitter account is the dumbest idea I ever heard, yet it may be the next Ether Rocks,” says one, referencing an early NFT collection that blew up in value last year.","Some tweets are used to promote the owner’s own NFT project or to try to sell one of their own NFTs. One tweet is attempting to offload a Pudgy Penguin NFT, which is on sale for 8.8 ETH ($30,700).&nbsp;","Other tweets are sporadic and random, as you might expect. Some reference well-known crypto concepts like the UpOnly podcast, key crypto individuals like Do Kwon and Elon Musk and even a cult NFT collection called Milady Maker. One tweeted out the phrase “go sleep anon” in Morse code.&nbsp;","If the concept catches on, it could do well for the creators of the NFTs. The collection is being sold on a sliding scale from 0.1 ETH ($340) to 1 ETH ($3,400) — increasing by 0.1 ETH for every 100 NFTs sold. That means the collection could net the creators up to 500 ETH ($1.7 million).","Some in the community are concerned, however, that the account may be closed by Twitter if it’s found to break its rules. Twitter has some restrictions on automated accounts and on taking payments for tweets. One tweet stated, “Please <a href=\"https:\/\/twitter.com\/jack\" data-v-f87c67ca=\"\">@jack<\/a> don't ban it,” in reference to Twitter’s former CEO, Jack Dorsey.&nbsp;","Others were a little more self-reflective. One <a href=\"https:\/\/twitter.com\/TheTweetDao\/status\/1510528878569304066\" data-v-f87c67ca=\"\">said<\/a>: “I just paid $2,000 to tweet this. How thin the line between genius and madness.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Patrick Bateman","content":"PERSON"},{"type":"Morse","content":"LOCATION"},{"type":"American Psycho","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Pudgy Penguin NFT","content":"ORGANIZATION"},{"type":"Tweet DAO","content":"ORGANIZATION"},{"type":"$1.7 million","content":"MONEY"},{"type":"$3,400","content":"MONEY"},{"type":"$30,700","content":"MONEY"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Milady Maker","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"$2,000","content":"MONEY"},{"type":"$340","content":"MONEY"}],"hashtag":["TWITTER"],"authors":["Tim Copeland","The Block"]}