{"summary":"BitDAO says Mantle is the DAO’s attempt to shift the focus back to Ethereum while solving problems facing Layer 2 networks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190926\/bitdao-launches-modular-ethereum-layer-2-network-mantle","publishDate":"2022-11-30T08:00:41","id":8547,"type":null,"title":"BitDAO launches modular Ethereum Layer 2 network Mantle","category":["LAYER 2S AND SCALING"],"content":["BitDAO, a decentralized autonomous organization with a treasury worth over $1.7 billion, has launched an Ethereum Layer 2 network called Mantle, the DAO announced on Wednesday.","Mantle is a modular Ethereum Layer 2 chain. Modular networks are a new way of designing blockchains and are different from the older monolithic chains, where all network functions happen on the base layer. On modular blockchains, there are separate layers for network consensus, transaction execution and settlement, as well as data availability. This type of design is said to create networks that are more efficient and have greater scalability.","BitDAO’s Layer 2 network stack has three distinct layers, according to the announcement. One layer is for transaction execution while the other two handle transaction finality and data availability, respectively.","Mantle is BitDAO’s attempt to solve some of the challenges facing Layer 2 networks, a spokesperson for the DAO told The Block. “BitDAO aims to bring the spotlight back from Alt-L1s to Ethereum and give market participants the best web3, DeFi and GameFi have to offer,” said the spokesperson.","Mantle will reportedly offer superior features compared to other Layer 2 networks. BitDAO’s Layer 2 network will come with faster throughput and low fees, and be powered by a decentralized data availability layer, the announcement stated. Transaction fees on Mantle will be paid using BitDAO’s governance token, BIT.","EigenLayer, an Ethereum middleware platform, is one of the partners in the project. As such, early adopters can use EigenDA, a custom-built data availability layer designed by EigenLayer that supports Optimistic and <a href=\"https:\/\/www.theblock.co\/post\/162098\/zk-rollups-likely-to-be-main-layer-2-solution-for-ethereum-says-vitalik-buterin\" data-v-f87c67ca=\"\">ZK-Rollups<\/a> — the two major types of roll-up technology.","Wednesday’s announcement marks the soft launch of the Layer 2 network. Mantle is expected to roll out an incentivized public testnet next year.","A BitDAO spokesperson confirmed that DAO partners can deploy protocols on Mantle when launched. Unlike most DAOs built around specific DeFi projects, BitDAO is more of an investment DAO. BitDAO’s mandate is to grow the web3 ecosystem by <a href=\"https:\/\/www.theblock.co\/post\/162698\/bitdao-to-fund-africadao-with-20-million-for-web3-adoption-in-africa\" data-v-f87c67ca=\"\">providing grants to projects<\/a> and supporting web3-based research activities. BitDAO has the second-largest DAO <a href=\"https:\/\/etherscan.io\/address\/0x78605Df79524164911C144801f41e9811B7DB73D\" data-v-f87c67ca=\"\">treasury<\/a> in the crypto space.","“Mantle will serve as the connective tissue for various BitDAO initiatives, such as projects from Game7, research from EduDAO, to the ecosystem of dApps being enabled by BitDAO,\" said jacobc.eth, product head at BitDAO’s Windranger Labs, adding: \"Mantle is BitDAO’s demonstration to scale Ethereum and web3, enabling a whole new generation of use cases and innovations.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mantle","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"$1.7 billion","content":"MONEY"}],"hashtag":["ROLLUPS","SIDECHAINS"],"authors":["Osato Avan-Nomayo","The Block"]}