{"summary":"The UK should bolster regulation on crypto to increase confidence post-FTX, according to Tom Duff Gordon, vice president on international policy at Coinbase.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192527\/regulatory-guardrails-crypto-confidence-coinbase","publishDate":"2022-12-06T12:15:56","id":8548,"type":null,"title":"Coinbase sees &#x27;regulatory guardrails’ needed for crypto confidence boost","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">The UK needs to beef up its regulation of crypto for public confidence to return to the still reeling sector in the wake of the FTX collapse, Coinbase Vice President for International Policy Tom Duff Gordon said in a podcast interview.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“Certainly if you look at the UK for example, one way to restore confidence is to usher in and accelerate some basic regulatory guardrails,” Gordon said in an episode of \"Following the Rules\" <a href=\"https:\/\/podcasts.apple.com\/gb\/podcast\/following-the-rules\/id1619958232?i=1000588950169\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">released<\/a>&nbsp;on Tuesday, adding that companies may need to be proactive and seek out regulation.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhile regulators may not always move as fast as government wants, Coinbase has been engaging with British parliamentarians “across the political divide\" through parliamentary groups on crypto and other events, Gordon said, adding that he's been speaking to the lead economic spokesman for the Labour Party, Rachel Reeves.<\/span>","<span data-v-f87c67ca=\"\">“I think it's important and we don't make any bets on election outcomes, but we do want to make sure that across the political divide that there is support for digital assets,” he said.<\/span><b data-v-f87c67ca=\"\"><\/b>","<span data-v-f87c67ca=\"\">It is certainly not rare to find industry leaders in the same rooms as policymakers and regulators, especially as governments open their doors for consultations on how to best approach the nascent market. Crypto payment platform Ripple, for example, <\/span><a href=\"https:\/\/www.theblock.co\/post\/186892\/ripple-publishes-proposed-guidelines-for-uk-regulators\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">published<\/span><\/a><span data-v-f87c67ca=\"\"> a regulatory whitepaper for UK policymakers last month.<\/span>","<span data-v-f87c67ca=\"\">New laws for regulating crypto in the UK rest largely with the Financial Services and Markets Bill, which is currently in parliament discussions. While targeting the UK’s financial sector more broadly, the bill sets working definitions for crypto assets and hands the national regulator, the Financial Conduct Authority, more supervisory power.<\/span>","<span data-v-f87c67ca=\"\">Despite incremental build-up, some regulators and industry leaders are looking for regulation to par up to more comprehensive frameworks, like the European Union’s Markets in Crypto-Assets.<\/span>","<span data-v-f87c67ca=\"\">“There's an opportunity for a basic set of guardrails for crypto asset service providers where the UK takes the good bits of MiCA, which is the markets in crypto assets regulation from the EU, and builds upon those and perhaps looks to focus less on some of the parts of MiCA that are less necessary or work less well,” Gordon said.<\/span>","<span data-v-f87c67ca=\"\">The good bit, according to Gordon, is how MiCA leaves the responsibility of asset listing to the crypto asset service provider. He said the part of the regulation he'd leave behind includes limitations on stablecoins, such as the <\/span><a href=\"https:\/\/www.theblock.co\/post\/173479\/non-euro-stablecoin-transaction-cap-revived-in-mica\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">cap<\/span><\/a><span data-v-f87c67ca=\"\"> on the use of non-euro denominated stablecoins.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“There’s a real opportunity for the UK to bring in some sensible and proportionate rules for stablecoins and to see the sterling stablecoin market grow,” he said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"European Union","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"EU","content":"ORGANIZATION"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Gordon","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"Coinbase Vice President for International Policy Tom Duff Gordon","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Labour Party","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"Rachel Reeves","content":"PERSON"}],"hashtag":["COINBASE","EUROPEAN PARLIAMENT","UK PARLIAMENT"],"authors":["Inbar Preiss","The Block"]}