{"summary":"Safe{RecoveryHub} allows users to recover their crypto assets using self-custodial, custodial or social recovery options.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266474\/safe-sygnum-bank-coincover-launch-crypto-recovery-service","publishDate":"2023-12-07T06:00:57","id":855,"type":null,"title":"Safe joins forces with Sygnum Bank, Coincover for crypto recovery service","category":["SECURITY"],"content":["On-chain custody protocol Safe (formerly Gnosis Safe) has teamed up with digital asset banking group Sygnum and UK-regulated recovery service provider Coincover to launch an optional crypto recovery service for users.","Dubbed “Safe RecoveryHub,” the service offers a range of options from self-custodial to custodial and social recovery, according to a statement.","According to Safe, if needed, RecoveryHub users will be able to restore their access to crypto assets via designated “recoverers,” including personal backup devices, family members, friends, or other collaborators for social recovery. Additionally, trusted third parties like Sygnum Bank and Coincover will offer a more formal recovery process, the team said.","Notably, users will maintain control over their accounts, only giving recoverers access when initiating a recovery event and can veto any such attempts. Users can also set up multiple recoverers, with a threshold required to enhance security.","“Rather than face a binary choice between a self-custody or custodial experience, users are empowered to optimize a key recovery solution to fit their personal risk preferences,” Safe co-founder Lukas Schor said.","While self-custody is touted as one of the main value propositions of web3, ensuring users retain full control over their assets in contrast to the custodial solutions of centralized exchanges and wallets, there are trade-offs. Coinbase Director Conor Grogan recently <a href=\"https:\/\/github.com\/jconorgrogan\/Lost-ETH\" data-v-f87c67ca=\"\">estimated<\/a> that over 912,000 ETH, now worth over $2 billion, had been lost due to Ethereum-based user errors and buggy contracts - 0.75% of circulating supply. That's where social recovery alternatives may come in, especially for institutions.","“As the market for self custody expands and new use cases emerge, there is a growing need for reliable institutional recovery solutions,” Sygnum Bank CPO Thomas Eichenberger added. “For individuals holding valuable digital assets, complementing self-custody with additional safeguards provides a balance between the desire for financial sovereignty and the need for risk management.”","Safe said that the recovery service is available to all Safe Wallet users from today, with partner solutions launching in the first half of 2024.","Notably, a similar recovery solution leveraging advanced cryptography and multi-party computation was introduced by hardware wallet provider <a href=\"https:\/\/www.theblock.co\/post\/251954\/ledger-ceo-privacy-on-demand\" data-v-f87c67ca=\"\">Ledger<\/a> earlier this year, also in collaboration in Coincover.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"0.75%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"Gnosis","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Thomas Eichenberger","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"the first half of 2024","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"Coincover","content":"ORGANIZATION"},{"type":"Conor Grogan","content":"PERSON"},{"type":"Sygnum Bank","content":"ORGANIZATION"},{"type":"Lukas Schor","content":"PERSON"},{"type":"$2 billion","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ASSETS","CRYPTO","TRADFI BANKS","WALLET MAKERS"],"authors":["James Hunt","The Block"]}