{"summary":"Coinbase&#x27;s recent regulatory woes make its stock a &#x27;hold,&#x27; according to analysts at Berenberg Capital Markets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231101\/coinbase-is-a-hold-amid-too-much-regulatory-risk-says-berenberg","publishDate":"2023-05-16T18:19:31","id":8562,"type":null,"title":"Coinbase is a &#x27;hold&#x27; amid &#x27;too much regulatory risk,&#x27; says Berenberg","category":["THE BLOCK"],"content":["Coinbase's recent regulatory woes make its stock a 'hold,' according to analysts at Berenberg Capital Markets.&nbsp;","The firm, which initiated coverage in the crypto-linked equity, kicked off its coverage of the stock with a price target of $55 per share. Coinbase closed at around $57.90 a share. Shares are up about 70% year-to-date.","Berenberg's neutral view on the stock stems from the regulatory environment for crypto in recent months and, specifically, rising tensions between Coinbase and the SEC which present \"too much regulatory risk.\"","For its part, Coinbase sued the SEC less than a year after it requested the agency for regulatory clarity. The SEC, in turn, <a href=\"https:\/\/www.theblock.co\/post\/230935\/the-sec-calls-coinbases-suit-over-digital-asset-rules-petition-baseless\" data-v-f87c67ca=\"\">argued<\/a> that the commission is under no obligation to issue new regulations and Coinbase has no standing to sue the agency.","The battle—and Chairman Gary Gensler's view that most cryptocurrencies are securities—could spell trouble for COIN bulls.&nbsp;","\"Investors should believe the SEC when it says it views all crypto tokens other than bitcoin as unregistered securities,\" Berenburg's Mark Palmer noted. \"As such, all platforms that facilitate trading of those tokens in the U.S. are vulnerable to being hit with enforcement actions that would potentially impact large swaths of their business activities.\"","The firm estimates that about 37% of Coinbase trading fee revenue comes from non bitcoin assets, which could have exposure to regulatory risk.","Palmer, an equity analyst veteran, <a href=\"https:\/\/www.linkedin.com\/in\/mark-palmer-bb12b3202\/\" data-v-f87c67ca=\"\">joined<\/a> Berenberg recently from BTIG, where he covered fintech and crypto.","The analyst noted that Coinbase is positioned to \"outlast the 'crypto winter,'\" pointing to \"better-than-expected Q123 print that it posted on May 4 and its $5.3bn of available cash resources as of March 31.\"","\"However, we also believe investors should be focusing on whether the company would have the ability to successfully pivot its business model and geographic focus if it were forced to curtail or cease a large portion of its activities in the U.S. as a result of an SEC enforcement action that appears likely to occur soon.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Berenburg","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"$5.3","content":"MONEY"},{"type":"May 4","content":"DATE"},{"type":"$55","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Berenberg","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"March 31","content":"DATE"},{"type":"Berenberg Capital Markets","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$57.90","content":"MONEY"},{"type":"37%","content":"PERCENT"},{"type":"Mark Palmer","content":"PERSON"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}