{"summary":"Crypto will be classified as high risk in the coming years, but it&#x27;s here to stay, said the Dutch central bank who chairs the Financial Stability Boards&#x27; crypto working group.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221641\/letting-crypto-burn-is-an-attractive-option-dutch-central-banker-says","publishDate":"2023-03-21T13:07:12","id":8564,"type":null,"title":"Letting crypto burn is an &#x27;attractive option,&#x27; Dutch central banker says","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">Although it would be an \"attractive option\" to let the crypto industry collapse onto itself, the crypto industry is here to stay despite the market downturn, or \"crypto winter,\" <\/span>said Steven Maijoor, executive director of supervision of the Dutch central bank and chair of the Financial Stability Boards's crypto working group.","\"C<span data-v-f87c67ca=\"\">rypto is here to stay and regulators need to set a path for supervising the sector,\"&nbsp;<\/span>Maijoor said, speaking at the Bank for International Settlements Summit on Tuesday.","The past year has been tumultuous for the crypto sector, seeing major crashes, including Terra's stablecoin collapse, the FTX debacle, and most recently the unravelling of crypto-friendly banks such as Silicon Valley Bank, Signature and Silvergate. Despite this series of events, there is growing interest in both digital assets and their underlying technology.&nbsp;","<span data-v-f87c67ca=\"\">Traditional finance players as well as consumers are interested in getting involved in the sector, making regulation — and therefore legitimization — necessary, Maijoor said. <\/span><span data-v-f87c67ca=\"\">Despite jurisdictions taking measures to regulate the sector around the world, crypto will remain a high risk for the next few years, he added.<\/span>","<span data-v-f87c67ca=\"\">\"There is detriment for consumers, but it's not for us as regulators to judge if this will be a successful new technological development, but to only control the negatives,\" he said.<\/span>","<span data-v-f87c67ca=\"\">The FSB's recommendations on global crypto regulation standards will be published in the summer, following the<\/span> <a href=\"https:\/\/www.theblock.co\/post\/176025\/g20-central-bankers-warn-stablecoins-arent-stable-recommend-action-around-crypto-assets\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">call<\/span><\/a><span data-v-f87c67ca=\"\"> for industry and expert input on policy recommendations from October, the crypto working group chair noted. <\/span>","The policy recommendations stem from a principle of \"same risk, same regulation.\" Maijoor noted that jurisdictions will need to be incentivized to implement the rules proposed by the FSB.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bank for International Settlements Summit","content":"ORGANIZATION"},{"type":"Maijoor","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"FSB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Financial Stability Boards","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Steven Maijoor","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":[],"authors":["Inbar Preiss","The Block"]}