{"summary":"Stellar has partnered with security firm Certora to conduct security audit checks for its upcoming smart contracts platform, Soroban.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255868\/stellar-conducts-security-checks-for-upcoming-smart-contracts-platform-soroban","publishDate":"2023-10-11T11:00:03","id":8566,"type":null,"title":"Stellar conducts security checks for smart contracts platform Soroban","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">The development foundation behind the <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Stellar <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248370\/stellar-xlm-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Stellar_symbol_black_RGB.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">XLM<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.43%\n    <\/span><\/a> <!----><\/span><\/span> blockchain has announced comprehensive security checks for its forthcoming smart contracts platform, Soroban.<\/span>","It has entered into a partnership with the security firm Certora, known for its formal verification tooling, to conduct these security audit checks.","Soroban, currently live on testnet, will give developers a new mechanism to deploy smart contracts, broadening the ecosystem of applications built on the Stellar blockchain. The platform leverages WebAssembly (WASM) — a binary-code format tailored for traditional web and blockchain integrations.","Considering the adversarial blockchain environment where even minor code vulnerabilities can lead to major setbacks, Stellar confirmed the implementation of rigorous security checks was necessary. Owing to their transparent and immutable characteristics, smart contracts necessitate stringent security measures to ward off potential threats.","The Stellar Development Foundation stated it will employ Certora’s <a href=\"https:\/\/www.certora.com\/\" data-v-f87c67ca=\"\">formal verification<\/a> tools, which surpass a mere one-time code inspection and provide a continuous integration service. When code is modified, it aligns with the specifications. This approach is designed to consistently keep bugs and vulnerabilities out of the codebase.","“Certora’s support of Soroban will equip the over 100 projects already in development on the platform with state-of-the-art verification tools to ensure software integrity,” said Tomer Weller, VP of Product at the Stellar Development Foundation. “Together with the intrinsic testing and security features of Soroban, developers have the tools required to bypass previous vulnerabilities and set the foundation for a secure DeFi ecosystem from its inception.”","Co-founded in 2014 by Jed McCaleb and Joyce Kim, <a href=\"https:\/\/www.theblock.co\/post\/253051\/circle-launches-eurc-stablecoin-on-stellar-network\" data-v-f87c67ca=\"\">Stellar<\/a> is an open-source blockchain protocol enabling swift cross-border transactions.","Originally, Stellar functioned on a system akin to Ripple since it was conceptualized as a fork. However, facing challenges and driven by the aspiration for a distinctive solution, Stellar introduced a completely revamped codebase with a renewed consensus mechanism termed the Stellar Consensus Protocol (SCP).","Though Stellar has supported smart contracts in the past, the core team has been progressively focusing on developing Soroban as general-purpose and developer-friendly platform to deploy WASM-based high-performance dapps. The mainnet launch of Soroban is expected by early next year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Tomer Weller","content":"PERSON"},{"type":"Certora","content":"LOCATION"},{"type":"Jed McCaleb","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Joyce Kim","content":"PERSON"},{"type":"+0.43%","content":"PERCENT"},{"type":"Stellar Consensus Protocol (SCP","content":"ORGANIZATION"},{"type":"Stellar Development Foundation","content":"ORGANIZATION"}],"hashtag":["CRYPTO"],"authors":["Vishal Chawla","The Block"]}