{"summary":"Federal Reserve Vice Chair Lael Brainard says the central bank must weigh questions around transfer limits and interest-bearing accounts as part of the debate over whether a digital dollar is necessary.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168366\/fed-needs-to-answer-key-questions-around-digital-dollar-brainard","publishDate":"2022-09-07T14:20:55","id":8568,"type":null,"title":"Fed needs to answer key questions around digital dollar: Brainard","category":["CRYPTOCURRENCY"],"content":["Federal Reserve Vice Chair Lael Brainard says the central bank must weigh questions around transfer limits and interest-bearing accounts as part of the debate over whether a digital dollar is necessary.","A key part of the central bank’s inquiry is what the future of the financial system’s infrastructure will look like, and whether a digital dollar would play a necessary role, Brainard said at a conference hosted by the Bank Policy Institute in New York.&nbsp;","Private banks should continue to play a role in the economy, rather than the Fed directly banking customers using the digital dollar. The central bank won't seek to crowd out private business activity in payments or otherwise, she said. Brainard did raise concerns about stablecoins, calling them an area “with the most potential risk of not properly regulated.”","That said, a digital dollar isn't foremost on the Fed's agenda.&nbsp;","“I don’t think it’s particularly relevant today,” she said. But \"we see the financial system moving in a digital direction every day.\"&nbsp;","The Fed vice chair reiterated that the central bank expects its <a href=\"https:\/\/www.theblock.co\/post\/166327\/federal-reserves-fednow-payments-system-will-be-live-within-a-year-says-brainard\" data-v-f87c67ca=\"\">instant payments system<\/a>&nbsp;to go live between May and July 2023.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Lael Brainard","content":"PERSON"},{"type":"Brainard","content":"PERSON"},{"type":"July 2023","content":"DATE"},{"type":"Bank Policy Institute","content":"ORGANIZATION"}],"hashtag":[],"authors":["Colin Wilhelm","The Block"]}