{"summary":"Ethereum Layer 2 scaling platform Optimism will be offline for up to four hours on June 6 for the Bedrock upgrade.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230898\/optimism-mainnet-bedrock-upgrade","publishDate":"2023-05-15T17:10:04","id":8570,"type":null,"title":"Optimism plans mainnet Bedrock upgrade for June 6","category":["CRYPTO ECOSYSTEMS"],"content":["Optimism, a Layer 2 scaling platform for Ethereum, has set June 6 as the official date for a major upgrade to its mainnet called Bedrock.","The upgrade, <a href=\"https:\/\/www.theblock.co\/post\/208043\/optimism-plans-major-network-upgrade-called-bedrock-in-march\" data-v-f87c67ca=\"\">discussed earlier this year<\/a>, will require two to four hours of downtime during which transactions, deposits and withdrawals will not be available, the Optimism Foundation <a href=\"https:\/\/twitter.com\/optimismFND\/status\/1658202279147601921\" data-v-f87c67ca=\"\">said Monday in a thread on Twitter<\/a>.&nbsp;","\"Bedrock will improve the security and resilience of the OP Mainnet bridge,\" the foundation said, adding that it would significantly cut fees. \"Bedrock is designed with the most minimal diff on Ethereum possible. Ethereum equivalence + minimized complexity = less room for bugs, easier for ecosystem devs to contribute.\"","The foundation said that additional information will be available on a <a href=\"https:\/\/oplabs.notion.site\/Bedrock-Mission-Control-EXTERNAL-fca344b1f799447cb1bcf3aae62157c5\" data-v-f87c67ca=\"\">mission control website<\/a>. One of the upgrade's key design goals is backward compatibility.&nbsp;","\"If you are a node operator, you will need to spin up a brand new node deployment for Bedrock,\" the foundation added.&nbsp;","Optimism uses optimistic rollups, a technology that allows for the bundling of multiple transactions that are then recorded on the Ethereum blockchain in a single transaction. The network has around <a href=\"https:\/\/defillama.com\/chain\/Optimism\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">$863 million<\/a> of locked assets on the platform.&nbsp;","\"Bedrock makes it easy to contribute to client diversity (@a16zcrypto Magi +@testinprod_io's op-erigon are early proof of this),\" the foundation <a href=\"https:\/\/twitter.com\/optimismFND\/status\/1658202287917998080\" data-v-f87c67ca=\"\">added<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Optimism Foundation","content":"ORGANIZATION"},{"type":"June 6","content":"DATE"},{"type":"$863 million","content":"MONEY"}],"hashtag":["OPTIMISM"],"authors":["Nathan Crooks","The Block"]}