{"summary":"Sam Bankman-Fried&#x27;s crypto policy ambitions are in jeopardy after he sold FTX to rival exchange Binance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184436\/bankman-frieds-priority-crypto-bill-dead-after-ftx-sells-to-binance","publishDate":"2022-11-08T16:56:02","id":8575,"type":null,"title":"Bankman-Fried’s priority crypto bill ‘dead’ after FTX sells to Binance","category":["POLICY"],"content":["FTX CEO Sam Bankman-Fried poured millions of dollars into political races and lobbying costs this year, becoming crypto’s best-known voice in the world of Washington policymaking.&nbsp;","But minutes after the exchange boss made the shocking decision to sell his company to Binance on Election Day, industry insiders declared that Bankman-Fried’s priority bill was “dead” in Washington — or at least on life support.&nbsp;","“It’s dead. Dead, dead, dead, dead,” Messari CEO Ryan Selkis said.","Bankman-Fried was the industry’s most prominent advocate for a bipartisan bill authored by Sens. Debbie Stabenow, D-Mich., and John Boozman, R-Ark. The Digital Commodities Consumer Protection Act, introduced in August, would grant the Commodities Futures Trading Commission new regulatory authority over crypto commodities exchanges and spot markets.&nbsp;","The bill — and Bankman-Fried himself — faced sharp criticism from proponents of decentralized finance, who say the legislation would hurt their projects. The scrutiny reached a fever pitch after a revised draft version of the bill became public, prompting private pushback from DeFi advocates to spill into public view. Advocates for the bill hoped it could be tied to a larger end-of-year spending package to fast-track it into law.","At the same time, FTX began to crumble. Rival exchange Binance announced on Sunday that it would sell a large position of FTX’s native exchange token, FTT. The move led to the collapse of the FTT token, which had dropped from $22 on Sunday to $14.59 on Tuesday morning. It sent the rest of the market plunging, too. FTX declined to comment.&nbsp;","FTX’s high-profile implosion makes it much less likely that the Stabenow-Boozman bill will gain traction in the last two months of the year, those tracking it say. Lawmakers will have to reintroduce existing bills when the new Congress begins in January.&nbsp;","\"I can say that discussions to address a few remaining concerns with the legislation are ongoing. This development doesn’t change that work on our end,\" said Patrick Creamer, the Republican communications director for the Senate Agriculture Committee.","“It's not going to happen this year. The driving force behind getting it done was Sam, and he obviously is preoccupied with other concerns at the moment, namely selling his international arm of his empire to Binance,” said Kristin Smith, the executive director of the Blockchain Association. “I don't think he's going to be on the ground in Washington anytime soon.”","The details of the FTX sale were not clear on Tuesday afternoon. Binance signed a “non-binding LOI” and intends to “fully acquire” the international arm of FTX and “help cover the liquidity crunch,” Binance CEO Changpeng Zhao <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1590013613586411520\" data-v-f87c67ca=\"\">said<\/a> on Twitter. A day earlier, Bankman-Fried had <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1589598284322328579\" data-v-f87c67ca=\"\">said<\/a> FTX was “fine.” Binance declined to comment.&nbsp;","“I think it's going to gonna take a long time for the dust to settle with this situation, for people to find out exactly what happened and what is happening. And I think that no matter what happens, it'll certainly be an unfortunate situation from which a lot of people can learn a lot. And I think that from that perspective, it might delay the bill,” said DeFi Education Fund Policy Director Miller Whitehouse-Levine, referring to the DCCPA.","Bankman-Fried’s crypto crisis has also left the industry scrambling to protect its credibility in Washington. The FTX meltdown might damage how policymakers view the industry, said Selkis, or push lawmakers to pass legislation that stunts the industry. Selkis called other crypto executives to “step up and actually demonstrate some leadership” on policy in the next few months.","“This is a pretty crucial moment for the industry in the U.S. right now ... The optics of this are just terrible. We've got some work cut out for us going into the new year,” Selkis said. “It's another very public setback.”&nbsp;","Lawmakers are already weighing in on the sudden collapse and sale. Rep. Patrick McHenry, the ranking Republican on the House Financial Services Committee and likely next chair of that committee, doubled down on his calls for new crypto laws in a statement.","“The recent events show the necessity of congressional action. It’s imperative that Congress establish a framework that ensures Americans have adequate protections while also allowing innovation to thrive here in the U.S. I look forward to learning more from FTX and Binance in the coming days about these events and the steps they will take to protect customers during the transition,” McHenry said.&nbsp;","There’s some irony to Bankman-Fried’s exchange conundrum, said Gellasch, who previously worked as counsel to a Senate subcommittee and for former Securities and Exchange Commissioner Kara Stein. &nbsp;","“The firm that has been leading the charge as perhaps the most reasonable voice on effective regulation,” Gellasch said. “Is now facing its own sort of existential financial crisis that, frankly, is almost exclusively made possible because of the lack of effective regulation of space.”","The digital asset industry is “entirely built on confidence” in the absence of transparent regulations, which leaves it vulnerable to volatility, Gellasch added. The FTX sale and its market impact could bolster the case for new laws, or stricter enforcement of existing financial regulations.&nbsp;","If the Stabenow-Boozman bill had already been enacted, it could have put a stop to the “old fashioned bank run” that FTX faced on its FTT token, said progressive policy advocate Todd Phillips, who previously worked for the Center for American Progress. But in his view, the FTX sale won’t be the nail in the coffin for the legislation because it has many other supporters, Phillips said.","Although Bankman-Fried has been a prominent voice on crypto policy, he is not the only player, Smith noted. The crypto agenda is also sure to shift next year if Republicans reclaim the House and Senate in the midterms, which will be decided Tuesday night.&nbsp;","“Sam certainly has a high profile, but he is not the only voice in the room. There are a lot of us who are going to continue doing the work that we have been doing, making sure that policymakers are educated on these issues and providing thoughtful ideas about how to move forward with regulation,” Smith said. “The industry is well-positioned to continue to have a voice in Washington and to be a productive partner in figuring out the right path forward.”","<em data-v-f87c67ca=\"\">Kollen Post contributed to this report. <\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"John Boozman","content":"PERSON"},{"type":"Commodities Futures Trading Commission","content":"ORGANIZATION"},{"type":"Kristin Smith","content":"PERSON"},{"type":"Todd Phillips","content":"PERSON"},{"type":"Debbie Stabenow","content":"PERSON"},{"type":"” Smith","content":"PERSON"},{"type":"Phillips","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"Ryan Selkis","content":"PERSON"},{"type":"Levine","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"FTT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"night","content":"TIME"},{"type":"Gellasch","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Patrick Creamer","content":"PERSON"},{"type":"Boozman","content":"PERSON"},{"type":"Senate Agriculture Committee","content":"ORGANIZATION"},{"type":"McHenry","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"},{"type":"Center for American Progress","content":"ORGANIZATION"},{"type":"Election Day","content":"DATE"},{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Kara Stein","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Smith","content":"PERSON"},{"type":"$14.59","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"millions of dollars","content":"MONEY"},{"type":"Selkis","content":"PERSON"},{"type":"Ark","content":"LOCATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Securities and Exchange","content":"ORGANIZATION"},{"type":"afternoon","content":"TIME"},{"type":"Miller Whitehouse","content":"PERSON"},{"type":"Sunday","content":"DATE"},{"type":"Binance","content":"LOCATION"},{"type":"Washington","content":"LOCATION"},{"type":"$22","content":"MONEY"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Patrick McHenry","content":"PERSON"},{"type":"Mich.","content":"LOCATION"},{"type":"morning","content":"TIME"},{"type":"Stabenow","content":"PERSON"},{"type":"Bankman","content":"PERSON"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}