{"summary":"The funding will come from 10% of all Fantom transaction fees and will be held in an Ecosystem Support vault.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156122\/fantom-community-voting-on-whether-to-use-burn-fee-to-fund-projects","publishDate":"2022-07-06T13:28:16","id":8579,"type":null,"title":"Fantom community voting on whether to use burn fee to fund projects","category":["GOVERNANCE"],"content":["The Fantom community is currently voting on whether it should set up a fund to support projects in the network’s ecosystem, funded by transaction fees that are currently burned.","This vote is based on a governance <a href=\"https:\/\/forum.fantom.network\/t\/ecosystem-support-vault\/69\" data-v-f87c67ca=\"\">proposal<\/a> that was submitted by Fantom Foundation director of business development Sam Harcourt. It calls for the creation of an on-chain Ecosystem Support Vault that will hold funds dedicated towards funding projects, ideas, and other proposals on the Fantom Opera network.","This vault will draw funds from transaction fees on the Fantom network. Specifically, a third of the fees that would otherwise have been burned — this is where transaction fees are destroyed instead of going to the network validator — will go toward funding the vault.","Voting on the proposal started on July 5 and will end on October 3. It can be <a href=\"https:\/\/pwawallet.fantom.network\/#\/gov\/0x6ad5a089F62359ea1Ce2c75332eBf917DdBFF310\/proposal-detail\/0x16\/0x7c3b85a71e4fce1209a81d67f1af46b5a068770e\" data-v-f87c67ca=\"\">accessed<\/a> through fWallet, Fantom's default wallet. Currently voters are in favor but it is only at a 2.78% participation rate so this is early days. It needs see this rise to 55% for it to reach quorum.","The Fantom Opera network currently burns 30% of all transaction fees as a means of inducing disinflationary pressure on FTM, the network’s native coin. Harcourt’s proposal, if passed, will reduce the amount of FTM that gets burned on a daily basis.","Fantom’s Special Fee Contract (SFC) will custody the funds meant for the vault. The SFC is responsible for distributing rewards to stakers and delegators on the network.","According to the governance proposal, projects looking to apply for a grant from the vault will have to submit a request through the network’s governance portal using fWallet. The community will then vote whether or not to grant the request.","If granted, the Foundation will pay out the grant sum via on-chain transaction automation services like LlamaPay. The Foundation also said it will work to create its own automated payment function for the vault.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Foundation","content":"ORGANIZATION"},{"type":"2.78%","content":"PERCENT"},{"type":"SFC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"July 5","content":"DATE"},{"type":"October 3","content":"DATE"},{"type":"Fantom Foundation","content":"ORGANIZATION"},{"type":"55%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"Sam Harcourt","content":"PERSON"},{"type":"Fantom","content":"PERSON"},{"type":"Fantom Opera","content":"ORGANIZATION"},{"type":"FTM","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}