{"summary":"A new class-action lawsuit is asking for $5 million in damages from Coinbase over the exchange&#x27;s habit of crashing during market volatility. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/165003\/coinbase-faces-class-action-for-crashing-during-volatility-listing-securities","publishDate":"2022-08-23T10:13:11","id":8583,"type":null,"title":"Coinbase faces class action for crashing during volatility, listing securities","category":["REGULATION"],"content":["A Coinbase user is <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.gand.306368\/gov.uscourts.gand.306368.1.0.pdf\" data-v-f87c67ca=\"\">suing the exchange<\/a> for failure to provide the secure crypto wallet access that it advertises.&nbsp;","The plaintiff, George Kattula, filed the class action on behalf of all Coinbase wallet and account holders saying that the company doesn't employ standard practices to secure accounts and it \"improperly and unreasonably locks out its consumers from accessing their accounts and funds.\"","The complaint, filed in a district court in Georgia on Aug. 15, also said Coinbase \"does not disclose that the crypto assets (or<br data-v-f87c67ca=\"\">\n“cryptocurrency”) on its platform are securities.\"","Coinbase's trading platform has <a href=\"https:\/\/www.theblock.co\/linked\/105366\/exchanges-outages-market-volatility-eth\" data-v-f87c67ca=\"\">historically crashed<\/a> during periods of market volatility when volumes increase. A representative for the exchange did not immediately respond to a request for comment.","Coinbase has seen business boom amid the interest for crypto assets during the pandemic as prices peaked last year. For the fourth quarter, Coinbase reported <a href=\"https:\/\/investor.coinbase.com\/financials\/quarterly-results\/default.aspx\" data-v-f87c67ca=\"\">11.2 million monthly transacting users (MTU)<\/a>, the most ever and up from 2.8 million a year earlier.&nbsp;","\"Coinbase’s user growth has outpaced its ability to provide the account services and protections it promises to consumers,\" the complaint says. \"Coinbase was aware it was woefully incapable, understaffed, and overstretched, such that it could not perform its promises and obligations to consumers like plaintiff.\"","Gary Gensler, chair of the Securities and Exchange Commission, has noted that such volatility and subsequent operational problems make <a href=\"https:\/\/www.theblock.co\/linked\/117651\/elizabeth-warren-and-gary-gensler-place-coinbase-in-oversight-crosshairs\" data-v-f87c67ca=\"\">holdings on such platforms<\/a> look more like securities, with users reliant upon the efforts of a third party to access their assets.&nbsp;In July, the SEC <a href=\"https:\/\/www.theblock.co\/post\/158973\/sec-lists-nine-crypto-tokens-as-securities-following-coinbase-insider-trading-charges\" data-v-f87c67ca=\"\">designated nine tokens<\/a> trading on Coinbase to be securities, amid a case against alleged insider trading based on new token listings at the exchange, to which Coinbase responded that it does not list <a href=\"https:\/\/blog.coinbase.com\/coinbase-does-not-list-securities-end-of-story-e58dc873be79\" data-v-f87c67ca=\"\">securities<\/a>.","The complaint also claims that Coinbase does not disclose that the crypto assets on its platform are securities and it \"boldly flouts federal and state laws by proclaiming it does not need a registration statement for those securities and by refusing to register as a securities exchange or as a brokerdealer.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"MTU","content":"ORGANIZATION"},{"type":"Aug. 15","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Georgia","content":"LOCATION"},{"type":"July","content":"DATE"},{"type":"George Kattula","content":"PERSON"},{"type":"the fourth quarter","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["COINBASE","SEC"],"authors":["Kollen Post","The Block"]}