{"summary":"Private key management network Torus has launched out of beta and open-sourced its codebase for the community to use.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55890\/key-management-network-torus-exits-beta-open-sources-its-codebase","publishDate":"2020-02-13T10:01:29","id":8584,"type":null,"title":"Key management network Torus exits beta, open-sources its codebase","category":["THE BLOCK"],"content":["<span data-v-f87c67ca=\"\">Private key management network Torus has launched out of beta and open-sourced its codebase for the community to use.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Founded in 2018, Torus aims to ease users and developers’ transition from web2 to web3 by offering straightforward authentication methods. On Thursday, the company announced that its infrastructure has now been migrated to a decentralized network, which enables one-click login with multiple verifier accounts like Google, Facebook, Reddit, Discord, and Twitch.<\/span>","<span data-v-f87c67ca=\"\">DApp developers can integrate with Torus with a few lines of code. End-users can then access these DApps using familiar login methods like Google or Reddit. And Torus will automatically generate users’ private keys, distribute them to the independent nodes, assign keys to verifier accounts, and authenticates users against them, according to Torus CEO Yuyong Zhen.<\/span>","<span data-v-f87c67ca=\"\">The team has also released a suite of new tools, Zhen said. Beyond one-click login, users can now send any ERC20 and ERC721 tokens to ENS Domains, ETH addresses, Google emails, Reddit accounts, and Discord IDs.<\/span>","<span data-v-f87c67ca=\"\">Moreover, Torus has kept traditional web2 account recovery systems. Instead of having to manage a seed phrase, users can recover their accounts through traditional email or social logins.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Eight partners – Binance, ENS, Etherscan, Matic Network, Ontology, Skale, Tendermint Core, and Zilliqa – have joined the firm in the newly formed Torus Network. They will act as node operators on Torus’ platform. <\/span>","<span data-v-f87c67ca=\"\">Going forward, Zhen said, Torus will seek deeper integration including working with ENS to push out smart contract wallets and integrate with additional operators including Cosmos, Zilliqa, and other chain networks.<\/span>","<span data-v-f87c67ca=\"\">Binance CEO Changpeng Zhao contended that Torus’ features will help lower the barrier for non-technical users to onboard web3 applications.<\/span>","<span data-v-f87c67ca=\"\">“User onboarding is one of the biggest hurdles holding back Web3 adoption today. The status quo of key generation and wallet linking does not scale for millions of non-technical users,” he said in a statement. “Torus has built an incredibly sleek product that makes signing into a DApp no different than logging into Google.”<\/span>","<span data-v-f87c67ca=\"\">Now that the first official version has been launched, Zhen said, Torus will keep expanding the nodeset, onboarding at least 10 more operators by the end of 2020. The goal is to eventually allow anyone – exchanges, foundations, banks, or individuals – to run a node on the network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We're also starting development on the next steps for the network,” Zhen said. “You can expect to see a whole new suite of features which improves the end-user experience;&nbsp; email\/phone or OAuth logins, gas abstraction via smart contracts, different chain integrations, permissions frameworks, white-labelling engine, the list goes on.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"Zhen","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Zilliqa","content":"LOCATION"},{"type":"Facebook","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Skale","content":"LOCATION"},{"type":"Matic Network","content":"ORGANIZATION"},{"type":"Torus Network","content":"ORGANIZATION"},{"type":"Discord","content":"ORGANIZATION"},{"type":"Etherscan","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Yuyong Zhen","content":"PERSON"}],"hashtag":["BINANCE"],"authors":["Yilun Cheng","The Block"]}