{"summary":"The price of bitcoin shot up $800 within a few minutes amid the chatter, according to The Block&#x27;s Price Page. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263567\/bitcoin-price-spikes-800-on-claims-sec-is-engaging-with-exchanges-over-spot-etfs","publishDate":"2023-11-17T12:40:05","id":8587,"type":null,"title":"Bitcoin price spikes $800 on claims SEC is engaging with exchanges over spot ETFs","category":["MARKETS"],"content":["The price of bitcoin spiked by $800 immediately following a report that the U.S. Securities and Exchange Commission has been interacting with exchanges in relation to numerous spot bitcoin ETF applications.&nbsp;","\"Hearing chatter SEC’s Trading &amp; Markets engaged with exchanges this week on spot bitcoin ETF 19b-4s, is advising them they'd like the ETFs to do cash creates (vs in-kind), and has asked them to get in amendments in next couple weeks,\" wrote Eric Balchunas, senior ETF analyst for Bloomberg, on the social media platform <a href=\"https:\/\/twitter.com\/EricBalchunas\/status\/1725559994995573086\" data-v-f87c67ca=\"\">X<\/a>. \"This isn't unexpected but good sign nonetheless.\"","Balchunas noted that cash creates make sense because they reduce limitations on broker dealers. He said that a few bitcoin ETF applications had planned this already while the remainder had chosen to go for in-kind.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Anyway, this doesn’t change our 90% odds up or down but is good sign the process marching and SEC has a path [forward] in the plumbing that they are comfortable with,\" he added.<\/span>","The price of bitcoin surged from roughly $36,000 to $36,800 in just minutes following the post before settling down, according to The Block's Price Page.&nbsp;","<span data-v-f87c67ca=\"\">Price of bitcoin. Image: The Block's Price Page<\/span>","\"Nothing groundbreaking. Nothing changes. But shows progress is still happening and things moving forward,\" noted fellow Bloomberg Intelligence ETF Research Analyst James Seyffart on <a href=\"https:\/\/twitter.com\/JSeyff\/status\/1725560446432792829\" data-v-f87c67ca=\"\">X<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"$800","content":"MONEY"},{"type":"James Seyffart","content":"PERSON"},{"type":"$36,000","content":"MONEY"},{"type":"Bloomberg Intelligence ETF Research","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$36,800","content":"MONEY"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["BITCOIN","SEC"],"authors":["MK Manoylov","The Block"]}