{"summary":"Since Bitwise published its bitcoin wallet for its spot bitcoin ETF, many crypto users have sent small amounts of bitcoin and tokens to it.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274620\/bitwise-bitcoin-etf-wallet-shareholders","publishDate":"2024-01-26T08:31:57","id":8588,"type":null,"title":"Bitwise says bitcoin received to ETF wallet will benefit the fund’s shareholders","category":["FUNDS"],"content":["Earlier this week, Bitwise became the first spot bitcoin exchange-traded fund issuer to <a href=\"https:\/\/www.theblock.co\/post\/274359\/bitwise-publishes-digital-wallet-addresses-with-bitcoin-holdings-for-spot-etf\" data-v-f87c67ca=\"\">publish the wallet<\/a> for its fund — and&nbsp;it didn’t take long before the wallet started receiving unexpected gifts.","Some users sent the wallet small amounts of bitcoin, <a href=\"https:\/\/www.blockchain.com\/explorer\/transactions\/btc\/870428a00094df3e4164bc15c5a9071ca7dfd47e436f2c7b95a251db0491a2ec\" data-v-f87c67ca=\"\">such as<\/a><span data-v-f87c67ca=\"\"> 0.00042069 <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.37%\n    <\/span><\/a> <!----><\/span>. Others sent BRC-20 tokens, Bitcoin domain names and a variety of Bitcoin NFTs to the wallet. In total, the wallet has received more than $5,000.<\/span>","When reached for comment about all of this, Bitwise CIO Matt Hougan said, \"All assets accrue to the benefits of shareholders of BITB.\"","According to the fund’s S-1 filing, if Bitwise involuntarily receives assets, it may sell them for cash and proportionally distribute the cash to shareholders. Earlier versions of its S-1 said such assets could be distributed in-kind, but this language was removed before approval.","Crypto commentators raised another issue that could concern the fund. The United States Treasury has sanctioned some bitcoin wallet addresses, and any wallets that receive funds from those addresses are required to block the bitcoin received and report information about the transaction to the Office of Foreign Assets Control.","This poses a problem since Bitcoin wallets can’t prevent funds from being sent to them. Anyone can send bitcoin to any wallet; the recipient can’t stop the funds from entering their wallet.","Hougan said this issue is tackled at the custodian level. Bitwise currently uses the crypto exchange Coinbase as its custody provider. When reached for comment, a spokesperson for Coinbase said that the exchange blocks OFAC-sanctioned addresses. When asked how it’s able to do so, they replied, “We work with the client to make sure the funds are blocked and reported as required by law.”","The spokesperson also pointed to a <a href=\"https:\/\/help.coinbase.com\/en\/coinbase\/other-topics\/legal-policies\/ofac\" data-v-f87c67ca=\"\">Coinbase blog post<\/a> that states, “If you have been notified that you attempted to send to or receive from a sanctioned address, these funds will be transferred to and securely held in a Coinbase internal holding account.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitwise","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"$5,000","content":"MONEY"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Office of Foreign Assets Control","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"BRC","content":"ORGANIZATION"},{"type":"Bitwise CIO Matt Hougan","content":"PERSON"},{"type":"1","content":"DATE"},{"type":"Hougan","content":"PERSON"},{"type":"-0.37%","content":"PERCENT"},{"type":"United States Treasury","content":"ORGANIZATION"},{"type":"OFAC","content":"ORGANIZATION"}],"hashtag":["SPOT BITCOIN ETF","TREASURY DEPARTMENT"],"authors":["Tim Copeland","The Block"]}