{"summary":"Since its launch in 2018, Nexo quickly made its name as the most retail-friendly crypto lender. The company’s success promptly led to the release of a now thriving institutional offering, but what many don’t know about Nexo is that they recently also began offering B2B services, in particular their Earn API.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/111257\/nexo-b2b-service-brings-high-yield-crypto-savings-accounts-to-fintech-companies","publishDate":"2021-07-19T10:34:33","id":8589,"type":null,"title":"Nexo B2B Service Brings High-Yield Crypto Savings Accounts to Fintech Companies","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Since its launch in 2018, Nexo quickly made its name as the most retail-friendly crypto lender. The company’s success promptly led to the release of a now thriving institutional offering, but what many don’t know about Nexo is that they recently also began providing B2B services, in particular their <\/span><a href=\"https:\/\/nexo.io\/earn-api?utm_source=theblock&amp;utm_medium=fixed&amp;utm_campaign=theblock_earnapi_jul21\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Earn API<\/span><\/a><span data-v-f87c67ca=\"\">. The <\/span><b data-v-f87c67ca=\"\">highly customizable B2B product<\/b><span data-v-f87c67ca=\"\"> allows companies’ users to earn up to <\/span><b data-v-f87c67ca=\"\">10% compounding interest p.a.<\/b><span data-v-f87c67ca=\"\"> on their idle crypto and stablecoins.<\/span>","<span data-v-f87c67ca=\"\">The product is ideal for <\/span><b data-v-f87c67ca=\"\">custodial and non-custodial wallets <\/b><span data-v-f87c67ca=\"\">as it creates an easy way to offer users yields on their clients’ crypto holdings. <\/span><b data-v-f87c67ca=\"\">Non-crypto fintechs<\/b><span data-v-f87c67ca=\"\"> can also leverage Nexo’s Earn API to very quickly and cost-effectively expand their product portfolio into the cryptocurrency space.<\/span>","<span data-v-f87c67ca=\"\">The Earn API service naturally helps businesses both attract new users as well as retain existing clients by enabling their customers to grow their portfolios directly from within their wallets. Additionally, Nexo’s offering is designed to not only increase profits for users, but also for the businesses that leverage it.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">First, companies using the Earn API collect a percentage of the daily compounding interest paid to their clients. Second, businesses have the option to decide how much interest to be paid out to end clients and how much interest to be retained by the company. Finally, through its passive income and thanks to the deflationary nature of cryptocurrencies, Nexo’s Earn API is an excellent h<\/span><span data-v-f87c67ca=\"\">edge against inflation<\/span><span data-v-f87c67ca=\"\"> both for businesses and their clients.<\/span>","<span data-v-f87c67ca=\"\">While the Earn API B2B service is relatively new, the product has already been battle-tested by some of the large players in the crypto industry, including keyless crypto wallet ZenGo.<\/span>","<iframe frameborder=\"0\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/tuk5hc_yORQ\" title=\"YouTube video player\" width=\"560\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">It takes just six easy steps and an approximate IT cost of USD 5,000-10,000. The product is fully customizable allowing companies to achieve a native look and feel with a tailored front-end UX\/UI journey, while their clients earn passive income through Nexo without ever leaving their native platform.<\/span>","<span data-v-f87c67ca=\"\">Nexo is the leading licensed and regulated institution for digital assets behind the Instant Crypto Credit Lines™, the Earn on Crypto &amp; Fiat suite, the <\/span><a href=\"https:\/\/nexo.io\/exchange?utm_source=theblock&amp;utm_medium=fixed&amp;utm_campaign=theblock_earnapi_jul21\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Nexo Exchange<\/span><\/a><span data-v-f87c67ca=\"\">, and, of course, the Earn API product. The company is known in the blockchain space as one of the most secure and sustainability-focused crypto lenders with some of the most rigorous KYC and AML procedures out there. As such, Nexo’s Earn API offers stable and predictable yields that do not change in the short term and supports a wide variety of digital assets, including 16 leading cryptocurrencies and stablecoins. The B2B earn product comes with another perk – the flexibility to add and withdraw funds at any time. All clients of Nexo’s services, including business clients, have access to 24\/7\/365 Customer Support, ensuring a seamless service no matter the circumstances.<\/span>","<span data-v-f87c67ca=\"\">Interested in integrating Nexo’s Earn API product into your product? <\/span><a href=\"https:\/\/nexo.io\/earn-api?utm_source=theblock&amp;utm_medium=fixed&amp;utm_campaign=theblock_earnapi_jul21#form-earn-api\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Drop them a line<\/span><\/a><span data-v-f87c67ca=\"\"> and sign up for a demo now.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nexo Exchange","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Instant Crypto Credit Lines","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Nexo","content":"PERSON"},{"type":"Earn API","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Earn on Crypto &amp; Fiat","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}