{"summary":"Hackers attacked Mysten Labs’ Discord server on Saturday.\nUsers have been warned not to click any links.","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166187\/sui-blockchain-creator-mysten-labs-suffers-discord-hack","publishDate":"2022-08-28T11:03:43","id":859,"type":null,"title":"Sui blockchain creator Mysten Labs suffers Discord hack","category":["Hacks"],"content":["The Discord server of Sui blockchain creators Mysten Labs has been hacked, according to a post on Saturday from the company.","It is warning people not to click any links posted on the server in the eight hours prior to its <a href=\"https:\/\/twitter.com\/mysten_labs\/status\/1563546631269597187?s=21&amp;t=GVtXXD_e_kJsOD9on3SzeA\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Twitter post<\/a>, adding that the team is working to resolve the issue.","An <a href=\"https:\/\/twitter.com\/NFT_GURUWEB3\/status\/1563547803799863297\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">unverified screenshot<\/a> shared on Twitter suggested that hackers had posted a link to a supposed airdrop on the announcement channel in the server.","At the time of writing, Mysten Labs has published no further updates. The Block has approached it via Twitter for comment.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","A permissionless proof-of-stake blockchain, Sui blockchain is the inaugural product of Mysten Labs and was unveiled in March.","Mysten Labs itself is a web3 infrastructure startup founded by Evan Cheng, Sam Blackshear, Adeniyi Abiodun and George Danezis, four former engineers from Meta’s crypto unit Novi. They previously worked on the Diem blockchain and the Move programming language.","High profile investors back the company including Andreessen Horowitz and Coinbase Ventures. In December, it <a href=\"https:\/\/www.theblock.co\/linked\/138813\/web3-infrastructure-startup-mysten-labs-unveils-its-layer-1-blockchain\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">raised $36 million<\/a>, and in July, The Block reported it was <a href=\"https:\/\/www.theblock.co\/post\/157007\/former-meta-execs-seek-2-billion-valuation-for-crypto-venture-mysten-labs-the-information\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">seeking a $2 billion valuation<\/a>."],"hashtag":[]}