{"summary":"Curve token has bounced back from falling to a two-year low with a 50% rebound amid a squeeze on a big short position.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189167\/curve-token-jumps-50-amid-squeeze-on-big-short-position","publishDate":"2022-11-22T11:49:45","id":8593,"type":null,"title":"Curve token jumps 50% amid squeeze on big short position","category":["CRYPTO ECOSYSTEMS"],"content":["The price of the Curve DAO token (CRV) rallied significantly today in what appears to be a squeeze on a publicized short bet.","Data from CoinGecko shows the CRV price fell sharply this morning from $0.53 to $0.40, a decline of about 25% to the token's lowest level in two years. The sharp fall was followed immediately by a massive spike of more than 50% that saw CRV go as high as $0.61.","CRV is currently trading at $0.60 as of the time of publishing, posting a 17% price gain in the last 24 hours.","The volatile price action for CRV appears to be connected to a major short position on the token that saw a trader borrow a total of 92 million CRV from the DeFi lending platform Aave using $57 million in USDC as collateral. The trader had been selling the CRV tokens, as <a href=\"https:\/\/www.theblock.co\/post\/189028\/curve-dao-token-plunges-14-under-heavy-short-selling-pressure\" data-v-f87c67ca=\"\">previously reported by The Block<\/a>, which could have been responsible for the initial decline earlier in the day.","","","The price recovery now puts the short seller in danger of liquidation. Data from the trader’s profile on portfolio tracker DeBank <a href=\"https:\/\/debank.com\/profile\/0x57e04786e231af3343562c062e0d058f25dace9e\" data-v-f87c67ca=\"\">shows<\/a> the initial loan on Aave now has a health factor of 1.08.&nbsp;","Debt positions go into liquidation when the health factor, which represents the value of borrowed tokens against the worth of the collateral deposited, dips below 1.","The short seller will face liquidation if CRV rises above $0.63, but the trader can prevent this from happening by posting more collateral on Aave.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"this morning","content":"TIME"},{"type":"17%","content":"PERCENT"},{"type":"$57 million","content":"MONEY"},{"type":"CRV","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"$0.63","content":"MONEY"},{"type":"$0.53","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$0.60","content":"MONEY"},{"type":"$0.61","content":"MONEY"},{"type":"$0.40","content":"MONEY"},{"type":"50%","content":"PERCENT"}],"hashtag":["LENDING"],"authors":["Osato Avan-Nomayo","The Block"]}