{"summary":"Crypto exchange Coinbase has increased deposit times to reduce the risk of suffering from a double spend attack.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251974\/coinbase-takes-precautions-as-mining-pool-captures-half-of-zcash-hash-rate","publishDate":"2023-09-20T04:45:25","id":8597,"type":null,"title":"Coinbase takes precautions as mining pool captures half of Zcash hash rate","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Crypto exchange Coinbase has implemented precautionary measures in response to a single mining pool taking control of 53.8% of the hash rate on the proof-of-work blockchain powering the privacy coin <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Zcash <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248496\/zcash-zec-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/circle-zcash-color.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ZEC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.42%\n    <\/span><\/a> <!----><\/span><\/span>.&nbsp;<\/span>","From now on, the exchange will require 110 block confirmations before it confirms a deposit of ZEC, according to a <a href=\"https:\/\/www.coinbase.com\/blog\/security-psa-observed-risks-in-zcash-mining-pool-distribution\" data-v-f87c67ca=\"\">blog post<\/a>. This increases the deposit time from roughly 40 minutes to around 2.5 hours. The goal is to reduce the risk of double spending that emerges when a single entity controls at least 51% of the hash rate on a proof-of-work blockchain.","It has also moved its Zcash trading pairs into “limit only” mode, meaning traders can’t place market bids. The exchange stated this would minimize the impact of any volatility — likely in the event of large sales made as part of a double-spend attack.","Coinbase further reached out to Electric Coin Company, the creator of Zcash, and the relevant mining pool, ViaBTC, with its concerns. \"<span class=\"sc-3cb1a032-0 fQNGSi\" data-v-f87c67ca=\"\">We shared our concerns around the risks of mining centralization and provided recommendations for various options that either party could implement to reduce the risk of a 51% attack,\" the exchange said.<\/span>","The Electric Coin Company <a href=\"https:\/\/twitter.com\/ElectricCoinCo\/status\/1704240109267153237\" data-v-f87c67ca=\"\">confirmed<\/a> the discussions, adding that its proposal to introduce a step named the “Trailing Finality Layer,” could address the issue. This would be a step toward transitioning Zcash from proof of work to proof of stake.","ViaBTC currently controls 53.8% of the Zcash hash rate, according to <a href=\"https:\/\/miningpoolstats.stream\/zcash\" data-v-f87c67ca=\"\">MiningPoolStats<\/a>. This implies that, in theory, if the mining pool decided to act with ill intent, it could carry out double spending attacks or exhibit other malicious behavior.","<span data-v-f87c67ca=\"\">ViaBTC now represents 53.8% of the Zcash's hash rate. Image: MiningPoolStats.<\/span>","That said, this isn’t a single miner dominating the network’s hash rate but rather a mining pool. Such pools comprise numerous miners who aggregate their resources to achieve a steadier income stream. If the mining pool were to engage in harmful actions, miners might opt to discontinue using the pool in favor of another.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">As a member of the PoW community, we are keenly aware of how the risks of a 51% attack threaten blockchain security and integrity. As a technical service platform dedicated to PoW pools, we have neither the motivation nor the ability to gather hashrates and launch a 51% attack,\" said ViaBTC in a message to The Block.<\/span>","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">We pledge zero tolerance towards any malicious acts. This is not just our responsibility as an industry player, but also our commitment to our valued users and the broader blockchain community,\" it added.<\/span>","<em data-v-f87c67ca=\"\">Updated with comment from ViaBTC.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"53.8%","content":"PERCENT"},{"type":"-1.42%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"ZEC","content":"ORGANIZATION"},{"type":"51%","content":"PERCENT"},{"type":"Electric Coin Company","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Tim Copeland","The Block"]}