{"summary":"Crypto tax reporting platform TaxBit has raised $5 million in seed funding\nThe round saw participation from Winklevoss Capital and Dragonfly Capital Partners, among others\nTaxBit says it aims to grow its customer base in the U.S. and globally","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/52115\/winklevoss-capital-joins-5m-seed-round-for-crypto-tax-reporting-platform-taxbit","publishDate":"2020-01-06T10:12:52","id":86,"type":null,"title":"Winklevoss Capital joins $5M seed round for TaxBit","category":["Cryptocurrency"],"content":["Winklevoss Capital, the venture firm led by crypto exchange Gemini co-founders Cameron and Tyler Winklevoss, has joined a $5 million seed funding round for tax reporting platform TaxBit.","The round also saw participation from Dragonfly Capital Partners, Collaborative Fund, TTV Capital and Valar Ventures, among others, according to an <a href=\"https:\/\/www.prnewswire.com\/news-releases\/taxbit-raises-5-million-in-funding-to-automate-cryptocurrency-tax-compliance-300981308.html\" data-v-f87c67ca=\"\">announcement<\/a>&nbsp;published Monday.","TaxBit, which helps automate cryptocurrency tax calculations and reporting for individuals and businesses, looks to utilize the fresh capital to grow its software platform and customer base, both in the U.S. and internationally in countries like Canada, the U.K., and Australia.","“Navigating cryptocurrency tax laws is a byzantine process,” said Sterling Witzke, a partner at Winklevoss Capital. “TaxBit's technology eliminates this confusion and complexity by allowing crypto owners to seamlessly understand the full picture of their tax liability through an intuitive and easy-to-use platform.”","An estimated 17 million Americans are currently trading in cryptocurrencies, TaxBit co-founder and CEO Austin Woodward, <a href=\"https:\/\/www.deseret.com\/utah\/2020\/1\/6\/21048926\/cryptocurrency-bitcoin-ethereum-taxbit-irs-mark-zuckerberg-crypto-wallet-crypto-exchange\" data-v-f87c67ca=\"\">told<\/a> Deseret News. “There’s been a misconception that crypto was untraceable and a vehicle for hiding income or evading taxes ... which really is not the case,” he said.","Utah-based TaxBit launched its product in January 2019, per the announcement, and claims to have helped thousands of cryptocurrency users to automate their taxes.","The U.S. Internal Revenue Service (IRS) has also been <a href=\"https:\/\/www.theblockcrypto.com\/post\/36070\/irs-sends-new-letters-to-crypto-holders-stating-amounts-they-owe-to-the-agency\" data-v-f87c67ca=\"\">vocal<\/a> about accurately reporting cryptocurrency taxes. Most recently, the authority <a href=\"https:\/\/www.irs.gov\/pub\/irs-dft\/f1040s1--dft.pdf\" data-v-f87c67ca=\"\">issued<\/a> a draft 1040 form, asking users: “At any time during 2019, did you receive, sell, send, exchange, or otherwise acquire any financial interest in any virtual currency?” with a simple yes or no checkbox to its right."],"hashtag":[]}