{"summary":"Coinbase Ventures, Electric Capital and Greenoaks also participated in the round, as Monad seeks to build out its Layer 1 blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287257\/monad-labs-raises-225-million-in-funding-round-led-by-paradigm","publishDate":"2024-04-09T09:41:28","id":86,"type":null,"title":"Monad Labs raises $225 million in funding round led by Paradigm","category":["VENTURE CAPITAL"],"content":["Monad Labs, the developer behind the Ethereum-compatible Layer 1 blockchain Monad, has finalized a $225 million funding round led by investment firm Paradigm.","“We are thrilled to announce our $225 million fundraise,” Monad <a href=\"https:\/\/monadlabs.substack.com\/p\/monad-labs-raises-225m-in-funding\" data-v-f87c67ca=\"\">said<\/a>. “This funding milestone gives us ample resources to continue scaling our team and to bring Monad to production.”","Electric Capital, Coinbase Ventures, Castle Island Ventures, GSR Ventures and Greenoaks also participated in the round, among others. Angel investors include Inversebrah, Ansem, Hsaka, punk6529, Eric Wall, Rune Christensen, Bryan Pellegrino, Luca Netz, Mert Mumtaz, and others, Monad confirmed.","The announcement follows the news last month that Monad was <a href=\"https:\/\/www.theblock.co\/post\/281816\/monad-labs-eyes-200-million-raise-led-by-paradigm-fortune\" data-v-f87c67ca=\"\">eyeing<\/a> a more than $200 million fundraising round as investors warm toward the digital assets industry after crypto winter.","At the time, Paradigm indicated it would pledge $150 million to the Layer 1 project’s next funding round, which values the company at $3 billion. Earlier this month, Bloomberg reported Paradigm was in talks with investors about raising up to <a href=\"https:\/\/www.theblock.co\/post\/286147\/paradigm-in-talks-of-raising-up-to-850-million-for-new-crypto-fund-report\" data-v-f87c67ca=\"\">$850 million<\/a> for a new crypto venture fund. If the fund raises more than $750 million, it would be the largest since the crypto market crash of May 2022.","“Monad is scaling all aspects of EVM performance by enabling developers to build next generation applications that will significantly expand the crypto ecosystem,” Paradigm Partner Charlie Noyes told The Block. “Keone, James, and Eunice are uniquely equipped both to build the technology and to create a vibrant community to support it. Paradigm is excited for a long-term partnership with the entire Monad team.”","Monad Labs previously <a href=\"https:\/\/www.theblock.co\/post\/211352\/monad-labs-funding-blockchain-former-jump-trading-developers\" data-v-f87c67ca=\"\">raised<\/a> $19 million in funding led by Dragonfly Capital following a $9 million pre-seed round in May 2022 and a $10 million seed round in December 2022.","Rather than simply cloning the Ethereum codebase, Monad <a href=\"https:\/\/www.theblock.co\/post\/211352\/monad-labs-funding-blockchain-former-jump-trading-developers\" data-v-f87c67ca=\"\">states<\/a> it is building a new kind of Ethereum Virtual Machine from the ground up. It implements parallelization, enabling more efficient processing and instant block finality rather than carrying out each process consecutively.","Since Monad is EVM bytecode compatible, it would make it straightforward for Ethereum developers to port their existing decentralized applications to the network.","In March, Monad’s devnet went live, having reached <a href=\"https:\/\/www.theblock.co\/post\/278182\/monad-10000-tps-devnet-launch\" data-v-f87c67ca=\"\">10,000 transactions per second<\/a> in internal testing — a level analysts at Bernstein <a href=\"https:\/\/www.theblock.co\/post\/287227\/solana-leads-the-battle-for-blockchain-payments-bernstein-says\" data-v-f87c67ca=\"\">said<\/a> was required to break into more mainstream consumer or B2B payments in a note to clients earlier today.","Monad claims to have optimized the way Ethereum works to provide greater throughput — designed to offer up to 10,000 TPS with a one-second block time — suitable for the type of high-frequency trading requirements of firms like Jump. However, this may be more challenging for node operators, with hardware requirements around twice as large compared to the main Ethereum blockchain.","A native token will be used to pay for transactions to be included within blocks, known as a carriage cost, and for transactions to be executed, according to Monad's <a href=\"https:\/\/www.theblock.co\/post\/252757\/monad-token-name\" data-v-f87c67ca=\"\">technical documents<\/a> released in September. However, Monad later removed the token name from the documents for unspecified reasons.","Monad’s public testnet is expected to follow shortly, with a mainnet release anticipated later in the year.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3 billion","content":"MONEY"},{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Eunice","content":"PERSON"},{"type":"Electric Capital","content":"ORGANIZATION"},{"type":"Bernstein","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Eric Wall","content":"PERSON"},{"type":"$750 million","content":"MONEY"},{"type":"GSR Ventures","content":"ORGANIZATION"},{"type":"Inversebrah","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Monad","content":"PERSON"},{"type":"last month","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"Dragonfly Capital","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"Ansem","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Greenoaks","content":"PERSON"},{"type":"May 2022","content":"DATE"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Rune Christensen","content":"PERSON"},{"type":"Mert Mumtaz","content":"PERSON"},{"type":"James","content":"PERSON"},{"type":"$19 million","content":"MONEY"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Luca Netz","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Hsaka","content":"LOCATION"},{"type":"$850 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Charlie Noyes","content":"PERSON"},{"type":"$9 million","content":"MONEY"},{"type":"$225 million","content":"MONEY"},{"type":"Monad","content":"ORGANIZATION"},{"type":"December 2022","content":"DATE"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Bryan Pellegrino","content":"PERSON"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Keone","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"}],"hashtag":["ETHEREUM","JUMP","PARADIGM"],"authors":["James Hunt","The Block"]}