{"summary":"Developers cannot integrate cryptocurrencies or crypto assets such as NFTs on GTA servers.\nAustralia-based MyMetaverse runs games on GTA 5 that integrates NFTs in the form of cars and swords.\nIn July, Minecraft creators Mojang Studios banned NFTs from its servers.","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189027\/grand-theft-auto-maker-rockstar-games-bans-nfts-on-third-party-servers","publishDate":"2022-11-22T07:23:01","id":860,"type":null,"title":"Grand Theft Auto maker Rockstar Games bans NFTs on third-party servers","category":["Gaming"],"content":["Grand Theft Auto has followed Minecraft in banning NFTs from its third-party online servers. Developers cannot integrate cryptocurrencies or crypto assets such as NFTs, creator Rockstar Games confirmed in a <a href=\"https:\/\/support.rockstargames.com\/articles\/11374598771091\/Roleplay-RP-Servers\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">statement<\/a> last week.","The new rules are specifically aimed at role play servers. Think of them as spin-offs of the original GTA 5 created by people who aren't Rockstar Games but instead fans and developers. They extend gameplay beyond what players can do in the standard game by allowing them to play as normally non-playable characters such as police, judges or taxi drivers.&nbsp;","The company stressed that it still supports these servers despite the new restrictions. It also banned the importation or misuse of other IP in the project, including other Rockstar IP, real-world brands, characters, trademarks or music; and making new games, stories, missions or maps.","\"Rockstar Games has always believed in reasonable fan creativity and wants creators to showcase their passion for our games. Third party 'Roleplay' servers are an extension of the rich array of community-created experiences within Grand Theft Auto that we hope will continue to thrive in a safe and friendly way for many years to come,\" the company said.","What will happen to companies already running games including NFTs now isn't clear. Among them, Australia-based MyMetaverse runs Grand Theft Auto V (GTA 5) servers that integrate tokens as well as NFTs in the form of cars and swords. It launched this in September in partnership with Enjin.","Rockstar Games is the latest U.S.-based top gaming company to ban NFTs. While some gaming giants elsewhere have started to explore NFT and web3 projects, in the U.S. <a href=\"https:\/\/www.theblock.co\/post\/166164\/microsoft-gaming-ceo-phil-spencer-gets-why-some-gamers-dont-like-the-metaverse\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">gaming execs<\/a> have taken a much more skeptical approach and have raised concerns that NFTs could be exploitative.","In July, Minecraft creators Mojang Studios <a href=\"https:\/\/www.theblock.co\/post\/158759\/minecraft-developer-mojang-to-restrict-use-of-nfts-blockchain-tech-with-guideline-update\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">banned NFTs<\/a> from its servers, much to the chagrin of projects like NFT Worlds that had built its entire business on Minecraft. Valve, who runs gaming store Steam, has also criticised NFTs and said it doesn't want them on its platform.&nbsp;","Valve competitor Epic Games has been more neutral. The Fortnite creators have <a href=\"https:\/\/www.theblock.co\/post\/173645\/star-atlas-offers-first-glimpse-of-gameplay-with-debut-on-epic-games-store\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">allowed several games<\/a> using NFTs onto the Epic Games store, although it does not invest in these games or lend them any additional support.","MyMetaverse did not respond to a request for comment by the time of publication."],"hashtag":["PLAY2EARN"]}