{"summary":"Members of the CFTC underscored the importance of regulatory collaboration after the SEC lodged a digital assets insider trading case today.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159098\/cftc-commissioners-speak-up-after-sec-files-crypto-insider-trading-case","publishDate":"2022-07-21T20:52:59","id":8601,"type":null,"title":"CFTC commissioners speak up after SEC files crypto insider trading case","category":["REGULATION"],"content":["Members of the Commodity Futures Trading Commission (CFTC) stressed the need for more regulatory collaboration after the Securities and Exchange Commission (SEC) lodged a digital assets insider trading case today against a former Coinbase employee and his associates.","CFTC commissioners were unusually public in calling for more collaboration. Commissioner Caroline Pham called the action a \"striking example of regulation by enforcement\" in a statement.","The Justice Department (DOJ) brought a <a href=\"https:\/\/www.theblock.co\/post\/158960\/former-coinbase-product-manager-arrested-on-insider-trading-charges\" data-v-f87c67ca=\"\">criminal complaint<\/a> against Ishan Wahi, a former Coinbase product manager, and his associates for allegedly running an insider trading scheme today, and the SEC followed with an announcement of<a href=\"https:\/\/www.theblock.co\/post\/158973\/sec-lists-nine-crypto-tokens-as-securities-following-coinbase-insider-trading-charges\" data-v-f87c67ca=\"\"> a civil case<\/a> shortly after.","The DOJ charged the men with wire fraud. The broad statute allows the DOJ to pursue any fraud that utilizes the \"wires,\" or internet and telecommunications. It doesn't implicate insider trading laws, which are securities laws, or allege that this fraud dealt with securities.","The SEC, on the other hand, has brought a securities violation case in a parallel action to the DOJ's criminal complaint. The regulator argues the alleged front-running centered on the trading of securities. In its filing, the SEC made arguments that nine tokens constituted securities — tokens the regulator had not previously clarified or called out as securities.","If the SEC hadn't stepped in and said it believes those tokens to be securities, regulation of the trading of those tokens likely would have fallen under the CFTC's purview.&nbsp;","\"The SEC’s allegations could have broad implications beyond this single case, underscoring how critical and urgent it is that regulators work together,\" Phan said. \"Major questions are best addressed through a transparent process that engages the public to develop appropriate policy with expert input — through notice-and-comment rulemaking pursuant to the Administrative Procedure Act. Regulatory clarity comes from being out in the open, not in the dark.\"","Her colleague Commissioner Kristin Johnson didn't specifically call out the SEC, and she even said that \"financial market regulators and law enforcement stand united\" in their fight against fraudulent conduct in the crypto markets. Still, her statement did call for collaboration among regulators in order to take insider trading to task.","\"We must continue to work collaboratively to adopt a whole-of-government approach to prevent bad actors from taking advantage of important policy and regulatory debates and to ensure the protection of retail investors and preservation of the safety and soundness of our financial system,\" Johnson said.","Jason Gottlieb, partner and chair of Morrison Cohen's White Collar and Regulatory Enforcement group, pointed out that the CFTC has clear authority to regulate insider trading in commodities, while the SEC has built a case here that is reaching — without considerable groundwork — to assert that these tokens are securities. Whether the tokens were securities at the time of issuance has yet to be determined, Gottlieb said, but the fact that the tokens are out there trading makes them commodities and puts them under the CFTC's purview.","\"The CFTC has clear authority here,\" Gottlieb said. \"The SEC is sort of helping itself to authority by making these assertions. If the CFTC wanted to bring these cases, they could. It's squarely in their corner.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Gottlieb","content":"PERSON"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Johnson","content":"PERSON"},{"type":"Jason Gottlieb","content":"PERSON"},{"type":"Caroline Pham","content":"PERSON"},{"type":"Ishan Wahi","content":"PERSON"},{"type":"Justice Department (DOJ","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Morrison Cohen's White Collar and Regulatory Enforcement","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Kristin Johnson","content":"PERSON"}],"hashtag":["CFTC","COINBASE","SEC"],"authors":["Aislinn Keely","The Block"]}