{"summary":"Taiwan’s Financial Supervisory Commission is studying the possibility of a special act focused on crypto and plans to release preliminary results in September.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280554\/taiwans-financial-regulator-explores-special-act-to-regulate-crypto","publishDate":"2024-03-05T01:23:55","id":8604,"type":null,"title":"Taiwan&#x27;s financial regulator explores special act to regulate crypto","category":["REGULATION"],"content":["Taiwan is studying the possibility of establishing a special act to regulate the cryptocurrency industry, with results expected to be released in September of this year, a top official said.","Tien-mu Huang, chair of the Financial Supervisory Commission, <a href=\"https:\/\/ppg.ly.gov.tw\/ppg\/sittings\/2024022944\/details?meetingDate=113\/03\/04&amp;meetingTime=09:00-17:30&amp;departmentCode=null\" data-v-f87c67ca=\"\">stated<\/a> Monday at the parliament in response to lawmakers’ inquiries that the regulator must handle the connection between traditional finance and cryptocurrency with care — and is more likely to oversee the crypto sector with a dedicated special law.","Huang noted that the FSC has begun researching the possibility of a crypto asset act and plans to release preliminary studies in September.","The regulator added that it currently prioritizes investor protection, with a group of local crypto companies preparing to establish a self-regulatory industry organization to communicate and address relevant issues.","Currently, Taiwan requires cryptocurrency service providers to comply with anti-money laundering laws since the FSC <a href=\"https:\/\/law.fsc.gov.tw\/LawContent.aspx?id=GL003218&amp;kw=%e8%99%9b%e6%93%ac%e9%80%9a%e8%b2%a8%e5%b9%b3%e5%8f%b0%e5%8f%8a%e4%ba%a4%e6%98%93%e6%a5%ad%e5%8b%99%e4%ba%8b%e6%a5%ad%e9%98%b2%e5%88%b6%e6%b4%97%e9%8c%a2%e5%8f%8a%e6%89%93%e6%93%8a%e8%b3%87%e6%81%90%e8%be%a6%e6%b3%95\" data-v-f87c67ca=\"\">introduced<\/a> anti-money laundering rules in July 2021. Otherwise, the crypto industry remains largely unregulated.","In September 2023, the FSC <a href=\"https:\/\/www.theblock.co\/post\/252915\/taiwan-releases-guidelines-for-crypto-exchanges-restricts-offshore-exchanges-unless-compliant\" data-v-f87c67ca=\"\">released guidelines<\/a> encouraging the crypto sector to form its own self-supervisory rules through a <a href=\"https:\/\/www.theblock.co\/post\/252884\/taiwans-crypto-industry-prepares-to-form-association-ahead-of-new-regulation\" data-v-f87c67ca=\"\">potential industry association<\/a>.","Additionally, some lawmakers submitted a <a href=\"https:\/\/www.theblock.co\/post\/259726\/taiwan-officially-proposes-crypto-bill-with-first-reading-passed-at-parliament\" data-v-f87c67ca=\"\">proposal for a draft special crypto act<\/a> in October 2023 — while they also anticipated that the FSC might present its version of a potential crypto act.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"September of this year","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Supervisory Commission","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"October 2023","content":"DATE"},{"type":"Taiwan","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"FSC","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"September 2023","content":"DATE"},{"type":"July 2021","content":"DATE"},{"type":"mu Huang","content":"PERSON"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}