{"summary":"Mastercard&#x27;s crypto card payment program with Binance in ending in Argentina, Brazil, Colombia and Bahrain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247307\/mastercard-and-binance-end-crypto-card-partnership-in-four-countries-reuters","publishDate":"2023-08-24T13:05:55","id":8610,"type":null,"title":"Mastercard, Binance end crypto card partnership in four countries: Reuters","category":["COMPANIES"],"content":["Mastercard and crypto exchange giant Binance are ending crypto card programs in Argentina, Brazil, Colombia and Bahrain, Reuters <a href=\"https:\/\/www.investing.com\/news\/stock-market-news\/mastercard-binance-to-end-crypto-card-partnership-3160921\" data-v-f87c67ca=\"\">reported<\/a>.&nbsp;","The cessation, set for Sept. 22, will not affect Mastercard's other crypto card programs, the news agency added.","Binance and Mastercard <a href=\"https:\/\/www.theblock.co\/post\/161521\/binance-and-mastercard-launch-prepaid-crypto-to-fiat-card-in-argentina\" data-v-f87c67ca=\"\">forged<\/a> the partnership allowing users to convert cryptocurrency into fiat currency with the ability to earn up to 8% cash back in crypto, depending on the purchase. Merchants still received fiat currency, while customers used their crypto as a means of payment which was intended to bolster broader crypto adoption.","Argentina became the first country to adopt the Binance crypto card program in August of 2022. The country's high inflation rate had consumers looking at alternative payment options such as cryptocurrency.&nbsp;","Mastercard did not immediately respond to a request for comment from The Block.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Argentina","content":"LOCATION"},{"type":"Colombia","content":"LOCATION"},{"type":"Sept. 22","content":"DATE"},{"type":"8%","content":"PERCENT"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Bahrain","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"August of 2022","content":"DATE"}],"hashtag":["BINANCE"],"authors":["MK Manoylov","The Block"]}