{"summary":"Nocturne Labs, a crypto startup that wants to bring private accounts within the Ethereum ecosystem, has raised $6 million in seed funding.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259359\/vitalik-buterin-ethereum-nocturne-labs-funding","publishDate":"2023-10-25T07:00:02","id":8612,"type":null,"title":"Vitalik Buterin backs Nocturne, which aims to bring private accounts to Ethereum","category":["VENTURE CAPITAL"],"content":["Nocturne Labs, a crypto startup that wants to bring private accounts to the Ethereum ecosystem, has raised $6 million in seed funding. Bain Capital Crypto and Polychain Capital co-led the round, with Ethereum co-founder Vitalik Buterin, Bankless Ventures, Hack VC, Robot Ventures and others participating, it said Wednesday.","The firm started raising for the round in January of this year and closed it in August amid a crypto funding slump, co-founder and CEO Luke Tchang told The Block. It was an equity with token warrants round, Tchang said — declining to comment on valuation.","Founded last year in the United States, Nocturne is building a protocol that aims to allow users to transact anonymously within the Ethereum ecosystem. \"Users will have 'internal' accounts within Nocturne where receiving\/ spending funds from these accounts works in a way that is anonymous (not all tied back to the same address),\" Tchang said. Users will be able to deposit or receive payments into their Nocturne account. They can then prove via zero-knowledge proof technologies that they own such funds and use them for other transactions such as payments, trading and staking, Tchang said.","While some privacy-focused crypto platforms exist — including mixers, blockchain networks and other platforms like Aztec Connect — they lack usability and compatibility, according to Tchang. Crypto mixers have poor user experience, Tchang said, explaining that if you put in one ether, you can take out exactly that one ether.","Other blockchain networks require users to bridge and migrate ecosystems, while platforms like Aztec Connect suffer from poor compatibility or interoperability, Tchang noted. \"If you could have something that just felt like a normal Ethereum account but with asset privacy, that would have a shot at wider adoption,\" he said.","Privacy is essential for crypto adoption, according to Nocturne, which said everyone should be able to receive their paychecks on the blockchain without exposing their earnings, make purchases without revealing their spending habits and store their assets on the blockchain without disclosing their total worth.","Nocturne is currently just focused on bringing private accounts within the Ethereum ecosystem, meaning it will support Ethereum first and then Ethereum Layer 2 networks in the future, Tchang said. The protocol is expected to launch on the Ethereum mainnet next month.","Privacy-focused crypto platforms, such as mixers, have been a target of regulatory authorities. Last year, popular crypto mixer Tornado Cash was <a href=\"https:\/\/www.theblock.co\/post\/169688\/treasury-says-sanctions-on-tornado-cash-dont-stop-people-from-sharing-code\" data-v-f87c67ca=\"\">sanctioned<\/a> by the Office of Foreign Assets Control, an enforcement agency of the U.S. Treasury Department. Earlier this week, The Wall Street Journal <a href=\"https:\/\/www.theblock.co\/post\/258510\/us-treasury-plans-to-designate-international-crypto-mixers-as-money-laundering-hubs-wsj\" data-v-f87c67ca=\"\">reported<\/a> that the Treasury Department is planning to designate international crypto mixers as money-laundering hubs, citing Hamas' use of them along with other terrorist groups.","As for Nocturne, Tchang said the protocol is taking a \"measured approach\" to stay compliant. \"We are starting with a two-step, permissioned deposit process that involves filtering out illicit deposits using tools such as TRM and other data analytics providers,\" he said. \"The tools we build for deposit filtering will allow us to gradually transition into a more permissionless approach in the future — proof of innocence.\"","Last month, Buterin co-authored a research paper on \"<a href=\"https:\/\/www.theblock.co\/post\/250040\/key-crypto-industry-figures-see-promise-in-privacy-pools-proposal\" data-v-f87c67ca=\"\">Privacy Pools<\/a>, a novel smart contract-based privacy-enhancing protocol,\" and how it can help separate honest users from dishonest ones. The main concept here is that users can prove where their money comes from without revealing all their financial history. Tchang said Nocturne will \"eventually strike the right balance between compliance and permissionlessness.\"","There are currently less than ten people working for Nocturne, and Tchang said he might add more people in the engineering, growth, and legal\/compliance functions after the mainnet launch.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"TRM","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Bankless Ventures","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Luke Tchang","content":"PERSON"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"Hamas","content":"ORGANIZATION"},{"type":"Office of Foreign Assets Control","content":"ORGANIZATION"},{"type":"Buterin","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Bain Capital Crypto","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"$6 million","content":"MONEY"},{"type":"Tchang","content":"PERSON"},{"type":"Nocturne","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Robot Ventures","content":"ORGANIZATION"},{"type":"Tchang","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["ETHEREUM","SEED &AMP; PRE-SEED","VITALIK BUTERIN"],"authors":["Yogita Khatri","The Block"]}