{"summary":"The Celsius Official Committee of Unsecured Creditors held a Twitter “town hall” on Tuesday to discuss next steps after a damning examiner report, as well as air out frustrations about a leak of bids for the company&#x27;s assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207291\/celsius-creditors-contemplate-next-steps-following-examiner-report","publishDate":"2023-01-31T19:12:45","id":8615,"type":null,"title":"Celsius creditors contemplate next steps following examiner report","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Despite a damning report from a court-appointed examiner, lawyers representing former Celsius customers told clients they are still in talks with the company around a \"recovery corporation\" proposal put forward by Celsius's lawyers in a last-ditch effort to partially repay them.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Twitter space town hall for the Celsius Official Committee of Unsecured Creditors came despite findings describing extreme self-dealing and over-leveraging in the report released earlier Tuesday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">During a Twitter space “town hall,” which had about 2,500 listeners on Tuesday, representatives from the committee spoke about a recovery corporation concept — a proposal for the company to tokenize and distribute to account holders an “<\/span><span class=\"s2\" data-v-f87c67ca=\"\">asset share token that would reflect the value of the assets managed by the Recovery Corporation.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A UCC attorney said that the committee is also, \"running down a number of other options in particular,” and expressed dismay that details of bids for Celsius leaked last week.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Another of the options the UCC is exploring is selling off Celsius's mining business, a committee representative said. The lawyer also said the committee has been looking at “winding down Celsius or transferring the crypto to a third party.”&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A court-appointed examiner released an over 600-page report earlier on Tuesday that contained <a href=\"https:\/\/www.theblock.co\/post\/207079\/highlights-from-the-court-report-detailing-celsius-ponzi-like-downfall\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">major revelations<\/span><\/a>, from blowing past its own lending limits, including lending $2 billion to Tether, to owing millions in taxes. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Celsius remains in the middle of the bankruptcy process after a sudden collapse last summer.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Listeners also asked about CEL, the lender’s native token, which was mentioned throughout the examiner’s report. The examiner found that Celsius spent at least $558 million buying CEL.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">It is in the best interest for people to distance themselves from the CEL token, a listener using the Twitter name \"Victim of Celsius\" said during the audio town hall.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“So much controversy and so much drama. I feel like it’s really taking away from the process and I hope that the UCC agrees with that,” they said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The examiner’s report with respect to the CEL token speaks for itself, a UCC representative acknowledged. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“There was a lot of manipulation of the token and it was used in extremely improper ways by insiders and that part is not lost on us,” said the rep. &nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$558 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Celsius","content":"ORGANIZATION"},{"type":"Celsius Official Committee of Unsecured Creditors","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"UCC","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"$2 billion","content":"MONEY"},{"type":"Recovery Corporation","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}