{"summary":"BitGo said Thursday that it&#x27;s terminating the acquisition of crypto custodian Prime Trust, just two weeks after it announced plans for the deal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236014\/bitgo-says-its-terminating-acquisition-of-prime-trust","publishDate":"2023-06-22T10:06:07","id":8617,"type":null,"title":"BitGo says it&#x27;s terminating acquisition of Prime Trust","category":["COMPANIES"],"content":["BitGo said Thursday that it's terminating the planned <a href=\"https:\/\/www.theblock.co\/post\/233878\/bitgo-reaches-deal-to-buy-crypto-custodian-prime-trust-coindesk\" data-v-f87c67ca=\"\">acquisition<\/a> of crypto custodian Prime Trust, just two weeks after it announced plans for the deal.","\"This decision was not made lightly and BitGo remains committed to our mission to deliver trust in digital assets,\" the company said in a <a href=\"https:\/\/www.theblockcrypto.com\/wp-admin\/post-new.php\" data-v-f87c67ca=\"\">post<\/a> on Twitter. It said the decision came \"after considerable effort and work to find a path forward.\"","BitGo Holdings said earlier this month that it had signed a non-binding term sheet to acquire 100% of the equity of Prime Core Technologies, the parent company of Prime Trust. The company said the deal would bring business continuity and long-term stability to clients of Prime Trust.","Prime Trust began offering services to crypto companies in 2018, and the firm has said it served nearly 700 fintech and crypto clients. It's recently lost several clients, however, including the Binance.US. exchange that was sued by the U.S. Securities and Exchange Commission earlier for allegedly violating the country's securities laws, among other charges.","The SEC lawsuit mentions a “Trust Company B,” which has drawn speculation on social media that it could be Prime Trust.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"100%","content":"PERCENT"},{"type":"Holdings","content":"ORGANIZATION"},{"type":"earlier this month","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Prime Core Technologies","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Prime Trust","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}