{"summary":"Crypto wallet Rainbow rolled out a points-based program designed to reward current users and attract new ones from MetaMask.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267360\/rainbow-points-ethereum-metamask-bonus","publishDate":"2023-12-13T05:43:54","id":8618,"type":null,"title":"Rainbow unveils points for Ethereum users, targets MetaMask community","category":["WEB3"],"content":["Rainbow, a crypto wallet accessible via mobile and browser, rolled out a points-based program designed to reward current users and attract new ones.","On Dec. 11, Rainbow captured a snapshot of user activity on Ethereum, forming the basis for initial eligibility for the program. It has allocated at least 100 points to every Ethereum user as an incentive to explore its platform. Moreover, Rainbow is targeting users of popular web3 wallet MetaMask by providing a points bonus to those who have used MetaMask’s swap service in the last year, with the amount based on their transaction volume.&nbsp;","Rainbow’s points program resembles a strategy commonly known as a “vampire attack.” This approach is used by projects to attract users from competitors, usually by providing greater incentives. However, Rainbow stated that “this isn’t a vampire attack. It’s a fox hunt,” referencing MetaMask’s logo which resembles a fox.","Rainbow has also reserved a specific number of points for its current users and those who hold Rainbow NFTs, according to its announcement. Rainbow added that these points can be redeemed after the version 1.9.11 of its wallet application is released.","There’s ongoing speculation that these Rainbow points might be exchangeable for future native tokens issued by Rainbow or make users eligible for an airdrop.","In 2022, Rainbow <a href=\"https:\/\/www.theblock.co\/linked\/134298\/rainbow-raise\" data-v-f87c67ca=\"\">raised<\/a> an $18 million Series A led by Seven Seven Six, the VC fund set up by Reddit co-founder Alexis Ohanian.","Typically in the crypto space, points are granted as incentives for activities such as participating in a network or interacting with a platform. These accumulated points can potentially serve as a basis for distributing crypto tokens through airdrops, a strategy that has been employed by several projects recently.","For example, Jito, a liquid staking protocol on the Solana blockchain, <a href=\"https:\/\/www.theblock.co\/post\/266735\/jito-token-witnesses-1-1-billion-of-trading-volume-in-first-day\" data-v-f87c67ca=\"\">rewarded<\/a> its users with points for staking SOL which made them eligible for an airdrop. Similarly, the NFT platform Blur <a href=\"https:\/\/www.theblock.co\/post\/264615\/blur-price-doubles-following-season-2-airdrop-and-binance-listing\" data-v-f87c67ca=\"\">distributed<\/a> tokens to its users based on the number of points they had accumulated through their activities. Other projects that utilize a points system but have not yet announced any token giveaways include FriendTech, MarginFi and Orbiter.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dec. 11","content":"DATE"},{"type":"Reddit","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Rainbow NFTs","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$18 million","content":"MONEY"},{"type":"Alexis Ohanian","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Rainbow","content":"ORGANIZATION"},{"type":"Jito","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["WALLET MAKERS"],"authors":["Vishal Chawla","The Block"]}