{"summary":"Ethereum-based credit service Porter Finance has shut down its bond issuance platform, citing a lack of demand. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156012\/defi-credit-service-porter-finance-shuts-down-bond-issuance-platform","publishDate":"2022-07-06T07:27:01","id":8620,"type":null,"title":"DeFi credit service Porter Finance shuts down bond issuance platform","category":["INSTITUTIONAL INVESTORS"],"content":["Porter Finance, a decentralized finance (DeFi) credit service on the Ethereum network, announced this week it will shut down its bond issuance platform amid a lack of demand.","The service, <a href=\"https:\/\/medium.com\/porter-finance\/ribbon-mainnet-bond-issuance-ea1119185b99\" data-v-f87c67ca=\"\">launched<\/a> only last month on the Ethereum mainnet, allowed decentralized autonomous organizations (DAOs) such as Ribbon DAO, to issue convertible bonds through Porter Finance. However, in a <a href=\"https:\/\/medium.com\/porter-finance\/porter-finance-is-shutting-down-bond-issuance-platform-bc8cb053f35d\" data-v-f87c67ca=\"\">statement<\/a> on Monday, founder Jordan Meyer said he was \"not confident\" there would be a large enough inflow of lending demand for fixed-income DeFi products.&nbsp;","Meyer cited the competitiveness of rates offered in traditional finance and the lack of institutional fixed income DeFi adoption as the reason behind Porter Finance's pivot away from bond issuance. The decision comes amid widespread price volatility in the crypto market in recent months, with bitcoin dropping below the $20,000 mark.","\"We are also no longer willing to take on the legal risk associated with bond offerings,\" Meyer said in the statement.&nbsp; \"For these reasons, we are pivoting away from the bond issuance platform and exploring better opportunities.\"","Meyer did not immediately respond to a request for comment by the time of publication.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Porter Finance","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Meyer","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$20,000","content":"MONEY"},{"type":"Jordan Meyer","content":"PERSON"}],"hashtag":["ETHEREUM"],"authors":["Tom Matsuda","The Block"]}