{"summary":"Bankrupt crypto lender Celsius sought permission in a late Thursday court filing to sell its stablecoin holdings.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170726\/celsius-asks-bankruptcy-court-for-permission-to-sell-stablecoin-holdings","publishDate":"2022-09-16T10:45:05","id":8624,"type":null,"title":"Celsius asks bankruptcy court for permission to sell stablecoin holdings","category":["LEGAL"],"content":["Bankrupt crypto lender Celsius sought permission in a late Thursday court filing to sell its stablecoin holdings.","The firm disclosed $23 million worth of stablecoins held by thee of its corporate entities. Celsius said it \"owns eleven different forms\" of stablecoins though it did not disclose which ones.","Celsius believes \"that the sale of their stablecoin consistent with past practice and in the ordinary course of business is an<br data-v-f87c67ca=\"\">\nefficient way to generate liquidity to help fund the Debtors’ operations,\" according to&nbsp;<a href=\"https:\/\/cases.stretto.com\/public\/x191\/11749\/PLEADINGS\/1174909162280000000022.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">the filing.<\/a>&nbsp;","The court has not yet granted approval for the sales and a court hearing has been scheduled for Oct. 6 to discuss the Celsius motion.","Celsius <a href=\"https:\/\/www.theblock.co\/post\/157491\/crypto-lender-celsius-declares-chapter-11-bankruptcy-in-new-york\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">declared<\/a> Chapter 11 bankruptcy in July amid severe financial headwinds after halting withdrawals the previous month. At the time, the firm declared assets between $1 billion and $10 billion, with an equal amount in estimated liabilities. It claimed more than 100,000 creditors, and said it had $167 million in cash on hand, \"which will provide ample liquidity to support certain operations during the restructuring process.\"","On Wednesday, the bankruptcy court <a href=\"https:\/\/www.theblock.co\/post\/170110\/judge-to-appoint-examiner-in-celsius-case?utm_source=rss&amp;utm_medium=rss\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">approved the appointment<\/a> of a third-party examiner to look into the current state of the crypto lender's finances as the Chapter 11 process continues.&nbsp;","The U.S. Trustee first pushed last month for the appointment, having highlighted what it characterized as \"extreme financial irregularities\" and \"the extensive mistrust of the Debtors' customers.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Oct. 6","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"$23 million","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"July","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"$167 million","content":"MONEY"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}