{"summary":"CoinShares, Europe’s largest crypto-focused asset manager, has quietly began a share issue ahead of a planned Initial Public Offering on the Nasdaq First North Growth Market in Stockholm, Sweden.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/95937\/crypto-asset-manager-coinshares-lists-sweden","publishDate":"2021-02-24T11:56:03","id":8626,"type":null,"title":"Crypto asset manager CoinShares to IPO in Sweden","category":["BITCOIN"],"content":["CoinShares, Europe’s largest crypto-focused asset manager, has quietly kicked off a share issue ahead of a planned public offering on the Nasdaq First North Growth Market in Stockholm, Sweden.","CoinShares International Limited has made 3,364,403 shares available for investment by individual and institutional investors in Sweden and abroad. This equates to an offering of roughly 151 million Swedish Krona (approximately $18 million).&nbsp;","But in <a href=\"https:\/\/coinshares.com\/assets\/IR\/coinshares---intention-to-list-and-prospectus-press-release-pdf-monday-22-2-2021.pdf\" data-v-f87c67ca=\"\">a press release<\/a> announcing the move, CoinShares said some 125 million Swedish Krona, or 83% of the offering, had already been subscribed for by members of its board of directors, management team, existing shareholders and through external investment.","The offering will take place at a fixed price of 44.90 Swedish Krona per share, giving the company a valuation of around 2.84 billion Swedish Krona ($341 million) prior to the offering.","The subscription period will remain open until March 2, and CoinShares will begin trading on the Nasdaq First North Growth Market on March 11 under the ticker “COIN”.","The press release said the firm’s board believes going public will boost the company’s balance sheet to help execute strategic initiatives; increase transparency; increase the level of regulatory scrutiny it is subject to; improve brand recognition; and bring liquidity to existing shareholders.","Jean-Marie Mognetti, CEO of CoinShares, said in a statement that the listing gives the firm “an opportunity to offer an even greater degree of visibility around its operations and to increase its credibility, trust, and transparency” in the digital assets sector.","“I am grateful to the dedication of my colleagues who shared our vision and joined us to build this fantastic company and of course to Nasdaq Stockholm who have been our trusted partner since 2015 in respect of our exchange traded products and now, today, our listing,” he added.","Launched in 2013, CoinShares is best known for running a range of cryptocurrency focused exchange-traded products (ETPs). It has amassed roughly $4.5 billion in assets under management.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"Sweden","content":"LOCATION"},{"type":"2.84 billion","content":"MONEY"},{"type":"Stockholm","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"$18 million","content":"MONEY"},{"type":"$341 million","content":"MONEY"},{"type":"Marie Mognetti","content":"PERSON"},{"type":"CoinShares International Limited","content":"ORGANIZATION"},{"type":"83%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"March 11","content":"DATE"},{"type":"$4.5 billion","content":"MONEY"},{"type":"Nasdaq First North Growth Market","content":"ORGANIZATION"},{"type":"CoinShares","content":"ORGANIZATION"},{"type":"Nasdaq Stockholm","content":"ORGANIZATION"},{"type":"March 2","content":"DATE"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}