{"summary":"Memecoin Slerf and presales for others gained traction recently, enough to drive up Solana&#x27;s fees and on-chain volume.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283190\/solana-memecoin-presales-continue-to-see-interest-despite-industry-leaders-expressing-concerns","publishDate":"2024-03-18T16:08:31","id":8629,"type":null,"title":"Solana memecoin presales continue to see interest despite industry leaders expressing concerns","category":["PEOPLE"],"content":["The founder and CEO of CryptoQuant, a cryptocurrency on-chain and market data platform, expressed concerns over the recent popularity of memecoins.&nbsp;","\"Memecoins harm the crypto industry,\"&nbsp;CryptoQuant's Ki Young Ju <a href=\"https:\/\/twitter.com\/ki_young_ju\/status\/1769759121903927446\" data-v-f87c67ca=\"\">said<\/a> on the social media platform X. \"It's frustrating to see billion-dollar-cap memecoins overshadow hardworking teams building legit products to advance this industry. Easy money can't drive industry-wide progress, as shown by the 2018 ICO burst.\"","\"Some say memecoins are a global lottery system that attracts new users to the crypto industry,\" Ju added. \"Would you risk losing money to enter the crypto space? Moreover, considering the 'shitcoins' from the 2018 ICOs, which was basically a casino, did they contribute any societal value?\"","Ju ended his X thread by saying that memecoin supporters must be new to the crypto industry and haven't experienced the downsides of \"easy money.\"&nbsp;","The ICO, or initial coin offering, burst describes the period in 2018 when web3 projects issued digital assets in exchange for financial investment. While some projects previously engaged in legitimate and successful ICOs, such as <a href=\"https:\/\/www.gemini.com\/cryptopedia\/initial-coin-offering-explained-ethereum-ico\" data-v-f87c67ca=\"\">Ethereum<\/a> in 2014, many offerings during this later period ended up being ethereal, speculative or simply fraudulent.","Ju's comments were in response to an uptick in memecoin sales recently.&nbsp; Memecoins, particularly those on Solana, have seen so much interest that they <a href=\"https:\/\/www.theblock.co\/post\/282993\/solana-memecoin-volume-fees-highs\" data-v-f87c67ca=\"\">drove up<\/a> Solana's fees and on-chain volume.","For instance, a presale for a project called \"are you stupid\" amassed 420.69 SOL ($83,717) in a single transaction on March 18. Users <a href=\"https:\/\/twitter.com\/MissionGains\/status\/1769163047405269327\" data-v-f87c67ca=\"\">have<\/a> 48 hours as of March 16 to send funds to the \"areyoustupid.sol\" wallet address, with a 99.99% chance that the investor receives nothing in return. The wallet <a href=\"https:\/\/explorer.solana.com\/address\/J8ddnZjyQxpxyFC4AakqpuktW78nd4h54jNNNNaMqH4F\" data-v-f87c67ca=\"\">address<\/a> for \"areyoustupid.sol\" contains a total of 437.27 SOL, worth over $87,000, as of publication.&nbsp;","A prominent memecoin called \"Slerf,\" a play on the word \"sloth,\" amassed a market capitalization of over $234,800,000 among 74,075 holders, according to the Solana blockchain tracker <a href=\"https:\/\/solscan.io\/token\/7BgBvyjrZX1YKz4oh9mjb8ZScatkkwb8DzFx7LoiVkM3\" data-v-f87c67ca=\"\">Solscan<\/a>. However, the Slerf team accidentally <a href=\"https:\/\/www.theblock.co\/post\/283025\/solana-memecoin-slerf-burn\" data-v-f87c67ca=\"\">burned $10 million<\/a> in funds from presale investors.&nbsp;","Solana changed hands at $199.35 at 3:00 p.m. ET on March 18, according to The Block's price page for <a href=\"https:\/\/www.theblock.co\/price\/33827\/solana-sol-usd\" data-v-f87c67ca=\"\">Solana<\/a>, with the token seeing a 2.03% 24-hour increase.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"2.03%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"$234,800,000","content":"MONEY"},{"type":"Ki Young Ju","content":"ORGANIZATION"},{"type":"$87,000","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$83,717","content":"MONEY"},{"type":"March 18","content":"DATE"},{"type":"March 16","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Slerf","content":"PERSON"},{"type":"99.99%","content":"PERCENT"},{"type":"$199.35","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"3:00 p.m.","content":"TIME"}],"hashtag":["MEMECOINS"],"authors":["MK Manoylov","The Block"]}