{"summary":"A near-700 page report into what went wrong at Celsius has found alleged misuse of customer funds and concerns among senior staff that they were breaking the law.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207007\/celsius-lost-800-million-risky-bets","publishDate":"2023-01-31T07:35:21","id":863,"type":null,"title":"Celsius failed to report $800 million in losses as CFO flagged &#x27;possibly illegal&#x27; behavior","category":["COMPANIES"],"content":["Crypto lender Celsius operated a riskier business than advertised and failed to report hundreds of millions in losses, all while CEO Alex Mashinsky cashed out more than $68 million,&nbsp;according to a court-ordered report into its bankruptcy.","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">\"Behind the scenes, Celsius conducted its business in a starkly different manner than how it<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">marketed itself to its customers in every key respect,” Shoba Pillay, who was appointed as the independent examiner, said in her<\/span>&nbsp;nearly <a href=\"https:\/\/cases.stretto.com\/public\/x191\/11749\/PLEADINGS\/1174901312380000000039.pdf\" data-v-f87c67ca=\"\">700-page report<\/a> released today. “Celsius abandoned its promise of transparency from its start.”&nbsp;","The report also detailed staff fears about whether they were complying with the law, including comments from Harumi Urata-Thompson, who served as chief financial officer from February 2020 to November 2021, that \"we are doing something possibly illegal.\"","Celsius's marketing told customers that it made low-risk and fully collateralized investments to secure the yields it offered, according to Pillay. Yet when the lender <span class=\"s1\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/post\/157491\/crypto-lender-celsius-declares-chapter-11-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">filed<\/a> for Chapter 11 bankruptcy protection last July, <\/span>it reported a $1.2 billion hole in its balance sheet.","And while the 2022 crypto bear market piled pressure on Celsius's finances, the trouble had begun as early as 2020.","By June of 2021, at the height of the bull market, a third of Celsius’s institutional loan portfolio was wholly unsecured and more than half was under-collateralized, the bankruptcy examiner said. The firm also recognized $800 million in losses in 2021 from investments with Grayscale, KeyFi, Stakehound and Equities First Holdings. It did not report these losses to its customers when they were incurred, the report said.","Celsius also used customer funds of bitcoin and ether to purchase its own native token CEL, according to the report, which also accused Celsius of concealing the extent to which it was market-making for CEL.","The lender used a strategy called the “OTC flywheel,” where it would sell CEL tokens in private, over-the-counter transactions and make offsetting purchases in the public market, which it believed would impact the trading price.","Celsius employees routinely discussed in 2022 that the tokens were “worthless” and questioned why any company other than Celsius was buying them.","“These trades caused Celsius’s former chief financial officer to write ‘[w]e are talking about becoming a regulated entity and we are doing something possibly illegal and definitely not compliant,'” the report said.","<span class=\"TextRun SCXW130408849 BCX0\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"auto\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW130408849 BCX0\" data-v-f87c67ca=\"\">“If anyone ever found out our position and how much our founders took in USD could be a very&nbsp;<\/span><span class=\"NormalTextRun SpellingErrorV2Themed SCXW130408849 BCX0\" data-v-f87c67ca=\"\">very<\/span><span class=\"NormalTextRun SCXW130408849 BCX0\" data-v-f87c67ca=\"\"> bad look... We are using users USDC to pay for employees worthless CEL... All because the company is the one inflating the price to get the valuations to be able to sell back to the company,” said another employee on Slack, referring to the USDC stablecoin.<\/span><\/span>","&nbsp;The company currently holds 95% of all CEL in existence, the report outlined.","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Pillay also examined the conduct of Mashinsky, Celsius's founder and CEO, accusing him of <\/span>selling CEL tokens while telling the public that he was either buying more or holding. Between 2018 and the firm’s collapse, Mashinsky sold CEL tokens for at least $68.7 million while making \"repeated assertions that he was not a seller,\" Pillay wrote.","The firm also used equity raised from outside investors to the support the price of CEL, a practice that raised concern among some managers who said the money would have been better used to grow the company.","Another manager put it more bluntly “We spent all our cash paying execs and trying to prop up alexs [sic] net worth in CEL token,” a reference to Mashinsky, who earlier this month was sued for fraud by the New York Attorney General.","In another documented instance, Celsius used customer assets to purchase tokens needed to cover the liabilities of other customers. This was described as \"very Ponzi like\" by the firm’s coin deployment specialist in April last year.&nbsp;","\"If Celsius had not instituted the pause and the run on the bank continued, new customer deposits inevitably would have become the only liquid source of coins for Celsius to fund withdrawals,\" said Pillay, who had been asked specifically to examine whether Celsius was running a Ponzi scheme, where existing investors' returns are paid from new clients' funds.&nbsp;","The pause appeared to satisfy the withdrawal requests, the report said. However, there were some cases in June 2022 where Celsius did directly use new customer deposits to fund customer withdrawal requests, according report.","\"The Examiner’s identification of the instances where Celsius directly used new customer deposits to fund customer withdrawals is not a comprehensive or exhaustive list of all transactions for all time periods,\" Pillay said.","Bankruptcy examiners provide the courts and creditors with an independent legal outlook on the failures of a bankrupt company.","Celsius didn't immediately respond to a request for comment.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thompson","content":"PERSON"},{"type":"Pillay","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"$68 million","content":"MONEY"},{"type":"Harumi Urata","content":"PERSON"},{"type":"Equities First Holdings","content":"ORGANIZATION"},{"type":"February 2020","content":"DATE"},{"type":"June of 2021","content":"DATE"},{"type":"November 2021","content":"DATE"},{"type":"Mashinsky","content":"PERSON"},{"type":"June 2022","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"April last year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$68.7 million","content":"MONEY"},{"type":"New York Attorney General","content":"ORGANIZATION"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"95%","content":"PERCENT"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Shoba Pillay","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"$800 million","content":"MONEY"},{"type":"$1.2 billion","content":"MONEY"},{"type":"Mashinsky","content":"ORGANIZATION"}],"hashtag":["BANKRUPTCY FILINGS","COURT HEARINGS","CRYPTO BANKS AND LENDERS","INVESTMENT FIRMS","LAWSUITS"],"authors":["Benjamin Robertson","Kari McMahon","The Block"]}