{"summary":"Applied Digital launched a fund with the goal of raising $100 million to invest in distressed crypto assets.\nThe company’s chairman and CEO said the bitcoin mining sector looks “more distressed by the day.”\nApplied Digital sees the new fund as an opportunity to grow its hosting customer base.","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189248\/applied-digital-sees-buying-opportunities-as-mining-hardware-selling-for-dirt-cheap","publishDate":"2022-11-22T19:25:24","id":863,"type":null,"title":"Applied Digital sees buying opportunities as mining hardware selling for dirt cheap","category":["Crypto Infrastructure"],"content":["As the market tightens for some of the biggest bitcoin mining companies, hosting provider Applied Digital is going after distressed assets with a new independent fund. It aims to raise $100 million.","The new fund, Highland Digital, is a joint venture with one of Applied Digital's clients, GMR Limited. It will pool together funds from investors, who will have ownership of the mining machines and be charged a fee to be split by the two companies. Applied Digital potentially would benefit from an increase in revenue as it hosts those newly acquired machines.","\"It feels like it's more distressed by the day, but we see a lot of opportunities of equipment that is extraordinarily cheap,\" Chairman and CEO Wes Cummins told The Block. \"I'm looking at that distressed assets constantly. I get called multiple times a week because there are a lot of people in trouble. And we're looking hard at that.\"","&nbsp;\"We see a lot of opportunities of equipment that is extraordinarily cheap, especially versus what it was at this time last year. It's like a 90% off sale on this equipment,\" Cummins said.","Other companies have recently moved to take advantage of the space. Crypto asset management firm Grayscale partnered with Foundry and <a href=\"https:\/\/www.theblock.co\/post\/175140\/grayscale-unveils-bitcoin-mining-centered-investment-entity\" data-v-f87c67ca=\"\">formed an entity<\/a> that will invest in discounted hardware and deploy this equipment to mine bitcoin. Bitcoin mining firm Luxor, which runs a mining pool and a hardware trading desk, <a href=\"https:\/\/www.theblock.co\/post\/175588\/luxor-launches-derivatives-product-based-on-bitcoin-mining-revenue\" data-v-f87c67ca=\"\">launched an over-the-counter derivative product<\/a> based on bitcoin mining revenues.","Hardware prices have plummeted, and as companies like Core Scientific and Argo struggle to make debt payments more machines are bound to hit the market.","\"I think you'll probably see a few of the public miners go bankrupt in the next few months, and a lot of the privates,\" Cummins said. \"Lenders are taking equipment back and that equipment all has to go somewhere. And so I think you're going to see those be liquidated at really attractive prices in the future.\"","Cummins said that Applied Digital's energy cost — a pain point for many miners struggling with rising rates — is one of its strong suits.","While not disclosing exact values, he said its all-in hosting rate for clients is below $0.07 per kilowatt-hour.","\"I think we're about as fixed as you can get in the electricity business because it's really impossible to get truly fixed-rate contracts,\" he said. \"Some of these guys, the ones that are really getting killed, their electricity price has gone from what they thought would be $0.02 or $0.03 to like $0.09, $0.10.\"","That factor combined with the decline in bitcoin prices and higher mining difficulty has put miners in a tough spot.&nbsp;","Applied Digital, formerly known as Applied Blockchain, currently has 100 megawatts operational in North Dakota and is developing a second 180-megawatt site in the same state and a 200-megawatt one in Texas.","Its recent name change reflects the company's shift from from being completely crypto-focused to catering more broadly to digital infrastructure applications, like machine learning or artificial intelligence.","\"Bitcoin mining was really the start for us,\" Cummins said. \"There's been a massive amount of demand and we still have more demand than we have supply.\""],"hashtag":["MINING COMPANIES"]}