{"summary":"Blur has orchestrated three airdrops but not laid out a long-term plan for the tokens. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211374\/blur-debuts-long-awaited-token","publishDate":"2023-02-14T13:33:17","id":8635,"type":null,"title":"Blur debuts long-awaited token","category":["METAVERSE & NFT"],"content":["Blur's native token is finally live, marking a long-awaited milestone for the NFT marketplace that may be primed to go head-to-head with market leader OpenSea.","\"It's time for $Blur,\" the company <a href=\"https:\/\/twitter.com\/blur_io\/status\/1625204166682636288\" data-v-f87c67ca=\"\">posted to Twitter<\/a> on Monday, advising people to \"double check\" they are following Blur's official account when claiming tokens, a warning almost certainly meant to help prevent holders from being scammed.","Tuesday's token drop comes on the heels of revelations that Blur raised enough money to achieve the much-coveted unicorn status, meaning a valuation north of $1 billion. The Block <a href=\"https:\/\/www.theblock.co\/post\/210668\/nft-marketplace-blur-raise-billion-dollar-valuation\" data-v-f87c67ca=\"\">first reported<\/a> news of the marketplace's new valuation.&nbsp;","Last month, Blur delayed the unlocking of its token, <a href=\"https:\/\/twitter.com\/blur_io\/status\/1616125798951571456?s=20&amp;t=vCUoRYK7mzg3H6YoGzgN9A\" data-v-f87c67ca=\"\">saying&nbsp;that<\/a> an \"extra two weeks will allow us to deliver a launch that hasn’t been done before.\" Blur orchestrated three airdrops last year, delivering \"care packages\" to traders which contained an undisclosed number of blur tokens.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nTuesday was the first opportunity for NFT traders to not only know how many tokens they had been awarded but also to start trading them on the open market.&nbsp;","<span data-v-f87c67ca=\"\">The total supply of Blur’s native token will be capped at three billion, according to The Block Research, with algorithmic digital-asset trading firm Wintermute having already received 15 million tokens. <\/span><span data-v-f87c67ca=\"\">The Block Research also said 12% of Blur tokens, or 360 million, will be distributed by Tuesday’s unlock.<br data-v-f87c67ca=\"\">\n<\/span>","Blur launched to much fanfare last October, quickly muscling in on an increasingly competitive niche in the market. It was the third-largest NFT marketplace by volume in January, according to data from The Block Research. OpenSea has dominated among marketplaces, holding the top spot since the market was in its infancy.","The upstart marketplace Blur is known for its low trading fees and its floor sweeping function. Part of its rise to prominence could be attributed to last year's airdrops and the fact that Blur has been awarding its tokens to NFT traders based on how much they engaged with the platform. So far, the business has orchestrated three airdrops but not laid out a long-term plan for the tokens.&nbsp;","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$Blur","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"October","content":"DATE"},{"type":"Block Research","content":"ORGANIZATION"}],"hashtag":["BLUR"],"authors":["Lucy Harley-McKeown","RT Watson","The Block"]}