{"summary":"&quot;The increase in energy consumption attributable to the growth of digital asset mining has negative environmental effects and can... increase energy prices,&quot; the White House said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229221\/biden-tax-on-bitcoin-miners-electricity-usage","publishDate":"2023-05-03T07:50:54","id":8636,"type":null,"title":"Biden wants 30% tax on Bitcoin mining electricity usage","category":["POLICY"],"content":["U.S. President Joe Biden's administration reiterated that it wants all crypto mining operations to pay a new tax priced at 30% of their electricity costs.&nbsp;","The White House outlined <a href=\"https:\/\/www.whitehouse.gov\/cea\/written-materials\/2023\/05\/02\/cost-of-cryptomining-dame-tax\/\" data-v-f87c67ca=\"\">details of the Digital Asset Mining Energy (DAME) tax<\/a> in a blog post yesterday, which highlighted <a href=\"https:\/\/home.treasury.gov\/system\/files\/131\/General-Explanations-FY2024.pdf\" data-v-f87c67ca=\"\">proposals<\/a> first laid out in March.&nbsp;","Proof-of-work crypto mining — which is overwhelmingly dominated by Bitcoin mining — is controversial because it uses vast amounts of electricity to compute and verify transactions on the blockchain. <a href=\"https:\/\/digiconomist.net\/bitcoin-energy-consumption\" data-v-f87c67ca=\"\">Bitcoin now uses more electricity than Finland, Belgium or the Philippines<\/a>, according to Digiconomist.","Since <a href=\"https:\/\/www.theblock.co\/article\/110499\/a-timeline-of-chinas-bitcoin-mining-crackdown-and-how-it-goes-beyond-environmental-concerns\" data-v-f87c67ca=\"\">China banned Bitcoin mining<\/a> in 2021, the U.S. has become a global center for the activity. The tax proposal aims to reverse that growth, stating that it intends to “reduce mining activity” in America.","It says: \"The computational effort involved in mining can be substantial and can therefore require a correspondingly large amount of energy. The increase in energy consumption attributable to the growth of digital asset mining has negative environmental effects and can have environmental justice implications as well as increase energy prices for those that share an electricity grid with digital asset miners. Digital asset mining also creates uncertainty and risks to local utilities and communities, as mining activity is highly variable and highly mobile. An excise tax on electricity usage by digital asset miners could reduce mining activity along with its associated environmental impacts and other harms.”","Biden's proposals may struggle to make it into law. Presidential budget requests in the current political era are never fully accepted by Congress and instead reflect the priorities of the administration. Some policies could become law through a more piecemeal legislative approach.","In the blog post, written by the White House’s Council of Economic Advisors, the Biden Administration argues that Bitcoin miners impose costs on the rest of society:","“Currently, cryptomining firms do not have to pay for the full cost they impose on others, in the form of local environmental pollution, higher energy prices, and the impacts of increased greenhouse gas emissions on the climate. The DAME tax encourages firms to start taking better account of the harms they impose on society.”","“Cryptominers’ intensive and often volatile power consumption also can push up electricity prices for consumers and can increase risks for local electrical grids — straining equipment, causing service interruptions and safety hazards.”","The CEA also produced a chart showing that crypto now uses more power in the U.S. than computers, fans, freezers and washers.","<span data-v-f87c67ca=\"\">U.S. Bitcoin power usage<\/span>","The Biden Administration also argues that crypto is not a significant driver of beneficial economic activity:","“There is&nbsp;little evidence&nbsp;of benefits to local communities in the form of employment or economic opportunity, and research has found that minor increases in local tax revenue are more than offset by increased energy prices for firms and households.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Biden Administration","content":"ORGANIZATION"},{"type":"America","content":"LOCATION"},{"type":"White House","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Philippines","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"Digital Asset Mining Energy (DAME","content":"ORGANIZATION"},{"type":"CEA","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"White House’s Council of Economic Advisors","content":"ORGANIZATION"},{"type":"Finland","content":"LOCATION"},{"type":"Belgium","content":"LOCATION"},{"type":"Biden","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["BITCOIN","MINING COMPANIES"],"authors":["Jim Edwards","The Block"]}