{"summary":"The government of Australia has today released a national blockchain roadmap to help drive the adoption of the technology in the country. The five-year roadmap hopes to bring regulatory frameworks, help people develop blockchain skills and increase global investment and collaboration opportunities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55236\/australian-government-issues-national-blockchain-roadmap-to-help-drive-adoption","publishDate":"2020-02-07T07:45:59","id":8639,"type":null,"title":"Australian government issues national blockchain roadmap","category":["LAYER 1S"],"content":["The government of Australia has today released a national blockchain roadmap to help drive the adoption of the technology in the country.","The <a href=\"https:\/\/www.industry.gov.au\/sites\/default\/files\/2020-02\/national-blockchain-roadmap.pdf\" data-v-f87c67ca=\"\">52-page roadmap<\/a>, issued by the government’s Department of Industry, has noted that blockchain has the potential to create jobs, save companies money and improve Australia’s economic growth.","The five-year roadmap hopes to bring regulatory frameworks, help people develop blockchain skills and increase global investment and collaboration opportunities.","Specifically, the roadmap lists a 12-step approach the government said it will take to help Australia progress towards “a blockchain empowered future.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Five-year plan<\/strong><\/span>","1. Formalize the National Blockchain Roadmap Advisory Committee and rename it to the National Blockchain Roadmap Steering Committee","2. Establish working groups for analyzing blockchain use cases","3. Investigate options for uses cases in sectors such as agriculture, education and finance","4. Establish a group of government blockchain users to discuss the learnings from existing government use cases","5. Look internationally to identify examples of countries using blockchain to provide efficient government services","6. Work closely with blockchain providers to engage with the Business Research and Innovation Initiative program","7. Ensure that blockchain is included in broader policy work","8. Help develop common frameworks and course content for blockchain qualifications","9. Work with Austrade [The Australian Trade and Investment Commission] on a capability development program for Australian blockchain start-ups","10. Work with Austrade to deliver a blockchain focussed inbound investment program","11. Leverage existing bilateral agreements to consider pilot projects with other countries","12. Work with relevant government departments to ensure Australian businesses can connect into digital trade infrastructure<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Driving adoption&nbsp;<\/strong><\/span>","“Together, we can drive the long-term development and adoption of blockchain technology, and capitalize on the tremendous economic and social opportunities it offers,” said Karen Andrews, Australia’s Minister for Industry, Science and Technology.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe government said blockchain technology, along with other technologies, can help add an estimated US$175 billion in business value by 2025.","“It is vital Australia and our tech companies stay ahead of the game in one of the world’s fastest growing technology sectors,” said Simon Birmingham, Senator and Minister for Trade, Tourism and Investment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"Austrade","content":"ORGANIZATION"},{"type":"Simon Birmingham","content":"PERSON"},{"type":"US$175 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Austrade [The Australian Trade and Investment Commission","content":"ORGANIZATION"},{"type":"Department of Industry","content":"ORGANIZATION"},{"type":"National Blockchain Roadmap Advisory Committee","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"National Blockchain Roadmap Steering Committee","content":"ORGANIZATION"},{"type":"Business Research","content":"ORGANIZATION"},{"type":"Karen Andrews","content":"PERSON"},{"type":"Industry, Science and Technology","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}