{"summary":"Bitmain has launched Antminer T19, a cheaper version of its more efficient bitcoin mining machine Antminer S19 \nThe new model comes as Bitmain has been losing its market share to rival MicroBT \nBitmain recently also released a new firmware for S17+ and T17+ Antminers since these models have shown a high failure rate ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/66964\/bitmain-releases-cheaper-bitcoin-miner-as-it-loses-market-share-to-microbt","publishDate":"2020-06-01T05:45:23","id":864,"type":null,"title":"Bitmain Releases Cheaper Bitcoin Miner","category":["Bitcoin"],"content":["Bitmain has launched a new, cheaper model for its Antminer range of bitcoin mining machines.","The <a href=\"https:\/\/blog.bitmain.com\/en\/bitmain-officially-launches-the-new-antminer-t19-available-for-purchase-today-on-bitmains-official-website\/\" data-v-f87c67ca=\"\">Antminer T19<\/a> has a hashrate or mining power of 84 TH\/s (terahash per second), and power efficiency of 37.5 J\/TH (joules per terahash).","The numbers compare well with the S19 model that has a hashrate of up to 95 TH\/s. Antminer T19 is <a href=\"https:\/\/shop.bitmain.com\/product\/detail?pid=00020200531222100356V51KHMp50623\" data-v-f87c67ca=\"\">priced<\/a> at around $1750, while S19 <a href=\"https:\/\/shop.bitmain.com\/product\/detail?pid=00020200526110631700Bro7L3Qe0673\" data-v-f87c67ca=\"\">comes<\/a> at the cost of $1785.","On the profitability front, the new T19 model can generate a profit of $3.14 per day, while S19 can generate earnings of $3.93 per day, according to <a href=\"https:\/\/www.f2pool.com\/miners?currency_code=btc#list-head\" data-v-f87c67ca=\"\">F2Pool’s calculations<\/a> (assuming an electricity cost of $0.05 per kilowatt per hour).","Bitmain said T19 has the same generation of chips found in the S19 and S19 Pro models and is more efficient than the T17 model.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBitmain always has series S and series T of its Antminer products, F2Pool’s global business director Thomas Heller, told The Block. The series S products are flagship, have a higher hashrate, and are more efficient, while the series T products are cheaper, Heller added.&nbsp;&nbsp;","Antminer T19 goes on sale from today and will be shipped between June 21-30, while the shipping date for S19 is September 1-30 since the model is sold out. This could force miners to buy the T19 model.&nbsp;","Notably, Bitmain has capped T19 purchases at two machines per user \"to prevent hoarding.”&nbsp;","The new product comes at a time when bitcoin miners are looking to replace their old machines with powerful ones after the halving, which cut mining rewards from 12.5 bitcoins to 6.25 bitcoins.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Antminer failure rate update<\/strong><\/span>","Bitmain's S17 and T17 Antminer models have shown a <a href=\"https:\/\/www.theblockcrypto.com\/post\/63360\/bitmain-is-said-to-have-made-over-300-million-in-revenue-this-year-so-far-ai-business-grew-rapidly\" data-v-f87c67ca=\"\">high failure rate<\/a> of 20-30% as compared to around 5% usually. The company previously told The Block that it is \"paying close attention to the issues of some products from the 17 Series [and] has begun to negotiate solutions with customers who have encountered issues with the product.”","Last week, Bitmain <a href=\"https:\/\/support.bitmain.com\/hc\/en-us\/articles\/900001044903%E3%80%82thank\" data-v-f87c67ca=\"\">released a new firmware<\/a> of S17+ and T17+ models and asked users to update it in small batches.","\"Please try a small amount of miners firstly when upgrading the firmware. For example, users upgrade 10-30 units at least for more than 24 hours. After confirming that there is no problem, users can upgrade more miners,” said Bitmain.","The company further said that it would also improve firmware “for the bad situation caused by frequent power outages in hydropower mining farms.”","Bitmain recently also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/66884\/bitmain-expands-hardware-repair-training-course-to-miners-in-north-america?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">teamed up<\/a> with U.S.-based Core Scientific to allow North American miners to get certified to repair their mining equipment, without having to travel to China.","Bitmain has been taking several steps to regain its <a href=\"https:\/\/www.coindesk.com\/bitcoin-mining-unit-manufacturer-microbt-nibbles-at-bitmains-market-share\" data-v-f87c67ca=\"\">market share<\/a> against rival <a href=\"https:\/\/www.theblockcrypto.com\/linked\/65889\/microbt-and-bitmains-latest-bitcoin-mining-machines-are-most-profitable-now-after-halving\" data-v-f87c67ca=\"\">MicroBT<\/a>, which manufacturers Whatsminer range of products. MicroBT’s Whatsminer M30S+ and M30S++ models are currently the second and third most profitable bitcoin miners, according to F2Pool's <a href=\"https:\/\/www.f2pool.com\/miners?currency_code=btc#list-head\" data-v-f87c67ca=\"\">calculations<\/a>.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nEarlier today, crypto mining firm Bitfarms <a href=\"https:\/\/www.globenewswire.com\/news-release\/2020\/06\/01\/2041364\/0\/en\/Bitfarms-Announces-Acquisition-of-New-Mining-Equipment-and-Management-Appointments-and-Changes.html\" data-v-f87c67ca=\"\">announced<\/a> that it has purchased 1,847 WhatsMiner M20S miners, which are scheduled to be delivered within 4 to 5 weeks. Once fully operational, the mining hardware is expected to add approximately 133 petahash per second to the company’s installed computing power and improve computing efficiency to over 15 PH per megawatt."],"hashtag":["BITCOIN"]}