{"summary":"In this episode of The Scoop, Frank Chaparro and Ryan Todd interview Michael Moro, Chief Executive Officer at Genesis Trading \/ Genesis Capital. Genesis Trading is a Digital Currency Group company providing over the counter digital currency trading for high net worth individuals or institutions. In their conversation, Frank, Ryan, and Michael discuss legacy OTC firms adoption of crypto, the challenges of handling big alt-coin transactions, and how the cryptocurrency lending market is heating up.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/22424\/michael-moro-genesis-global-trading","publishDate":"2019-05-07T17:48:54","id":8643,"type":null,"title":"A Conversation with Michael Moro, CEO of Genesis Global Trading","category":["PODCASTS"],"content":["\n<style data-v-f87c67ca=\"\">\n\t.transcript {}\n\t.transcript .speaker {font-weight: bold;}\n<\/style>\n","<em data-v-f87c67ca=\"\">The following transcript is taken from episode three of The Scoop, The Block's new podcast. Listen below and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>, <a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>, <a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" data-v-f87c67ca=\"\">Google Play<\/a>, <a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback to <a href=\"\/cdn-cgi\/l\/email-protection#60100f040301131420140805020c0f030b03121910140f4e030f0d\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"93e3fcf7f0f2e0e7d3e7fbf6f1fffcf0f8f0e1eae3e7fcbdf0fcfe\">[email&nbsp;protected]<\/span><\/a>. This transcript has been edited for clarity and length. <\/em>","<em data-v-f87c67ca=\"\">In this episode of The Scoop, Frank Chaparro and Ryan Todd interview <a href=\"https:\/\/twitter.com\/michaelmoro?lang=en\" data-v-f87c67ca=\"\">Michael Moro<\/a>, Chief Executive Officer at Genesis Trading \/ Genesis Capital. Genesis Trading is a Digital Currency Group company providing over the counter digital currency trading for high net worth individuals or institutions. In their conversation, Frank, Ryan, and Michael discuss legacy OTC firms adoption of crypto, the challenges of handling big alt-coin transactions, and how the cryptocurrency lending market is heating up.<\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK2137864950\" width=\"100%\" height=\"200\" frameborder=\"no\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong> Thanks for tuning in everyone this is The Scoop. You could have been listening to the thousand other crypto podcasts that are out there but you chose us and we appreciate it. We have a very special guest today Michael Moro, the CEO of Genesis Global Trading. I'm joined by my colleague and good dear friend Ryan Todd and we're going to be diving into some very interesting things.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Michael has been a long time friend, source, consigliere in the crypto world to me. When I first met him I didn't know the difference between a piece of biscotti and a bitcoin and he's been incredibly influential in the entire space on all things, OTC trading, exchanges, I mean you name it Michael is your guy to unpack and unearth some of the most pedantic, wonky and frankly from my perspective interesting topics in the space. Michael thanks so much for joining us today.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael Moro:<\/span><\/strong> Thanks for having me. Glad to be here.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> It's a great pleasure to have you. Let's talk a little bit for our guests about <a href=\"https:\/\/genesistrading.com\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">Genesis<\/a>. It's a name that a lot of folks might not know in crypto trading, millions of dollars worth of crypto probably among multimillions of dollars worth of crypto every month, facilitating over-the-counter trades. What's the origin story behind the firm? It dates back to <a href=\"https:\/\/www.crunchbase.com\/organization\/secondmarket\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">SecondMarket<\/a> which was in equities and found its way to crypto. Let's sort of walk through that.","<span class=\"speaker\" data-v-f87c67ca=\"\">Michael<\/span> Alright well we'll go way back, 2013 is when we started trading Bitcoin. But the true origin really goes back to <a href=\"https:\/\/www.linkedin.com\/in\/barrysilbert\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">Barry Silbert<\/a> and when he himself discovered bitcoin, this would have been in...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> That's the <a href=\"https:\/\/www.theblockcrypto.com\/2019\/03\/06\/mapping-out-digital-currency-group\/\" data-v-f87c67ca=\"\">CEO of DCG<\/a>.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span> <\/strong>Yes the CEO of our parent company, Digital Currency Group who discovered Bitcoin itself I believe in around 2011. I think he's probably spent six months going from skeptic, to interested, to convert, to full blown evangelist. And then all throughout 2012 he wouldn't stop talking about bitcoin in the office. At the time SecondMarket was really focused on, it was a broker dealer, focused on trading off the run illiquid financial assets. Things that didn't trade on an exchange, hard to value assets which obviously became very prevalent after the financial crisis where certain things that used to be worth a dollar were no longer worth a dollar and a secondary market was needed to help price things and to potentially transact. When he approached us and started talking about bitcoin in 2012 we didn't understand it, we didn't know what it was. A lot of the education 101 material that is available on the Web today, not there, not in the space. And so you try to figure out...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span> <\/strong>I was pretty young back then, I was at my high school prom","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> That ages me quite a bit. So for us, we just had to learn what bitcoin was firsthand. What Barry did was, SecondMarket had one hundred employees at the time. He went out and bought a bunch of Bitcoin and gave every employee 2 bitcoins and he said okay I'm going to give you guys two bitcoins, I want you to go and find a website that lets you create a bitcoin wallet. Create your bitcoin wallet, figure out how to store your private key and then send me your public address. And then I will send you 2 bitcoins to your public address. Then he said you've got your two bitcoins, spend one and save one. So keep one for your future investment and find out somewhere to spend the other one. All of us are Googling places to spend Bitcoin in early 2013 and really there wasn't a huge range of places you can buy. It was like <a href=\"https:\/\/bitcoin.stackexchange.com\/questions\/4947\/what-is-the-store-that-sells-the-famous-alpaca-socks-for-bitcoin\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">Alpaca Socks<\/a>.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Was <a href=\"https:\/\/help.overstock.com\/help\/s\/article\/Bitcoin\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">Overstock<\/a> in the game yet?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> Overstock, ah I don't believe they were it was really limited. All of us ended up spending our 1 bitcoin which was worth like eighty\/ninety dollars at the time at the same four or five different retailers but that was really our first foray into figuring out how to hold, how to spend and private keys, don't lose it. That basic 101 type of stuff, we learned firsthand ourselves by doing it. And then we're like oh this is just another financial asset, just as illiquid as most other things. Why don't we start trading this stuff? And that's how the trading desk was born.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Back then I'd imagine, Bitcoin obviously has this reputation for being tied to nefarious sectors, <a href=\"https:\/\/www.theblockcrypto.com\/2018\/11\/07\/analysis-the-u-s-has-seized-nearly-200000-bitcoins-to-date-global-confiscations-are-up-to-453000\/\" data-v-f87c67ca=\"\">Silk Road and drug markets<\/a>. Who are your counter parties back then? Right now I know a lot of them are other large trading firms. How'd as a regulated firm, a broker dealer, how did you go about engaging with some of the firms that would probably want to be on the other side of the trade, back in 2013?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> That's a very good question. And it was certainly an eye opening experience for us who were only used to dealing with institutions whether it be trading stocks or bonds or hedge fund interests and bankruptcy claims and all of the other assets second market. Which trading at the time, Barry literally just gave us his rolodex and said here's every contact that I've made in this space since 2011. Smile and dial. Start grassroots calling and saying hey we're interested in making a market let me know if you want to buy, let me know if you want to sell, to try to drum up the counterparties on either side. Now, a lot of the counterparties to your point or the early crypto anarchists -- the people who sneered at things like <a href=\"https:\/\/www.quora.com\/What-is-a-difference-between-KYC-and-AML\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">AML\/KYC<\/a>, onboarding -- many of them would just hang up. What are you going to do with my information? Why do you need my driver's license? All of that kind of basic stuff. That was certainly a new experience for us. On the institutional side, onboarding and providing documentation, yes that's a normal course of business but it was foreign to a lot of these guys. And so for us it was it was pretty scary. We used to have people literally walk into our office with suitcases full of cash and say I want to buy some bitcoin. I'm not telling you who I am. I'm providing nothing. But here's my proof of funds and then they'd open up their briefcase.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> What was the largest amount?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael<\/span>: <\/strong>Guys wanted to buy a million, two million dollars worth of bitcoin but provide absolutely nothing. And then comes their explanation -- no sir, I'm sorry we are unable to help you, the exit is right this way. We had more than one of those kind of instances early on which we knew that this is not fixed income. This isn't equity, is there something a little bit different about this world? Which was clearly...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd:<\/span><\/strong> It's more commodities than equities I would say","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> Yeah. I think that's probably right and yes it is dramatically different. I think in 2013, and 2013 if you remember was also the year when Bitcoin went from like 80 dollars to twelve hundred, thirteen hundred, <a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/14\/money-2-0-stuff-everyone-is-an-expert-on-japanese-courts\/\" data-v-f87c67ca=\"\">Mt. Gox just before Mt. Gox imploded.<\/a> That was early 2014 when it happened and the magnitude and the speed of the moves were just like what is this thing that we're starting to trade? And then when Mt. Gox happened I think we really thought that bitcoin is going back to 100 bucks. Where it was pre all of that stuff and if you had told me in, 2014, 2015 that the <a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/20\/cmes-bitcoin-futures-are-off-to-a-record-breaking-start-this-year\/\" data-v-f87c67ca=\"\">CME was going to have a bitcoin futures product<\/a> out in a couple years, I wouldn't have believed you. We were so far from where we thought the CME's of the world would need to be in this asset class to get there.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Might have been the case that we moved a little too far or rather a little too quickly going into 2017 with the roll out of futures. And now here we are with almost every day there's a new announcement that there's gonna be another future product rollout tied to this market or another exchange launch","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span> <\/strong>Which to me is amazing. I would have thought that an old Chicago institution like the CME would have eventually entered as opposed to leading the pack. Which typically isn't the mindset of established financial institutions. It's the let's startups that go out and do their thing and then they figure it out and they take over. But the CME's decided to take a leadership role in doing it. Were they potentially early? Sure, but I think they basically now have 100 percent market share in the traditional futures market and so I'm sure they're reaping the spoils now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> And just thinking about across the trading landscape, now you guys are not alone in this world -- you have <a href=\"https:\/\/www.financemagnates.com\/cryptocurrency\/news\/jump-trading-developing-electronic-crypto-otc-trading-platform\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">Jump<\/a>, you have <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/jane-street-and-flow-traders-are-actively-trading-the-top-five-cryptocurrencies-for-a-new-exchange-traded-product\/\" data-v-f87c67ca=\"\">Jane Street<\/a> you have all the Chicago prop shops in this market making markets and over-the-counter trading. If you think about what it looks like today how are you differentiated outside of your experience for being in this market for so long and how are folks and firms in OTC maintaining their competitiveness in the market? We\"ve drawn down 60 percent.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> Let me take off my Genesis hat for a second and just try to take a 30,000 foot view on the crypto OTC generally. Spreads were pretty wide in 2015-2016. I think the 2017 bull market certainly opened the eyes of a lot of the prop traders and a lot of the Chicago firms that you mentioned into entering this space and I think just the level of liquidity and the sophistication of the participants have certainly helped to bring down spreads. Better execution across the board, much better experience for buyers and sellers. Which naturally happens in any marketplace where there is money to potentially be made. On the whole, 2017 I think was the huge catalyst for a lot of people. 2018, you would think that in a market in which 80 percent or 90 percent price drawdown would cause people to disappear and potentially for spreads to come back and normalize a little bit. It didn't happen. The exact opposite happened, we saw more entrants into this space, we saw more exchanges, even on an agency basis. Even in a bear market we start to see more competition, more entrant, more liquidity providers and so I'm not sure, I actually believe that spreads are not going to go back to where it was. That spreads are only going to go one way and that's just closer and closer to the spot market over time. What does that mean?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> It's bad news for you guys. For all the OTC guys","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> In one sense yes, on the other hand you're always banking on the idea that you'll just do more trades. So volume should be higher to compensate for tighter spreads, that helps overall liquidity, volumes, the market is bigger and so we're just taking our piece of a much bigger pie even though each trade might yield less in terms of percentage on the P and L side. I think different firms react differently to the changing landscape when the jumps of the world enter the space. I think firms that are much more electronic and technology oriented, they try to compete. They try to staff up on their tech side, build a smart order router that is that much more efficient and can route through different fiat currencies and crazy pairs to arrive at the best price in a bid to try to squeeze out just a little bit more than everyone else. And there's also an idea to, hey let's just do trades. Even if the spreads aren't there and it's not justifying the risk of the trade, spreads are coming down but volatility isn't exactly decreasing.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> And some firms are even offering products, different types of swaps and derivatives.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> And so you either compensate via tech and try to say hey I'm just as good as Jump or Jane Street or whomever or you go the other way and say OK what else can we do? What other additional services or products can we provide? Which is kind of where the CFD's and the non deliverable forwards and some of the other products that I think are out there.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> That's kind of the route that you guys have taken. When you think about electronification, that's not necessarily where you guys have headed.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> That hasn't and frankly even in 2019 most of our trading is still OTC. We don't face the exchanges very much at all. I think that the firms that have built in the connectivity to 20, 30, 40 different exchanges certainly have a lot more access to that exchange liquidity. Given our regulatory position, what the broker dealer and the <a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/24\/robinhood-crypto-coming-to-new-york-after-firm-nabs-coveted-bitlicense\/\" data-v-f87c67ca=\"\">bitlicense<\/a> and whatnot. Our threshold as to which exchanges we can comfortably work with.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Yeah I remember when we talked about this before you got this shiny new office here in Midtown and we spoke about how you guys wouldn't put more than a million, 5 million on exchange because it's just too risky. Are we still, well I think that conversation was probably at the end of early 2018, are we still in that spot in terms of the exchange market structure being so fragile?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> I would say it's pretty <a href=\"https:\/\/www.investopedia.com\/terms\/b\/barbell.asp\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">barbelled<\/a> in the way we look at exchange risk. The guys that have been around for a few years and the guys that have proper licensing regulation of themselves -- we work with, we trust, we'll leave capital there. That's fine. But there's also a long tail of exchanges which we just are less comfortable. And not only are we less comfortable, it'll be the exchanges that are regulators that would have questions about why are you parking assets at that exchange and if we have a difficult time explaining why we're comfortable, that tends to raise red flags with our regulators. We often times are putting our regulators had on ourselves.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Do they ever call and are like what are you doing on this Shitcoin exchange?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> We get audited every two years by the SEC and <a href=\"http:\/\/www.finra.org\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">FINRA<\/a>, both come knocking on our door and AML, KYC is the one big thing that they'll look through from our counterparty files and yes they have questions as to who we're trading and why we're trading and I need to be able to give good answers.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> 100 percent, I think it might be interesting just to focus more precisely on what Genesis is up to right now. Obviously a year ago you launched this very impressive lending business. At the time from my perspective I thought it would feed into OTC, it almost seems at this point that's become not the focal point but certainly can stand alone on its own merit in terms of it being a strong business. Can you talk about the success of that over the past year?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> In 2014 actually, right after we started trading bitcoin we had on our balance sheet just a bunch of Bitcoin that we considered to be hold to maturity -- we're not selling this thing, this is our principal position so we were sitting on a bunch of Bitcoin. We've had friends and family firms in the crypto space that would come to us from time to time and say hey can I borrow 50 bitcoins, can I borrow one hundred bitcoins? And we said sure we'll make the loan to you. It was much more of a cottage business back then and it really remained that way for years. In 2017 I had a conversation with Barry, I had been talking to him about wanting to create a lending business for some time as a standalone entity and Barry said all right let's give it a shot. It was probably mid-2017 when we started to put together the business plan and try to figure out what it would potentially take to launch this thing and we were ready for launch in March of last year. I wish I could tell you that I was some price savant that expected the 80-90 percent price decline so a lending business might do really well. No, the calendar just happened to line up that we were ready right after <a href=\"https:\/\/www.coindesk.com\/ripples-xrp-token-hits-time-high-3\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">XRP hit three dollars or whatever<\/a> it was in early 2018. And I think the idea for the lending business, what we call a <a href=\"https:\/\/genesiscap.co\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">Genesis Capital<\/a> was, it's not a bad thing to short -- that this idea that when you short something you're a hater or you don't believe in the asset class. Fundamental guys oftentimes, and crypto does not lack passion for people who believe in their coins of choice...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Passion... Psychosis.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> And the idea of how could you let somebody short, that's anti-moon, right? And this idea of getting the marketplace comfortable with the idea of going long or going short exists in every other market. As a cryptocurrency becomes more of a mainstream asset class we need to still come up with the same products and services that investors get in every other asset class. They'll come to expect it in crypto and that a borrow market provides healthy two-way price discovery and it allows obviously people to go long and go short and you have the ability to turn bitcoin into a productive asset. For the first time you can now lend bitcoin and actually end up with more bitcoin because you'll get more bitcoin in kind interest in return. Then at the same time the market was starting to mature to the point where people who wanted to be short entered this space. Lending in 2013 would not have worked. Shorting is a technique that a lot of professional institutional money managers use. We didn't have those back then and the 2017 bull market in addition to the flood of market makers -- a lot more institutional money came in. Whether it be the standalone crypto funds or traditional money managers that happened to add a crypto product. They were buying, going long, going short and everything else so we had our customer who would utilize it for shorting. And so in 2018 we said aright -- doors are open, come borrow. As you might imagine, a lot of our first cases were speculators who were borrowing to short. Now my guess is most of them if not all of them were still net long, they still had some net long exposure but they didn't want to sell it for whatever reason, they'll short it as a hedge. Maybe they will long a futures product and short the spot and to hedge or to arb out some exposure. Then the business took off from there, I'm sure the bear market acted as a tailwind but the tremendous growth and interest has taken us to where we are.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan:<\/span><\/strong> But even with the bear market, I think thankfully we know you guys are the 800 pound gorilla because you guys publish what's going on in your book, volumes, all that type of stuff. And you see these numbers are quite eye watering, 1.5 billion dollars worth of origination cumulative, I believe.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> Cumulative but from the most recent report.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan:<\/span><\/strong> Right. Right. 40 percent outstanding loan growth since 3Q. You have about 180 million loans outstanding. When you see these numbers and considering the market sentiment is starting to shift but the growth is still there, what's driving that use case still, relative to other options in the market starting to spring up?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> I have a hypothesis and it's kind one I've held during the 2018 bear market -- look our lending business is doing great in a bear market, what happens in a bull market? What do the speculators, the short guys they go away and maybe the pie is bigger but what happens to our loan book? Do we lose our customer base? And so we were looking at use cases, why are people taking out borrows? And interestingly there is a split between people who borrow bitcoins and people who borrow alts. Bitcoin is predominantly used either for working capital purposes or arbitrage market making purposes. There's almost no speculative on the downside. No people who are thinking the bitcoin prices are going to go to zero. On the other hand if Ether, Lightcoin, XRP some of those alts you will see people who will speculate from time to time who think that they're overvalued mostly because they have they're overvalued relative to Bitcoin. And whenever you see a price pop you'll see you'll see that kind of scenario sort of play out. So I think that any bear in the bull market while the speculators made certainly go away and hopefully they do because they don't get run over on the short squeeze scenario. I think the pie regarding working capital lending gets bigger. I think there'll be a lot more market makers which will need borrow to help and to help settle and do the float transactions that'll be bigger and has actually played itself out. So I'll give you an update even on this new report. So as of March 31 we had one hundred eighty one million. Right. And then we had some but the cutoff date was March 31. What happened first week of April we had Bitcoin price run. Yeah. Price run. And so we were seeing kind of real time like what happens to our loan book. So the bitcoin shorts the little that we had closed out and some of the old guys close out and then in the price run. But then what we saw was we saw more working capital loans come out and then we saw shorts in alts and so shorting into interest in that took off. So here we are on April 23rd. Our loan book is just about quarter billion. So our 250 million up from that one eighty one that we just had just a few weeks ago. And so the hypothesis around \"Hey is it just for shorting?\" Is it's it's turned out to not like us. If it's not reality and that the loan book and businesses like ours should perform continue to perform well even in a rising price environment.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan:<\/span><\/strong> Something else to call out from that recent lending snapshot. The report mentions market makers and high frequency trading firms coming in. What's the profile on these types of shops. Is it more crypto native or is it your more traditional legacy Chicago type operation or a blend of both.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong>&nbsp;It is a combination of both. I think the market makers for the most part are just pure crypto guys. The arb guys they will find pricing and efficiencies in any market that you can possibly find. So you'll you'll see the more that the Chicago guys kind of playing some of that and you know they'll they'll buy they'll go buy the future are short to spot that kind of stuff where they still need access to the out to the spot borrow to be able to execute their strategy.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Thinking about the trading side of the business and we kind of hinted at it earlier in the conversation about how many firms are going electronic they're launching their own GUIs to engage with counter parties electronically. <a href=\"https:\/\/drw.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">DRWs<\/a>, <a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/20\/cumberland-took-a-big-step-to-modernize-their-market-heres-our-conversation-with-its-head-of-otc-bobby-cho\/\" data-v-f87c67ca=\"\">Cumberland<\/a> that <a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/06\/mad-crypto-max-boonen-ceo-of-b2c2-weighs-in-on-tether-news\/\" data-v-f87c67ca=\"\">UK shop B2C2<\/a> has done something similar. Why doesn't your firm feel a need to go that route? How much opportunity is there for you guys to stay traditional OTC as it's been and also not get into new products and new derivatives.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> I think that's for it for us. Our real focus has always been what's missing. What's missing from the landscape of marketing infrastructure that institutional investors are going to come and expect and clearly in 2013 there was no OTC trading desk. And then when we launched our lending business there really wasn't anyone doing what we were doing. And so our heads are much more around the next service the next product as opposed to, Hey let's compete on the technology side with somebody who's been doing this for decades and decades with you know a lot more experience head count.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> What makes a firm you know I think we've talked about this before in the past. What makes a counterparty or a firm hedge fund probably more interested in trading with Genesis in that traditional sort of over Skype wire the money way than electronically. What is the profile of those types of firms and what makes it more advantageous to do that.","<span class=\"speaker\" data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Michae<\/strong>l:<\/span> It's funny. This is a little bit of a carryover from our old second market days. The counterparty is that we deal with. Certainly they're sophisticated certainly there. They have a technology bent to them but they still need to talk to people. They still feel very comfortable picking up the phone and say hey I want to buy 5 million. I want to buy 10 million and while the orders will get routed and we'll put it into the platform electronically there's still tremendous value to them to having that familiar voice on the other end of the line. When you're moving seven figures eight figures at a time and so, for us where we've been really good at is sort of a client relationship. The service level the experience and dealing with the regulated broker dealer. And that's kind of the missing pieces. Am I dealing with you know, do I have any AML KYC concerns about where these bitcoins came from? Or you know are they properly regulated? Now it becomes a much bigger issue the larger the fund you're dealing with because that's a larger compliance team accounting team legal that do a tremendous amount of due diligence on the counter parties before they able to trade with you. And so for a lot of them it's were seen as an extension of them as an execution partner as opposed to a prop trading firm that is trying to scalp you. And so it's much more of a relationship dynamic between us and our counterparty as opposed to say hey these guys are really smart that I'm talking to idea. They're trying to you know to not give me the best price that they can make the most money. So it's much more about how do we have that conversation and that relationship dynamic.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan:<\/span><\/strong> Thinking about how you house all these separate businesses together seems pretty coherent. Is there an advantage to having a lending business, OTC desk, DCG all kind of working together?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> So there's clearly synergies between the trading and the lending side of the business right. Although to Frank's point earlier, the lending business is a business that stands on its own. It does not need the trading business and vice versa. Trading business has clients that lending does not and lending has clients trading does not. But they are very complementary to your point sort of being part of the DCG umbrella. DCG now has one hundred and forty five different companies in the portfolio. Many of them are trading clients. Many of them are lending clients and many of them are both. And so there is sort of that DCG network that we certainly tap when we look to expand our relationships and things like that. And obviously knowing the founders and CEOs really well because their DCG portfolio company certainly helps make it easier on not just on the client prospecting side but on the due diligence side as well knowing that DCG is an equity investor certainly gives us some comfort level on the credit that we would extend on many of these relationships.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> That's interesting. That makes a lot of sense. You mentioned that you guys try to or at least think of your differentiated factor being looking at where the new market's going to be, a year and a half ago it was lending. Well what is it now seven, six years ago it was actually trading crypto itself. What's the next market you're looking at a crash and how are you going to do it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> I think that's where there's a lot of initiatives underway at Genesis. Unfortunately I'm unable to talk about most of them.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Let's zero in on those ones that you can.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> I would say that I think the world the given the competitive nature of sort of OTC markets in general the reason why we started doing prop trading in 2013 was because of the illiquidity of the marketplace. We couldn't, there was zero chance that I would have a buyer of a million dollar worth of bitcoin and a seller of a million dollar with bitcoin within the same hour. Back then it would have been one trade every few hours and we couldn't be like let me call you back and then call somebody two hours later. That just wasn't effecient way to get anything done which force Genesis, our \"SecondMarket\" at the time to have some inventory like we had we had to have some on hand to be able to do transactions right then and there when the client called in over time. Liquidity has certainly improved to the point where I don't really think you need to take a massive position at any kind of given time just to have inventory to trade. I think liquidity will continue to improve. That actually lessens the risk profile of the over-the-counter market making business. If you don't have to carry large amounts of inventory and kind of be susceptible to the price swings that may happen. And so in this world I think the trading business certainly transforms. We're much more of a, we're not quite agency traders but I think directionally I think that's where a lot of the market the OTC guys will end up kind of going in a world in which you're lucky to make one basis point here, two basis points there, like what's the point taking risk right. And then like that I think further furthers a narrative around Genesis being an extension of the client trying to bring about best execution whatever that might.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> So going in the way of some of these multi dealer platforms?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> It could be. And and marrying that obviously with our lending business and having the broker dealer license, having our obviously our bitlicense, having our lending business that you know that is growing significantly will add hopefully three or four different things in my head that'll but some of it will take time but some I think that's what we'll end up at a place where we will. What would Genesis will look like. We'll be a lot more close to what Wall Street institutions the biggest hedge funds are more used to seeing.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> What they're used to working with like in traditional prime broker. Maybe you'll look like in <a href=\"https:\/\/www.instinet.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">Instinet<\/a> or something.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span> <\/strong>I think that's directionally I think that's correct.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> That's interesting.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan:<\/span><\/strong> Frank you mentioned differentiation. Let's talk about competition from the lending side heating up.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> I mean you guys were really the first and then you see it on airlines custodial. Decentralized and <a href=\"https:\/\/defi.network\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">DeFi's<\/a> catching up to you.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan:<\/span><\/strong> He's shaking his head.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> We've all got bit by the DeFi bug over at The Block.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan:<\/span><\/strong> I'm not convinced from an institutional standpoint. I mean it doesn't offer KYC\/AML properties which is a no go from the start.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Do you even see that as a threat in terms of some of these decentralized lending platforms?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> It's much more of a science experiment to me more than I'm fascinated by it and how it turns out. My view on like decentralized exchanges and some of this stuff and this comes from conversations with some institutional accounts it's a little bit, gosh it sounds bad when I put it this way, but institutions need to have somebody to sue. They need to be able to point a legally to a contract and say hey you were supposed to do something and you breached the contract. This idea it's decentralized and so no one is responsible.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan:<\/span><\/strong> We are our own fiduciary, right?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> There is no one or everybody is responsible. It just doesn't work in sort of corporate America. And so in that context of you have a legal contract and relationship between a buyer and seller or a lender and borrower and if something goes wrong and you have to take them the court you need to kind of have that legal venue to be able to point your finger and say you were liable for this that and the other and in the absence of the ability to point to any one person company, it almost falls apart. The whole thing is these guys fear the worst case scenario and kind of build up from there. But the worst case scenario is we can't do anything because nothing is standing behind this, it tends to not work. But, as that I'm fascinated by how this whole thing works. And I think it could potentially work at the retail level. And frankly 80, 90 percent of crypto is still retail right. That's a big enough market for folks to kind of disrupt. So I'm watching from the sidelines with more like keen interests more than anything else.","<span class=\"speaker\" data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Ryan<\/strong>:<\/span> A fair point.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> To your point about platforms, the other platforms that are more of the custodial centralized model. I think that's certainly many of them or most of them play in a different market than we do they onboard retail clients and they'll take a little bit here a little bit there and sort of try to aggregate bitcoins or whatnot and make a big loan to an institution. We certainly work with them on certain instances if they have a well priced loan available for sale, for borrow. We will work with them and so were much more partners in a lot of different ways and like direct competitors. And frankly, that's no different than the OTC side. I mean Circle we've traded each other for years and years and years.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> They're some of your biggest counterparties?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> Yes. I actually think that in many ways it would hurt us if they went away. There's not that many counterparty you feel comfortable trusting a five million dollar trade with to settle properly. And so years of working together in that trust in blockchain is still incredibly important in the world of business. Right.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> What do you think over the past seven years that you've been doing this the toughest trade has been or the worst trade.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> Oh gosh. It is when you have a very good client somebody who's bought. Call it 50, 100, 200 million dollars worth of bitcoin who suddenly comes to you and wants to buy five million dollars of <a href=\"https:\/\/www.coinbase.com\/price\/bitcoin-gold\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">bitcoin gold<\/a>. Right. It is illiquid, all volatile, thinly traded asset. But it is one of your best clients and you have to try to do your best to make a fair market that wouldn't offend the client. Right. Because in reality you're just like I don't even know where to price this thing. Right. But like you also don't want to offend the client.","<span class=\"speaker\" data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Ryan:<\/strong><\/span> Can you even ask why?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Like, why do you want to buy this thing.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> I'm not the guy that was on the phone but I know it's most of the time it's OK. Here's the price. Right. It should be no different than it really was a trade that you do but trying to fill that without quoting some crazy spread, less about Genesis making money but it's more about Genesis not losing money in that scenario because your ability to the hedge Bitcoin Gold at a five million dollar clip is a challenge but that would be an easy.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> I want to know these people trying to buy five million dollars worth of size. That's insane.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> This is not this year as you might imagine.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> But during the crazy time when Bitcoin Gold was four hundred dollars. Right. Like the halcyon days of this market that kind of hype.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> But back to your earlier point Ryan about other competition. What I think happens is that as you've seen spreads come down on the OTC side. Rates are going to come lower and tighter on the lending. It's already starting to happen it's more competition and I'm not. You know that's just a natural progression of the market. Again I don't think it's a bad thing for the overall space. What I do think it happens and I'm a little wary, is that loans become mispriced. Is that risk gets mispriced relative to the counterparty credit and it'll be the mini version of like the subprime crisis happening at a much bigger, at a faster pace because these companies are smaller and so they can make decisions faster. And so you'll see sometimes firms that will like offer high rates like introductory rates just to buy customers. Right. And then you're like OK well what's the other side will you start to lend cheaper. Than you should maybe you're collateral management isn't great. You start making some loans that are unsecured or uncollateralized and they want to write a big ticket and so they start chasing some of that. I think you're going to see it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> What does it look like? If we're going to liken it to subprime That's got to be some level of devastation.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span> <\/strong>At our world level, yes it would be. And presuming that the lender is somebody of some size you know where we are maybe it's a blip in the curve but as the marketplace kind of continues to grow and I think competition heats up and you start just buying customers with cheap rates. All right. I could 100 percent see the moving down the credit cycle a little bit and you start lending to people at rates you probably shouldn't. I don't know why this wouldn't happen in crypto when it has happened in every other financial services market. On the other hand for us like I think we have 75 to 100 borrowers right now. So our average loan is call it three million dollars four million dollars somewhere in that area. I actually don't think our addressable universe for the super prime credit is that much bigger. Sure. I don't think this number is a thousand counterparties that we could possibly lend to given who we want to lend to and given the size of the space not the space size is going to grow and hopefully we continue to attract those guys. Chasing that 101st borrower, 102nd borrower just to acquire customers. That's how you lose. So I care much more about risk adjusted returns than the overall size of the portfolio or what the origination numbers might be. I'm very mindful of that.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan:<\/span><\/strong> The lending business model itself is quite simple. I mean there's not that many levers to pull to compete against. I guess the market's still in the early days of figuring out how to rationally price risk and counterparty risk. You mentioned risk adjusted returns have those tightened recently? What are you guys seeing on that front?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> Yeah I think there are counterparties that come to us and say hey so and so's lent offering me 2.5% uncollateralized Bitcoin loan. Can you beat it? No. We have to be comfortable.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Who are these people giving those giving those terms out.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span> <\/strong>I don't know, I don't know them. I guess some of them are exchanges, right? To try to get more exchange trading volume, providing some credit to their customers. That's something we just can't chase, we can't make that work. Even if I had a lender at 1 percent, which I don't, making an unsecured loan at two and a half percent doesn't make any sense.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> I think doom and gloom, potential devastation is a great place to end.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> I'm not guaranteeing that. That's not what I said. But potentials as to a growing market and mispriced lending.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan:<\/span><\/strong> Let's end on a positive note actually.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Yeah sure why not.","<span class=\"speaker\" data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Ryan:<\/strong><\/span> Market sentiment shifting.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Is someone going to bring out some booze? What's the positive now?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan:<\/span><\/strong> Just shifts in market sentiment. How has that impacted the business? You gave us some of the numbers.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> All it really takes is a three to five percent move to get people fired up again.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan:<\/span><\/strong> Right.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> I feel like once we start getting fired up it's not going to stop.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> I think that's right. And look, there are some people that are still calling this move from three to five a dead cat bounce. They'll still feel that way.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Where do we need to get to where we realize that we're over that hump you think? 6K?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Michael:<\/span><\/strong> Yeah I think sixty two hundred, whatever the big support level was in 2018, we can kind of get through that. There might not be much until like 10. People remain bullish. I don't know anybody who even if they sold their bitcoin that are no longer bullish about the asset class regardless. And I feel much better infrastructure wise about where we are in 2019 than we were in 2017. So hopefully entrepreneurs are smarter, more companies are entering the space and we're much more ready to kind of handle institutional demand the next time around.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Yeah keep out Flyod Mayweather... Michael thank you so much for joining us.","We'd like to take a minute to thank our sponsor <a href=\"https:\/\/cash.app\/\" data-v-f87c67ca=\"\">Cash App<\/a>. Cash App has been the number one in finance on the App Store for almost two years. It was the first major peer to peer payments app to support bitcoin and it's still the fastest and easiest way to onramp VR. No more waiting five days for your ACH transfer to come through. With Cash App you can buy Bitcoin instantly. When you're ready to take full ownership of your private keys just use Cash App to scan an external wallet's QR code. It's really that simple. Cash App also comes with standard banking features like direct deposits and others your bank would never even consider like Cash Card. A customizable debit card that lets you instantly save every time you use it, at Lyft, Whole Foods, Chipotle, Chick-fil-A, Starbucks, Dunkin, local coffee shops, and a whole lot more. Download Cash App today from the App Store or Google Play. And thanks for listening.","Subscribe to <strong data-v-f87c67ca=\"\">The Scoop<\/strong> wherever you listen:"," 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Michael<\/span> Alright","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Chipotle","content":"LOCATION"},{"type":"1.5 billion dollars","content":"MONEY"},{"type":"Barry Silbert","content":"PERSON"},{"type":"Spotify","content":"LOCATION"},{"type":"Whole Foods","content":"ORGANIZATION"},{"type":"Dunkin","content":"LOCATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Chicago","content":"LOCATION"},{"type":"CME","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Gox","content":"PERSON"},{"type":"Lightcoin","content":"LOCATION"},{"type":"Michael Moro","content":"PERSON"},{"type":"Ryan Todd","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"eighty\/ninety dollars","content":"MONEY"},{"type":"Barry","content":"PERSON"},{"type":"Ether","content":"LOCATION"},{"type":"Chick","content":"ORGANIZATION"},{"type":"60 percent","content":"PERCENT"},{"type":"March 31","content":"DATE"},{"type":"CFD","content":"ORGANIZATION"},{"type":"Cumberland","content":"LOCATION"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"five million dollars","content":"MONEY"},{"type":"2014","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"ACH","content":"ORGANIZATION"},{"type":"three million dollars four million dollars","content":"MONEY"},{"type":"2011","content":"DATE"},{"type":"Frank","content":"ORGANIZATION"},{"type":"2012","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"two million dollars","content":"MONEY"},{"type":"Google","content":"ORGANIZATION"},{"type":"Genesis Trading \/ Genesis Capital","content":"ORGANIZATION"},{"type":"2.5%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"first week of April","content":"DATE"},{"type":"April 23rd","content":"DATE"},{"type":"200 million dollars","content":"MONEY"},{"type":"early 2018","content":"DATE"},{"type":"Alpaca Socks","content":"ORGANIZATION"},{"type":"80 dollars","content":"MONEY"},{"type":"FINRA","content":"ORGANIZATION"},{"type":"Shitcoin","content":"PERSON"},{"type":"Web today","content":"DATE"},{"type":"Ryan","content":"PERSON"},{"type":"Instinet","content":"ORGANIZATION"},{"type":"1 percent","content":"PERCENT"},{"type":"80 percent","content":"PERCENT"},{"type":"today","content":"DATE"},{"type":"Genesis Global Trading","content":"ORGANIZATION"},{"type":"100 percent","content":"PERCENT"},{"type":"America","content":"LOCATION"},{"type":"March of last year","content":"DATE"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"multimillions of dollars","content":"MONEY"},{"type":"OTC","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Michael","content":"PERSON"},{"type":"Overstock","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Skype","content":"ORGANIZATION"},{"type":"90 percent","content":"PERCENT"}],"hashtag":[],"authors":["Frank Chaparro","Ryan Todd","The Block"]}