{"summary":"DefiDollar has scored $1.2 million in new funding in a round led by Standard Crypto, Accomplice, and Divergence Ventures. DefiDollar operates a stablecoin backed by an index of stablecoins.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/82682\/defidollar-stablecoin-usd-funding-round","publishDate":"2020-10-28T18:06:43","id":865,"type":null,"title":"DefiDollar scores $1.2 million in new funding to build a USD token backed by a stablecoin index","category":["THE BLOCK"],"content":["Just when you thought the DeFi world couldn't get more meta, along comes a stablecoin made up of, well, stablecoins: DefiDollar.&nbsp;","The project, which traces its origins to HackMoney, announced Wednesday that it raised $1.2 million from a group of professional trading firms and venture capitalists. The deal was led by Standard Crypto, Accomplice, and Divergence Ventures. Other investors include CMS Ventures, Ledger Prime, and Altonomy.&nbsp;","The fundraise comes after a period of sustained growth in the stablecoin market, which has seen total supply of crypto dollars soar from $5 billion at the beginning of 2020 to beyond $20 billion, as per <a href=\"https:\/\/www.theblockcrypto.com\/linked\/81422\/stablecoin-supply-has-surged-past-20-billion-driven-by-derivatives-market\" data-v-f87c67ca=\"\">data<\/a> compiled by The Block.","<iframe title=\"Total Stablecoin Supply\" src=\"https:\/\/www.theblock.co\/data\/open-finance\/stablecoins\/total-stablecoin-supply-daily\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","\"The stablecoin market has grown tremendously — both in scale of issuance and in quantity of issuers,\" said Adam Goldberg of Standard Crypto. \"And with that growth also comes different shapes of risk that any holder of a stablecoin is implicitly taking. With DeFi Dollar, a user can hold an index of stablecoins in a single token (DUSD) that mitigates the risk of any specific underlying stablecoin losing its peg, all while maximizing yield.\"","\"DUSD is an index of stablecoins, hence it reduces the exposure you have if one holds a single stabelcoin,\" said co-founder Siddharth Jain.&nbsp;","For instance, Jain explained that \"if a particular stablecoin loses its peg and has a bank run on its reserves you lose 100% of your value stored in that.\"","He went on:&nbsp;","\"While by holding an index your risk is not only capped to the assets’ weight in the index, but we have some novel ways to reduce the deficit. These will be covered soon in greater detail when we unveil or stability module.\"","To be sure, users are subject to the risk of the protocol itself. Jain said that Quantstamp and Peckshield have conducted audits of the project.","Stablecoins have long been a darling of crypto's high-speed traders, given they allow traders to move in between cryptos and limit their exposure to price swings. They also use stablecoins as collateral to trade on certain exchanges. DUSD's mechanisms aim to keep a peg that's closer to $1.&nbsp;","As <a href=\"https:\/\/www.theblockcrypto.com\/post\/76776\/coin-metrics-nate-maddrey-podcast\" data-v-f87c67ca=\"\">indicated<\/a> by CoinMetrics, stablecoins aren't always stable and have ventured away from their $1 pegs, especially during periods of heightened volatility. Here's how DefiDollar's arbitrage mechanics work:&nbsp;\"If DUSD is trading &gt; $1, an arbitrageur will deposit $1 worth of assets to mint DUSD and sell it in the open market until the price has been driven down. Similarly, if DUSD is trading &lt; $1, arbitrageurs will buy it from open markets to redeem it for $1 from the protocol.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CMS Ventures","content":"ORGANIZATION"},{"type":"crypto dollars","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Standard Crypto, Accomplice","content":"ORGANIZATION"},{"type":"Altonomy","content":"ORGANIZATION"},{"type":"Siddharth Jain","content":"PERSON"},{"type":"DUSD","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"$1.2 million","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"CoinMetrics","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Adam Goldberg","content":"PERSON"},{"type":"$20 billion","content":"MONEY"},{"type":"Jain","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Peckshield","content":"PERSON"},{"type":"Standard Crypto","content":"ORGANIZATION"},{"type":"Divergence Ventures","content":"ORGANIZATION"},{"type":"2020","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}