{"summary":"Sam Bankman-Fried admitted he had &quot;embarrassingly little knowledge&quot; of his firm&#x27;s financial status.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191995\/sam-bankman-fried-takes-aim-at-ftx-ceo-john-ray-in-new-interview","publishDate":"2022-12-05T05:00:23","id":8654,"type":null,"title":"Sam Bankman-Fried takes aim at FTX CEO John Ray in new interview","category":["EXCHANGES"],"content":["Sam Bankman-Fried is picking a fight with the new CEO of FTX, the crypto exchange he co-founded.","The exiled former exchange boss claims FTX CEO John J. Ray III has been icing him out since he took the helm at the beleaguered crypto company in November.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> Ray was appointed as the new head of the embattled FTX after it filed for Chapter 11 bankruptcy protection.<\/span>","“John Ray and his team do not communicate with me. They have not responded and he has not responded to a single message I've sent him,” Bankman-Fried said. “His team does not in general work with me or, you know, care about what I have to say.”","The former FTX CEO spoke on “The Scoop,” The Block’s <a href=\"https:\/\/megaphone.link\/BLOCK7074136408\" data-v-f87c67ca=\"\">podcast<\/a> hosted by Frank Chaparro, who conducted the nearly <a href=\"https:\/\/www.theblock.co\/post\/192005\/2-hour-sit-down-with-Sam-Bankman-Fried-on-the-FTX-scandal\" data-v-f87c67ca=\"\">two-hour interview<\/a>. The wide-ranging interview covered Bankman-Fried’s involvement with his Alameda Research trading firm, his dealing with policymakers and whether FTX might have quietly funneled money to Alameda.","In response to a question about Ray and his team, he suggested Ray may be making false statements.","“There have been a lot of statements that have been made that have been put on legal record that I knew to be false,” Bankman-Fried said. “I don't know if they were intentionally lying or if it was just an honest mistake because of people not consulting with anyone who knew where any of these records were. But there have been cases where, you know, it's been said X, Y or Z did not exist. And I am staring at a copy of X, Y, Z, and none of my emails have been returned.”","Ray, who oversaw Enron’s bankruptcy, <a href=\"https:\/\/www.theblock.co\/post\/188187\/the-ftx-bankruptcy-filings-are-a-doozy-we-bring-you-the-highlights\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">lambasted<\/span><\/a> FTX in court filings, saying the firm was in the hands of “inexperienced, unsophisticated and potentially compromised individuals.” The company’s financial situation is the worst Ray has seen in his career, he noted.","Bankman-Fried stepped down from FTX when the company filed for bankruptcy protection in Delaware last month. The former CEO’s crypto empire was once valued at $32 billion, and now Bankman-Fried says he has roughly $100,000 left in his bank account.","The former FTX CEO has been on a media marathon in the weeks since his company collapsed, talking with the press, posting to social media and joining audio chatrooms to tell his side of the story.","Bankman-Fried pushed back on claims by Ray that FTX lacked financial controls. Ray said in bankruptcy filings that FTX didn’t know how much money it owed customers or even how many employees worked at the firm. He also noted FTX had a special exemption for Alameda on its platform, and lacked proper corporate governance like a functioning board of directors.","“I would dispute the claim that there is zero financial controls. I completely agree that there were places in which there were very poor controls and that those places were critical and that that was really bad in terms of zero financial controls,” Bankman-Fried said. “I think it's pretty hard if you try and take over a company and refuse to talk with anyone who was involved in running that company to, in a short period of time, know where any of the relevant data would be or where any of the relevant policies or procedures would be, or, you know, what books or records there were.”","Ray has said he isn’t speaking with Bankman-Fried. The new FTX chief executive recently <a href=\"https:\/\/www.theblock.co\/post\/190999\/ftx-ceo-stresses-bankman-fried-ellison-no-longer-involved-in-operations\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">told<\/span><\/a> employees that Bankman-Fried and his inner circle are not involved in the company.","Bankman-Fried did concede that he had “embarrassingly little knowledge” about the financial status of FTX before its implosion last month. But he disputed comparisons to the infamous Ponzi scheme operator Bernie Madoff, saying FTX was a “real business” before it fell apart.","“I had embarrassingly little knowledge about what was going on. There are a lot of things that I had to look up when things started going south, you know, at the beginning of November, that I don't think I should have had to look up,” Bankman-Fried said. “There are a lot of failures of oversight on many dimensions there. But I do think, like, FTX was a real, is a real business that was making real profit.”","At the heart of the FTX collapse is the firm’s relationship with Alameda Research. The company’s downfall began when Binance, a rival exchange, announced it would sell much of its FTT, which is FTX’s native utility token. Former Alameda Research CEO Caroline Ellison <a href=\"https:\/\/twitter.com\/carolinecapital\/status\/1589287457975304193\" data-v-f87c67ca=\"\">offered<\/a> to buy the tokens from Binance at $22, but it was too late. The blunder sent the token price plummeting, and FTX filed for bankruptcy protection within a week.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Bankman-Fried has dodged questions about how closely involved he was with Alameda’s decision-making. He stepped down as CEO of the company in 2021, but says he had been distancing himself even earlier over concerns about a conflict of interest.","Bankman-Fried didn’t say whether a top employee could have built a system that would allow Alameda to borrow money from FTX. He and his inner circle <a href=\"https:\/\/www.reuters.com\/article\/fintech-crypto-ftx-hole-idCAKBN2S2023\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">reportedly<\/span><\/a> had a “backdoor” in FTX’s system that allowed him to alter financial records without alerting outside auditors, although Bankman-Fried said he wasn’t sure “what people are referring to when they talk about the backdoor.”","“Anything's possible,” Bankman-Fried said. “I was under the impression that Alameda was over-collateralized at the very least on FTX. … I don't think that there was, like, intentionality to have a, you know, an infinitely big position there or anything.”","Bankman-Fried didn’t clearly answer a question about whether FTX loaned funds to Alameda from customers who had spot positions on the platform. He said he did not know the “technological details of the system” and was unsure if his answer was correct.","“That sort of transfer has resulted over time from a significant amount of dollars being sent from customers straight to Alameda Research, never hitting FTX in the first place,” Bankman-Fried said.","“I don't believe that that was coming from Alameda's primary account,” Bankman-Fried added. “I believe it was coming from a stub account that was specifically meant to be a ledger for wire transfers that customers had sent.”","Policymakers in Washington did ask Bankman-Fried about the relationship between FTX and Alameda, the former CEO said. The questions did not, however, pertain to credit as far as Bankman-Fried can remember.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“So there were lots of inquiries about the relationship between FTX and Alameda,” Bankman-Fried said. “[What] I do remember being asked about was trading patterns. Like, what I do remember being asked about was from the perspective of market manipulation, from the perspective of order book liquidity, from the perspective of revenue.”","Lawmakers and regulators are taking a closer look at FTX and Bankman-Fried in the wake of the firm’s implosion. Bankman-Fried had lobbied for a digital commodities bill in Congress and had filed an <a href=\"https:\/\/www.theblock.co\/post\/186673\/ftxs-cftc-application-to-offer-direct-trading-is-dead\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">application<\/span><\/a> with the Commodity Futures Trading Commission for FTX to offer direct trading.","Several House and Senate committees have arranged hearings into the company, and the Securities and Exchange Commission and CFTC are launching <a href=\"https:\/\/www.wsj.com\/articles\/sec-investigates-crypto-platform-ftx-11668020379\" data-v-f87c67ca=\"\">their own inquiries<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Enron","content":"ORGANIZATION"},{"type":"$32 billion","content":"MONEY"},{"type":"Delaware","content":"LOCATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"Ray","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"last month","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Commodity Futures Trading Commission for FTX","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"$22","content":"MONEY"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Bernie Madoff","content":"PERSON"},{"type":"Fried","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"$100,000","content":"MONEY"},{"type":"Alameda","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"John J. Ray III","content":"PERSON"},{"type":"John Ray","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}