{"summary":"Andreessen Horowitz-backed dYdX is rolling out a decentralized version of perpetual bitcoin contracts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/62368\/dydx-a16z-decentralized-bitcoin-perpetual-contracts","publishDate":"2020-04-20T11:28:55","id":8664,"type":null,"title":"A16z-backed dYdX launches decentralized market for bitcoin perpetual contracts","category":["THE BLOCK"],"content":["Andreessen Horowitz-backed dYdX is rolling out a decentralized version of one of the most popular trading products in the digital asset market, the firm revealed exclusively to The Block.&nbsp;","On Monday, the firm began the alpha launch of a new market for bitcoin perpetual contracts – the first time the firm has supported a non-Ethereum asset. It is also the first time that a perpetual contract has gone live on a decentralized exchange, the firm said.","Founded in 2017, dYdX has raised $12 million from a16z, Polychain, and 1confirmation.","Perpetual contracts, also known as perpetual swaps, were pioneered by centralized exchange BitMEX. Since BitMEX first launched in 2014, several centralized exchanges have launched markets for perpetual swaps tied to bitcoin. <a href=\"https:\/\/www.bitmex.com\/app\/perpetualContractsGuide\" data-v-f87c67ca=\"\">Perpetual swaps<\/a> offer exposure to bitcoin through a future contract with no future date of expiration or settlement.","dYdX's contract will be tethered to the price of the underlying asset and will be cash-settled in USDC. It will run off a separate order book from the existing Ethereum markets currently running on dYdX. Users will be able to trade with up to 10x leverage, according to dYdX.","The market for various futures tied to bitcoin has soared as more and more exchanges support their products. Indeed, BitMEX <a href=\"https:\/\/www.theblockcrypto.com\/post\/61236\/bitmex-bitcoin-futures-dominance-binance-huobi-okex\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">has ceded its bitcoin futures markets dominance<\/a> to rivals as Binance, Huobi, and OKEx inch ahead.&nbsp;Data from analytics provider Skew indicates that the crypto derivatives exchange's daily BTC futures trading volume (perpetual swaps included) dropped significantly on March 14.&nbsp;","","","BitMEX specifically has long been haunted by an overload problem of its systems. Although BitMEX has improved its capacity, more recently the firm was criticized for an outage on its platform during the March 12-13 plunge in bitcoin's price. The lack of transparency around liquidation and socialized losses—when an exchange has to eat into the profits of certain traders to cover losses—has drawn criticism as well.","Similarly to how its margin trading product works, liquidations on dYdX are handled by other market participants,&nbsp;according to Zhuoxun Yin, head of strategy and business operations at the firm. In addition, the insurance fund account and its activities will be publicly auditable. Deleveraging that occurs will be public and auditable on-chain.","\"On centralized exchanges, the exchange does the liquidation,\" Yin explained. \"On dYdX, any account may liquidate any other account that is liquidatable.\"","\"The fact that anyone is able to perform the liquidation, and it’s verifiable on chain means that it is quite different to centralized exchanges,\" he added.&nbsp;","Wintermute Trading will act as both a liquidator and a liquidity provider on the platform.&nbsp;","Evgeny Gaevoy, Wintermute's founder and CEO, said in a phone interview with The Block that the firm wants an orderly and predictable market and so it is incentivized to liquidate prior to any socialization of losses.&nbsp;","\"We never want the losses to be socialized,\" he said.&nbsp;","Still, other questions hang over the infant market, including whether it will be able to build up a sufficient amount of volumes and liquidity.&nbsp;","\"I am cautiously optimistic,\" said Su Zhu, co-founder of crypto hedge fund Three Arrows Capital. \"[It] will be interesting to see if the liquidity will be good enough to trade on it, Zhu said, referring to the ease at which a trader can move into and out of a position.&nbsp;","dYdX's Yin said liquidity is something the firm will be closely watching in the first phase of the launch. A few core partners and market makers will trade on the platform over the next few weeks. From there, dYdX is aiming for a public launch in mid-May.&nbsp;","To be clear, from a volume standpoint dYdX has fared well relative to other non-custodial exchanges. Daily volumes on its spot exchange averaged at approximately $6.5 million in March.","","","<em data-v-f87c67ca=\"\">Source: Tom Schmidt, Dune Analytics<\/em>","Its market share in the DEX space has fluctuated between 20% and 60% since the beginning of March.","","","<em data-v-f87c67ca=\"\">Source: Tom Schmidt, Dune Analytics<\/em>","The firm is hoping the introduction of a bitcoin product will further boost liquidity on the platform and overall interest in decentralized finance.&nbsp;","\"Being Ethereum-centric was the right way to start, but it is hard to scale beyond the Ethereum user-base,\" said Yin, adding:","\"We can't be in our DeFi bubble forever for us to be successful.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Polychain","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"$12 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Tom Schmidt","content":"PERSON"},{"type":"60%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Yin","content":"PERSON"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Zhuoxun Yin","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"13","content":"DATE"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"Su Zhu","content":"PERSON"},{"type":"March 14","content":"DATE"},{"type":"March 12","content":"DATE"},{"type":"Zhu","content":"PERSON"},{"type":"$6.5 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Wintermute Trading","content":"ORGANIZATION"},{"type":"mid-May","content":"DATE"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Huobi","content":"PERSON"}],"hashtag":["BITMEX","DERIVATIVES"],"authors":["Frank Chaparro","The Block"]}