{"summary":"Government shutdown or not, plaintiffs&#x27; lawyers haven’t stopped filing new crypto lawsuits. This week we look at three new complaints, one involving lost","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/7180\/can-mining-equipment-preorders-qualify-as-securities","publishDate":"2019-01-11T16:00:33","id":8669,"type":null,"title":"Can mining equipment preorders qualify as securities?","category":["LEGAL"],"content":["Government shutdown or not, plaintiffs' lawyers haven’t stopped filing new crypto lawsuits. This week we look at three new complaints, one involving lost crypto and a demand for a fork (the software kind), another that says that pre-sold mining hardware contracts were actually securities, and last but not least artificial intelligence on the blockchain (but not so much, it turns out). [As always, Rosario summaries are “NMR” and Palley summaries are “SDP”]","<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario [twitter: <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>] and Stephen Palley [twitter: <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>]. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.&nbsp;<\/em>","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Roberts et al. v. Obelisk, Inc., 3:18-cv-02898 (D.S.D.Cal, December 28, 2019) [SDP]<\/strong><\/em>","Copy of <a href=\"https:\/\/www.scribd.com\/document\/397202241\/Roberts-v-Obelisk\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">original state court lawsuit<\/a>","<a href=\"https:\/\/www.scribd.com\/document\/397202232\/Obelisk-Notice-of-Removal\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Notice of removal<\/a>","Are contracts for delivery of mining equipment investment contracts that require state law securities registration? According to plaintiffs in this new lawsuit, the answer is yes. Whether a court agrees with that position remains to be seen of course.","This putative class action was first filed in state court in California and removed to federal court on December 28, 2018. (What’s this whole removal thing about? We’ve written about previously, <a href=\"https:\/\/medium.com\/crypto-caselaw-minute\/crypto-caselaw-minute-10-18-2018-3a996f24ec8b\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">as in this earlier post<\/a> — see in particular the discussion <em data-v-f87c67ca=\"\">Greenwald v. Ripple Labs<\/em>).","At issue is mining equipment to be used for the Siacoin and Decred cryptocurrencies. Plaintiffs say that the lawsuit “arises out of a scheme by Defendants to raise millions of dollars through the unregistered sale of Mining Appliance Preorders to retail investors” in violation of state consumer protection and securities laws.","According to the lawsuit, defendants sold preorders to the plaintiffs for specialized mining hardware that were advertised as (1) meeting specifications that would allow buyers to make a lot of money once delivered and (2) having a money-back guarantee if they weren’t delivered on time or didn’t meet specifications. This all took place against a backdrop of the cryptocurrency bull-market in 2017.","Plaintiffs say that the equipment wasn’t delivered on time and when it finally arrived didn’t meet specifications in that the actual hash rates (the speed at which computations are performed) were too low to allow the buyers to make any money mining. In spite of this, refunds were refused, plaintiffs allege.","The lawsuit alleges that the presale was really an unregistered securities offering under both California and Massachusetts law, and that defendants also violated consumer protection laws of both states.","With respect to the securities claim, plaintiffs say they","<em data-v-f87c67ca=\"\">“provided consideration … in exchange for their Preorders. Preorder purchasers reasonably expected to derive profits from their Preorders of the Mining Appliances, and Defendants themselves have frequently highlighted this profit motive. Finally the development of the Mining Appliances, and the profits that investors expected to derive therefrom, were, and are, based entirely on the technical, managerial, and entrepeneurial efforts of Defendants[.]\"<\/em>","Plaintiffs later explicitly allege that the pre-sale contracts were securities (using the Howey Test) that should have been registered as such and weren’t. (You might wonder — we did — why if this alleges California state court securities law violations they didn’t use the more flexible risk capital test, which is California law. I don’t know either).","Plaintiffs also allege violations of consumer protection laws related to the alleged failure to deliver equipment on time and per specification, or to provide refunds when asked. The Complaint is full of written promises to provide refunds, including a statement by one of the defendant that if they failed to meet a specific deadline they were “legally required to provide a refund.”","If I am handicapping this lawsuit, the consumer protection claims look like they may have more teeth and might be more likely to survive motion practice. The securities claim looks more vulnerable to attack and is a place where I’d expect defense counsel to focus. It may survive motion to dismiss, but pre-selling mining equipment on its face sounds somewhat far afield from an investment contract).","<em data-v-f87c67ca=\"\">The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Image credit: <\/span><\/i><a href=\"https:\/\/www.shutterstock.com\/g\/Aline+Fortuna?sort=popular\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Shut<\/span><\/i><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">terstock<\/span><\/i><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">\/Alina Fortuna<\/span><\/i><\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Greenwald","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"Roberts","content":"PERSON"},{"type":"Alina Fortuna","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Nelson Rosario [","content":"PERSON"},{"type":"Massachusetts","content":"LOCATION"},{"type":"California","content":"LOCATION"},{"type":"Mining Appliances","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Palley","content":"PERSON"},{"type":"December 28, 2019","content":"DATE"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"v. Obelisk, Inc.","content":"ORGANIZATION"},{"type":"December 28, 2018","content":"DATE"}],"hashtag":[],"authors":["Stephen D. Palley","The Block"]}