{"summary":"Chinese cryptocurrency exchange FCoin may not be able to pay back around 7,000 to 13,000 BTC (around $67 million to $125 million) to its users as the platform went default.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56191\/cryptocurrency-exchange-fcoin-expects-to-default-on-as-much-as-125m-of-users-bitcoin","publishDate":"2020-02-17T09:44:00","id":867,"type":null,"title":"Fcoin expects to default on as much as $125M of users&#x27; bitcoin","category":["EXCHANGES"],"content":["Chinese cryptocurrency exchange FCoin may not be able to pay back around 7,000 to 13,000 BTC (around $67 million to $125 million) to its users as the platform went default.&nbsp;","In a <a href=\"https:\/\/fcoin.zendesk.com\/hc\/zh-cn\/articles\/360043503273-FCoin%E7%9C%9F%E7%9B%B8\" data-v-f87c67ca=\"\">tell-all blog post<\/a> titled \"FCoin Truth,\" the exchange founder and the former Huobi CTO Jian Zhang said the default was triggered neither by external hack nor scam, but a \"data error\" and a \"decision error.\"&nbsp;","\"The biggest problem that FCoin currently faces is not the problem that the system cannot be restored, but the problem that the capital reserve cannot be paid by users. The internal problems and technical difficulties we face are the results of financial difficulties,\" Zhang wrote in the post.&nbsp;","The founder said he will continue to handle withdrawal requests via email and expect the process to continue for 2 to 3 months. Meanwhile, he is planning to start a new project and pledged to use profits from the project and his personal funds to cover FCoin users' losses.&nbsp;","\"I will be responsible for this till the end of my life,\" said Zhang.&nbsp;","Launched in May 2018, FCoin was able to quickly accumulate eyebrow-raising volumes through a <a href=\"https:\/\/hackernoon.com\/the-death-of-fcoin-a-tale-of-bad-token-design-261d64a8116f\" data-v-f87c67ca=\"\">new business model<\/a> named \"trans-fee mining.\"","Under the scheme, FCoin issued FT tokens and distributed 51% of them publicly by reimbursing transaction fees. Users were incentivized to transact as frequently as possible since the platform reimbursed 100% in FT tokens of the transaction fees they paid.&nbsp; 80% of the exchange's daily revenue from transaction fees were then paid back to users.&nbsp;","At one point in June 2018, around a month after the exchange went live, CoinDesk reported that its daily trading volumes hit over $5.6 billion, overshadowing the Top 10 exchanges on CoinMarketCap at the time.&nbsp;","According to the blog post, in the first few months following the launch, Zhang personally gained around $150 million to $200 million, and on some days the revenue payouts could be as high as 6,000 BTC.&nbsp;","However, at that time, the platform was, in fact, unable to build out a solid technical platform that could sustain the hype, Zhang admitted in the blog post.","Towards mid-2018, FT token price took a huge dip, stirring increasing criticism from the user community. To quell users' anxiety, Zhang decided to use company funds plus all its personal gains to buy back FT tokens. However, since some users had been exploiting FCoin's weak backend system to receive more dividends, the buyback continued to drain the company's and the team's personal funds until the FCoin platform was shut down recently.&nbsp;","As a last restort, Zhang asked Huobi founder Lin Li for help, although the latter declined Zhang's request.&nbsp;","\"I told him the real reason (but not as detailed as this article), and then we explored possible rescue solutions. The results were exactly the same as I expected. Because I know that if Li Lin agreed to rescue, Huobi would not have today or tomorrow.&nbsp;If I were in his position that day, I should and would have made the same decision,\" Zhang wrote.&nbsp;","Last week, the exchange <a href=\"https:\/\/fcoin.zendesk.com\/hc\/en-us\/articles\/360043178633\" data-v-f87c67ca=\"\">announced<\/a> that it had destroyed all of the unissued FT tokens and decided to burn all 720 million tokens held by the team. It also began the email withdrawal process on Thursday last week.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zhang","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"Thursday last week","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$5.6 billion","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$67 million","content":"MONEY"},{"type":"51%","content":"PERCENT"},{"type":"100%","content":"PERCENT"},{"type":"$125 million","content":"MONEY"},{"type":"Huobi CTO Jian Zhang","content":"PERSON"},{"type":"Zhang","content":"PERSON"},{"type":"June 2018","content":"DATE"},{"type":"Li Lin","content":"PERSON"},{"type":"$200 million","content":"MONEY"},{"type":"May 2018","content":"DATE"},{"type":"Lin Li","content":"PERSON"},{"type":"Huobi","content":"PERSON"},{"type":"$150 million","content":"MONEY"}],"hashtag":[],"authors":["Celia Wan","The Block"]}