{"summary":"95% if BIT Mining&#x27;s Q2 revenues came from BTC.com but that was more just an accounting trick as BTC.com treats all block rewards as revenue.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/114887\/bit-mining-q2-revenue-btc-bitcoin","publishDate":"2021-08-18T21:46:34","id":8671,"type":null,"title":"BIT Mining nets $445 million in Q2 revenues thanks to BTC.com","category":["MINING"],"content":["U.S.-listed bitcoin mining firm BIT Mining has reported $443 million in Q2 revenues – a whopping 150 times growth over the first quarter – thanks to the acquisition over mining pool BTC.com.","Previously known as <a href=\"https:\/\/www.theblockcrypto.com\/daily\/96817\/chinese-state-owned-capital-500-bitcoin-mining\" data-v-f87c67ca=\"\">500.com<\/a>, Shenzhen-based BIT Mining said in an unaudited earnings report Tuesday that 95% of the Q2 revenues came from BTC.com, which it acquired from Bitmain earlier this year.","This is the first time a crypto mining pool's financial numbers are released as part of a public mining firm's earnings report, which also reflects how mining pools was accounted for their revenues in the U.S.","Per BIT Mining's report, BTC.com's $422.8 million in revenues from April 15 to June 30 essentially referred to all the block rewards the pool had received from the bitcoin blockchain before distributing almost all of them to its miner customers.","Mining pools are hashing power aggregators. After mining blocks, they distribute the block rewards pro rata with each miner customer's hash rate contribution. They make money by charging roughly a 2.5% handling fee. BTC.com operates in a Full Pay Per Share (FPPS) model, which means it pays out both block subsidies and transaction fees to miner customers.","Hence $414 million of BTC.com's total revenues in Q2 – about 98% – essentially belonged to its miner customers but were booked as cost of revenue \"for the allocation to pool participants.\"","That means BTC.com was able to pocket just $8.4 million for itself before deducting other operating expenses like manpower or rent, etc.","A spokesperson for BIT Mining told The Block that because the mined rewards arrived first in BTC.com's own blockchain addresses before being further transacted out, those rewards had to be booked as their total revenues as per the Generally Accepted Accounting Principles in the U.S.","\"From an accounting perspective, that is the proper way to look at it if the pool operates as FPPS payment method,\" said Ethan Vera, co-founder and COO of North America mining pool Luxor. \"Miners are suppliers of hash rate to a mining pool and so payments to them are represented as an expense, often classified as cost of goods sold.\"","\"That is how our accountants advised us to do it under a FPPS method,\" he said but cautioned that for investors, they always talk about the revenue after deducting the payouts since the total revenues could be misleading.","Indeed, when Bitmain filed for an initial public offering in Hong Kong in 2018, it specified that under the International Financial Reporting Standards, its BTC.com and Antpool generated revenue from up to five percent of the mining rewards from the mining activities connected to the two mining pools.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Ethan Vera","content":"PERSON"},{"type":"Shenzhen","content":"LOCATION"},{"type":"Bitmain","content":"LOCATION"},{"type":"98%","content":"PERCENT"},{"type":"2.5%","content":"PERCENT"},{"type":"International Financial Reporting Standards","content":"ORGANIZATION"},{"type":"Bitmain","content":"PERSON"},{"type":"FPPS","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"five percent","content":"PERCENT"},{"type":"earlier this year","content":"DATE"},{"type":"Luxor","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$443 million","content":"MONEY"},{"type":"BIT Mining","content":"ORGANIZATION"},{"type":"$414 million","content":"MONEY"},{"type":"North America","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"95%","content":"PERCENT"},{"type":"first quarter","content":"DATE"},{"type":"$422.8 million","content":"MONEY"},{"type":"April 15 to June 30","content":"DATE"},{"type":"$8.4 million","content":"MONEY"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}