{"summary":"While &quot;there’s plenty to dislike&quot; in crypto, U.S. regulators should create spaces for trading in bitcoin and ether, according to Bloomberg&#x27;s editorial board.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229070\/crypto-regulatory-crackdown-bloomberg","publishDate":"2023-05-02T09:21:15","id":8673,"type":null,"title":"SEC crackdown &#x27;best thing that ever happened&#x27; to crypto, Bloomberg says","category":["POLICY"],"content":["The clash between U.S. regulators and crypto \"could be the best thing that ever happened to the industry\" as it roots out bad actors, according to Bloomberg Opinion's editorial board.&nbsp;","The <a href=\"https:\/\/www.theblock.co\/post\/226648\/sec-lawsuit-bittrex-crypto\" data-v-f87c67ca=\"\">Securities and Exchange Commission's crackdown<\/a> on the sector \"could all but shut the door on crypto\" in the U.S., according to the column. Yet this risks rejecting a technology with the potential to develop better forms of money, more efficient financial tools and novel ways of governing enterprises.&nbsp;","\"With proper identification requirements, blockchain networks could even be a lot more transparent, and less conducive to crime, than the existing banking system,\" <a href=\"https:\/\/www.bloomberg.com\/opinion\/articles\/2023-05-02\/crypto-is-still-a-mess-a-crackdown-would-do-it-good\" data-v-f87c67ca=\"\">the editorial<\/a> argued.&nbsp;","The SEC, under Chair Gary Gensler, has been leading a charge against crypto firms in recent months. The agency filed a lawsuit against Bittrex last month, alleging it was operating as an \"unregistered national securities exchange, broker, and clearing agency.\"&nbsp;In March, the <a href=\"https:\/\/www.theblock.co\/post\/222084\/sec-investigating-coinbase-for-its-earn-product-wallet-service-and-exchange-activity\" data-v-f87c67ca=\"\">SEC issued Coinbase a Wells Notice<\/a> regarding aspects of its exchange, staking service Coinbase Earn and Coinbase Wallet.","To avoid losing the potential benefits of crypto technology, U.S. authorities should carve out venues where financial instruments that don't fall into existing buckets like securities or derivatives can be legally traded, the editorial said. Bloomberg named bitcoin and ether as two such instruments.&nbsp;","Disclosure requirements could be mandated by Congress or by an industry-funded body along the lines of the Financial Industry Regulatory Authority.","\"Such a framework would grant the SEC and the Commodity Futures Trading Commission broad powers to quickly rid the market of thousands of bad actors, without getting bogged down in definitional details — and without diminishing their authority in their traditional jurisdictions,\" the opinion piece concluded. \"Speculators would still make bets that go wrong, as they do in any market. But the general reduction in scamminess would provide genuine innovators with the best possible shot at achieving something consequential. Crypto’s true believers could hardly ask for more.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Financial Industry Regulatory Authority","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Wells Notice","content":"ORGANIZATION"},{"type":"Coinbase Wallet","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Bloomberg Opinion","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Andrew Rummer","The Block"]}