{"summary":"The latest ruling in the Celsius bankruptcy case underscores the importance of reading the fine print.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199628\/celsius-ruling-shines-light-on-crypto-user-agreement-fine-print","publishDate":"2023-01-06T05:55:50","id":8677,"type":null,"title":"Celsius ruling shines light on crypto user agreement fine print","category":["POLICY"],"content":["Experts say a judge’s recent ruling that assets in a yield-bearing account belong to Celsius, not investors, highlights how high the stakes are in bankruptcy proceedings for customers of crypto firms.","<span class=\"s1\" data-v-f87c67ca=\"\">Celsius, a cryptocurrency lending company, filed for Chapter 11 bankruptcy protection in July, one of several casualties of this year's slide in the markets.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Judge Martin Glenn, chief judge for the U.S. Bankruptcy Court for the Southern District of New York, ruled on Wednesday that assets in Celsius Earn accounts belong to the company, not customers. Earn accounts allowed users to deposit assets into a Celsius account, which was then used by Celsius to generate yields across various on-chain and off-chain investment strategies. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Glenn said Celsius’ terms of use formed a “valid, enforceable contract” and “that the Terms unambiguously transfer title and ownership of Earn Assets deposited into Earn Accounts from Accounts Holders to the Debtors.” He acknowledged the decision could make it harder for Celsius customers to recoup the full value of their accounts, as the company looks to sell off portions of itself to fulfill its debts.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Glenn added: “The Court does not take lightly the consequences of this decision on ordinary individuals, many of whom deposited significant savings into the Celsius platform.”&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Jennifer Schulp, director of financial regulation studies at the libertarian think tank Cato Institute, said the ruling showed the importance of the terms of agreement and conditions between the investor and the company. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“It’s vitally important for investors to have understood what it was they were agreeing to with the company,” Schulp said in an interview. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Those investors will now be placed into a queue as unsecured creditors, meaning they’re unlikely to get 100% back, Schulp said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Schulp contrasted the difference between putting digital assets into a crypto investment firm versus putting money in a bank, noting that banks have federal deposit insurance in the event of a failure.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Investors really should be careful to understand that their relationship with the&nbsp;crypto investment firm is governed by the agreement with the crypto investment firm, not background banking regulation that applies to standard fiat banks,” Schulp said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Earn accounts held crypto assets with a market value of about $4.2 billion as of July 10, 2022.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp; <\/span>Stablecoins made up $23 million as of September 2022, according to court documents. Chapter 11 proceedings allow a business to stay operational as it restructures to pay creditors.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Whether or not assets belong to a bankrupt firm are key issues in proceedings, said Thomas Braziel, partner at 507 Capital, which provides capital to restructuring companies. Creditors with defined property at stake tend to come out ahead of so-called unsecured creditors — customers owed money but otherwise without property at stake.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“If you have estate property then clearly, you can go for preferences,” Braziel said in an interview. “You can’t claw back something that was never yours.”&nbsp;<\/span>","Added Braziel: <span class=\"s1\" data-v-f87c67ca=\"\">“This is going to shine a light on what the fine print says for any CeFi [centralized financial] institution.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">For example, crypto exchange Coinbase added a risk disclosure in its quarterly report in May that said if it were to file for bankruptcy, the court might treat customer assets, which the exchange is a custodian for, as Coinbase's assets.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Braziel also highlighted the lack of regulation over customer rights in crypto and emphasized the importance of terms of service. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“A lot of times with banks or insurance companies, you have protections for account holders that are written into the regulation that protect people,” Braziel said. “So you can’t just write whatever you want in the contract.” &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The court also said on Wednesday that stablecoins belong to Celsius and that the company could sell those to provide liquidity.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Former Celsius CEO Alex Mashinsky, who was referenced in Glenn's ruling on the Earn accounts, was <a href=\"https:\/\/www.theblock.co\/post\/199522\/new-york-sues-former-celsius-ceo-for-fraud\" data-v-f87c67ca=\"\">sued<\/a> by New York Attorney General Letitia James on Thursday for defrauding investors. Part of James' stated intent in filing the suit was to recover damages on behalf of customers.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Letitia James","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"$4.2 billion","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"100%","content":"PERCENT"},{"type":"$23 million","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Braziel","content":"PERSON"},{"type":"Martin Glenn","content":"PERSON"},{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"Jennifer Schulp","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"James","content":"PERSON"},{"type":"Schulp","content":"PERSON"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"July 10, 2022","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"September 2022","content":"DATE"},{"type":"Thomas Braziel","content":"PERSON"},{"type":"Glenn","content":"PERSON"},{"type":"Glenn","content":"LOCATION"},{"type":"Cato Institute","content":"ORGANIZATION"}],"hashtag":["COURT HEARINGS"],"authors":["Sarah Wynn","The Block"]}