{"summary":"Company will support &quot;multiverse&quot; project Translucia which is backed by Thailand&#x27;s T&amp;B Media Global and MQDC","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276238\/layer-2-startup-lightlink-secures-4-5-million-in-seed-round-led-by-tb-media-global-and-mqdc","publishDate":"2024-02-06T10:57:13","id":8678,"type":null,"title":"Layer 2 startup LightLink secures $4.5 million in seed round led by T&amp;B Media Global and MQDC","category":["LAYER 2S AND SCALING"],"content":["Layer 2 startup LightLink has secured $4.5 million of seed funding in a round led by Thai media company T&amp;B Media Global and real estate developer MQDC .","LightLink's technology will help support a \"multiverse project\" called Translucia that \"blends the virtual and physical worlds\" and is backed by $300 million in funding from T&amp;B Media Global MQDC, according to a statement.","\"This collaboration is an ideal alignment, driven by our mutual goal to establish an interconnected, user-friendly digital world that shares happiness to the world,\" said Translucia founder and CEO of T&amp;B Media Global Dr. Jwanwat Ahriyavraromp.","Other investors in the seed round included JellyC,&nbsp;Aweh Ventures,&nbsp;Blue7&nbsp; and&nbsp;B3V, according to the statement.&nbsp;","Tuesday's announcement follows LightLink's <a href=\"https:\/\/www.animocabrands.com\/animoca-brands-and-lightlink-partner-to-enhance-web3-gaming-experiences\" data-v-f87c67ca=\"\">recent partnership<\/a> with Animoca Brands. LightLink is an \"Ethereum Layer 2 blockchain that enables dApps and enterprises to offer users instant, gasless transactions,\" according to the announcement.&nbsp;","Pellar Technologies, which has built \"over 50 blockchain projects for major enterprise-level businesses in the APAC region since 2017,\" is responsible for developing LightLink. The startup \"ranks in the top 10 in transaction volumes among rollups\" and \"has surpassed 215,000 unique wallet addresses operating on-chain.\"","\"The funding we've received enhances our focus on making blockchain as intuitive as traditional web platforms, with an emphasis on gasless transactions,\" Roy Hui, co-founder and CEO of LightLink, said in a statement.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Aweh Ventures","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"T&amp;B Media Global Dr. Jwanwat Ahriyavraromp","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$4.5 million","content":"MONEY"},{"type":"APAC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"T&amp;B Media Global","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Translucia","content":"ORGANIZATION"},{"type":"Pellar Technologies","content":"ORGANIZATION"},{"type":"Roy Hui","content":"PERSON"},{"type":"$300 million","content":"MONEY"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["RT Watson","The Block"]}