{"summary":"Platypus Finance, which suffered a $9.1 million hack earlier this monh, said French police had arrested its suspected hackers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215206\/platypus-finance-says-french-police-took-suspected-hackers-into-custody","publishDate":"2023-02-25T11:35:46","id":8679,"type":null,"title":"Platypus Finance says French police took suspected hackers into custody","category":["CRYPTO ECOSYSTEMS"],"content":["Platypus Finance, a decentralized finance protocol on Avalanche, <a href=\"https:\/\/twitter.com\/Platypusdefi\/status\/1629448306186412033?t=ts0AnE0CyIsTg2l-GQ2XmQ&amp;s=19\" data-v-f87c67ca=\"\">announced<\/a> that the French National Police have arrested two people suspected of hacking its protocol. The project assisted French law enforcement in tracing the identity of the attackers to a KYC-verified Binance account that was being used in an attempt to cash out the stolen funds.","Platypus said the alleged hackers were taken into custody after the firm provided information to trace them with help from pseudonymous on-chain analyst <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1629450492186173441\" data-v-f87c67ca=\"\">ZachXBT<\/a> and crypto exchange Binance. On Feb. 16, hackers <a href=\"https:\/\/www.theblock.co\/post\/212711\/flash-loan-exploit-appears-to-be-behind-platypus-usd-stablecoin-attack\" data-v-f87c67ca=\"\">stole<\/a> almost $9.1 million in crypto assets from Platypus. Since then, recovery efforts have been underway.","<a href=\"https:\/\/www.theblock.co\/post\/212966\/platypusdefi-salvages-2-4-million-in-hacked-funds-with-blocksecs-help\" data-v-f87c67ca=\"\">About $2.4 million<\/a> in USDC stablecoin was recovered, after it had been placed in the attacker's contract. This was made possible by the efforts of blockchain security firm BlockSec. The security firm found a loophole in the attacker's contract and retrieved 2.4 million USDC by transferring it from the contract back to Platypus's control. Another $1.5 million in stolen USDT was frozen with the help of its issuer, as Platypus had <a href=\"https:\/\/medium.com\/platypus-finance\/update-on-recovery-efforts-after-the-exploitation-a8f64acd5aa5\" data-v-f87c67ca=\"\">noted<\/a> earlier.","Platypus Finance has assured its users that it will continue to take steps to enhance its security measures to prevent such incidents from happening in the future.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2.4 million","content":"MONEY"},{"type":"$1.5 million","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$9.1 million","content":"MONEY"},{"type":"BlockSec","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Platypus Finance","content":"ORGANIZATION"},{"type":"Feb. 16","content":"DATE"},{"type":"French National Police","content":"ORGANIZATION"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Vishal Chawla","The Block"]}