{"summary":"MoonPay, the crypto payments infrastructure firm, is again expanding its product set.\nThe startup is now pushing into the consumer market with the launch of a crypto app that has been in testing since March.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229163\/moonpay-pushes-into-retail-space-with-new-crypto-app","publishDate":"2023-05-03T00:01:53","id":868,"type":null,"title":"MoonPay pushes into retail space with new crypto app","category":["Companies"],"content":["MoonPay, the Miami-based crypto payments firm, continues to expand its services with the launch of a retail-facing app.","The app, which has been in testing with 15,000 early access users since March, is now widely available on Apple and Google app stores, according to an announcement this morning.","The app will give users a way to manage multiple crypto wallets and hundreds of different tokens, something MoonPay sees strong demand for among its users, 55% of whom have transacted with three or more wallets.","The app is another departure from MoonPay’s core business model of providing on and off-ramp payments infrastructure for consumer-facing businesses in the crypto space. Since late 2021, MoonPay has also been <a href=\"https:\/\/www.theblock.co\/post\/192384\/moonpay-soto-wright-web3-culture-crypto-winter\" data-v-f87c67ca=\"\">aggressively expanding<\/a> into the NFT market — with new products including a concierge service for brokering big-ticket purchases and a platform that helps big brands orchestrate their own NFT drops.","Ivan Soto-Wright, co-founder and CEO of MoonPay, said in a statement that the new app is designed “to provide our millions of customers with a new way to engage with their cryptocurrencies and digital assets and provide the foundation for our leading brand partners and creators to continue their adoption within the web3 ecosystem.”","MoonPay today works with more than 500 partners, including wallets, exchanges and commercial brands."],"hashtag":[]}