{"summary":"The Bologna-based motorcycle manufacturer&#x27;s digital collectible will consist of a video sequence of Ducati logos on tanks of motorcycles.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241285\/ducati-digital-collectible-xrp-ledger","publishDate":"2023-07-25T08:04:36","id":8680,"type":null,"title":"Ducati announces first digital collectible on XRP Ledger","category":["CORPORATE NFTS"],"content":["Ducati has announced the launch of its first-ever digital collectible on the XRP Ledger. The Bologna-based motorcycle manufacturer's digital collectible will consist of a video sequence of Ducati logos on tanks of motorcycles produced since 1946.","Ducati's CEO, Claudio Domenicali, affirmed <a href=\"https:\/\/www.theblock.co\/post\/241258\/web3-japan-fumio-kishida\" data-v-f87c67ca=\"\">the significance of web3 innovations<\/a> in providing fans with an immersive brand experience. “Entering web3 is another way to get closer to the Ducatisti community by further extending the number of services offered to them. It also represents an opportunity to meet and make ourselves known to a new community of NFT enthusiasts, giving them the opportunity to live unique Ducati-style experiences and collect the digital assets that we will develop exclusively for this new dimension of the brand,\" Domenicali added.","Users must sign up within seven days of the July 26 launch date. Those who receive the first collectible will gain access to subsequent project releases. The manufacturer said upcoming Ducati projects will be deployed using XRPL. \"Over the coming months will see the creation of new digital aggregation spaces, NFT collections and opportunities to participate in the new activities typical of the web3 universe, already relevant in the cryptocurrency community\", the Ducati website <a href=\"https:\/\/www.ducati.com\/ww\/en\/news\/ducati-announces-its-entry-into-the-world-of-web-3-0-in-partnership-with-nft-pro\" data-v-f87c67ca=\"\">said<\/a>.","For the project, Ducati partnered with Web3 Pro. Ducati's parent company, Lamborghini, also has <a href=\"https:\/\/www.web3pro.com\/2022\/10\/27\/web3-pro-helps-lamborghini-to-market-nfts-in-the-digital-world\/\" data-v-f87c67ca=\"\">brand engagement<\/a> with Web3 Pro via an NFT collection called \"The Epic Road Trip.\"","Ripple is a contributor to XRPL, running six of the 35 plus unique validator nodes on the network. The company said transactions on XRPL increased 9% to 116 million on Q1 of this year.","\"NFTs continue to drive activity and over 1 million assets have been minted on the ledger since XLS-20 went live on mainnet,\" the Ripple website <a href=\"https:\/\/ripple.com\/insights\/q1-2023-xrp-markets-report\/\" data-v-f87c67ca=\"\">noted<\/a>.","The XLS-20 standard allows XRPL to support native NFTs.&nbsp; The standard allows all essential NFT functionality on XRPL, including minting, trading, burning and automatic royalties.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bologna","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"9%","content":"PERCENT"},{"type":"Claudio Domenicali","content":"PERSON"},{"type":"July 26","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"1946","content":"DATE"},{"type":"Lamborghini","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Ducati","content":"ORGANIZATION"}],"hashtag":[],"authors":["Brian McGleenon","The Block"]}