{"summary":"Taurus, a Swiss crypto infrastructure firm, has integrated the Polygon blockchain network for its tokenization and custody platforms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232959\/crypto-taurus-polygon-tokenization-credit-suisse","publishDate":"2023-06-02T09:00:31","id":8683,"type":null,"title":"Credit Suisse-backed crypto firm Taurus integrates Polygon for tokenization","category":["CRYPTO INFRASTRUCTURE"],"content":["Taurus, a Swiss crypto infrastructure firm, today announced an integration with the Polygon blockchain network for its tokenization and custody platforms.","The move means Taurus's clients, which include Credit Suisse and Deutsche Bank, can now leverage Polygon to tokenize any asset, including equity and debt. Polygon becomes the fourth blockchain supported by Taurus's tokenization platform, following Ethereum, Tezos and Cardano.","There was a high demand to integrate Polygon from clients, \"especially large banks,\" Victor Busson, chief marketing officer and head of strategic partnerships at Taurus, told The Block. Polygon's key benefits as an Ethereum scaling network include low fees, increased speed and a \"user-friendly smart contract development platform and tools,\" Busson said.","On-chain asset tokenization is seen by some as the next big catalyst for mainstream crypto adoption. Boston Consulting Group in September <a href=\"https:\/\/web-assets.bcg.com\/1e\/a2\/5b5f2b7e42dfad2cb3113a291222\/on-chain-asset-tokenization.pdf\" data-v-f87c67ca=\"\">said<\/a> tokenization of global illiquid assets is estimated to be a $16 trillion business opportunity by 2030, or 10% of global GDP. Last month, a JPMorgan executive reportedly <a href=\"https:\/\/www.coindesk.com\/business\/2023\/04\/27\/tokenization-is-the-killer-app-for-tradfi-jpmorgan\/\" data-v-f87c67ca=\"\">said<\/a>, \"tokenization is a killer app for traditional finance.\"","<a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/224014\/citi-tokenized-securities-use-case\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Tokenization<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> is a method of representing real-world or digital assets as tokens on a blockchain. It enables fractional ownership, liquidity and transferability of assets that are ordinarily illiquid or indivisible, such as real estate. Tokenized assets can be traded, transferred and accessed more easily on blockchain platforms, proponents say.&nbsp;<\/span>","Taurus's tokenization business has swollen in recent months. Busson said 70% of the company's clients are now using its tokenization platform compared to just 10% two years ago. He declined to share the size of assets tokenized through Taurus's infrastructure.","Founded in 2018, Taurus provides an infrastructure to issue, custody, and trade digital assets and is currently focused on serving banks and financial institutions in Europe. It has plans to expand across the globe. To that end, Taurus <a href=\"https:\/\/www.theblock.co\/post\/211162\/taurus-crypto-series-b-credit-suisse\" data-v-f87c67ca=\"\">raised<\/a> $65 million in a Series B funding round led by Credit Suisse earlier this year — one month before the Swiss bank was forcibly sold to rival UBS Group for $3.2 billion by Swiss authorities amid collapse fears.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Deutsche Bank","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"$3.2 billion","content":"MONEY"},{"type":"Victor Busson","content":"PERSON"},{"type":"$65 million","content":"MONEY"},{"type":"$16 trillion","content":"MONEY"},{"type":"Cardano","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"UBS Group","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Boston Consulting Group","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"Credit Suisse","content":"ORGANIZATION"},{"type":"Busson","content":"PERSON"}],"hashtag":["POLYGON","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}