{"summary":"Just a month after launch, Moonbird NFTs are quickly joining Bored Apes as a popular target for hackers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/148750\/hackers-steal-29-moonbirds-valued-at-1-5-million-in-nft-phishing-attack","publishDate":"2022-05-25T11:40:02","id":8684,"type":null,"title":"Hackers steal 29 Moonbirds valued at $1.5 million in NFT phishing attack","category":["HACKS"],"content":["The crypto Twitter community is encouraging everyone to check links and stay vigilant following a hack targeting the popular Moonbirds non-fungible token (NFT) project.&nbsp;","Late Tuesday, 29 Moonbirds valued at about 750 ETH ($1.5 million) were taken from their owner, <a href=\"https:\/\/opensea.io\/DigitalOrnithologist?tab=activity\" data-v-f87c67ca=\"\">DigitalOrnithologist<\/a>, according to on-chain data.&nbsp;","Despite having only launched a month ago, Moonbirds are quickly joining the Bored Ape Yacht Club as a popular target for hackers. The collection, a product of venture capitalist Kevin Rose's Proof Collective, has skyrocketed in popularity and was at the center of a <a href=\"https:\/\/www.theblockcrypto.com\/post\/142403\/latest-twitter-scam-aims-to-capitalize-on-moonbirds-success-and-snares-bernie-sanders-sons-verified-account\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">phishing scam shortly after its launch<\/a>.","Twitter sleuth 0xLosingMoney has <a href=\"https:\/\/twitter.com\/0xLosingMoney\/status\/1529401905990242304\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">linked this new attack<\/a> to an account on Twitter named @DVincent_, which now, along with its corresponding OpenSea page, has disappeared. He also noted that, prior to the attack, other NFT holders reported being approached by @DVincent_ for private sales.","Among them, Bored Ape holder @just1n_eth described how the account approached him on May 10. \"We came to an agreement on price. Then this individual insisted we use a platform called ‘p2peers.io’. I have been in the space [for] over a year and hadn’t heard of it. I instantly knew something didn’t seem right.\"","Another user responded by saying “the exact same happened to me. I told him I would only use NFTTrader and he kept insisting on the other scammy platform.”","The p2peers site, which is registered to a domain company in Finland, appears to have been suspended. According to Tal Be’ery, security research manager and co-founder and CTO of ZenGo, the aim of directing people to such sites is to trick victims into signing and approving a transaction that transfers ownership to the attacker.","Phishing attacks, particularly on Twitter, continue to plague the NFT community. Last week hackers also gained access to the Twitter account of NFT creator Mike Winkelmann, aka Beeple, and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/148219\/beeple-twitter-account-hacked-to-share-louis-vuitton-phishing-link\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">carried out a phishing attack<\/a> that netted them $483,000 in cryptocurrency and NFTs.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"Mike Winkelmann","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Tal Be’ery","content":"ORGANIZATION"},{"type":"Kevin Rose","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$483,000","content":"MONEY"},{"type":"Moonbirds","content":"PERSON"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Finland","content":"LOCATION"},{"type":"May 10","content":"DATE"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}