{"summary":"Nexo has unveiled a new feature, unrivaled in the crypto space, which allows customers of crypto-backed credit lines to preserve the value of their collateralized assets in a dipping market, while improving the overall health of their loans.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109423\/nexos-new-feature-gives-borrowing-clients-full-control-over-their-collateral","publishDate":"2021-06-24T09:08:20","id":8685,"type":null,"title":"Nexo’s New Feature Gives Borrowing Clients Full Control Over Their Collateral","category":["SPONSORED"],"content":["<a href=\"https:\/\/nexo.io\/?utm_source=theblock&amp;utm_medium=press&amp;utm_campaign=theblock_article_june21\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Nexo<\/span><\/a><span data-v-f87c67ca=\"\"> has unveiled a new feature, unrivaled in the crypto space, which allows customers of crypto-backed credit lines to preserve the value of their collateralized assets in a dipping market, while improving the overall health of their loans.<\/span>","<span data-v-f87c67ca=\"\">The unprecedented pandemic and the ups and downs of the crypto ecosystem have illuminated the interconnection of our actions and their impacts on the market trends. Owing to the recent meltdown of some of the biggest digital assets, such as Bitcoin and Ethereum, companies are focusing on developing efficient solutions to help customers mitigate the downside.<\/span>","<span data-v-f87c67ca=\"\">To safeguard its customer assets, Nexo – the world's leading regulated institution for digital assets – has introduced the concept of <\/span><b data-v-f87c67ca=\"\">collateral exchange<\/b><span data-v-f87c67ca=\"\"> for its customers. This new versatile feature allows Nexo customers to preserve the value of their collateralized digital assets during a market meltdown while improving the health of their credit line within seconds.<\/span>","<span data-v-f87c67ca=\"\">Using <\/span><a href=\"https:\/\/nexo.io\/blog\/introducing-collateral-exchange-option-for-our-instant-crypto-credit-lines?utm_source=theblock&amp;utm_medium=press&amp;utm_campaign=theblock_article_june21\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Nexo Collateral Exchange<\/span><\/a><span data-v-f87c67ca=\"\">, customers can quickly swap assets in their Credit Line Wallet. Not only does this future <\/span><b data-v-f87c67ca=\"\">help customers maintain a healthy LTV<\/b><span data-v-f87c67ca=\"\"> (loan to value) ratio during downtrends by selecting a more stable or better-performing asset, but it also allows users to re-enter the market only when they see fit and in a way that matches their investment goals.<\/span>","<span data-v-f87c67ca=\"\">For those unfamiliar, a Nexo Credit Line Wallet contains both the assets already used as collateral for an ongoing credit line and the excess collateral available to back additional borrowing. With the new Collateral Exchange feature, Nexo customers can reap dual benefits – they can <\/span><b data-v-f87c67ca=\"\">exchange their collateralized balance for stablecoins<\/b><span data-v-f87c67ca=\"\"> to exit market volatility and\/ or swap the cryptocurrencies that have not yet been used as collateral for other cryptocurrencies, depending on their preferred portfolio strategy.<\/span>","<span data-v-f87c67ca=\"\">With the release of the Collateral Exchange feature, Nexo cements itself as the only CeFi company to offer the option to convert collateral to any other supported crypto asset as long as the latter has a higher LTV than the collateralized asset, thus realizing the full potential of their collateral.<\/span>","<span data-v-f87c67ca=\"\">In addition to safeguarding assets and ensuring easy access to liquidity, Nexo’s Collateral Exchange feature is highly customer-centric. This novel concept prevents automatic credit line repayments and serves as a portfolio adjustment tool in accordance with market conditions, adding a new level of utility to Nexo’s existing Instant Crypto Credit Line.<\/span>","<span data-v-f87c67ca=\"\">Nexo is one of the most popular CeFi platforms, allowing its customers to earn compound interest on their cryptocurrencies. Besides generating high-yield returns on their digital and fiat assets, users can borrow fiat and stablecoins using their existing holdings as collateral, as well as <\/span><a href=\"https:\/\/nexo.io\/buy-crypto?utm_source=theblock&amp;utm_medium=press&amp;utm_campaign=theblock_article_june21\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">buy crypto<\/span><\/a><span data-v-f87c67ca=\"\"> and swap between 100+ market pairs on the instant Nexo Exchange.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nexo Credit Line Wallet","content":"ORGANIZATION"},{"type":"Nexo Exchange","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nexo Collateral Exchange","content":"ORGANIZATION"},{"type":"Nexo","content":"PERSON"},{"type":"LTV","content":"ORGANIZATION"},{"type":"Nexo’s Collateral Exchange","content":"ORGANIZATION"},{"type":"Collateral Exchange","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}