{"summary":"For purchasers of luxury items, there&#x27;s a new way to buy and store expensive items using blockchain technology.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240554\/ferrari-worth-2-5-million-is-now-a-polygon-nft","publishDate":"2023-07-19T11:16:26","id":8686,"type":null,"title":"Ferrari worth $2.5 million is now a Polygon NFT","category":["ART AND COLLECTIBLES"],"content":["<span data-v-f87c67ca=\"\">Imagine you buy a sports car, like a Ferrari F40, or a lavishly expensive watch, like a $195,000 Rolex, but you aren’t ready to shoulder the responsibility of caring for either item.<\/span>","<span data-v-f87c67ca=\"\">Altr, a company which aspires to become a hub for the buying and selling of luxury items authenticated on the Polygon blockchain with NFTs, believes it might have the answer. And with <a href=\"https:\/\/altr.trade\/products\/ferrari-f40\/\" data-v-f87c67ca=\"\">the sale<\/a> of a Ferrari F40 for $2.5 million, the firm hopes to have demonstrated how such a high-priced transaction facilitated by Altr works.<\/span>","<span data-v-f87c67ca=\"\">When a luxury item is sold via its platform, Altr said it not only “issues a digital proof of ownership in the form of an NFT\" minted on the Polygon blockchain, but also promises to take care of the physical asset until the new owner decides to claim their item. <\/span>","<span data-v-f87c67ca=\"\">“All collectibles are safely stored and maintaine<\/span><span data-v-f87c67ca=\"\">d by Altr’s Oracles in safe storage facilities until the NFT holder decides to redeem the physical collectible,” the company said in a statement.<\/span>","<span data-v-f87c67ca=\"\">Altr's governance application Lucidao said the Ferrari sold in less than 48 hours, <a href=\"https:\/\/twitter.com\/Lucidao_\" data-v-f87c67ca=\"\">according to a post<\/a> to Twitter. Transactions are carried out in USDT stablecoin, according to the company's website.<\/span>","","","&nbsp;","<span data-v-f87c67ca=\"\">“The speed with which the car sold is a testament to the confidence that the community has in Altr and the technology on which it is built” said Davide Rovelli, who, according to the statement, is “one of Altr’s initial supporters.”<\/span>","<span data-v-f87c67ca=\"\">Rovelli added he's confident that “there is a growing market for collectors to buy physical assets using blockchain technologies, enabling a secure and transparent solution for acquiring, owning, exchanging and storing high-value assets.”<\/span>","<span data-v-f87c67ca=\"\">While the sale of the Ferrari appears to be the biggest transaction Altr has handled thus far, the company says it was not its first sale of a big-ticket item. In January, Altr sold a Rolex Daytona for $195,000, according to the statement.<\/span>","<span data-v-f87c67ca=\"\">Altr, however, did not sell the Rolex to one buyer, but instead to a group of buyers. The company has introduced what it calls <\/span><a href=\"https:\/\/lucidao.medium.com\/what-are-fractionalised-nfts-and-why-should-you-care-12634800738f\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“fractionalized” ownership<\/span><\/a><span data-v-f87c67ca=\"\"> that entitles would-be collectors to a piece — essentially a share — of a luxury item. People who own a fraction of an item receive an NFT.<\/span>","<span data-v-f87c67ca=\"\">The company's “Oracles” are employed to certify the authenticity and safeguard luxury assets, according to Altr. It said \"renowned experts\" are able to both appraise and secure storage of the valuable items sold through the platform.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"$2.5 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Ferrari","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Rovelli","content":"PERSON"},{"type":"Rolex Daytona","content":"ORGANIZATION"},{"type":"$195,000","content":"MONEY"},{"type":"Davide Rovelli","content":"PERSON"},{"type":"Altr","content":"PERSON"},{"type":"Lucidao","content":"PERSON"}],"hashtag":[],"authors":["RT Watson","The Block"]}