{"summary":"Paul Brody is the EY Global Blockchain Leader, driving EY initiatives and investments in blockchain technology across consulting, audit and tax business","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50065\/if-you-build-a-blockchain-will-anyone-come","publishDate":"2019-12-11T09:45:02","id":869,"type":null,"title":"If you build a blockchain, will anyone come?","category":["LAYER 1S"],"content":["The era of centrally controlled private blockchains is coming to an end, according to research by professional services firm Ernst &amp; Young, and public blockchains offer a better choice in terms of avoiding monopoly-like dominance","Public blockchains have matured considerably in terms of privacy and security solutions, leading to a higher level of acceptance among enterprises and likely a larger scale of adoption in the near future","<em data-v-f87c67ca=\"\"><a href=\"https:\/\/www.linkedin.com\/in\/pbrody\/\" data-v-f87c67ca=\"\">Paul Brody<\/a> is the EY Global Blockchain Leader, driving EY initiatives and investments in blockchain technology across consulting, audit and tax business lines.<\/em>","<span data-v-f87c67ca=\"\">B<\/span><span data-v-f87c67ca=\"\">lockchains thrive as network systems. They allow companies to manage and track assets and complex interactions across large business ecosystems. This technology has been long overdue, because while companies themselves have transformed radically over the last 30 years, the technology that is used to collaborate between enterprises hasn’t kept pace.<\/span>","<span data-v-f87c67ca=\"\">Today, most companies still rely upon point-to-point messaging like emailing spreadsheets to manage their shared operations. Blockchains promise to bring collaboration between companies, enabling the sharing of both factual data as well as business logic across an ecosystem in a standardized, structured and secure manner. So far, however, enterprises have limited themselves to a kind of stripped-down beginner model of this technology, and the limitations of this approach are starting to show.<\/span>","<span data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">The era of private blockchain comes to a close<\/b><\/span>","<span data-v-f87c67ca=\"\">Public blockchains, like Bitcoin and Ethereum, sparked a technology revolution, but did not support transaction privacy in their early versions. To rectify that, centrally controlled private blockchains were developed that allowed for privacy in transaction data by appointing a central authority to verify transactions. This allowed companies to dip their toes in the world of blockchain technology without the fear of exposing confidential data.<\/span>","<span data-v-f87c67ca=\"\">The limitations of this approach are obvious: if the main value proposition of blockchain technology is its decentralized nature, then creating a centralized version of it might not prove to be of lasting value. Findings from&nbsp;<a href=\"https:\/\/assets.ey.com\/content\/dam\/ey-sites\/ey-com\/en_gl\/topics\/blockchain\/ey-public-blockchain-opportunity-snapshot.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Seize The Day: Public Blockchain Is On The Horizon<\/em><\/a>,&nbsp;a commissioned study conducted by Forrester Consulting on behalf of EY in November 2019, suggests the era of private blockchain will be coming to a close.<\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The most pressing question in the world of blockchain innovation is, do you start your own blockchain or do you join one started by someone else? No prizes for guessing, but what has typically happened thus far is that for every organization willing to join a consortium or someone else’s network, two companies started their own. Not much hope for a network-effect here.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>","<span data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">The value of public blockchains<\/b><\/span>","<span data-v-f87c67ca=\"\">Blockchains, like most network technologies, are natural monopolies. The more users they have, the more useful they become, and once they achieve a position of dominance, they tend to start aggressively extracting “rents” from their members. Having seen this pattern in several consumer applications, at EY we believe most enterprises will prefer to stick to their legacy tools rather than let themselves experience a similar fate facing an all-powerful private blockchain monopolist in the B2B space.<\/span>","<span data-v-f87c67ca=\"\">Public blockchains like Ethereum offer a better choice for enterprise users because even if they do achieve monopoly-like dominance, there is no controlling entity to extract excess profits. There is only an ecosystem of competing service providers. Despite this advantage, there is an apparent lack of awareness around Ethereum’s benefits and this must be overcome. In fact, a separate EY survey of blockchain developers, researchers and professionals during the Devcon 5 Ethereum conference found that 90% of the respondents do not believe the general public understands the purpose of Ethereum, despite nearly 60% of respondents being confident in the future of Ethereum themselves.<\/span>","<span data-v-f87c67ca=\"\">The protocols that power the Internet are good examples of how shared systems can be universally adopted and offer immense value creation without putting control in the hands of a single enterprise. Public blockchains offer the same kind of enduring value proposition.<\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">&nbsp;<\/span><b data-v-f87c67ca=\"\">Solving privacy and security concerns<\/b><\/span>","<span data-v-f87c67ca=\"\">Scalability aside, before enterprises embrace public blockchains, the problem of data security and privacy remains paramount.<\/span>","<span data-v-f87c67ca=\"\">Fortunately, privacy and security solutions on public blockchains are now maturing to a level where enterprises can make use of them with confidence. <a href=\"https:\/\/www.ey.com\/en_gl\/blockchain\/blockchain-platforms\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">The&nbsp;newest generation of public blockchain solutions, like the solutions EY is building<\/a>, allow companies to use public blockchains while maintaining complete data privacy. In fact, companies can transact with each other over public blockchains without ever having to put any sensitive enterprise or personal data on the blockchain at all. Instead, blockchains are used to pass status updates and mathematical proofs, but the sensitive data is always stored behind enterprise firewalls.<\/span>","<span data-v-f87c67ca=\"\">Let’s take for example a procurement contract between a buyer, seller, and a finance company.&nbsp; The parties use the blockchain to identify each other, negotiate and agree upon a contract, but the contract itself is only stored in a readable format behind each enterprise firewall. What the parties leave on the blockchain for each other are only sets of mathematical proofs about when and how they have completed their obligations to each other.<\/span>","<span data-v-f87c67ca=\"\">The speed at which blockchain privacy technology is improving is dizzying. Since early 2018,&nbsp;<a href=\"https:\/\/www.youtube.com\/watch?v=SUtTy9RoXb0&amp;list=PL3ZOd0y-i_r5lsU2oXCHYQCA2ZXMJXihd&amp;index=5&amp;t=0s%20%20by%20EY\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">we improved the efficiency of EY blockchain tools for privacy<\/a>&nbsp;by a factor of 100. We are not alone in this pursuit: multiple organizations from companies to universities are pushing the envelope of a specialized form of math known as a&nbsp;<a href=\"https:\/\/www.ey.com\/en_gl\/news\/2019\/04\/ey-releases-zero-knowledge-proof-blockchain-transaction-technology-to-the-public-domain-to-advance-blockchain-privacy-standards\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">zero-knowledge proof (ZKP)<\/a>&nbsp;that is central to this technology. With nearly half (42%) of members of the Ethereum believing issues around scalability are the biggest barrier to Ethereum’s future success, the release of ZKPs brings newfound privacy and security to enterprises.<\/span>","<span data-v-f87c67ca=\"\">Enterprises are taking note of this progress. Perhaps the most telling result from&nbsp;<a href=\"https:\/\/assets.ey.com\/content\/dam\/ey-sites\/ey-com\/en_gl\/topics\/blockchain\/ey-public-blockchain-opportunity-snapshot.pdf\" data-v-f87c67ca=\"\">Seize The Day: Public Blockchain Is On The Horizon<\/a>[1]&nbsp;study was that while only 6% have implemented solutions on public blockchains, 75% of respondents expect their organizations to do so in the future. &nbsp;<\/span>","<span data-v-f87c67ca=\"\">When the cloud first became available, most enterprises were reluctant to embrace it. The efficiency of cloud comes from sharing infrastructure across companies, but where enterprises embraced cloud at all, the most popular early cloud solutions were private clouds that allowed that limited shared infrastructure within a single enterprise. As organizations and enterprises got comfortable with the security and reliability of sharing infrastructure, public cloud services came to dominate. A similar pattern is repeating itself in blockchain.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As privacy and security solutions on public blockchains mature and increase to unprecedented levels, so too should the level of adoption. With all signs pointing to public blockchains for the long term, you can either build a private blockchain today, or you could just skip to the last chapter of the story and go straight to public. The decision seems clear.&nbsp;&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Paul Brody is the EY Global Blockchain Leader, driving EY initiatives and investments in blockchain technology across consulting, audit and tax business lines.<\/em>","<span data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The views reflected in this article are the views of the author and do not necessarily reflect the views of the global EY organization or its member firms.<\/span><\/i><\/span>","[1] <em data-v-f87c67ca=\"\"><a href=\"https:\/\/assets.ey.com\/content\/dam\/ey-sites\/ey-com\/en_gl\/topics\/blockchain\/ey-public-blockchain-opportunity-snapshot.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Seize The Day: Public Blockchain Is On The Horizon<\/a><\/em>, a commissioned study conducted by Forrester Consulting on behalf of EY | November 2019.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"6%","content":"PERCENT"},{"type":"November 2019","content":"DATE"},{"type":"Ernst &amp; Young","content":"ORGANIZATION"},{"type":"EY Global Blockchain Leader","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"42%","content":"PERCENT"},{"type":"75%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"last 30 years","content":"DATE"},{"type":"Forrester Consulting","content":"ORGANIZATION"},{"type":"Paul Brody","content":"PERSON"},{"type":"Devcon","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Paul Brody","The Block"]}