{"summary":"A former employee has pleaded guilty to embezzling cryptocurrencies from the now-defunct crypto exchange Cryptopia.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110495\/ex-employee-pleads-guilty-to-stealing-over-170000-from-cryptopia","publishDate":"2021-07-05T09:35:27","id":8694,"type":null,"title":"Ex-employee pleads guilty to stealing over $170,000 from Cryptopia","category":["HACKS"],"content":["<span data-v-f87c67ca=\"\">A former employee has reportedly pleaded guilty to embezzling NZD 245,000 (USD 172,000) worth of cryptocurrencies and stealing customer data from the now-defunct New Zealand-based crypto exchange Cryptopia.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to a <\/span><a href=\"http:\/\/stuff.co.nz\/national\/crime\/125617315\/excryptopia-staffer-admits-stealing-almost-250000-of-cryptocurrency\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report<\/span><\/a><span data-v-f87c67ca=\"\"> by local news outlet Stuff, the ex-employee has admitted to two charges: theft by a person in a special relationship, and theft of over NZD 1,000 (USD 700). He will receive his official sentence on October 20. The Christchurch district court has granted the man interim name suppression.<\/span>","<span data-v-f87c67ca=\"\">The ex-employee reportedly had issues with management about the handling of private keys for many wallets held by the exchange. At one point, the employee made an unauthorized copy of private keys from Cryptopia’s wallets and saved it on an external storage device, transferring the information to his personal computer.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Per a summary of facts from the hearing, this gave him access to tens of thousands of digital wallets and access to over NZD 100 million (USD 70.2 million) worth of different cryptocurrencies.<\/span>","<span data-v-f87c67ca=\"\">Cryptopia was one of New Zealand’s most popular crypto exchanges. At its peak, the exchange had over 80 staff members and more than 1.4 million customers globally.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">That was until January 2019, when a hacker stole over NZD 25 million (USD 17.5 million) worth of cryptocurrencies — 15% of the exchange’s holdings — making it the largest theft in the country to date.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The exchange was forced into a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/23453\/cryptocurrency-exchange-cryptopia-halts-trading-and-announces-it-is-in-the-process-of-liquidation\" data-v-f87c67ca=\"\">liquidation process<\/a> after the hack. Accounting firm Grant Thornton is managing the <a href=\"https:\/\/www.theblockcrypto.com\/post\/25344\/liquidation-of-new-zealand-crypto-exchange-reaches-nyc-bankruptcy-court\" data-v-f87c67ca=\"\">ongoing process<\/a>. According to Stuff.co.nz, however, the recent charges are unrelated to the 2019 hack.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">After the exchange began its liquidation process, Cryptopia’s entire staff was laid off, but the ex-employee apparently kept his copy of the private keys. <\/span>","<span data-v-f87c67ca=\"\">The hack was noticed after someone told the exchange’s liquidators they had accidentally deposited some bitcoin into an old Cryptopia wallet and requested the funds be returned.&nbsp;<\/span><span data-v-f87c67ca=\"\">After reviewing Cryptopia’s wallets, the liquidators saw 13 bitcoins had been illegally withdrawn from various wallets in a series of transactions, some of which had been laundered via a mixing service. At the time, the laundered bitcoin totalled about NZD 235,000 (USD 165,000). Then the man stole more cryptocurrency, worth about NZD 10,000 (USD 7,000).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The defendant admitted that he was frustrated with Cryptopia but also motivated by the belief that he could get away with the theft as he thought nobody would ever check the old deposit wallets,” read the summary of facts, as reported by Stuff.<\/span>","<span data-v-f87c67ca=\"\">The ex-employee said he had returned some of the stolen currencies and offered to pay back the remaining amount.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New Zealand","content":"LOCATION"},{"type":"Cryptopia","content":"LOCATION"},{"type":"Cryptopia","content":"PERSON"},{"type":"Christchurch","content":"LOCATION"},{"type":"Grant Thornton","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"October 20","content":"DATE"},{"type":"USD 17.5 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"January 2019","content":"DATE"}],"hashtag":["CRYPTO"],"authors":["Saniya More","The Block"]}