{"summary":"The Reserve Bank of India says that a central bank digital currency prototype may be launched &quot;soon.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175519\/indias-central-bank-to-launch-digital-rupee-pilot","publishDate":"2022-10-07T08:32:08","id":8695,"type":null,"title":"India’s central bank to launch digital rupee pilot","category":["CENTRAL BANKS"],"content":["<span data-v-f87c67ca=\"\">The Reserve Bank of India (RBI) is stepping towards initiating a digital rupee pilot and indicating key features in the central bank digital currency (CBDC), according to a 50-page <a href=\"https:\/\/rbidocs.rbi.org.in\/rdocs\/PublicationReport\/Pdfs\/CONCEPTNOTEACB531172E0B4DFC9A6E506C2C24FFB6.PDF\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">report<\/a> released on Friday.<\/span>","<span data-v-f87c67ca=\"\">The Indian central bank says it will launch a pilot Digital Rupee program “soon,” and will communicate about its features and benefits “from time to time.” Some key features, however, have been cautiously revealed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The report distinguishes between retail and wholesale use cases, for consumers and for bank-to-bank transfers, and suggests that both may be introduced.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It also discusses several issuing models, especially one where a wholesale CBDC would be account-based and issued by the central bank, while the CBDC for consumers would be token-based and managed by an intermediary.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Additionally, RBI calls for “reasonable anonymity for small value transactions” to stick to a non-interest-bearing coin that resembles physical cash.<\/span>","<span data-v-f87c67ca=\"\">The technology behind the digital rupee is not yet set in stone. The RBI is leaving the door open to adapt to the decentralized technology as it evolves.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The report explores different possibilities and aims to raise awareness about CBDCs, with “compelling reasons” that make a national digital currency “as attractive as cash if not more.” However, the concept note is also wary of the risks and seeks to take on the pilot program step by step.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Reserve Bank of India","content":"ORGANIZATION"},{"type":"RBI","content":"ORGANIZATION"}],"hashtag":[],"authors":["Inbar Preiss","The Block"]}