{"summary":"Sky Mavis will stake over 11 million AXS in an effort to &quot;reinforce our long-term commitment to the Axie Infinity ecosystem.&quot; ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176222\/sky-mavis-to-stake-over-11-million-axs-tokens","publishDate":"2022-10-11T11:03:43","id":8696,"type":null,"title":"Sky Mavis to stake over 11 million AXS tokens","category":["METAVERSE & NFT"],"content":["Axie Infinity creators Sky Mavis said the company will stake the 11,475,000 AXS tokens on its balance sheet to “reinforce [its] long-term commitment to the Axie Infinity ecosystem.\"","“Staking this AXS represents our strong alignment with a new type of social contract, one where players and developers work and build together through aligned incentives,” it added in a <a href=\"https:\/\/twitter.com\/skymavishq\/status\/1579749776840880130?s=21\" data-v-f87c67ca=\"\">tweet thread.<\/a>","Sky Mavis is the creator of the play-to-earn game <a href=\"https:\/\/www.theblock.co\/post\/154590\/axie-infinitys-ronin-ethereum-bridge-officially-reopens-following-hack\" data-v-f87c67ca=\"\">Axie Infinity<\/a>, which experienced a meteoric rise in popularity in 2021 before declining in the new year due to the <a href=\"https:\/\/www.theblockcrypto.com\/news+\/146915\/the-decline-of-axie-infinity\" data-v-f87c67ca=\"\">decreasing<\/a> value of in-game token rewards, The Block previously reported. The game since announced a pivot away from the play-to-earn model in an effort to prompt users to receive more from the game than its tokens, Axie co-founder Jeffrey Zirlin recently <a href=\"https:\/\/www.theblock.co\/post\/173137\/crypto-games-are-moving-away-from-play-to-earn-to-build-robust-digital-economies\" data-v-f87c67ca=\"\">mentioned<\/a> on The Scoop.&nbsp;","The most recent move could potentially dilute the 43 million AXS currently staked and decrease the annual percentage rate (APR) for current AXS stakers, according to The Block Research. As of publication, there is over 42 million AXS, worth $491 million, staked at a 43% annual percentage rate.","“I don’t understand how this signals long-term commitment when Sky Mavis can unstake whenever they want,\" said Thomas Bialek, NFT analyst at The Block Research.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$491 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Jeffrey Zirlin","content":"PERSON"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Thomas Bialek","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"43%","content":"PERCENT"},{"type":"AXS","content":"ORGANIZATION"},{"type":"Mavis","content":"PERSON"}],"hashtag":["STAKING"],"authors":["MK Manoylov","The Block"]}