{"summary":"As the value of bitcoin and other cryptocurrencies has risen over the past several years, the financial press has been trying to make sense of it all.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233\/on-their-own-cryptocurrencies-are-an-asset-class-unlike-many-others","publishDate":"2018-08-13T16:42:53","id":87,"type":null,"title":"On their own: Cryptocurrencies are an asset class unlike many others","category":["CRYPTOCURRENCY"],"content":["As the value of bitcoin and other cryptocurrencies has risen over the past several years, the financial press has been trying to make sense of it all. What moves crypto pricing? How does crypto’s value change with stocks? Commodities? Currencies? Macroeconomic factors? The following is a just a smattering of the headlines purporting to place crypto in context with other financial assets:","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">“RBC detects a fledgling relationship between bitcoin and gold”,&nbsp;<\/em><a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.cnbc.com\/2018\/02\/07\/a-relationship-between-bitcoin-and-gold-exists-rbc-analyst-finds.html\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.cnbc.com\/2018\/02\/07\/a-relationship-between-bitcoin-and-gold-exists-rbc-analyst-finds.html\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">CNBC reported<\/em><\/a><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">last December.<\/em>","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">“Bitcoin is selling off this year. Here’s what the decline could mean for stocks,”&nbsp;<\/em><a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.cnbc.com\/2018\/06\/14\/bitcoin-is-crashing-heres-what-it-could-mean-for-stocks.html\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.cnbc.com\/2018\/06\/14\/bitcoin-is-crashing-heres-what-it-could-mean-for-stocks.html\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">the news channel stated<\/em><\/a><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">&nbsp;in June.<\/em>","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">“Turkey meltdown propels lira volatility above bitcoin,”&nbsp;<\/em><a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.bloomberg.com\/news\/articles\/2018-08-13\/turkey-meltdown-propels-lira-volatility-above-bitcoin\" target=\"_blank\" rel=\"noopener nofollow\" data-href=\"https:\/\/www.bloomberg.com\/news\/articles\/2018-08-13\/turkey-meltdown-propels-lira-volatility-above-bitcoin\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">says Bloomberg<\/em><\/a><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">&nbsp;today.<\/em>","Two Yale economists, Yukun Liu and Aleh Tsyvinski, were curious enough to seek an answer to these questions. In “Risks and returns of cryptocurrency,” published by the National Bureau of Economic Research (<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.nber.org\/papers\/w24877.pdf\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.nber.org\/papers\/w24877.pdf\" data-v-f87c67ca=\"\">it’s behind a paywall<\/a>, alas), the pair concluded that the answer — for now — is simple: Nothing much moves crypto prices but crypto itself. They write:","“Cryptocurrencies have no exposure to most common stock market and macroeconomic factors. They also have no exposure to the returns of currencies and commodities.”","And yet, crypto prices do move — often dramatically. The summer’s bear market has helped take bitcoin down 70% from its all-time high and other cryptos&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/the-block-crypto\/bear-territory-cryptos-summer-of-no-love-7876b50814bd\" target=\"_blank\" rel=\"noopener\" data-href=\"https:\/\/medium.com\/the-block-crypto\/bear-territory-cryptos-summer-of-no-love-7876b50814bd\" data-v-f87c67ca=\"\">have fared even worse<\/a>. It seems bad news for crypto is yielding… well more bad news for crypto. And Liu and Tsyvinski might well agree that’s the case. Again, in their own words:","“[W]e determine that there is a strong&nbsp;… momentum effect and that proxies for investor attention strongly forecast cryptocurrency returns.”","These simple conclusions are very important to understand as they run counter to some of the core narratives around crypto. While bitcoin may someday supplant fiat currencies like the U.S. dollar and Japanese yen, it is not currently being priced in a way that implies that. Last week, the investment bank UBS<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.bloomberg.com\/news\/articles\/2018-08-02\/bitcoin-needs-to-hit-213-000-to-replace-money-supply-ubs-says\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.bloomberg.com\/news\/articles\/2018-08-02\/bitcoin-needs-to-hit-213-000-to-replace-money-supply-ubs-says\" data-v-f87c67ca=\"\">&nbsp;argued that bitcoin would need to reach $213,000<\/a>&nbsp;to replace the existing money supply. Bitcoin maximalists certainly see this as plausible. Late last year John McAfee, the software mogul turned bitcoin bull, doubled down on a prediction he had earlier made that bitcoin would hit $500,000.","<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"56f89f949263\" data-v-f87c67ca=\"\">“When I predicted Bitcoin at $500,000 by the end of 2020, it used a model that predicted $5,000 at the end of 2017. BTC has accelerated much faster than my model assumptions. I now predict Bitcoin at $1 million by the end of 2020. I will still eat my d — k if wrong,”<\/span>&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/cointelegraph.com\/news\/john-mcafee-doubles-down-predicts-1-mln-btc-bets-his-dk-on-it\" target=\"_blank\" rel=\"nofollow noopener noopener\" data-href=\"https:\/\/cointelegraph.com\/news\/john-mcafee-doubles-down-predicts-1-mln-btc-bets-his-dk-on-it\" data-v-f87c67ca=\"\">he said rather colorfully late last year in a report at&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">CoinTelegraph<\/em><\/a>.","Never mind the logistical challenges involved in McAfee’s commitment if he’s proven wrong. The truth is that as improbable as a&nbsp;one hundred <em data-v-f87c67ca=\"\">sixtyfold<\/em> increase in bitcoin pricing might be, it’s certainly&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">possible<\/em>&nbsp;that will occur. On the other hand, what is missing thus far is any evidence bitcoin moves are impacted by changes in global currencies, according to the paper.","The authors looked at bitcoin, Ethereum, and Ripple’s XRP for all aspects of their study and then compared the trio of cryptos to five major world currencies: the Australian Dollar, Canadian dollar, euro, Singaporean dollar, and U.K. pound. What they found was no statistical significance comparing the movements of crypto with those of the currencies. This finding goes beyond the question of correlation and causation and rather implies&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">there isn’t even any correlation.<\/em>","None of this means crypto won’t replace national fiat currencies down the road, of course; many long-term outcomes are possible. What it does mean is we aren’t seeing evidence that phenomenon is occurring despite proclamations it has driven crypto thus far.","One of the more persuasive arguments around bitcoin adoption, in particular, is that it acts as a digital equivalent of gold. To wit: It’s a rare enough commodity that it can act as a store of value. Gold itself has served a similar function for thousands of year, in part because it’s relatively portable, fairly easy to verify for purity, and hard to get ahold of. Indeed bitcoin is by design capped in its issuance making it arguably better than gold in this respect if some&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.engineering.com\/DesignerEdge\/DesignerEdgeArticles\/ArticleID\/15308\/Asteroid-Mining-Who-Wants-to-be-a-Trillionaire.aspx\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.engineering.com\/DesignerEdge\/DesignerEdgeArticles\/ArticleID\/15308\/Asteroid-Mining-Who-Wants-to-be-a-Trillionaire.aspx\" data-v-f87c67ca=\"\">far out ideas like asteroid mining<\/a>&nbsp;pan out. (And, of course, it’s quite a bit more portable globally than carrying heavy gold ingots!)","And even while bitcoin has tumbled, it’s certainly proven its mettle as a value store for those investing early. Two years ago, you could purchase a bitcoin for &lt;$600, today it’s 10x that even with recent price declines. Returns are even stronger for those getting in earlier, but still quite positive for buyers even from a year ago (&gt;30%).","But while all of that makes a case for potential diversification into crypto (or at least into bitcoin), what’s thus far lacking is any cause\/effect relationship with existing precious metals. Indeed, what might be more surprising is that so far crypto isn’t moving with them at all. The conclusions of the economists are a little harder to parse here but it helps to just examine the basics for a moment: “With the exception of the exposure of Ethereum to gold, the exposures of all other cryptocurrencies to [gold, platinum, and crude oil] are not statistically significant.”","(It seems rather unlikely that Ethereum prices are destined to move along with gold for any particular Ethereum-specific reason but instead that there is some coincidental movement that has been lacking in bitcoin and XRP.)","The authors also found that “alphas” — excess returns — actually fall when examined against gold and platinum. That’s despite the lack of any correlation in said movements. Bitcoin might be the “new gold” for some, but the old gold is doing just fine right now.","Arguably this one is worth watching more closely in the coming years, however. Ethereum’s recent struggles make bitcoin’s fall look milder, by comparison, suggesting it might possibly be less good as a store of value than bitcoin. In fact, more data might reverse the statistical conclusion above relating gold and Ethereum.","A related narrative to “bitcoin will replace fiat” is such a shift will happen because of the impending collapse of the current macroeconomic system.&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Something<\/em>&nbsp;is coming that will establish a new order around cryptocurrency. The current situation in Turkey, following those in Zimbabwe and Venezuela, shows there is indeed some value in a portable, nation-less, currency-like instrument when a government can control the value of the local currency — most often by lowering that value.","But the authors looked for evidence that macroeconomic data had a more systemic effect on cryptocurrencies and failed to find it. They used four factors of macro performance: non-durable consumption growth, durable consumption growth, industrial production growth, and personal income growth as proxies for the macroeconomy. (Critiques of the methodology are reasonable, though one is likely going to find it difficult to suggest other broad gauges of performance the economists missed).","Other than some linkage between Ethereum and durables, no correlations of significance were found. That Ethereum again was an outlier is almost certainly coincidence as opposed to a causal relationship, but perhaps it appearing twice&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">does mean something<\/em>. Still, it overall leaves one without a compelling argument that crypto is being moved by the economy or vice versa for that matter.","Still, one more explanation that qualifies as “intuitive” remains: that crypto moves with other markets. As an asset class representing roughly $200B, it should be in “rotation” along with stocks, bonds, real estate, commodities, et al. Not surprisingly, the alpha of crypto is statistically significant and has been outstanding in the period measured, which essentially comprises the life history of the coins examined.","Perhaps then it will surprise that beta, or simply put&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">relative<\/em>&nbsp;volatility as compared with other investments, doesn’t meet statistical significance criteria despite being high. A few bits of data are interesting nevertheless: Bitcoin does seem to move along with “growth” stocks rather than “value” stocks and more with high-profit firms rather than low-profit ones, the authors find. But overall any impact from equity moves on crypto pricing is at best hard to discern and most likely not present. The idea in the headline atop this post, therefore, that crypto might lead the stock market is somewhat far-fetched.","Further still, there was an attempt to find meaningful correlation inputs to crytpo mining (electricity prices, et al.) as an intriguing avenue. The authors also attempt to find at least some industries that moved along with crypto, perhaps finding future winners and losers in the process.","A number of data points emerged: “The Consumer Goods and Healthcare industries are positively and statistically significantly affected while the Fabricated Products and Metal Mining (Mines) industries are negatively and statistically significantly affected,” by rises in bitcoin price. But those that many expect&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">would<\/em>&nbsp;be impacted were not: “Surprisingly, the often mentioned Finance, Retail, and Wholesale industries have no statistically significant exposure, and the magnitude of the point estimates is very small.”","So what’s left? The volatility of the prices of cryptocurrencies remains hard to ignore, especially on a day like today where a double-digit change in Ethereum has been seen. The easiest explanations — as demonstrated by the authors and summarized above — have been mostly ruled out by the data.","But if we look holistically at bitcoin and crypto, we should see that Occam’s Razor might provide the answer after all: Faith in crypto and projects around cryptocurrencies\/blockchain make crypto tokens valuable. The more faith (and interest) there is, the more valuable bitcoin, Ethereum, and Ripple become. The more that faith is called into question (Hi, summer of 2018!) the less the currencies are worth.","The authors measured all this using crude proxies like Google searches and Twitter mentions. Crude not because the numbers behind them are inaccurate, but rather because negative sentiment could only be measured by searching on terms like “bitcoin hack” while positive sentiment was seen by changes in use of the search terms, for example.","On the other hand, the Yale economists were able to track “momentum” using a simpler method: seeing how the change in price in a given period predicts the future price in a forthcoming period. This is the “hot hand” idea in basketball (<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.thecut.com\/2016\/08\/how-researchers-discovered-the-basketball-hot-hand.html\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.thecut.com\/2016\/08\/how-researchers-discovered-the-basketball-hot-hand.html\" data-v-f87c67ca=\"\">which has been debunked and also proved true in limited circumstances<\/a>) and other sports.&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Does bitcoin’s rise predict bitcoin’s rise?<\/em>","For both the measures of sentiment and the price gains, there is undoubtedly a significant effect on crypto pricing. Arguably, those two feed into one another as well though the authors don’t appear to have spent much time looking at that. (In other words, a sharp rise in bitcoin price would almost certainly yield a sharp rise in searches for bitcoin which — by their own conclusions — would be correlated with a rise in bitcoin prices!)","For the measured currencies, outlier moves were indeed predictive with those being almost entirely positive for bitcoin and XRP although those broader moves tended to predict a negative countermove in Ethereum. (That Ethereum was often an outlier here might be nothing but more time should answer the question.)","Google searches were unsurprisingly even more correlated. As people look for information on bitcoin, XRP, and Ethereum at least some are new buyers to the world of crypto or those adding to positions. That their searches foretold upward moves reliably is no surprise. These numbers are not so dramatic as to constitute a trading strategy but are noteworthy nevertheless.","That cryptocurrencies values have fallen often confounds the still true core narrative: Cryptocurrency has emerged from nothing a decade ago to something valued at hundreds of billions of dollars. And for many millions of investors, it’s become a place to at least consider putting “investment dollars” into.","Historically, many asset classes have acted as&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">hedges<\/em>&nbsp;(“buy gold in case of inflation”) or diversification (“it’s good to own real estate, which is more stable than stocks”). Rarely has been there been an asset class that one buys because it isn’t much related to others. One could make an argument that art is such a thing: Though overall values and sales are clearly impacted by macroeconomic factors, the value of Picassos, Renoirs, and Cezannes mostly trends upwards on the weird vicissitudes of where new pockets of billionaires are emerging (add a few Russian oligarchs to the Forbes list and it’s good to already own a Monet).","If bitcoin (and possibly other cryptocurrencies) continue to rise long term because people want to own the inherent scarceness of something that gets even a little more useful, the sheer faith in bitcoin can keep it not only rising but also rising on its own unique cadence. The conclusion of the Yale paper, then, is that it might well be intriguing that crypto is mostly uncorrelated because it is uncorrelated. Stocks and bonds will likely never have that characteristic with respect to one another, nor will many commodities.","None of this says you ought to be buying bitcoin tomorrow, but it makes a case that you just might. And if you happen to see a wave of momentum, as measured by Google or even a recent rally feeding on itself, you might find the right entry point too.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"National Bureau of Economic Research","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"Turkey","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Occam","content":"LOCATION"},{"type":"McAfee","content":"ORGANIZATION"},{"type":"$600","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"John McAfee","content":"ORGANIZATION"},{"type":"summer of 2018","content":"DATE"},{"type":"CoinTelegraph","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"UBS","content":"ORGANIZATION"},{"type":"Aleh Tsyvinski","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"Yale","content":"ORGANIZATION"},{"type":"$213,000","content":"MONEY"},{"type":"hundreds of billions of dollars","content":"MONEY"},{"type":"Monet)","content":"ORGANIZATION"},{"type":"Zimbabwe","content":"LOCATION"},{"type":"RBC","content":"ORGANIZATION"},{"type":"XRP","content":"ORGANIZATION"},{"type":"euro","content":"ORGANIZATION"},{"type":"Venezuela","content":"LOCATION"},{"type":"$200B","content":"MONEY"},{"type":"Yukun Liu","content":"PERSON"},{"type":"$5,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$500,000","content":"MONEY"},{"type":"Healthcare","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"Tsyvinski","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["John Biggs","The Block"]}