{"summary":"Video reviews show how China&#x27;s digital yuan can be paid by merely having two devices touching each other with or without internet connection.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/87754\/china-digital-yuan-touching-pay","publishDate":"2020-12-15T14:17:19","id":8700,"type":null,"title":"China is testing its digital currency in Suzhou. Here&#x27;s an early look at the user experience","category":["CHINA"],"content":["Lottery winners of Chinese city Suzhou's $3 million digital yuan red packets are now able to spend their free central bank digital currency, known as DC\/EP.","Video reviews of the ongoing test by Chinese state-owned media show that residents who have activated a DC\/EP wallet can pay not only via regular QR codes but also by merely touching their smartphones with a merchant's sensor device.","The Block has previously <a href=\"https:\/\/www.theblockcrypto.com\/post\/86773\/six-things-china-digital-yuan-lottery\" data-v-f87c67ca=\"\">reported<\/a>&nbsp;on the six major ways Suzhou's DC\/EP test is different from the one conducted in Shenzhen in October.","The contact feature, with or without internet connections, is one feature that differentiates DC\/EP transactions from mobile payment giants like AliPay or WeChat, where payments can only be initiated by scanning QR codes.","According to a state media <a href=\"https:\/\/weibo.com\/1301904252\/JyoUAovgh?refer_flag=1001030103_&amp;type=comment\" data-v-f87c67ca=\"\">Jiangsu TV<\/a>&nbsp;report on Monday, a local resident surnamed Wu bought a product at a physical shop owned by Chinese e-commerce giant JD.com in Suzhou, Jiangsu province — right after <a href=\"https:\/\/www.theblockcrypto.com\/linked\/86654\/suzhou-3m-digital-yuan-lottery\" data-v-f87c67ca=\"\">the city-wide DC\/EP test<\/a> officially started on December 11.","The video clip, embedded below at timestamp 00:14, shows that after activating his DC\/EP wallet and choosing the touching feature, Wu touched his mobile phone with a digital yuan sensor device installed at the JD shop. The interface on his smartphone was instantly directed to a page where he could type in the price and complete the payment.&nbsp;&nbsp;","The touching feature exists alongside QR codes that are also supported in the Suzhou test. A QR code is the only payment method on Chinese mobile payment giants AliPay or WeChat Pay where users can either scan a merchant's receiving QR code or having a merchant to scan their paying QR code to complete transactions.","However, DC\/EP's touching feature can only be tested between a lottery-winner and a merchant. Individual residents cannot send each other DC\/EP via touching their smartphones at this stage.&nbsp;","In addition to touching devices with internet connections, the Suzhou trial has rolled out an invite-only test for offline transactions by having smartphones touch each other without network access.","The same Jiangsu TV news clip, at timestamp 1:00, shows that a customer tested a payment of 7.9 yuan, about $1.2, by touching her smartphone back-to-back with a merchant's smartphone while both devices turned off cellular or WiFi signal. It appears the offline transaction process took about five seconds as shown in the video.","","","Another new feature that was revealed in the Suzhou test is the sub-wallet push function, which is what enables the spending of DC\/EP in online scenarios.&nbsp;","A <a href=\"https:\/\/weibo.com\/tv\/show\/1034:4581698755559494?from=old_pc_videoshow\" data-v-f87c67ca=\"\">review video<\/a> from The Beijing News, from timecode 00:45, shows that if Suzhou users want to spend their digital yuan on JD.com's mobile app, they need to tap on the top-right corner of their DC\/EP wallets to enable a JD sub-wallet push. After that, they will find a DC\/EP payment option available on their mobile JD.com app.","JD.com <a href=\"https:\/\/jdcorporateblog.com\/nearly-20000-orders-made-by-dcep-in-first-24-hours-on-jd\/\" data-v-f87c67ca=\"\">said<\/a> it received nearly 20,000 DC\/EP orders in the first 24 hours after the Suzhou test started at 8:00 pm China time on December 11.&nbsp;","In addition to JD.com, The Block <a href=\"https:\/\/www.theblockcrypto.com\/linked\/87486\/didi-meituan-bilibili-suzhou-digital-yuan\" data-v-f87c67ca=\"\">reported<\/a> last week that three Chinese internet giants are also taking part in the Suzhou test: ride-hailing giant DiDi, food delivery platform Meituan and video streaming platform Bilibili.","Indeed, the Beijing News' review video shows additional sub-wallet push functions for Meituan's bike-sharing and DiDi are available if users have activated their DC\/EP wallets with Industrial and Commercial Bank of China.","<span data-v-f87c67ca=\"\">DC\/EP sub-wallet push via The Beijing News review video<\/span>","The Suzhou test will end on December 27 and any unspent digital yuan will be collected back by the government.","That said, a second <a href=\"https:\/\/weibo.com\/tv\/show\/1034:4581402352484373?from=old_pc_videoshow\" data-v-f87c67ca=\"\">news clip<\/a> from Jiangsu TV indicated that more DC\/EP in red packets will arrive in Suzhou in different amounts during several upcoming festivals, including the Winter Solstice, New Year, the Lunar New Year as well as the Lantern Festival.","Speaking of the experience thus far, a customer identified as Miss Ma said she found the offline payment \"quite convenient,\" especially for scenarios where the cellular signal can be weak, if not completely unavailable.","One shop owner, identified as Mr. Ma, said one advantage for him as a merchant is there's no transaction fee if he wants to convert his DC\/EP into bank savings.&nbsp;","By comparison, there's no charge for Chinese users to top up their AliPay or WeChat Pay wallets with their bank accounts. But there's typically a 0.1% transaction fee if they want to withdraw funds from AliPay or WeChat Pay wallets back to their banks.&nbsp;","Ma said his shop sold some 600 yuan — about $90 — worth of goods in seven or eight DC\/EP transactions within hours after the Suzhou test began.","\"It's just like cash but with a mobile wallet for funds to go in and out,\" Ma said of his test experience. \"And there's no transaction fee if I move the funds from a DC\/EP to my bank account.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Meituan","content":"ORGANIZATION"},{"type":"1:00","content":"TIME"},{"type":"Beijing News","content":"ORGANIZATION"},{"type":"$1.2","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Shenzhen","content":"LOCATION"},{"type":"December 11","content":"DATE"},{"type":"Jiangsu","content":"LOCATION"},{"type":"Suzhou","content":"LOCATION"},{"type":"8:00","content":"TIME"},{"type":"$3 million","content":"MONEY"},{"type":"Commercial Bank of China","content":"ORGANIZATION"},{"type":"0.1%","content":"PERCENT"},{"type":"Winter Solstice","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"The Beijing News","content":"ORGANIZATION"},{"type":"December 27","content":"DATE"},{"type":"DC","content":"ORGANIZATION"},{"type":"Ma","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"DC\/EP","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"$90","content":"MONEY"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}