{"summary":"If you were an Ethereum-based NFT bought or sold in the first week of March, there&#x27;s an 84% chance that you changed hands on the marketplace Blur.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217458\/blur-captures-84-of-eth-based-nft-transactions-in-first-week-of-march","publishDate":"2023-03-07T11:46:32","id":8702,"type":null,"title":"Blur captures 84% of ETH-based NFT transactions in first week of March","category":["COMPANIES"],"content":["If you were an Ethereum-based NFT bought or sold in the first week of March, there's an 84% chance that you changed hands on the Blur marketplace, according to data from The Block.","As recently as January those chances would have been closer to 43%, but in a little over two months, Blur's marketshare has nearly doubled – overtaking rival OpenSea by double digits.","Launched in October 2022 to much fanfare, Blur quickly became the third-largest NFT marketplace by volume in January, according to data from The Block.&nbsp;","But the platform reached new heights this February after it launched its native token, $Blur, enticing new users with a mixture of airdrops, token incentives, and cheap trading fees. In the first 24 hours after it launched, the token did about $1.1 billion in volume, according to CoinGecko data.","The combination has created a \"powerful cocktail,\" according to Thomas Bialek, an analyst at The Block Research.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/nft-marketplace-monthly-volume\/embed\" title=\"Ethereum NFT Marketplace Monthly Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","In February, the overall NFT marketplace rose alongside Blur, reaching its <a href=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/nft-overview\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">highest transaction volume<\/a> since May.","It’s unclear if the spike is sustainable or merely connected to the incentives offered by Blur, according to Bialek.&nbsp;","\"It seems likely that this heated NFT marketplace war will continue to intensify in the near future, with Blur needing to demonstrate the longevity of its approach and OpenSea needing to come up with an effective response,\" Bialek said,","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thomas Bialek","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"43%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"first week of March","content":"DATE"},{"type":"October 2022","content":"DATE"},{"type":"84%","content":"PERCENT"},{"type":"$Blur","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Bialek","content":"PERSON"},{"type":"$1.1 billion","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Sam Venis","The Block"]}