{"summary":"Tyr Capital has been accused of mismanagement by an investor and searched by Swiss prosecutors, the Financial Times reported.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278122\/crypto-hedge-fund-tyr-faces-allegations-of-ignoring-ftx-risk-warnings-ft","publishDate":"2024-02-20T02:24:21","id":8703,"type":null,"title":"Crypto hedge fund Tyr faces allegations of ignoring FTX risk warnings: FT","category":["COMPANIES"],"content":["Switzerland-based crypto hedge fund Tyr Capital has been accused of mismanagement by an investor and searched by Swiss prosecutors after the investor alleged the firm to have ignored early warnings over the collapse of the FTX exchange, according to the Financial Times.","Tyr allegedly ignored warnings from TGT, a fund that invested with Tyr, regarding its exposure to FTX and only attempted to withdraw assets from FTX after the exchange filed for bankruptcy in November 2022, the Financial Times <a href=\"https:\/\/www.ft.com\/content\/2bfc1f50-3b5e-4bd1-99be-8a111e4b8dc4\" data-v-f87c67ca=\"\">reported<\/a> on Tuesday, citing legal documents filed in the Cayman Islands.","TGT claimed that it had warned Tyr about the risks associated with FTX between Nov. 7 and 10, 2022 — before the exchange collapsed. TGT — whose directors include Yield App Co-founders Justin Wright and Jason Corbett — is currently making efforts to wind down its portfolio and gain control of its assets, including a $22 million claim against FTX, according to the FT report.","Tyr did not immediately respond to The Block’s request for comment. Tyr said in the media report that it could not comment in detail given the ongoing investigations.","In April 2023, TGT filed a criminal complaint against Tyr with the Swiss prosecutor for criminal mismanagement. The prosecutor carried out a search at the fund manager’s office and seized documents in August — according to the FT article, which cited a source familiar with the matter.","<span data-v-f87c67ca=\"\">FTX filed for bankruptcy in November 2022. <\/span><span data-v-f87c67ca=\"\">FTX lawyer Andrew Dietderich <\/span><a href=\"https:\/\/www.theblock.co\/post\/275405\/bankrupt-ftx-wont-be-restarting-but-former-customers-will-get-money-back-in-full\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">told a judge last month<\/span><\/a><span data-v-f87c67ca=\"\"> that FTX plans to repay former customers in full but it has abandoned plans to restart the exchange.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“That payment in full is based on the petition date values of those claims,” the lawyer added. “Many of those claims are premised upon currencies, which declined dramatically in value in that tumultuous period leading up to the petition date.”<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cayman Islands","content":"LOCATION"},{"type":"April 2023","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Tyr","content":"ORGANIZATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"FT","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$22 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Andrew Dietderich","content":"PERSON"},{"type":"Justin Wright","content":"PERSON"},{"type":"TGT","content":"ORGANIZATION"},{"type":"Nov. 7 and 10, 2022","content":"DATE"},{"type":"Tyr Capital","content":"ORGANIZATION"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Jason Corbett","content":"PERSON"},{"type":"November 2022","content":"DATE"},{"type":"August","content":"DATE"}],"hashtag":["FTX","INVESTMENT FIRMS"],"authors":["Timmy Shen","The Block"]}