{"summary":"Chainway has released a &quot;Proof of Innocence&quot; tool for Tornado Cash users to show their funds didn&#x27;t originate from nefarious sources.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/204544\/tornado-cash-proof-of-innocence","publishDate":"2023-01-23T07:37:11","id":8704,"type":null,"title":"New tool lets Tornado Cash users privately show their funds were not illicit","category":["CRYPTO ECOSYSTEMS"],"content":["A tool built by Chainway lets Tornado Cash users prove their initial deposits were not from a list of wallets containing stolen funds — without revealing their own address.","Called Proof of Innocence, the tool is designed for those who want to use Tornado Cash but also want to show they're not a bad actor. It's designed for legitimate users who don't want to be associated with nefarious activities, yet still want to maintain their own privacy.","\"Nice way to prove you're not a bad actor without giving up your anonymity,\" <a href=\"https:\/\/twitter.com\/semenov_roman_\/status\/1616266327710130177?s=20&amp;t=hbhAAwU1H5QL0ynOLQefNw\" data-v-f87c67ca=\"\">said<\/a> Roman Semenov, a co-founder of Tornado Cash, on Twitter on Friday.","Those who want to use the new tool need to provide a list of malicious wallets they don't want to be associated with. It then uses cryptography to prove that the wallet they used to deposit the funds isn't contained within that list.","\"By providing this proof, users can show that they are not hackers or other bad actors, and can make withdrawals from Tornado Cash with confidence,\" Chainway, which describes itself as a web3 venture builder, said in a <a href=\"https:\/\/medium.com\/@chainway_xyz\/introducing-proof-of-innocence-built-on-tornado-cash-7336d185cda6\" data-v-f87c67ca=\"\">Medium post<\/a> last week. \"This not only improves the security and trustworthiness of the system, but also helps to protect legitimate users from being associated with illegal activities, without sacrificing their privacy.\"","Currently this is possible to do within Tornado Cash, but doing so requires the user to provide their address — something that undermines the purpose of using a crypto mixing service.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chainway","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Roman Semenov","content":"PERSON"}],"hashtag":["CENSORSHIP","DEVELOPER TOOLS","WALLETS"],"authors":["Tim Copeland","The Block"]}