{"summary":"New and active daily addresses surged following OpenSea Pro&#x27;s launch — meant to rival upstart NFT marketplace Blur — but competition remains fierce.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225457\/opensea-pro-blur-transactions-volumes-addresses","publishDate":"2023-04-08T03:21:03","id":8709,"type":null,"title":"OpenSea Pro overtakes rival Blur in key metric","category":["NFT MARKETPLACES"],"content":["NFT aggregator OpenSea Pro has seen significant increases in active addresses and transaction volumes this week following its launch. It also managed to take and maintain the top share of transactions in a competitive market.","Both new and active daily addresses surged following OpenSea's announcement of its new offering — geared toward professional traders and meant to rival upstart NFT marketplace Blur.","<span data-v-f87c67ca=\"\">New daily addresses on OpenSea Pro surged following its launch. Source: Dune\/@onures<\/span>","According to data from Dune, new addresses on OpenSea Pro spiked to above 1,800 daily before falling back toward 1,000.","Active addresses also surged above 3,500 daily and have been hovering below 3,000 since.","<span data-v-f87c67ca=\"\">Active daily addresses on OpenSea Pro have also spiked. Source: Dune\/@onures<\/span>","Daily volume on the rebranded platform has similarly surged, surpassing $3 million. It has since hovered above $2.5 million.","<span data-v-f87c67ca=\"\">Daily volume in USD on OpenSea Pro has increased significantly since its launch. Source: Dune\/@onures<\/span>","Blur has long dominated daily volume among NFT aggregators since arriving on the scene with its high-profile airdrops, meant to <a href=\"https:\/\/www.theblock.co\/post\/211374\/blur-debuts-long-awaited-token\" data-v-f87c67ca=\"\">incentive<\/a> activity on the platform. Now, it has some competition.","OpenSea Pro has been battling Blur for most daily volume among NFT aggregators. The former took the lead on April 5 and April 6 but lost the lead to Blur yesterday.","<span data-v-f87c67ca=\"\">OpenSea Pro has made volumes among NFT aggregators more competitive. Source: Dune\/@onures<\/span>","Similarly, OpenSea Pro garnered the most-significant percentage share of the market among NFT aggregators on April 5 and April 6 — but, again, lost the lead to Blur yesterday.","<span data-v-f87c67ca=\"\">OpenSea Pro has also made the landscape of NFT aggregators' daily volume share more competitive. Source: Dune\/@onures<\/span>","One metric which has seen OpenSea Pro take and maintain the lead over rival Blur is daily transactions share among NFT aggregators.","OpenSea's new offering saw the most daily transactions on April 5, garnering 55.1% of the market against Blur's 29.5%. It took an even larger share of overall transactions the following day, with 58.4% occurring on OpenSea Pro.","Yesterday — and so far today — OpenSea Pro is maintaining more than 50% of transactions among NFT aggregators.","<span data-v-f87c67ca=\"\">OpenSea Pro is dominating daily transactions share among NFT aggregators. Source: Dune\/@onures<\/span>","OpenSea Pro is — at least in some ways — a rebranding of NFT aggregator Gem, which OpenSea <a href=\"https:\/\/www.theblock.co\/post\/143297\/opensea-acquires-nft-aggregator-gem\" data-v-f87c67ca=\"\">acquired<\/a> in April of last year.","At the time, Gem said the acquisition offer was \"unexpected\" but would accelerate its next growth stage. Meanwhile, OpenSea said that it would be able to \"learn from Gem’s expertise and intuition about the advanced NFT community.\"","Gem has since been <a href=\"https:\/\/www.theblock.co\/post\/224875\/opensea-blur-nfts-pro\" data-v-f87c67ca=\"\">integrated<\/a> into OpenSea Pro.","“Building on previous Gem designs, we’re excited to roll out a vastly improved suite of features that will allow collectors to discover the best deals and insights across 170 marketplaces and access sophisticated tools that meet their need for automation,” OpenSea said.","<em data-v-f87c67ca=\"\">Disclaimer: Larry Cermak, CEO of The Block, is an angel investor in Blur.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dune","content":"ORGANIZATION"},{"type":"$2.5 million","content":"MONEY"},{"type":"April 5","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"April 6","content":"DATE"},{"type":"Gem","content":"PERSON"},{"type":"$3 million","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"USD","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Larry Cermak","content":"PERSON"},{"type":"55.1%","content":"PERCENT"},{"type":"29.5%","content":"PERCENT"},{"type":"58.4%","content":"PERCENT"},{"type":"OpenSea","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Dune\/@onures","content":"ORGANIZATION"}],"hashtag":["BLUR","OPENSEA"],"authors":["Adam James","The Block"]}