{"summary":"New York is suing Alex Mashinsky, seeking to get money back to customers who lost it in Celsius&#x27; bankruptcy. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199522\/new-york-sues-former-celsius-ceo-for-fraud","publishDate":"2023-01-05T11:38:00","id":8710,"type":null,"title":"New York sues former Celsius CEO for fraud","category":["LEGAL"],"content":["New York's attorney general filed a lawsuit against Alex Mashinsky, alleging that the former CEO of the now-bankrupt crypto lender Celsius defrauded investors.","\"The collapse of Celsius left many individuals in a state of desperation and financial ruin,\" the complaint filed today reads. \"Celsius’s business model was unsustainable. As Celsius proved unable to generate sufficient returns through safe loans and investments, it began to make uncollateralized loans to institutional borrowers and engage in risky strategies on unregulated decentralized finance protocols.\"&nbsp;","“As the former CEO of Celsius, Alex Mashinsky promised to lead investors to financial freedom but led them down a path of financial ruin,” Attorney General Letitia James said in a statement. In the civil suit, James and her office assert that Mashinsky misled investors by saying that the company had $11 billion under management without disclosing that Celsius also had $11.9 billion in liabilities.&nbsp;","The case is a civil suit that would require Mashinsky to pay damages and give back money to investors, while also barring him from leading any business in New York state.","Celsius is also in a contentious bankruptcy process in federal bankruptcy court, with a judge ruling Wednesday that digital assets of customers held in Celsius accounts were considered property of the company due to terms of service.&nbsp;","Celsius offered high interest rates on its users' crypto deposits while advertising them as analogous to bank accounts. But those accounts were not insured, and the firm collapsed amid the stablecoin crash last year. Users are now scrambling to get funds locked up in legal proceedings.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"last year","content":"DATE"},{"type":"Letitia James","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"James","content":"PERSON"},{"type":"$11 billion","content":"MONEY"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"Mashinsky","content":"PERSON"},{"type":"$11.9 billion","content":"MONEY"}],"hashtag":[],"authors":["Kollen Post","The Block"]}