{"summary":"The Sotheby&#x27;s Gen Art Program will feature two to three generative artists a year, auctioning their work through blockchain-based methods. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236995\/sothebys-launches-blockchain-fueled-program-for-generative-artists","publishDate":"2023-06-28T16:23:54","id":8712,"type":null,"title":"Sotheby&#x27;s launches blockchain-fueled program for generative artists","category":["METAVERSE & NFT"],"content":["The centuries-old auction house Sotheby's is unveiling a new blockchain-based program for generative artists.&nbsp;","Dubbed the Gen Art Program, Sotheby's will feature the work of two to three generative artists per year in fully on-chain auctions using the generative asset creator <a href=\"https:\/\/www.theblock.co\/post\/166344\/nft-project-art-blocks-launches-engine-for-generative-asset-creation\" data-v-f87c67ca=\"\">Art Blocks Engine<\/a>.","The auction house will have the first-ever auction for the program on July 26, when it will sell 500 pieces from generative artist Vera Molnár. At 99 years old, Molnár has experimented with algorithms and generative work since the 1960s.&nbsp;","\"Generative art has played a central role in the evolution of digital art, and has featured prominently throughout our digital art offerings, including an auction dedicated to gen art in April 2022 which featured Vera Molnár’s debut NFTs,\" Sotheby’s Head of Digital Art and NFTs Michael Bouhanna told The Block via email. \"The launch of the Gen Art Program allows us to further showcase and support the leading gen artists working today with exclusive offerings of new works, and, in addition to our traditional auctions, provides additional ways to engage with collectors and spotlight artists.&nbsp;","The sale will take place fully on-chain through the auction house's curated NFT platform <a href=\"https:\/\/www.theblock.co\/linked\/120666\/art-house-sothebys-launches-curated-nft-platform-called-sothebys-metaverse\" data-v-f87c67ca=\"\">Sotheby's Metaverse<\/a>. Only ETH payments will be accepted.","Sotheby's found recent success with generative art through the sale of \"The Goose,\" a highly sought-after NFT from generative artist <a href=\"https:\/\/www.theblock.co\/post\/227177\/sothebys-nft-auction-3ac\" data-v-f87c67ca=\"\">Dmitri Cherniak<\/a>. The auction house sold off the NFT for <a href=\"https:\/\/www.theblock.co\/post\/235030\/dmitri-cerniaks-the-goose-nft-sold-for-6-5-million-at-sothebys-auction\" data-v-f87c67ca=\"\">$6.2 million<\/a> earlier this month. The defunct crypto hedge fund <a href=\"https:\/\/www.theblock.co\/post\/195611\/failed-hedge-fund-three-arrows-capital-estimated-assets-at-1-billion-in-july\" data-v-f87c67ca=\"\">Three Arrows Capital<\/a>, or 3AC, used to own the NFT, originally purchasing it for $5.8 million.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sotheby","content":"ORGANIZATION"},{"type":"July 26","content":"DATE"},{"type":"Sotheby’s Head of Digital","content":"ORGANIZATION"},{"type":"April 2022","content":"DATE"},{"type":"Dmitri Cherniak","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$5.8 million","content":"MONEY"},{"type":"$6.2 million","content":"MONEY"},{"type":"Molnár","content":"PERSON"},{"type":"1960s","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Vera Molnár","content":"PERSON"},{"type":"Michael Bouhanna","content":"PERSON"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}