{"summary":"The original seller is putting up the financing to buy back the company from FTX, which has no use for its valuable license.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276990\/ftx-files-to-sell-subsidiary-acquired-for-10-million-to-coinlist-for-500000","publishDate":"2024-02-10T18:32:44","id":8714,"type":null,"title":"FTX files to sell subsidiary acquired for $10 million to CoinList for $500,000","category":["COMPANIES"],"content":["The FTX Debtors estate, led by CEO John Ray III, has filed to sell another one of its assets: Digital Custody Inc. (DCI). FTX had purchased the subsidiary in two $5 million transactions in Dec. 2021 and Aug. 2022; however, the company will be sold to CoinList for just $500,000, with the financing provided by DCI's original CEO and seller, Terence J. Culver.&nbsp;","In their <a href=\"https:\/\/restructuring.ra.kroll.com\/FTX\/Home-DownloadPDF?id1=MzA1OTc3Ng==&amp;id2=-1\" data-v-f87c67ca=\"\">filing<\/a>, FTX's lawyers explain that DCI was purchased to provide custodial services for FTX.US and LedgerX, though the company was never formally integrated into the FTX ecosystem before former CEO Sam Bankman-Fried filed for bankruptcy in November 2022, three months after the DCI purchase was finalized.&nbsp;","The lawyers also explain that their failure to restart FTX.US means DCI is essentially worthless to the estate, writing \"DCI is also no longer useful to the Debtors’ business given the Debtors’ sale of LedgerX and that it is unlikely for the Debtors to sell or restart FTX US.\"","However, DCI retains a license from the South Dakota Division of Banking that allows it to provide custodial services. After receiving offers from three interested parties, including Culver, the Debtors chose the purchaser \"...based on its superior offer, ability to execute the Sale Transaction within a short time frame and relationship with Mr. Culver, which the Debtors believe will be advantageous in aiding Purchaser in obtaining regulatory approval for the Sale Transaction in an expeditious manner.\"&nbsp;","FTX's lawyers note that the Committee and the Ad Hoc Committee of Non-US Customers of FTX.com both approved the transaction, though as part of the deal, FTX has until three days before the closing to find a better offer for DCI. A reverse-termination fee of $50,000 will apply if the purchaser is unable to close the deal.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Digital Custody Inc.","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Culver","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Dec. 2021","content":"DATE"},{"type":"$50,000","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Committee","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"DCI","content":"ORGANIZATION"},{"type":"$500,000","content":"MONEY"},{"type":"Hoc Committee of Non-US Customers","content":"ORGANIZATION"},{"type":"South Dakota Division of Banking","content":"ORGANIZATION"},{"type":"John Ray III","content":"PERSON"},{"type":"Sale Transaction","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Aug. 2022","content":"DATE"},{"type":"Terence J. Culver","content":"PERSON"},{"type":"November 2022","content":"DATE"},{"type":"$5 million","content":"MONEY"}],"hashtag":["BANKRUPTCY FILINGS","FTX"],"authors":["Zack Abrams","The Block"]}