{"summary":"Wintermute says Node will expand its OTC API to enable institutional clients to trade crypto assets and their derivatives.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/140797\/wintermute-launches-institutional-crypto-otc-trading-platform","publishDate":"2022-04-06T09:52:46","id":8721,"type":null,"title":"Wintermute launches institutional crypto OTC trading platform","category":["STARTUPS"],"content":["Crypto market-maker Wintermute has launched Node, an over-the-counter (OTC) platform for institutional clients and qualified investors to trade digital assets and their derivatives.","Wintermute Node is an extension of the company’s OTC API product launched in June 2021 that functioned as a liquidity delivery mechanism for digital asset trading.","The company says Node will deliver proprietary prices and reliable feeless click-to-trade execution for over 250 digital assets.","According to the announcement issued Wednesday, Wintermute’s existing proprietary algorithms that aggregate data from over 60 centralized and decentralized exchanges (DEX) will power NODE’s pricing and execution function.","Wintermute CEO Evgeny Gaevoy told The Block that the new OTC platform has both API and a user interface. Wintermute has been running institutional OTC crypto trading APIs since June 2021 and is one of the few OTC spot trading desks <a href=\"https:\/\/www.theblockcrypto.com\/linked\/135592\/wintermute-wins-approval-for-uks-crypto-register-as-deadline-approaches\" data-v-f87c67ca=\"\">listed on<\/a> the UK Financial Conduct Authority (FCA)'s cryptoasset register.","The company says NODE will make it easier for family offices, hedge funds, and other big-money players to participate in niche markets like decentralized finance (DeFi).","As Gaevoy noted, Wintermute being on the FCA cryptoasset register provides a viable pathway for institutions to get involved in the DeFi space, which is the subject of a nascent but evolving regulatory environment worldwide.&nbsp;","<em data-v-f87c67ca=\"\">Update: This story has been corrected to show that Wintermute is on the FCA's cryptoasset register but is not FCA-regulated, as originally stated.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Evgeny Gaevoy","content":"PERSON"},{"type":"June 2021","content":"DATE"},{"type":"UK Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"Wintermute Node","content":"ORGANIZATION"}],"hashtag":["WINTERMUTE"],"authors":["Osato Avan-Nomayo","The Block"]}