{"summary":"Cryptocurrency exchange Bitmex has delayed the listing of its native token BMEX, citing market volatility. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157047\/bitmex-delays-native-token-citing-market-conditions","publishDate":"2022-07-12T05:32:07","id":8722,"type":null,"title":"BitMEX delays native token listing, citing market conditions","category":["EXCHANGE TOKEN"],"content":["Cryptocurrency exchange BitMEX has delayed the listing of its native token BMEX, citing market volatility.&nbsp;","While the crypto futures and spot exchange said in a statement today it's ready to list BMEX for trading, it <a href=\"https:\/\/blog.bitmex.com\/bmex-launch-rescheduled\/\" data-v-f87c67ca=\"\">called<\/a> present market conditions \"not ideal\" for holders of the token. Recent market turbulence has seen bitcoin drop below $20,000 from a high of more than $60,000 in November.&nbsp;","\"Bear markets are not easy; we have seen our share over the years and stayed strong, even with bitcoin at much lower levels,\" said the statement. \"As we look to the future, listing BMEX on our spot exchange remains our top priority and we hope to celebrate this milestone with you soon.\"&nbsp;","The exchange didn't immediately respond to a request for further comment on the postponed listing date.&nbsp;","BitMEX <a href=\"https:\/\/www.theblock.co\/post\/128227\/crypto-exchange-bitmex-own-bmex-token-launch-airdrop\" data-v-f87c67ca=\"\">announced<\/a> the launch of its native token in December last year and had airdropped <a href=\"https:\/\/www.coindesk.com\/markets\/2022\/01\/31\/crypto-exchange-bitmex-airdrops-15m-bmex-tokens-to-users\/\" data-v-f87c67ca=\"\">1.5 million tokens to users<\/a> as of January this year. The company says it's continuing to airdrop the token to traders and new joiners.&nbsp;","The tokens have a maximum supply of 450 million units and are vested over a period of up to five years. Users can currently utilize the token by staking it to receive trading fee discounts and withdrawal funds.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"January this year","content":"DATE"},{"type":"$60,000","content":"MONEY"},{"type":"December last year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$20,000","content":"MONEY"},{"type":"November","content":"DATE"}],"hashtag":["BITMEX"],"authors":["Tom Matsuda","The Block"]}