{"summary":"Singapore will require crypto firms to keep customer funds in a trust before the end of the year, as part of newly announced requirements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237453\/singapore-crypto-firms-client-funds-trust","publishDate":"2023-07-03T06:37:41","id":8725,"type":null,"title":"Singapore wants crypto firms to keep client funds in a trust","category":["POLICY"],"content":["The Monetary Authority of Singapore (MAS) announced new requirements for crypto firms to keep their customers' funds in a statutory trust before the end of the year. <span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The new requirements are \"draft legislative amendments\" and are open for public comments before they are passed into law.<\/span>","The MAS <a href=\"https:\/\/www.mas.gov.sg\/news\/media-releases\/2023\/mas-publishes-investor-protection-measures-for-digital-payment-token-services\" data-v-f87c67ca=\"\">said<\/a> the new requirements for digital payment token (DPT) service providers \"will mitigate the risk of loss or misuse of customers' assets and facilitate the recovery of customers' assets in the event of a DPT service provider's insolvency.\"","Crypto platforms will also be required to perform daily reconciliation, maintain proper records and operate custody services independently, the regulator said. Additionally, they will need to provide clear risk disclosures to customers regarding the storage of their assets.","The new requirements <a href=\"https:\/\/www.theblock.co\/post\/179929\/singapore-regulator-proposes-banning-crypto-trading-with-borrowed-capital\" data-v-f87c67ca=\"\">follow a public consultation<\/a> on proposed rules for the crypto sector in October. Singapore will now also push ahead to restrict crypto firms from providing lending and staking services to retail customers, as first proposed in October. While \"self-staking\" will be allowed.","\"MAS would like to clarify, in response to feedback received, that retail customers are not prohibited from handling their own assets (e.g. self-staking), including the lending and staking of those assets,\" the regulator <a href=\"https:\/\/www.mas.gov.sg\/-\/media\/mas\/news-and-publications\/consultation-papers\/2022-proposed-regulatory-measures-for-dpt-services\/response-to-public-consultation-on-proposed-regulatory-measures-for-dpt-services-part-1.pdf\" data-v-f87c67ca=\"\">said<\/a>. But crypto platforms \"will be restricted from facilitating staking arrangements for retail customers, in addition to lending of retail customers' assets.\"&nbsp;","These new requirements will be made official through guidelines and changes to the Payment Services Regulations 2019. They are currently open for public feedback until August 3, the MAS said.","The MAS said it will release more responses to the October consultation feedback in multiple parts. Today's new requirements are just Part 1 of the response, focused on the rules for separating and safeguarding customers' assets.","Overall, the new requirements are to protect consumers from losses \"given the extremely high risk and speculative nature of DPT trading,\" the regulator said, adding that consumers must also continue to exercise \"utmost caution\" when trading in crypto as they may lose their assets.","\"While the segregation and custody requirements will minimize the risk of loss of customers' assets, consumers may still face significant delays in recovering their assets in the event of insolvency of the service providers,\" the MAS said. \"Consumers must also remain vigilant and not deal with unregulated entities, including those based overseas, as they risk losing all their assets.\"","While Singapore continues to tighten its regulatory regime for the crypto sector, Hong Kong is <a href=\"https:\/\/www.theblock.co\/post\/232961\/hong-kong-crypto\" data-v-f87c67ca=\"\">aiming to<\/a> attract more crypto firms in the region.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DPT","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"August 3","content":"DATE"},{"type":"Payment Services Regulations","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Monetary Authority of Singapore (MAS","content":"ORGANIZATION"},{"type":"MAS","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"2019","content":"DATE"}],"hashtag":["ASIAN PARLIAMENTS"],"authors":["Yogita Khatri","The Block"]}