{"summary":"Jito&#x27;s initial governance cohort will include individuals from Coinbase Cloud, the Solana Foundation and its own community.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277026\/jito-governance-group","publishDate":"2024-02-12T11:01:21","id":8727,"type":null,"title":"Jito Foundation earmarks 12 million tokens to governance delegates from Coinbase Cloud, Solana Foundation and others","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Solana-based staking project <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Jito <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/266782\/jito-jto-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><!----> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">JTO<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.76%\n    <\/span><\/a> <!----><\/span><\/span>’s initial governance cohort will include individuals from Coinbase Cloud, the Solana Foundation, and its own community.<\/span>","The project named 17 individuals and projects, according to a statement. The list includes research company Gauntlet, infrastructure platform Chainflow, and crypto analytics platform Flipside.","The Jito Foundation will be delegating 12 million JTO ($23.5 million) of voting power to the cohort, spread evenly. This represents roughly 10% of the circulating supply of the JTO token, according to <a href=\"https:\/\/www.theblock.co\/price\/266782\/jito-jto-usd\" data-v-f87c67ca=\"\">The Block’s Price Page<\/a>.","“Historically, governance on Solana has not been as active compared with other chains,” said Jito Network Core Contributor Lucas Bruder. “We’re hoping that the Jito Foundation’s delegation program can set a new high water mark for governance on Solana.”","The delegates will use the voting power to guide the future direction of the project through its governance forum. The Jito Foundation said upcoming votes will include the launch of StakeNet, its future staking product that monitors validators.","<em data-v-f87c67ca=\"\">Update: Corrected Flipside's business description.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jito Network Core Contributor Lucas Bruder","content":"ORGANIZATION"},{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"-1.76%","content":"PERCENT"},{"type":"Jito Foundation","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$23.5 million","content":"MONEY"},{"type":"The Block’s Price Page","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Coinbase Cloud","content":"ORGANIZATION"}],"hashtag":["STAKING"],"authors":["Tim Copeland","The Block"]}