{"summary":"Crypto Twitter influencers shared the NFT project in good faith before the scammer ran off with the funds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232679\/crypto-twitter-left-jaded-after-scammer-pretends-to-have-cancer-to-sell-nfts","publishDate":"2023-05-31T09:41:52","id":8729,"type":null,"title":"Crypto Twitter left jaded after scammer pretends to have cancer to sell NFTs","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto Twitter rallied around a purported cancer patient who was trying to sell NFTs yesterday in an act of community goodwill, but it was left jaded after they turned out to be a scammer who disappeared with the funds.","It started when an account called Phoenix posted that they were a cancer patient and trying to make NFTs with pixel art. The tweet was picked up and shared rapidly among many crypto influencers who encouraged people to buy the NFTs and support the artist.&nbsp;","Yet it was quickly discovered by some Twitter users including web3 artist <a href=\"https:\/\/twitter.com\/ArcanicNFT\/status\/1663732042121773056\" data-v-f87c67ca=\"\">Arcanic <\/a>that the account was simply reselling work from other artists such as&nbsp;as <a href=\"https:\/\/twitter.com\/Lancelotli2\" data-v-f87c67ca=\"\">Snooow<\/a>. Arcanic also highlighted that the same account had been used to run similar tactics, such as claiming their wife had cancer and were trying to get out of debt.&nbsp;","The Twitter account was deleted once the scam was widely discovered, but not before the NFT project had raised around 63.5 ether ($119,000). The funds were <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1663753427095101440\" data-v-f87c67ca=\"\">transferred<\/a> to other wallets, according to crypto sleuth ZachXBT. He claimed they may have been sent to crypto exchange OKX.","“We as a community came together to support someone with a heart-wrenching story. For half a day it felt good and genuine again,” <a href=\"https:\/\/twitter.com\/xBenJamminx\/status\/1663708400218193923\" data-v-f87c67ca=\"\">said<\/a> a crypto individual known as BenJammin who initially shared the NFT project.&nbsp;","“I’m tired of this shit, I joined this Web3 space because of the quest for knowledge, community and vibes. Now it’s a cesspool of scammers,” they added.","Arcanic also <a href=\"https:\/\/twitter.com\/ArcanicNFT\/status\/1663732048983367682\" data-v-f87c67ca=\"\">weighed<\/a> in, saying that the ordeal had been \"a gut-punch to everyone trying to do some good in space so riddled with drama and grifters. But I think that despite this, we shouldn't get rid of our empathy either.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Phoenix","content":"LOCATION"},{"type":"$119,000","content":"MONEY"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}