{"summary":"Bitcoin miner CleanSpark bought 20,000 latest-generation machines from Bitmain.\nThe company has leveraged the bear market to scoop up assets at depressed prices. The new purchase brings that total to 46,500.\nCleanSpark expects to pay $32.3 million after discounts — down from $43.6 million.","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211579\/cleanspark-buys-20000-miners-from-bitmain-bringing-bear-market-tally-to-46500","publishDate":"2023-02-16T09:00:20","id":873,"type":null,"title":"CleanSpark buys 20,000 miners from Bitmain, bringing bear market tally to 46,500","category":["Crypto Infrastructure"],"content":["Bitcoin miner CleanSpark bought 20,000 more mining machines, bringing the total count of its bear market spending-spree purchases to over 46,500.","The company expects to pay $32.3 million for the new generation Antminer S19j Pro+ units after discounts from manufacturer Bitmain, it said on Thursday.","That will equate to a price tag of $13.25 per terahash and add 2.44 EH\/s to CleanSpark's hashrate, which currently stands at 6.6 EH\/s.","\"As machines are delivered to us we will have rackspace waiting for them at one of our sites,\" Chief Executive Zach Bradford said in a statement. \"We exercise tremendous control over our infrastructure and, therefore, our ability to be highly efficient in the way we allocate our resources.”","The company is adding to the over 26,500 units it bought last year at discounted prices, leveraging the bear market. The new units will be shipped in batches to be delivered by the end of May.","CleanSpark said last week during its earnings call that it plans to keep buying new machines and sites as it looks to reach its end-year guidance of 16 EH\/s — which it <a href=\"https:\/\/www.theblock.co\/post\/195154\/bitcoin-miner-cleanspark-slashes-2023-hashrate-guidance-on-build-out-delays\" data-v-f87c67ca=\"\">cut from 22.4 EH\/s<\/a> in December.","\"We also expect to shift our strategy when the time is right and look towards future contracts,\" Bradford said at the time. \"We believe the tides are starting to shift and locking in prices for large orders will begin to be part of our strategy in the coming months.\"","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-asic-price-index\/embed\" title=\"Bitcoin ASIC Price Index\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","ASIC prices fell over 80% in 2022 but have more recently shown a very slight uptick, going from $13.86\/TH in mid-January to $14.89\/TH for machines with efficiency under 38 joules\/terahash, according to data from Luxor.","The company is also looking to add on between 50-75 megawatts of either greenfield sites or acquisitions.&nbsp;"],"hashtag":["MINING COMPANIES"]}