{"summary":"On this episode of The Scoop, Co-Founder and CEO of CoinRoutes discusses how trading crypto has evolved and why regulators are ignoring these improvements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/114511\/coinroutes-podcast-wall-street-bitcoin","publishDate":"2021-08-16T06:00:03","id":8732,"type":null,"title":"Wall Street vet explains the Bitcoin trading improvements regulators are ignoring %","category":["BITCOIN"],"content":["<em data-v-f87c67ca=\"\">Episode <strong data-v-f87c67ca=\"\">48<\/strong> of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Dave Weisberger, co-founder &amp; CEO of CoinRoutes.<\/em>","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on&nbsp;<\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vdGhlYmxvY2stdGhlc2Nvb3A?sa=X&amp;ved=0CAMQ4aUDahcKEwionbSO9fbxAhUAAAAAHQAAAAAQAg\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Podcasts<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"2c5c43484f4d5f586c5844494e40434f474f5e555c5843024f4341\">[email&nbsp;protected]<\/a>.<\/i>","<strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors&nbsp;<a href=\"http:\/\/eventussystems.com\/\" data-v-f87c67ca=\"\">Eventus<\/a>,&nbsp;<a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>, and&nbsp;<a href=\"https:\/\/www.exodus.com\/\" data-v-f87c67ca=\"\">Exodus<\/a><\/strong>","<em data-v-f87c67ca=\"\">Eventus is the leading global provider of multi-asset class trade surveillance, transaction monitoring and market risk solutions. Eventus offers a powerful, award-winning trade surveillance platform that is easy to deploy, customize and operate. Eventus is proven in the most complex, high-volume and real-time environments and supports many of the industry’s leading crypto exchanges including Coinbase, Gemini, ErisX and OSL. The company’s rapidly growing client base relies on Eventus’ responsive support and product development teams to overcome its most pressing regulatory challenges.<\/em>","<strong data-v-f87c67ca=\"\">About Kraken<br data-v-f87c67ca=\"\">\n<\/strong><em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit&nbsp;<\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\">&nbsp;to get started today.<\/em>","<strong data-v-f87c67ca=\"\">About Exodus<br data-v-f87c67ca=\"\">\n<\/strong><em data-v-f87c67ca=\"\">Exodus is leading the world out of traditional finance by building beautiful and user-friendly crypto products. Forget having to learn the nuances of different cryptocurrencies. Exodus is designed for everyone and hides the complex details behind a beautiful and intuitive interface.<\/em>","&nbsp;","<span data-v-f87c67ca=\"\">Dave Weisberger is a Wall Street vet who saw market structure develop and go electronic. On this episode of The Scoop, the co-founder and CEO of CoinRoutes joined host Frank Chaparro for a walk-through on how far trading in crypto has evolved and why regulators are ignoring these improvements.<\/span>","He remarked:","<span data-v-f87c67ca=\"\">“Firms that are domiciled and regulated out of the United States are at such a massive disadvantage in the growing digital asset world to the point where, as a startup, we had to make a choice to become software only.”<\/span>","<span data-v-f87c67ca=\"\">Weisberger views the slow regulatory work by the SEC as being harmful to investors, which among factors, is causing exchanges and custodians to put fees and premiums on crypto in order for investors to enter the market. <\/span>","<span data-v-f87c67ca=\"\">But as the market grows and becomes more differentiated from traditional markets, the crypto “market is getting more efficient,\" <\/span><span data-v-f87c67ca=\"\">Weisberger said. <\/span>","<span data-v-f87c67ca=\"\">While the current sentiment sees larger players continuing to find themselves subject to arbitrage fees and the headaches of legal battles, Weisberger believes it won’t last forever:<\/span>","<span data-v-f87c67ca=\"\">\"The settlement costs and the financing costs of doing certain esoteric strategies will ultimately go down dramatically as DeFi finds its sea legs and matures. We're nowhere near that point yet, but the application of that technology is going to be profound as it grows.\"<\/span>","<span data-v-f87c67ca=\"\">During this episode, Weisberger and Chaparro also discuss:<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dave Weisberger","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"OSL","content":"ORGANIZATION"},{"type":"Weisberger","content":"PERSON"},{"type":"Spotify","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["Frank Chaparro","The Block"]}