{"summary":"Sen. Cynthia Lummis, R-Wyo., urged a New York district court to dismiss the SEC’s lawsuit against crypto exchange Coinbase.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244761\/sen-lummis-joins-call-to-dismiss-the-secs-case-against-coinbase","publishDate":"2023-08-14T11:39:13","id":8735,"type":null,"title":"Sen. Lummis joins call for dismissal of the SEC&#x27;s case against Coinbase","category":["EXCHANGES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Sen. Cynthia Lummis, R-Wyo., urged a New York district court to dismiss the Securities and Exchange Commission’s lawsuit against crypto exchange Coinbase, in part because the agency’s treatment of crypto “runs counter to ongoing legislative efforts.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lummis, who recently introduced a comprehensive bill to regulate digital assets with Sen. Kirsten Gillibrand, D-N.Y., said the SEC is out of bounds when regulating crypto. Lummis, along with other stakeholders, filed amicus briefs on Friday asking for the agency’s case against Coinbase to be dismissed.&nbsp; The SEC charged the exchange in<\/span><span class=\"s2\" data-v-f87c67ca=\"\"> June with allegedly operating as an unregistered exchange, broker and clearing agency.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lummis cited the major questions doctrine in her <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.599908\/gov.uscourts.nysd.599908.53.0.pdf\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">brief<\/span><\/a>, a legal argument with growing support in the crypto industry, that <\/span><span class=\"s4\" data-v-f87c67ca=\"\">says that if an agency wants to decide on an issue that has major national significance, it has to be supported by clear congressional authorization.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">The major questions doctrine has two parts — one focused on whether the subject has a major impact on the nation’s economy or on the public, and the second is whether a federal agency has explicit authority to implement new regulations.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">Crypto does have economic and political significance, Lummis said.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">“On the first pillar, regulation of crypto assets is a matter of great economic and political significance. It is the subject of dozens of recent Congressional hearings and legislative proposals,” Lummis said, citing the growth of crypto’s value over the years.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">Other firms also cited the doctrine in a flurry of amicus briefs filed on Friday. Venture capital firms Paradigm and a16z said that the crypto industry has <a href=\"https:\/\/www.theblock.co\/post\/244562\/paradigm-a16z-file-brief-supporting-coinbase-in-battle-with-sec\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">economic<\/span><\/a> significance, noting that crypto traded at volumes as high as $500 billion per day at its peak.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">It is unclear how much weight the doctrine could have going forward. Last month, a federal judge <a href=\"https:\/\/www.theblock.co\/post\/242381\/judge-slams-ripple-decision-in-secs-case-against-terraform-labs\" data-v-f87c67ca=\"\">rejected<\/a> the argument in a case involving the SEC and Terraform labs, saying the industry falls short of having economic and political significance.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">A group of crypto and tech advocacy groups including the Blockchain Association, Crypto Council for Innovation, Consumer Technology Association and the Chamber of Progress filed a joint amicus brief as well on Friday, asking for the lawsuit to be dismissed.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">“In seeking to regulate the sale of nearly all digital assets on secondary markets, the SEC is attempting to effect a ‘transformative expansion’ of its authority that would extend its oversight not only to the trillion-dollar digital asset industry but potentially to countless other assets as well,” the <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.599908\/gov.uscourts.nysd.599908.48.0.pdf\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">groups<\/span><\/a> said.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"N.Y.","content":"LOCATION"},{"type":"Chamber of Progress","content":"ORGANIZATION"},{"type":"Consumer Technology Association","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Wyo.","content":"LOCATION"},{"type":"Crypto Council for Innovation","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Lummis","content":"PERSON"},{"type":"Kirsten Gillibrand","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"$500 billion","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"Cynthia Lummis","content":"PERSON"}],"hashtag":["COINBASE","SEC"],"authors":["Sarah Wynn","The Block"]}