{"summary":"The Japanese digital flea market platform is planning to allow users to purchase products in bitcoin by June this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270798\/japans-e-commerce-giant-mercari-plans-to-accept-btc-payments-report","publishDate":"2024-01-08T02:59:18","id":8736,"type":null,"title":"Japan’s e-commerce giant Mercari plans to accept BTC payments: report","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">Mercari, Japan’s digital flea market platform with over 22 million monthly active users, is planning to allow users to purchase products in bitcoin by June this year, <\/span><a href=\"https:\/\/www.nikkei.com\/article\/DGXZQOUC202J50Q3A221C2000000\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">according to Nikkei<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Payments in bitcoin are set to be hosted by the company’s Tokyo-based blockchain subsidiary, Mercoin. While prices on Mercari would remain displayed in Japanese yen, users of the app would be able to make payments with the world’s largest cryptocurrency by market capitalization, according to the report.&nbsp;<\/span>","Mercoin plans to serve as an intermediary that transfers bitcoin to the seller in yen. Payments in bitcoin will be subject to the same range of fees charged to usual Mercari transactions made in fiat currency, the company told The Block in an email response. The e-commerce platform plans to incorporate NFTs into the app in the future, but said it does not have a roadmap to disclose at the moment.","<span data-v-f87c67ca=\"\">In March 2023, Mercari launched its own bitcoin exchange, allowing users to purchase bitcoin through the app using their bank account balance, sales proceeds and free points earned from selling activities on the platform, according to its <\/span><a href=\"https:\/\/about.mercoin.com\/en\/news\/20230309_bitcoin\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">website<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Mercari, founded in 2013, reported 2.8 billion yen ($19.4 million) in profit in the third quarter of 2023, compared to 555 million yen in the same period in the previous year, according to its latest <\/span><a href=\"https:\/\/about.mercari.com\/en\/ir\/library\/results\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">earnings report<\/span><\/a><span data-v-f87c67ca=\"\">. The company generated 44.27 billion yen in revenue in the same period, up 11.2% year-on-year.<\/span>","<em data-v-f87c67ca=\"\">Updates to correct spelling of \"Mercoin\" and add comment from Mercari<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tokyo","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"third quarter of 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Nikkei","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"555 million yen","content":"MONEY"},{"type":"June this year","content":"DATE"},{"type":"44.27 billion yen","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March 2023","content":"DATE"},{"type":"$19.4 million","content":"MONEY"},{"type":"Japan","content":"LOCATION"},{"type":"11.2%","content":"PERCENT"},{"type":"Mercari","content":"LOCATION"},{"type":"2.8 billion yen","content":"MONEY"},{"type":"Mercari","content":"ORGANIZATION"}],"hashtag":["INTERNET"],"authors":["Danny Park","The Block"]}