{"summary":"Square said Thursday that sold $1.63 billion in bitcoin through its Cash App during the third quarter of 2020\nThe gross profit figure was $32 million for the period, per the firm’s Q3 data release\nSince launching bitcoin purchase capabilities at the start of 2018, Square has now sold more than $3.4 billion in total sales","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/83748\/square-earnings-q3-cash-app-bitcoin","publishDate":"2020-11-05T16:18:05","id":874,"type":null,"title":"Square reports $1.63 billion in bitcoin sales for the third quarter via its Cash App","category":["Bitcoin"],"content":["Square sold $1.63 billion in bitcoin during the third quarter of 2020, according to <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1512673\/000119312520286821\/d201688dex991.htm\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a newly released earnings statement<\/a>. The latest quarterly sales make up nearly 90% of all sales in prior quarters, highlighting the growth in the business.","Backing out the cost to acquire the bitcoin, Square made $32 million in gross profit on its bitcoin sales, up more than 15 times since last year and good for more than 4% of total company gross profit.","\"Bitcoin revenue and gross profit benefited from an increase in bitcoin actives and volume per customer,\" the firm said in its report.","","","Square made headlines last month when it announced the <a href=\"https:\/\/www.theblockcrypto.com\/post\/80175\/jack-dorsey-square-purchases-50-million-worth-of-bitcoin\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">purchase<\/a> of $50 million in bitcoin. At the time, the payment firm said that \"cryptocurrency is an instrument of economic empowerment and provides a way to participate in a global monetary system, which aligns with the company’s purpose.” The investment represented roughly 1% of Square’s total assets as of 2020's second quarter, as reported at the time.&nbsp;","Square said of that purchase in its Q3 report:","As The Block's Ryan Todd <a href=\"https:\/\/www.theblockresearch.com\/the-interchange-square-up-on-bitcoin-80238\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">wrote<\/a> in a recent column, bitcoin sales to date have only formed a negligible — but still growing — amount to Square's gross profit base.","\"Through the first 10 quarters of selling bitcoin through the Cash App, the company has now sold more than $1 billion dollars worth of bitcoin. And yet, the net impact of selling bitcoin has only contributed a total of $34.1 million in net income to date when backing out the cost of acquiring the asset. In the second quarter of 2020, the $17 million in net income from the sale of bitcoin represented only 2.84% of total firm gross profit,\" he wrote.","Through the latest quarter results, the company has now sold more than $3.4 billion worth of bitcoin since launching the service at the start of 2018.","<iframe title=\"Percentage of Total Square Gross Profit from Bitcoin Sales (Quarterly)\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/public-companies\/percentage-of-total-square-gross-profit-from-bitcoin-sales-quarterly\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","Square reported overall gross profits of $794 million for the third quarter. Cash App, according to the report, generated a total of $385 million in gross profits.","\"Cash App saw increased engagement as customers adopted multiple products: In the third quarter of 2020, the number of average daily transacting active Cash App customers nearly doubled from the same period last year,\" the firm said.","As Cash App has evolved into a one-stop-shop to \"Spend, Send, and Invest,\" with the latest offering now including free fractional-based stock trading, many of these product offerings have led to meaningful cross-sell type levels of engagement, and specifically translating into new bitcoin users.","Square noted in its <a href=\"https:\/\/s21.q4cdn.com\/114365585\/files\/doc_presentations\/Investor-Update-March-2020.pdf\" data-v-f87c67ca=\"\">2020 Investor Letter<\/a>&nbsp;that the redesign of the Cash App to include shares trading had helped to drive approximately \"double\" the number of first-time bitcoin buyers in Cash App within the 30 days following the redesign.","",""],"hashtag":["BITCOIN","EARNINGS"]}