{"summary":"A court should not treat digital assets “as somehow special,” securities regulators argued in a case between the SEC and Coinbase.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255791\/state-securities-regulators-argue-against-crypto-special-treatment-in-coinbase-brief","publishDate":"2023-10-10T18:00:33","id":8740,"type":null,"title":"State securities regulators argue against crypto special treatment in Coinbase brief","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A New York district court should not treat digital assets \"as somehow special,\" an association made up of securities regulators argued in a case involving a U.S. regulator and Coinbase.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The North American Securities Administrators Association made that argument in an <a href=\"https:\/\/ecf.nysd.uscourts.gov\/cgi-bin\/show_temp.pl?file=file0.341923489739326.pdf&amp;type=application\/pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">amicus brief<\/span><\/a> filing on Tuesday, supporting the Securities and Exchange Commission in its lawsuit against Coinbase. The SEC charged the crypto exchange in June for allegedly operating as an unregistered exchange, broker and clearing agency.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The Court should reject Coinbase's attempt to narrow and misapply the established legal framework in order to avoid being subject to the same regulatory obligations as all other participants in the Nation’s securities markets. And the Court should decline to treat digital assets as somehow special,\" the association said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC’s case against Coinbase isn’t “extraordinary,” the association said, citing the Howey Test, a 1946 U.S. Supreme Court case involving citrus groves that the SEC often uses to determine whether transactions are investment contracts and thus subject to securities laws. Some in the crypto industry have disagreed with the SEC’s application of that court case.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC’s position that certain digital assets are investment contracts under the test is “well within the bounds of established law,” NASAA said.&nbsp;<\/span><span class=\"s1\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC is not making new policy when it comes to digital assets and is instead enforcing the existing law, NASAA argued in its brief.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“It cannot be the law that an agency must have explicit Congressional authorization to apply existing law to new fact patterns in complex and evolving financial markets,” the association said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lawmakers have introduced a number of bills to regulate crypto, though none have yet become enacted. Two bills, one that would regulate stablecoins, and another that takes a comprehensive approach at creating a regulatory framework for crypto, passed through a House committee over the summer and await a full House vote and a tough Senate vote.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Although Congress may eventually legislate a comprehensive regulatory framework for digital assets in the future, it has not done so. It is also possible that Congress will not do so,” the association said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">NASAA also pushed back against assertions that the major questions doctrine can be applied to crypto.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The doctrine says that if an agency wants to decide on an issue that has major national significance, it has to be supported by clear congressional authorization.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The major questions doctrine has two parts — one focused on whether the subject has a major impact on the nation’s economy or on the public, and the second is whether a federal agency has explicit authority to implement new regulations.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The crypto industry can’t be meaningfully compared in terms of economic and political significance to cases related to the major questions doctrine, NASAA said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“As an initial matter, digital assets cannot reasonably be considered a sufficiently significant component of the American economy because there is no practical economic use case identified or widely adopted for the vast majority of digital assets, other than speculation,” NASAA wrote.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">NASAA represents state and provincial securities regulators in the U.S., Canada and Mexico with a mission to protect investors from fraud and abuse. Some state securities regulators also filed legal actions against Coinbase, Nexo Capital and other firms over the past year.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"U.S. Supreme Court","content":"ORGANIZATION"},{"type":"1946","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Mexico","content":"LOCATION"},{"type":"Howey Test","content":"ORGANIZATION"},{"type":"NASAA","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Nexo Capital","content":"ORGANIZATION"},{"type":"North American Securities Administrators Association","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["COINBASE","SEC"],"authors":["Sarah Wynn","The Block"]}