{"summary":"Uniswap Labs has launched its venture unit to invest in web3 projects across categories, including in startups building blockchain infra.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141485\/uniswap-labs-launches-venture-unit-to-invest-in-web3-projects","publishDate":"2022-04-11T13:00:11","id":8748,"type":null,"title":"Uniswap Labs launches venture unit to invest in web3 projects","category":["DEFI"],"content":["Uniswap Labs, the main developer of the Uniswap decentralized exchange protocol, has launched a new venture unit.","Uniswap Labs Ventures will invest in web3 projects across categories, focusing on startups building blockchain infrastructure, developer tools and consumer-facing applications.","The size of Uniswap Labs Ventures' fund was not disclosed, but Matteo Leibowitz, the firm's ventures lead, told The Block that investments will be made directly from the Uniswap Labs balance sheet. He declined to comment on the size of the balance sheet and the range of average check sizes.","Uniswap Labs has invested in 11 startups and projects before launching its venture arm, including MakerDAO, Aave, Compound Protocol, PartyDAO, LayerZero and Tenderly, an Ethereum developer platform.","When asked how Uniswap Labs decides to invest in a project, Leibowitz, a former research analyst at The Block, said the firm places \"a lot of emphasis on the tenacity and vision of the founders.\"","\"Beyond that, we look for projects that will advance the benefits of Web3 and user adoption. In all cases, we seek to support teams that can benefit from our experience and expertise as a fast-growing crypto-native company,\" he added.","Uniswap Labs Ventures aims to help startups build and scale across strategy, product, partnerships, engineering, and design. To that end, the firm said it will also actively participate in on and off-chain governance of projects — an aspect more venture firms are interested in, including giants <a href=\"https:\/\/www.theblockcrypto.com\/post\/134578\/sequoia-capital-new-crypto-fund-tokens\" data-v-f87c67ca=\"\">Sequoia Capital<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/136753\/bain-capital-ventures-first-crypto-fund-560-million\" data-v-f87c67ca=\"\">Bain Capital Ventures<\/a>, which both recently launched their crypto-dedicated funds.","As for Uniswap Labs Ventures, it plans to participate in the governance systems of the MakerDAO, Aave, Compound and Ethereum Name Service protocols.","The firm will invest in both equity and token deals, said Leibowitz, who will manage the ventures unit alongside Uniswap Labs chief operating officer MC Lader.","Uniswap Labs' venture unit launches as more crypto funds tied to corporate entities and protocols launch, including FTX Ventures and Cake DeFi Ventures. Commenting on the trend, Leibowitz said \"the growth of Web3 companies supporting each other through venture investments reflects the principles of collaboration that are so fundamental to the industry’s open-source ethos.\"","\"The Uniswap ecosystem has benefited enormously from third-party contributions, and we’re excited to pay it forward by sharing our experience and expertise with our peers,\" he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Leibowitz","content":"PERSON"},{"type":"Uniswap decentralized","content":"ORGANIZATION"},{"type":"Cake DeFi Ventures","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sequoia Capital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"FTX Ventures","content":"ORGANIZATION"},{"type":"Matteo Leibowitz","content":"PERSON"},{"type":"Uniswap Labs","content":"ORGANIZATION"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"Uniswap Labs Ventures","content":"ORGANIZATION"},{"type":"Bain Capital Ventures","content":"ORGANIZATION"},{"type":"Lader","content":"PERSON"}],"hashtag":["UNISWAP"],"authors":["Yogita Khatri","The Block"]}