{"summary":"Obol is testing and rolling out its distributed validator network on Ethereum over the next six to nine months.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213409\/obol-to-bring-distributed-validators-to-ethereum-this-year","publishDate":"2023-02-22T10:16:38","id":8749,"type":null,"title":"Obol to bring distributed validators to Ethereum this year","category":["CRYPTO ECOSYSTEMS"],"content":["Obol Technologies has brought its distributed validator technology to the Ethereum mainnet for the first time in an internal alpha testing phase. If successful, the project aims to make Ethereum more secure and resilient, while increasing the number of people running validators at home.","The validator comprises four nodes spread across three countries. It’s the first step in the project’s testing and audit plan, expected to culminate in an eventual public release toward the end of this year.&nbsp;","The infrastructure project has a lot of support from the community. Obol raised $19 million in two funding rounds with a total of 107 backers that include big VC investors Coinbase Ventures, Ethereal Ventures and Pantera Capital, alongside staking businesses Figment, Blockdaemon, Chorus One and angel investors.","But it wasn’t always like this.","“For like a solid two years no one gave a shit about it at all; no one cared about it at all. Everyone was skeptical. The Ethereum Foundation didn’t even want to fund it,” Obol co-founder and CEO Collin Myers said in an interview, referring to support for distributed validator technology in general.&nbsp;","Myers had been interested in the idea of distributed validators since 2019 and had discussed potentially building a project around it but was dismayed by the lack of funding available.","But that began to change in February 2021, shortly after Ethereum had launched its Beacon Chain — the start of its proof-of-stake journey — when staking provider Staked had a big <a href=\"https:\/\/blog.staked.us\/blog\/eth2-post-mortem\" data-v-f87c67ca=\"\">slip up<\/a>. In one day, 75 of its validators were slashed, losing some of their staked ether as a penalty for accidentally attesting blocks with the same keys twice. It showed how easily centralized validators could lose their clients’ funds.","This proved to be a turning point. Suddenly those running validators and liquid staking pools were saying someone has to build this technology and were willing to stump up cash to support it. But no one wanted to raise their hand and do it. Seeing this, Myers left ConsenSys, and Obol co-founder and CTO Oisin Kyne quit his role at Blockdaemon. They joined forces.","While funding was now more available, the next challenge was to bring these entities together to work toward a common goal — even though many of them were competing projects.","“Getting it funded has taken us a very long time, multiple years of education and convincing competitors to play nicely with each other,” Myers said. “It's been a lot of human coordination right in this element of getting people to all invest in Obol who kind of hate each other.”","The idea behind Obol is to enable distributed validators on the Ethereum blockchain.","What is a validator? There are a few thousand nodes running the Ethereum blockchain. Each of these nodes can run multiple validators, which essentially approve blocks to go into its blockchain. There are currently 522,000 validators on the network, according to <a href=\"https:\/\/beaconscan.com\/statistics\" data-v-f87c67ca=\"\">Beaconscan<\/a>. Each validator locks up 32 ether ($55,000) as a stake and these coins can be slashed if the validator misbehaves.&nbsp;","Obol’s goal in a nutshell is to take a single validator and run it across multiple nodes, which could each be run by multiple people or entities. A company in one country might look after half of a validator on its nodes, and an individual node operator in another running the other half. In this instance, each would pony up half of the staked ether.&nbsp;","To test out its technology, Obol set up four nodes running out of Ireland, Estonia and Canada that are all working together as one distributed validator. The validator is running on the Ethereum mainnet, although Obol doesn’t recommend that anybody else use the code yet&nbsp; since it hasn’t gone through an audit yet.&nbsp;","Currently the initial live test is showing decent results. The validator has performed 10,182 attestations with a 99.84% participation rate as of Feb. 13, which is above average per <a href=\"https:\/\/beaconscan.com\/stat\/networkparticipation\" data-v-f87c67ca=\"\">Beaconscan<\/a>. Additionally, even though distributed validators were expected to perform more slowly, the current test is showing slightly faster speeds than the network average.","Obol brings a couple of different benefits to the Ethereum network and to those running validators at home, if they choose to use its technology.","In terms of the network, Obol aims to add security and resiliency. When multiple entities are running a single validator, it’s much harder for one of those entities to cause downtime because the other entities can keep the validator running. This helps to prevent malicious attacks on the network and plain old accidents.&nbsp;","As a result, Obol may also prevent validators from getting slashed and paying penalties.&nbsp;","When it comes to at-home validators, Obol can lower the ether requirements for each operator. This means someone who wants to run their own validator at home but doesn’t have the 32 ETH required can team up with other operators to run one together. This could help to increase the number of people running validators, boosting the network’s level of decentralization.","Obol also plans to get heavily involved with liquid staking protocols. These protocols typically assign a large amount of stake to a number of centralized staking providers. But were these providers using distributed validators, it would be harder for one of them to turn malicious and try to slash the stake that they have been assigned. In this sense, it should help to reduce single points of failure.","“If I’m a large validator I can self-slash and take all the pool down. With distributed validator technology you can’t do that,” said Myers.","Now that Obol has entered its first testing phase, it’s getting ready for many more rounds of testing before the team will be ready to say it’s live for anyone to use.&nbsp;","In the short term, Obol will start going through audits on Feb. 27 for three weeks, after which the team will make some fixes and go for a second run. This should be finished by April or May, the team said.","Afterward, Obol has retained the research team at the Barcelona Supercomputing Center to do a performance test. It will create up to 1,000 validators on multiple clusters. This will take place in Q1 this year.","Separately, Obol will be doing an attacknet with Code Arena. This will be a hacking bounty competition for a few weeks open to anyone. The goal will be to reward people who find issues in the project’s code, helping to protect it for when it goes live.","As this progresses, Obol will also be trialed with a few entities that it’s already working with. It will be bringing Obol live with them in a closed beta. Around this time, the project will also be brought to liquid staking protocols. Once integrated with these, in the second half of 2023, it will be ready for at-home validators and network adoption.","Beyond this, Obol is also working on a multi-client implementation. It’s working with other developer teams to bring this together in what will likely be called Obol v2. This has no clear release date, but it would follow the main launch of the first version. Supporting multiple clients is designed to add further security and resilience to the network.","As a result, Myers doesn’t see this like the team is building just one big thing. It’s more like multiple versions of a similar idea — with different client implementations and unique implementations for each liquid staking protocol.&nbsp;","“We’re not cathedral builders here, we’re more bazaar builders,” he said.","<em data-v-f87c67ca=\"\">Update: Changed investor name to Ethereal Ventures.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Collin Myers","content":"PERSON"},{"type":"Ethereal Ventures","content":"ORGANIZATION"},{"type":"Canada","content":"LOCATION"},{"type":"Obol","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Feb. 27","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Blockdaemon","content":"PERSON"},{"type":"CTO Oisin Kyne","content":"PERSON"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"February 2021","content":"DATE"},{"type":"Estonia","content":"LOCATION"},{"type":"$55,000","content":"MONEY"},{"type":"Obol Technologies","content":"ORGANIZATION"},{"type":"Obol","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"second half of 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$19 million","content":"MONEY"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Feb. 13","content":"DATE"},{"type":"99.84%","content":"PERCENT"},{"type":"Barcelona Supercomputing Center","content":"ORGANIZATION"},{"type":"Blockdaemon","content":"ORGANIZATION"},{"type":"Myers","content":"PERSON"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Ireland","content":"LOCATION"}],"hashtag":["DEVELOPER TOOLS","ETHEREUM","STAKING FIRMS","VALIDATORS"],"authors":["Tim Copeland","The Block"]}