{"summary":"Capitalism and increasingly global markets have worked to dramatically lift the quality of life for people around the world. Financial markets work by","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/16313\/an-introduction-to-rehypothecation-with-cryptocurrency","publishDate":"2019-03-19T09:15:31","id":875,"type":null,"title":"An introduction to rehypothecation with cryptocurrency","category":["LENDING"],"content":["Capitalism and increasingly global markets have worked to dramatically lift the quality of life for people around the world. Financial markets work by learning and adapting through product development from ecosystem participants and progressive regulation. At a time when we face global challenges, the world needs a more globalized financial system that is accessible to individuals on a level playing field.","How can we help Bitcoin and blockchain technology win market share? We can develop scalable, trustworthy lending systems to support growth of the asset class. As part of that journey, we will need to use rehypothecation.","BlockFi <a href=\"https:\/\/www.theblockcrypto.com\/2019\/03\/05\/crypto-cash-back-blockfi-looks-to-boost-market-with-launch-of-high-interest-accounts%E2%80%8B\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">recently announced<\/a>&nbsp;it is launching a crypto savings account with 6 percent annual interest, payable monthly in bitcoin or ether. This announcement made a splash in the crypto community, but some did not like the risks associated with the product. The ability to self custody large amounts of value with Bitcoin is one of the unique qualities of blockchain technology and something that will always be the preferred method of storage for many in the community.","The new product does carry risk, which we thoroughly disclose and thoughtfully manage. We think it’s important for people to know and understand the realities of rehypothecation and its role as a financial tool to help grow the cryptocurrency industry.","One concern frequently voiced is that rehypothecation creates more than 21 million bitcoin. In our view, that wouldn't be possible without a major change to the current implementation of Bitcoin. This is a technological reality of the Bitcoin blockchain. Even if you are worried about margin trading or rehypothecation enabling this, platforms that enable margin and up to 100x leverage have already existed for some time, including during the 2017 bull run.","<strong data-v-f87c67ca=\"\">Why do we want rehypothecation in the crypto market? Let’s look at 5 key points regarding rehypothecation in traditional markets and how this capability is unique with Bitcoin:<\/strong>","<span data-v-f87c67ca=\"\">&nbsp;<\/span>","<a href=\"https:\/\/twitter.com\/BlockFiZac\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Zac Prince<\/a> is the Founder and CEO at BlockFi, a wealth management platform for crypto investors.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6 percent","content":"PERCENT"},{"type":"2017","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Zac Prince","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BLOCKFI"],"authors":["Contributor Network","The Block"]}