{"summary":"The major hack may be the worst attack to hit the NFT community in its history, with millions of dollars in potential losses.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267963\/hackers-steal-nfts-worth-millions-from-apes-to-art-blocks-in-nft-trader-exploit","publishDate":"2023-12-16T12:03:34","id":8750,"type":null,"title":"Hackers steal NFTs worth millions, from Apes to Art Blocks, in NFT Trader exploit","category":["METAVERSE & NFT"],"content":["Millions of dollars of high-value NFTs, including rare Bored Ape and Mutant Ape Yacht Club tokens, World of Women NFTs, VeeFriends, Art Blocks, and more were stolen in a major hack of peer-to-peer trading platform NFT Trader earlier today.&nbsp;","The company confirmed in an <a href=\"https:\/\/wp.theblock.co\/wp-admin\/post.php?post=267963&amp;action=edit\" data-v-f87c67ca=\"\">X post<\/a> that \"old smart contracts\" had been attacked and urged users to revoke any permissions they had given the smart contracts in the past. X user foobar has claimed the <a href=\"https:\/\/x.com\/0xfoobar\/status\/1736065943057334573?s=20\" data-v-f87c67ca=\"\">attacks have finished<\/a> after NFT Trader updated its smart contracts to fix a reetrancy vulnerability.&nbsp;","The apparent main attacker posted a <a href=\"https:\/\/etherscan.io\/tx\/0xc2f91dbab46531732908a317290e18297670d0bb02bb66f94aa883ec448d9391\" data-v-f87c67ca=\"\">public message<\/a> to the blockchain, pinning the invention of the NFT exploit on another user and claiming the attack was to \"pick up residual garbage.\" The attacker offered to return tokens to victims after being paid a ransom of 3 eth per Bored Ape and .6 eth per Mutant Ape. The attacker has also made a series of confusing moves, refunding one Bored Ape along with 31 eth to <a href=\"https:\/\/x.com\/RSandersDFS\/status\/1736029410841485578?s=20\" data-v-f87c67ca=\"\">one user<\/a> and returning certain staked Bored Apes to their owners, while <a href=\"https:\/\/x.com\/CirrusNFT\/status\/1736044308841586871?s=20\" data-v-f87c67ca=\"\">keeping the ApeCoin rewards<\/a>.&nbsp;","Aside from the main hacker, there have been reports of auxiliary hacks that have <a href=\"https:\/\/x.com\/punk9059\/status\/1736054271391777206?s=20\" data-v-f87c67ca=\"\">drained tokens<\/a> such as Cool Cats and Squiggles from users' wallets.&nbsp; NFT Trader did not immediately reply to a request for comment from The Block.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Bored Ape","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Mutant Ape","content":"ORGANIZATION"}],"hashtag":["BAYC","EXPLOITS","MAYC"],"authors":["Zack Abrams","The Block"]}