{"summary":"Gryphon mined 71 bitcoin-equivalent coins with an average hashrate of 0.625 EH\/s.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206664\/bitcoin-miner-gryphon-releases-operational-update-ahead-of-going-public","publishDate":"2023-01-30T10:39:47","id":8761,"type":null,"title":"Bitcoin miner Gryphon releases operational update ahead of going public","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitcoin miner Gryphon mined 71 bitcoin-equivalent coins in December, it said in an operational update after announcing <a href=\"https:\/\/www.theblock.co\/post\/206236\/bitcoin-miner-gryphon-going-public-via-deal-to-buy-cannabis-software-company-akerna\" data-v-f87c67ca=\"\">plans to go public<\/a> last week.","The miner had an average hashrate of 0.625 EH\/s, a 13% month-over-month decrease, in part due to the winter storm that led to seven days of full or partial curtailment.","\"Despite this, Gryphon’s bitcoin efficiency for December increased by 7% from November and remained tied as the top performing operation for the month,\" it said in a <a href=\"https:\/\/www.prweb.com\/releases\/gryphon_digital_mining_announces_december_operational_update\/prweb19140581.htm\" data-v-f87c67ca=\"\">statement<\/a>.","The company has a 22.5% net operating profit interest royalty with a third party, whose reported hashing power is around 0.37 EH\/s, it said.","Gryphon will go public via a deal to buy Akerna Corp. in an all-stock transaction.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"Gryphon","content":"ORGANIZATION"},{"type":"Akerna Corp.","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"22.5%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"November","content":"DATE"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}