{"summary":"For all the criticism IBM&#x27;s Blockchain project has faced over the years, its ability to grow - and maintain - its team may be one area where it excels.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/28167\/ibm-blockchain-team-reportedly-spared-worst-of-firms-layoffs-as-it-redoubles-dlt-efforts","publishDate":"2019-06-20T12:27:16","id":877,"type":null,"title":"IBM Blockchain team reportedly spared worst of firm&#x27;s layoffs as it redoubles DLT efforts","category":["STARTUPS"],"content":["For all the criticism IBM's Blockchain project has faced over the years, its ability to grow - and maintain - its team may be one area where it excels.","Although IBM laid off 1,700 employees earlier this month, only a “very tiny, tiny percentage\" of them came from the blockchain operation, sources close to the team told The Block.","\"The product team had no layoffs, there was nothing out of development. It was very limited on the blockchain side,\" one source who has direct contact with the Blockchain division said.&nbsp;","While IBM declined to give specific details about the degree to which the layoffs had impacted its blockchain operation, Jerry Cuomo, VP of IBM Blockchain Technology, told The Block:","\"Blockchain skills are the priority...And we're full-steam ahead of blockchain.\" He added: \"We plan to grow for a very long time.\"","Indeed, a quick search of online job-postings reveals <a href=\"https:\/\/www.glassdoor.com.au\/Jobs\/IBM-blockchain-Jobs-EI_IE354.0,3_KO4,14.htm\" data-v-f87c67ca=\"\">blockchain <\/a>jobs a-plenty at IBM across the world - from Australia to <a href=\"https:\/\/www.naukri.com\/blockchain-jobs\" data-v-f87c67ca=\"\">India<\/a>. This corroborates with <a href=\"https:\/\/www.crn.com\/ibm-layoffs-big-blue-looks-to-reposition-workforce-as-cuts-hit\" data-v-f87c67ca=\"\">the firm saying<\/a> it wanted to focus its hiring efforts in new businesses like \"analytics, security and blockchain,\" and that the layoffs elsewhere were part of a <a href=\"https:\/\/finance.yahoo.com\/news\/ibm-layoffs-2019-12-things-163419866.html\" data-v-f87c67ca=\"\">\"realignment plan.<\/a>\"","That does not mean the blockchain division escaped any culling, however. Another source reported a handful of layoffs on the services (or consulting) side of the blockchain business, but confirmed the engineering side had been kept intact. The consulting arm is one of the blockchain team's three pillars and reportedly its main \"cash-cow.\" It is, however, unrelated to the raw technological side of the business, which encompasses the <a href=\"https:\/\/www.theblockcrypto.com\/2019\/06\/19\/ibm-blockchain-targets-smes-with-launch-of-tiered-pay-as-you-grow-model\/\" data-v-f87c67ca=\"\">IBM Blockchain Platform<\/a> and the IBM Solutions products, which cover the Food Trust Network and the Stellar partnership.&nbsp;&nbsp;","IBM's $34 billion acquisition of software developer Red Hat is also set to close. Sources suggested this may lead to more changes in the blockchain team in the near future, as Red Hat's 13,000-strong team joins IBM's Hybrid Cloud unit. Red Hat developers <a href=\"https:\/\/www.redhat.com\/en\/about\/press-releases\/ibm-and-red-hat-join-forces-accelerate-hybrid-cloud-adoption\" data-v-f87c67ca=\"\">are set to work<\/a> alongside and to utilise IBM's blockchain team.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"IBM Blockchain Technology","content":"ORGANIZATION"},{"type":"IBM","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"India","content":"LOCATION"},{"type":"Blockchain","content":"ORGANIZATION"},{"type":"$34 billion","content":"MONEY"},{"type":"Hybrid Cloud","content":"ORGANIZATION"},{"type":"Food Trust Network","content":"ORGANIZATION"},{"type":"Jerry Cuomo","content":"PERSON"}],"hashtag":["LAYOFFS"],"authors":["Isabel Woodford","The Block"]}