{"summary":"Binance&#x27;s security team has identified two suspects in the $265K KyberSwap hack, according to CEO Changpeng Zhao, and has shared the intel with Kyber.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167641\/binance-security-team-has-identified-two-suspects-in-kyberswap-hack-cz-says","publishDate":"2022-09-03T08:58:08","id":8774,"type":null,"title":"Binance security team has identified two suspects in KyberSwap hack, CZ says","category":["HACKS"],"content":["Binance's CEO Changpeng Zhao (CZ) shared an update on the KyberSwap hack today, revealing that his firm's security team had identified two suspects.","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">\"Binance security team has identified two suspects for yesterday's KyberSwap hack. We have provided the intel to the Kyber team, and are coordinating with LE (law enforcement),\" CZ <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1565976776710430721?s=20&amp;t=iB-W-zNYqCQMnAY49tluaA\" data-v-f87c67ca=\"\">tweeted<\/a>.<\/span>","In response to a <a href=\"https:\/\/twitter.com\/TajoCrypto\/status\/1565978107999313920?s=20&amp;t=iB-W-zNYqCQMnAY49tluaA\" data-v-f87c67ca=\"\">tweet<\/a> commending the exchange's actions and referring to it as playing the role of big brother in the crypto space, the CEO said, \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Hopefully not the 'big brother' role. We don't need that in crypto. <\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Just helping out where we can.\"<\/span>","KyberSwap is a multichain DEX aggregator that suffered a frontend exploit that resulted in the theft of $265,000 in user funds.","The Kyber team told victims of the hack they would be compensated for any funds lost and offered a 15% bounty to the hacker if the funds were returned.","The code exploit was flagged at about 2:30 a.m. EST on Thursday. KyberSwap gave more details about the exploit in an <a href=\"https:\/\/blog.kyber.network\/notice-of-exploit-of-kyberswap-frontend-963aa8febd6a\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">official notice<\/a>, writing: “We identified a malicious code in our Google Tag Manager (GTM) which inserted a false approval, allowing a hacker to transfer a user’s funds to his address.”","The exploit was neutralized about two hours after the team began investigations. It urged users to proceed with caution while using its platform.","Neither Binance nor KyberSwap responded to requests for comment from The Block before publication.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DEX","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"2:30 a.m. EST","content":"TIME"},{"type":"$265,000","content":"MONEY"},{"type":"Google","content":"ORGANIZATION"},{"type":"GTM","content":"ORGANIZATION"}],"hashtag":["BINANCE","CZ"],"authors":["Adam Morgan McCarthy","The Block"]}