{"summary":"SEC Chair Gensler reiterated his concern that much of the activity in the crypto space could fall under the securities regime.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152058\/secs-gensler-says-theres-a-regulatory-path-forward-for-crypto-lenders","publishDate":"2022-06-14T17:53:26","id":8779,"type":null,"title":"SEC&#x27;s Gensler says there&#x27;s a regulatory path forward for crypto lenders","category":["REGULATION"],"content":["Securities and Exchange Commission Chair Gary Gensler continued to push that much of the activity in the crypto space could potentially fall under the purview of the securities regulator, calling out lenders and exchanges that could be supporting unregistered securities.","A recent bill introduced by US Senators Cynthia Lummis and Kirsten Gillibrand would codify the jurisdiction of certain regulators over different parts of the crypto space, creating a framework to categorize certain tokens and designate their overseer. It also seeks to clarify and codify questions related to taxation and registration.","At the Wall Street Journal's CFO Network Summit, Gensler was asked to address the bill, and though he said he wouldn't comment directly on the legislation before talking to the lawmakers themselves, he worried about the general possibility of undermining protections in the market and wants to preserve \"the employees' basic bargain for raising money from the public.\"","This basic bargain, according to Gensler, is based on full and fair disclosures free of fraud and misleading statements.","\"We don't want our current stock exchanges, our current mutual funds, our current public companies to sort of inadvertently, by the stroke of a pen, say 'I want to be noncompliant as well, I want to be outside this regime' that I think has been quite a benefit to investors and economic growth over the last 90 years,\" he said.","Much of the crypto space, he said, has key attributes of securities and are thus beholden to this basic bargain. This includes many lenders, according to Gensler. He pointed to the recent BlockFi settlement in his comments, saying the SEC found in that situation that the high-yield offerings constituted an unregistered security.&nbsp;","Today's crypto lending platforms are offering rates up to 17%, and while this is attractive to the public, it's unclear what stands behind the ability to realize those returns, according to Gensler.","\"You can see the investing public could be attracted to that, but what stands behind those plans? And that's what we're really looking at here.\"","BlockFi's settlement has turned into a path towards registration, and Gensler said the SEC will try their best to find similar paths with other lending platforms and exchanges that could potentially list unregistered securities on their platforms.","\"But to the extend that they are unregistered securities offerings, non-compliant securities offerings for investment companies, we will try to take to them, try to get them registered, but also bring, where necessary, enforcement actions,\" he said.","He also referenced the reason halt of withdrawals on Celsius, a crypto lending platform, though he did not mention the lender by name. He compared Celsius's halting of withdrawals to actions taken during the meme stock run, contrasting that crypto lacks investor protections that were in place in traditional markets during the meme stock controversies.","\"You couldn't trade, but they were clearly your assets,\" he said. \"Here in crypto exchanges and lending, we should be able to bring those same protections and make sure that those protections are there, but they're not there right now.\"","Still, he reiterated that there is a potential path forward for lenders in dialogue with the regulator. As of now, he said about six crypto projects are working to register crypto markets, focusing on what disclosures are necessary for the tokens on their platform.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"17%","content":"PERCENT"},{"type":"Kirsten Gillibrand","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Exchange Commission","content":"ORGANIZATION"},{"type":"US Senators Cynthia Lummis","content":"ORGANIZATION"},{"type":"last 90 years","content":"DATE"}],"hashtag":["BLOCKFI","SEC"],"authors":["Aislinn Keely","The Block"]}