{"summary":"Fed Chair Powell&#x27;s testimony to Congress sent markets lower as he says interest rates could go higher than previously expected and labor market conditions &quot;very likely&quot; to see some softening.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217739\/crypto-prices-whipsaw-on-fed-chair-powells-congressional-testimony","publishDate":"2023-03-07T11:21:54","id":8785,"type":null,"title":"Crypto prices whipsaw on Fed Chair Powell&#x27;s Congressional testimony","category":["MARKETS"],"content":["Markets sank initially on the release of U.S. Federal Reserve Chair Jerome Powell's testimony to Congress before rebounding slightly.","Bitcoin was trading around $22,400 by 10:30 a.m. EST, up about 0.09%, according to TradingView data.","\"As I mentioned, the latest economic data have come in stronger than expected, which suggests that the ultimate level of interest rates is likely to be higher than previously anticipated,\" Powell said.","The leading cryptocurrency by market cap led the drop in crypto prices shortly after the release of Powell's testimony before recovering. Ether was also down, dropping 0.5% to about $1,558.&nbsp;","<a href=\"https:\/\/www.tradingview.com\/chart\/xAJYa739\/?symbol=COINBASE%3ABTCUSD\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">BTCUSD chart by TradingView<\/span><\/a>","Powell's hawkish comments initially sent markets down. The Fed chair's comments noted the U.S. central bank is \"prepared to increase the pace of rate hikes.\" The pace of interest rate hikes had slowed towards the end of 2022 and increased rates by 25 basis points in February.&nbsp;","Powell recognized at the time of the last increase that a \"disinflationary process has started,\" although he added, \"it's at an early stage.\"","The Fed chair said today that \"little sign of disinflation\" exists in core services, excluding housing. In order to restore price stability, \"we will need to see lower inflation in this sector, and there will very likely be some softening in labor market conditions,\" Powell said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"10:30 a.m. EST","content":"TIME"},{"type":"$1,558","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$22,400","content":"MONEY"},{"type":"today","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"0.5%","content":"PERCENT"},{"type":"Powell","content":"PERSON"},{"type":"Jerome Powell","content":"PERSON"},{"type":"0.09%","content":"PERCENT"}],"hashtag":["ANALYST REPORTS","BITCOIN","ECONOMIC INDICATORS","EQUITY MOVERS","ETHEREUM","GARY GENSLER","JEROME POWELL"],"authors":["Adam Morgan McCarthy","The Block"]}