{"summary":"Bitso is unveiling a new QR payment option in Argentina in its wallet app.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172288\/bitso-introduces-crypto-qr-payment-tool-in-argentina","publishDate":"2022-09-22T20:23:29","id":8796,"type":null,"title":"Bitso introduces crypto QR payment tool in Argentina","category":["CRYPTOCURRENCY"],"content":["<span data-v-f87c67ca=\"\">Bitso soon will launch a new QR code payment tool in its wallet app that allows shoppers in Argentina to pay with crypto at a wide array of supermarkets, restaurants and other stores around the country, providing an alternative to the peso, as inflation batters the economy.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Latin America-focused cryptocurrency exchange, which counts more than a million customers in Argentina, will start progressively rolling out the QR code option to users there starting Sept. 27.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The idea is to make crypto more useful in more places, and allow all citizens to live their lives in crypto by buying everyday services,” Bitso’s Senior Vice President of Product Santiago Alvarado told The Block in an email.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The QR codes provide an additional option for Argentine consumers to save in crypto and spend it while visiting physical stores, especially relevant as inflation in the country <\/span><a href=\"https:\/\/www.reuters.com\/markets\/us\/argentina-inflation-nears-80-spiraling-prices-squeeze-shoppers-2022-09-14\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">approaches<\/span><\/a><span data-v-f87c67ca=\"\"> 80% compared with last year, and the peso's purchasing power declines.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Many stores in Argentina already offer the option of paying in fiat currency via QR codes, and Bitso’s wallet app will be able to scan these and offer users the option of paying with U.S.-dollar pegged stablecoins, the Dai stablecoin, ether, bitcoin or Argentine pesos. Bitso will then automatically convert the crypto into Argentine pesos for merchants at the time of purchase.<\/span>","Bitso's wallet will be able to scan two of the most popular types of QR codes from&nbsp;<span data-v-f87c67ca=\"\">payment services Mercado Pago and Modo, Alvarado said. Furthermore, Bitso’s app will be able to scan QR codes from “all other systems approved by the central bank,” he added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">QR codes are a popular payment method in Argentina. The country has the highest rate of QR code usage in Latin America, local economic publication <a href=\"https:\/\/www.cronista.com\/finanzas-mercados\/argentina-lider-en-pagos-qr-de-la-region-por-que-es-furor-sobre-otros-paises\/\" data-v-f87c67ca=\"\">El Cronista<\/a> reported in August, citing data from the Mastercard New Payments Index.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Argentina <\/span><a href=\"https:\/\/blog.chainalysis.com\/reports\/2022-global-crypto-adoption-index\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ranked 13 <\/span><\/a><span data-v-f87c67ca=\"\">on Chainalysis’ 2022 Global Crypto Adoption Index.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Mercado Pago","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"Sept. 27","content":"DATE"},{"type":"Alvarado","content":"PERSON"},{"type":"Santiago Alvarado","content":"PERSON"},{"type":"El Cronista","content":"ORGANIZATION"},{"type":"Argentina","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Kristin Majcher","The Block"]}