{"summary":"Gaming and entertainment focused Saga&#x27;s token is experiencing a high-level of volatility after the protocol&#x27;s mainnet went live today.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287374\/saga-token-highly-volatile-after-mainnet-goes-live-and-binance-listing","publishDate":"2024-04-09T14:43:49","id":88,"type":null,"title":"Saga token highly volatile after mainnet goes live and Binance listing","category":["TOKEN PROJECTS"],"content":["Layer 1 protocol Saga's mainnet went live and its token appears to be generating an enormous amount of trading activity, according to Binance, the exchange where the token first started trading on Tuesday.","According to Binance's <a href=\"https:\/\/www.binance.com\/en\/trade\/SAGA_USDT?ref=AZTKZ9XS&amp;type=spot&amp;utm_campaign=GlobalSocial&amp;utm_medium=GlobalSocial&amp;utm_source=BinanceTwitter\" data-v-f87c67ca=\"\">listing of the SAGA token<\/a>, trading data shows it had risen by more than 15,000% since early Tuesday and was trading hands at over $6 as of 2:03 p.m. ET. The exchange's data also showed that at one point SAGA had hit a high of $7.89 after opening at a low of $0.40. On the listing page, the exchange warned the SAGA token is currently subject to \"high volatility.\"","Saga's protocol<span class=\"richtext-text css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\"> \"allows developers to automatically spin up VM-agnostic, parallelized and interoperable dedicated chains, or 'chainlets,' that provide applications with infinite horizontal scalability,\" according to a Binance <a href=\"https:\/\/www.binance.com\/en\/research\/projects\/saga\" data-v-f87c67ca=\"\">research report<\/a>. <\/span><span class=\"richtext-text css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">The gaming and entertainment focused protocol is \"a fully decentralized proof-of-stake chain,\" the report said.<\/span>","In <a href=\"https:\/\/twitter.com\/Sagaxyz__\/status\/1777607519180845351\" data-v-f87c67ca=\"\">a post<\/a> on X, Saga announced its mainnet had launched early Tuesday. \"Utilizing an innovative blend of shared security, precise validator orchestration tools, and a seamless automated deployment pipeline, Saga ensures that each application operates on its own dedicated blockspace with built-in interoperability,\" the company said.","\"Launching the Saga mainnet, we deliver on our promise to redefine web3 development by enabling creators to deploy their blockchains with zero cost to end users,\" Saga co-founder and CEO Rebecca Liao said in a statement.","\"Saga grew from 0 to 350 projects building on its protocol, 80% of which are gaming,\" Binance also said in the report. \"Saga has also inked partnerships with Polygon, Avalanche, MarbleX, Com2uS, and Celestia to automatically scale their infrastructure using chainlets.\"","Last month, Saga launched a division focused on game publishing.","The company also said in a statement that Saga has raised a total of $15 million from a long list of investors which includes Samsung and Polygon.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"80%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Saga","content":"ORGANIZATION"},{"type":"Rebecca Liao","content":"PERSON"},{"type":"$7.89","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$0.40","content":"MONEY"},{"type":"2:03 p.m. ET","content":"TIME"},{"type":"Samsung","content":"ORGANIZATION"},{"type":"$6","content":"MONEY"},{"type":"Celestia","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"$15 million","content":"MONEY"},{"type":"15,000%","content":"PERCENT"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}