{"summary":"As filings pour in for ether exchange-traded funds, Valkyrie looks to convert its Bitcoin Strategy ETF to a Bitcoin and Ether Strategy ETF.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243372\/valkyrie-btf-bitcoin-ether-etf-convert","publishDate":"2023-08-04T23:21:16","id":8805,"type":null,"title":"Valkyrie files to add ether to bitcoin fund: analyst","category":["FINANCE FIRMS"],"content":["Asset management firm Valkyrie has filed to convert its Bitcoin Strategy exchange-traded fund into a Bitcoin and Ether Strategy ETF on Oct. 3, 2023, according to Bloomberg Intelligence.&nbsp;","In its current form, Valkyrie's Bitcoin Strategy ETF is an actively managed exchange-traded fund listed on Nasdaq. It primarily invests in bitcoin futures contracts.","Bloomberg Senior ETF Analyst Eric Balchunas noted on X (formerly Twitter) that Valkyrie's proposed date may be an effort to front-run the competition, <a href=\"https:\/\/twitter.com\/EricBalchunas\/status\/1687566431502716928\" data-v-f87c67ca=\"\">stating<\/a> that Oct. 3 \"would be two weeks ahead of the other 13 filers' scheduled launch.\"","Earlier on Friday, The Block reported that <a href=\"https:\/\/www.theblock.co\/post\/243157\/proshares-bitwise-bitcoin-ether-etf-applications\" data-v-f87c67ca=\"\">ProShares and Bitwise filed applications<\/a> with the U.S. Securities and Exchange Commission for exchange-traded funds that offer exposure to both bitcoin and ether — adding to the ten then-already-existing ether futures ETF filings.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Oct. 3","content":"DATE"},{"type":"Oct. 3, 2023","content":"DATE"},{"type":"Bloomberg Intelligence","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Valkyrie","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["INVESTMENT FIRMS"],"authors":["Adam James","The Block"]}