{"summary":"ProShares has launched SETH, designed to offer investors the opportunity to profit from ether price declines.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260698\/proshares-launches-first-short-ether-futures-etf-for-bearish-traders","publishDate":"2023-11-02T10:33:42","id":8807,"type":null,"title":"ProShares launches first short ether futures ETF for bearish traders","category":["MARKETS"],"content":["Asset manager ProShares has launched the ProShares Short Ether Strategy ETF (SETH), designed to offer investors the opportunity to profit from ether price declines.","\"SETH is designed to address the challenge of acquiring short exposure to ether, which can be onerous and expensive,\" ProShares CEO Michael L. Sapir said in a statement. \"With today’s launch of SETH, ProShares now offers investors opportunities to profit both on days when ether increases and when it drops — all through the convenience of a traditional brokerage account,\" he added.","Not to be confused with sETH — a synthetic ether token enabled by the Synthetix protocol — SETH joins a range of crypto-linked ProShares exchange-traded funds. This includes BITO, the first U.S. bitcoin-linked futures ETF launched in 2021, BITI, the first U.S. short bitcoin-linked ETF and EETH, the first U.S. ETF investing in ether futures. ProShares also offers BETH and BETE, two futures ETF products focusing on the blended performance of bitcoin and ether, providing market cap-weighted and equal-weighted exposure, respectively.","Listed on the New York Stock Exchange, SETH aims to deliver the inverse of the daily performance of the S&amp;P CME Ether Futures Index, the company stated. Like its counterparts in the ProShares suite, SETH seeks exposure through ether futures contracts.","Though ether has lagged behind the recent <a href=\"https:\/\/www.theblock.co\/post\/260486\/bitcoins-price-is-mostly-flat-as-fed-holds-rates-steady-solana-leads-altcoin-rally\" data-v-f87c67ca=\"\">price rally<\/a> in bitcoin and altcoins like solana, the second largest cryptocurrency by market cap is up around 10% over the last 30 days. Ether is currently trading at $1,825, <a href=\"https:\/\/www.coingecko.com\/en\/coins\/ethereum\" data-v-f87c67ca=\"\">according<\/a> to CoinGecko data.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/eth-price\/embed\" title=\"ETH Price\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"SETH)","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"BITO","content":"ORGANIZATION"},{"type":"$1,825","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"SETH","content":"ORGANIZATION"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"Michael L. Sapir","content":"PERSON"},{"type":"BETE","content":"ORGANIZATION"},{"type":"last 30 days","content":"DATE"}],"hashtag":["ETHEREUM","INVESTMENT FIRMS"],"authors":["James Hunt","The Block"]}