{"summary":"Securitize aims to be the first firm to offer tokenized security issuance and trading across the U.S. and Europe. ","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241382\/securitize-launches-tokenized-security-in-europe","publishDate":"2023-07-27T08:00:07","id":881,"type":null,"title":"Securitize launches tokenized security in Europe","category":["Companies"],"content":["<a href=\"https:\/\/www.theblock.co\/post\/234685\/securitize-takes-contrarian-view-in-cryptos-war-with-the-sec\" data-v-f87c67ca=\"\">Securitize<\/a>, a blockchain firm specializing in the tokenization of real-world assets, has started issuing tokenized securities in Europe that represent equity in the Spanish real estate investment trust Mancipi Partners.","The shares will be tokenized on the Avalanche blockchain, and secondary trading is set to begin in September.&nbsp;","The rollout comes nearly a <a href=\"https:\/\/securitize.io\/press-releases\/securitize-europe\" data-v-f87c67ca=\"\">month<\/a> after Spain's General Secretariat of the Treasury and International Finance approved the firm to deploy digital asset securities to a small number of businesses and investors under supervised \"sandbox\" conditions","Once the sandbox period expires after around six months and the firm gets the go-ahead from the European Union Pilot Regime, Securitize plans to issue, manage and trade tokenized securities in Spain and the EU more broadly.&nbsp;","“Securitize is now the first firm to be able to issue and trade tokenized securities in both the U.S. and Europe, and is the first firm to do so under the EU’s new pilot regime for digital assets,” Barcelona-born Securitize co-founder Carlos Domingo said in a statement. “European businesses will be a major beneficiary of this innovation, giving businesses a new way to raise capital through primary capital raises, and obtain potential tax benefits and liquidity through secondary trading.”","In May, Securitize <a href=\"https:\/\/www.theblock.co\/post\/229366\/securitize-hamilton-lane-tokenized-fund-ploygon\" data-v-f87c67ca=\"\">partnered<\/a> with the asset manager <a href=\"https:\/\/www.theblock.co\/post\/239022\/carlos-domingo-securitize-scoop\" data-v-f87c67ca=\"\">Hamilton Lane<\/a> to bolster investor exposure to tokenized security offerings."],"hashtag":[]}