{"summary":"The billion-dollar fund could be a crucial lifeline for the crypto industry, as companies tussle with the aftershocks of FTX’s collapse.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190177\/binances-bailout-fund-backstop-crypto-questions","publishDate":"2022-11-29T05:18:43","id":8812,"type":null,"title":"Binance’s bailout fund is a welcome backstop for crypto — but questions remain","category":["INSTITUTIONAL INVESTORS"],"content":["Last week, the world’s largest crypto exchange Binance formally unveiled a $1 billion “industry recovery fund” to help contain the damage dealt to the industry by the spectacular implosion of FTX. A few weeks earlier, Binance’s CEO Changpeng Zhao had played <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1589283421704290306\" data-v-f87c67ca=\"\">a pivotal role<\/a> in the events that led to that collapse.","Zhao said in a tweet on Nov. 6 that Binance would start selling off its holdings in FTT, FTX’s token, triggering a liquidity crisis that showed the business run by Sam Bankman-Fried to be nothing but a house of cards. &nbsp;","Though Zhao has since <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1589695561678344192?lang=en\" data-v-f87c67ca=\"\">dismissed<\/a> “conspiracy theories” that he had orchestrated FTX’s demise and that of its sister trading firm Alameda Research, the irony of Binance playing both doomsayer and redeemer in the same month has not been lost on observers. “You sort of giveth with one hand and taketh away with the other,” said Hagen Rooke, a partner at the law firm Reed Smith.","More so than ever, the extraordinary sequence of events leaves Binance as consolidator-in-chief in the crypto industry — and there is a clear sense of relief at the company’s commitment to the role.","<a href=\"https:\/\/www.theblock.co\/post\/185138\/which-crypto-companies-have-exposure-to-ftx\" data-v-f87c67ca=\"\">Dozens if not hundreds<\/a> of crypto businesses have been affected by the FTX crisis. Some had lent money to the company, many have funds stuck on the exchange, and others had made investments in Bankman-Fried’s empire. Binance’s emergency fund — which has also <a href=\"https:\/\/www.theblock.co\/post\/189797\/jump-crypto-polygon-ventures-gsr-contribute-to-binances-1-billion-recovery-fund\" data-v-f87c67ca=\"\">amassed contributions<\/a> from Jump Crypto, Polygon Ventures, Aptos Labs, Animoca Brands, GSR, Kronos and Brooker Group — promises support for innovative and viable projects that face liquidity issues related to FTX. As of last week, it had already received 150 applications for aid.","“While our Binance-backed startup Nym had no exposure to the scammers at FTX and Alameda, we are glad to see this recovery fund from Binance help out those in need,” said Harry Halpin, CEO of Nym Technologies. “While negotiating with Alameda was like dealing with a greedy teenager who was vastly overconfident of their own intelligence and ability, Binance had always been straight shooters with us since they cut us our first check for privacy tech when no one else would.”","There are, however, questions over whether the fund — which Binance convened and seeded with an initial $1 billion — could further concentrate power in the hands of the exchange. Binance did not respond to a request for comment.","Thibault Schrepel, an associate professor of law and blockchain expert at Vrije Universiteit Amsterdam, raised two main concerns about potential antitrust issues from the new bailout fund: boycotts and the sharing of sensitive information.","The first involves a group of companies — often competitors — collectively refusing to do business with another company.","“Typically, boycotts are prohibited because they reduce competition by eliminating a company. Here, the companies applying to the fund are allegedly on the edge of disappearing. Still, I can see how an agency could see the fund as an instrument run by companies to decide who, amongst their horizontal and vertical competitors, can survive,” Schrepel said.","“Knowing the companies running the fund have vested interests in many other companies in the industry, I wouldn’t be surprised if antitrust agencies were to investigate in a couple of weeks the reasons why the fund decided to refuse funding specific entities.”","The mechanics of the fund’s decision-making, as well as the extent to which its contributors communicate, will be key factors in determining the level of antitrust risk, Schrepel added. Binance said in its announcement last week that each contributor will have the opportunity to review opportunities and “make investment decisions independently of each other, on a deal-by-deal basis.”","“In practice, it would be surprising if the companies running the fund never communicate, if only to know who has committed to a deal,” Schrepel said.","On the risk of information sharing, Schrepel points out that the fund’s application form asks for a business overview, team overview, exposure to FTX and Alameda, historical financials, funding amount sought, the desired timeline for funding, the preferred form of capital, a financial model demonstrating a path to profitability post-funding and a brief summary of what situation the applicant is in amid ongoing market volatility.","“This information could help Binance and other members of the fund decide on a business strategy, thus being considered competitively sensitive topics,” Schrepel said. “Typically, exchanging about pricing, production levels, capacity and margins is considered an illegal exchange of information. Should the members of the fund coordinate on these variables (even indirectly) after sharing the information they will obtain thanks to the fund, they are in the antitrust territory.”","These are the technical considerations that underly a broader concern: that of one player building up too much power in the crypto market.","“If and when any funds from this pot are deployed to help businesses in distress, will that come with any sort of strings attached?” said Reed Smith’s Rooke, who added that the fund could give its architects a way to&nbsp;“scoop up distressed businesses and end up being able to control them.”","For now, though, that is hardly the sector’s most pressing concern.","“We as an industry are trying to weather through storms, what we need now, more than ever, is unity, mutual support and strong leadership. There is little point in speculating about concentration if you don’t even have a positively growing industry to start with,” said a spokesperson for Tron DAO, which <a href=\"https:\/\/www.theblock.co\/post\/189877\/justin-sun-tron-dao-line-up-to-contribute-to-binance-recovery-fund-exclusive\" data-v-f87c67ca=\"\">recently applied<\/a> to contribute to the recovery fund.","There are other questions about the fund, too — not least of which is why the $1 billion allocated to it by Binance came from a cold wallet that is also home to customer funds. A Binance spokesperson declined to comment on that at the time, although <a href=\"https:\/\/www.theblock.co\/post\/189897\/binance-clarifies-recovery-fund-deposits?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">they clarified<\/a> that the capital was not customer funds but “Binance assets that have been set aside.”","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Polygon Ventures","content":"ORGANIZATION"},{"type":"GSR","content":"ORGANIZATION"},{"type":"Nym Technologies","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Aptos Labs","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Reed Smith’s Rooke","content":"PERSON"},{"type":"Nov. 6","content":"DATE"},{"type":"Schrepel","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Brooker Group","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Reed Smith","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Harry Halpin","content":"PERSON"},{"type":"Hagen Rooke","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Thibault Schrepel","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Alameda","content":"PERSON"},{"type":"Bankman","content":"LOCATION"},{"type":"Jump Crypto","content":"LOCATION"},{"type":"last week","content":"DATE"},{"type":"Tron DAO","content":"ORGANIZATION"},{"type":"Vrije Universiteit Amsterdam","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE","FTX","PRIVATE COMPANY M&AMP;A"],"authors":["Ryan Weeks","The Block"]}