{"summary":"While NFT marketplace LooksRare has pivoted to royalty-free trading, it has diverted some of the protocol’s fees to creators.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180427\/looksrare-becomes-latest-nft-marketplace-to-nix-royalties-exclusive","publishDate":"2022-10-27T11:00:36","id":8816,"type":null,"title":"LooksRare becomes latest NFT marketplace to nix royalties: Exclusive","category":["NFTS"],"content":["LooksRare joined the growing list of NFT marketplaces opting to drop creator royalties, joining SudoSwap, X2Y2 and, most recently, Magic Eden.&nbsp;&nbsp;","LooksRare said it will instead distribute a quarter of its protocol fee to creators in an attempt to find a middle ground in the running debate over royalties. The marketplace is now allocating 25% of its 2% protocol fee with creators, according to a statement. This results in an effective 0.5% royalty fee on trades for all collections, which is a lot lower than most were previously seeing.&nbsp;","“With this change, LooksRare wants to buck the trend with our solution that actually enforces income for creators, while still remaining attractive to traders with an effectively zero-fee offering. It’s a way to turn all that zero-royalty volume into something that still benefits the creators,” said the pseudonymous LooksRare co-founder known as Guts.","Royalties are fees that are designed to be paid on every NFT trade and are typically sent to the creator of the collection at the point of sale. Depending on the success of a collection, they are a way for NFT creators to earn regular income. However, with royalties ranging from 2.5% to 10%, they can be a source of friction for NFT traders.&nbsp;","The LooksRare changes will effect all users. The marketplace shares its protocol fee with stakers of its native LOOKS token. With a quarter of that fee going to creators, stakers will see their revenues drop.&nbsp;","LooksRare is trying to mitigate the impact of this knock-on effect. It has rejiggered how the trading rewards will be handed out. Instead of splitting them 50:50 between buyers and sellers, it’s now giving 95% to sellers. LooksRare claims that this should account for the drop in revenue.&nbsp;","While all the other changes are already live, the change to the trading rewards will take effect on Oct. 28 at 9:00 AM (UTC).","The marketplace has also changed how the listing rewards are calculated. These are rewards given to NFT holders putting their NFTs up for sale. The leaderboard will now be ranked by OpenSea volume —&nbsp;instead of LooksRare volume — in the preceding 24 hours. This is over fears that wash trading may increase with the removal of royalties.","Since NFT royalties are not enforced on-chain, they are down to the whim of NFT marketplaces. While OpenSea, the dominant NFT marketplace on Ethereum, continues to support royalties for creators, other newer NFT marketplaces have pivoted away from doing so. This has seen these plucky marketplaces pick up greater volumes.","NFT marketplaces like X2Y2 and SudoSwap on Ethereum operate without creator royalties, and recently Solana’s dominant NFT marketplace Magic Eden <a href=\"https:\/\/www.theblock.co\/post\/177414\/solana-nft-platform-magic-eden-opts-for-optional-royalty-payments\" data-v-f87c67ca=\"\">followed suit<\/a>. Magic Eden co-founder and COO Zhuoxun “Zedd” Yin <a href=\"https:\/\/www.theblock.co\/post\/178362\/magic-eden-coo-calls-0-royalties-a-prisoners-dilemma\" data-v-f87c67ca=\"\">likened<\/a> the issue to a “prisoner's dilemma.”","\"We felt that in the absence of [a] technically enforceable solution at the protocol level, things would continue to trend basically toward optional royalties anyway,” Yin said at the time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"2.5%","content":"PERCENT"},{"type":"9:00","content":"TIME"},{"type":"0.5%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"95%","content":"PERCENT"},{"type":"Zedd” Yin","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"Yin","content":"PERSON"},{"type":"OpenSea","content":"ORGANIZATION"},{"type":"Oct. 28","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Magic Eden","content":"ORGANIZATION"}],"hashtag":["LOOKSRARE","MAGIC EDEN"],"authors":["Tim Copeland","The Block"]}