{"summary":"The Securities and Exchange Commission brought a record number of crypto-related enforcement actions last year, up 50% from 2021, according to a new","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203078\/sec-racks-up-50-increase-in-crypto-enforcement-actions-in-2022-report","publishDate":"2023-01-18T00:01:34","id":8819,"type":null,"title":"SEC racks up 50% increase in crypto enforcement actions in 2022: Report ","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission brought a record number of crypto-related enforcement actions last year, up 50% from 2021, according to a new report from consulting firm Cornerstone Research.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Last year's record of 30 crypto-related enforcement actions was second only to 2020, when the SEC brought 29 such actions. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">The most frequent allegations were fraud and unregistered securities, the firm found. Of those 30 enforcement actions, 70% alleged fraud, 73% alleged an unregistered securities offering and 50% alleged both. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Some of the biggest cases brought last year include the charges against a <a href=\"https:\/\/www.theblock.co\/post\/158960\/former-coinbase-product-manager-arrested-on-insider-trading-charges\" data-v-f87c67ca=\"\">former Coinbase employee<\/a>, his brother and his friend for allegedly running an insider trading scheme and another case <a href=\"https:\/\/www.theblock.co\/post\/194509\/sam-bankman-fried-charged-with-fraud-over-ftx-collapse\" data-v-f87c67ca=\"\">in December<\/a> against former FTX CEO Sam Bankman-Fried for allegedly defrauding investors. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">SEC Chair Gary Gensler has said that the vast majority of cryptocurrencies are securities. Lawmakers last year introduced legislation to regulate crypto, with <a href=\"https:\/\/www.theblock.co\/post\/177371\/pieces-of-crypto-bill-could-pass-in-six-months-authors-lummis-and-gillibrand-say\" data-v-f87c67ca=\"\">some bills<\/a> giving the Commodity Futures Trading Commission jurisdiction over the largest digital assets. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“<\/span><span class=\"s2\" data-v-f87c67ca=\"\">It seems crypto assets will likely continue to be a priority under the Gensler administration,” said <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Simona Mola, principal at Cornerstone Research and author of the report. Mola cited the 50% uptick in enforcement actions and the agency’s expansion of its Crypto Assets and Cyber Unit. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Mola also said an increase in assistance that the agency received from outside agencies and organizations during its crypto-related investigations was a surprising finding. Of the 127 enforcement actions from 2013 to 2022, the SEC received assistance from outside agencies and organizations in 56 actions, according to the report. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Under the Gensler administration, the SEC has been increasingly assisted by multiple international authorities in its cryptocurrency enforcement actions, which is likely&nbsp;a byproduct&nbsp;of the number of U.S. agencies regulating the space in addition to the SEC, but also a byproduct of the increasing complexity of certain cases that often transcend the national borders,” Mola said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The consulting firm has a database with crypto related enforcement actions brought by the SEC between January 1, 2013 and December 31, 2022. Mola also used the SEC’s enforcement website, among other methodologies. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"> <i data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Mola","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"December 31, 2022","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Crypto Assets","content":"ORGANIZATION"},{"type":"January 1, 2013","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"73%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Cornerstone Research","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"December 2022","content":"DATE"},{"type":"Simona Mola","content":"PERSON"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"2020","content":"DATE"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}