{"summary":"Hayes&#x27; advisor role will focus on advancing the financialization of AI, leveraging his experience in both traditional and crypto markets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271501\/bitmex-co-founder-arthur-hayes-joins-decentralized-ai-platform-ritual","publishDate":"2024-01-10T08:01:18","id":8822,"type":null,"title":"BitMEX co-founder Arthur Hayes joins decentralized AI platform Ritual","category":["PEOPLE"],"content":["BitMEX co-founder Arthur Hayes has joined the decentralized AI platform Ritual as an advisor.","Hayes is now the Chief Investment Officer of his family office, Maelstrom. The former BitMEX CEO also introduced perpetual swaps — a type of futures derivative contract used in cryptocurrency trading that does not expire, unlike traditional futures contracts.","“Arthur Hayes was also one of the first crypto leaders to understand the opportunities at the intersection of AI and Crypto and will utilize his perspective from both traditional and crypto markets to help Ritual scale,” the company said in a statement.","“As an advisor to Ritual, Arthur will provide his deep crypto and financial markets expertise to further the financialization of AI models, GPUs, and data, help grow the Ritual brand, and develop new use cases of on-chain AI,” Ritual co-founder Akilesh Potti added. “His unique expertise — as well as his passion for the crypto ecosystem — will be invaluable to us as we continue to grow Ritual and create a decentralized, permissionless, and open future of AI.”","“AI is made for decentralization — in fact, the future of this technology hinges on its ability to assert independence from the handful of powerful tech giants who control each input and output,” Arthur Hayes said. “I’m excited to join the Ritual team as an advisor to ensure the burgeoning AI economy has access to a more censorship-resistant, collaboration-powering technology than we currently have.”","Hayes told The Block he was not an investor in Ritual before becoming an advisor but was not able to disclose if he was offered any incentives to join the project. He also could not disclose how many advisor roles he had taken on in crypto overall, nor if he was involved with any other AI projects.","“I strongly believe that AI is changing the world. Generative AI, in particular, drives new use cases and worker productivity, and will have massive rippling effects on the economy,” Hayes said. “One sector I’m most interested in working with Ritual on is the financialization of AI models, GPUs, and data,” he added.","Potti told The Block that Hayes’ new role came about following various conversations with Maelstrom in recent months regarding Ritual’s vision around the financialization of AI and crypto primitives.","Hayes joins Ritual’s existing board of advisors, including crypto alumni such as NEAR Protocol co-founder Illia Polosukhin, EigenLayer founder Sreeram Kannan, and Gauntlet founder and Robot Ventures GP Tarun Chitra.","Ritual emerged from stealth last year, built by a team with backgrounds at firms like OpenAI, Coinbase, Palantir, Protocol Labs, Polychain, Paradigm, Citadel and Google. Ritual <a href=\"https:\/\/www.theblock.co\/post\/262114\/decentralized-ai-compute-platform-ritual-closes-25-million-fundraise\" data-v-f87c67ca=\"\">raised<\/a> a $25 million capital injection round in November led by Archetype, with participation from Accomplice and Robot Ventures. The firm did not disclose a valuation for the round.","Some 25% of the company worked at Polychain, though the venture capital firm is not an investor in Ritual, Potti told The Block. Potti, and his Ritual co-founder Niraj Pant, have known each other for over five years, having worked together at Polychain. They both felt it became clear there was an inflection point in late 2022 for building decentralized AI, Potti said.","Ritual features an incentivized network dedicated to hosting, processing and refining AI models. Its flagship product, Infernet, enables smart contracts to access AI models for a variety of on-chain applications, from “powering autonomous agents to leveraging machine learning models in a dynamic setting for existing DeFi and NFT protocols to ameliorate governance issues,” Potti said.","“Ritual is currently the only platform that allows smart contracts to verifiably interact with AI, ensuring integrity, transparency, and accessibility in the space. This helps unlock a broad range of potential use cases — from AI-generated content on blockchain to more intelligent DeFi mechanisms,” Hayes added.","Having already built and released Infernet, Potti said that Ritual’s philosophy is to open-source as quickly as possible to educate, grow and iterate with the community. Ritual’s testnet is set to launch in the second half of the year.","Ritual is not the only project working in connection with decentralized AI, with Gensyn, Modulus, Autonolas and Bittensor among a number of organizations Potti sees as potential partners. In terms of the biggest challenges and opportunities in the emerging niche, Potti identified compute, education and unification as the most important considerations.","According to Potti, one major challenge is sourcing diverse global compute resources, particularly GPUs. Ritual is addressing this by forming strategic partnerships and designing an incentivized network that encourages widespread participation.","Another challenge is education; much like the early days of blockchain, there is a general lack of understanding about machine learning in the web3 community. Ritual is tackling this through various educational initiatives, including content creation, experiments, prototypes and open-sourcing their developments.","Additionally, since AI and decentralization have traditionally been on opposite ends of the spectrum, much of Ritual's work is new, based on first principles, Potti said.","Big Tech has built an AI system that is fundamentally lacking in transparency, accessibility and privacy, Potti said. “Advances in cryptography can be used to counter this status quo to guarantee computational integrity, data protection, and censorship resistance. Essentially, decentralized AI brings the best of web3 to AI — ensuring a more open, universally accessible future of this critical technology,” he added.","In July last year, Hayes <a href=\"https:\/\/www.theblock.co\/post\/241873\/ai-dao-arthur-hayes\" data-v-f87c67ca=\"\">argued<\/a> that AI-powered DAOs would revolutionize how economic entities are organized and funded, particularly impacting Ethereum transaction growth.","“This thesis has advanced more quickly than I anticipated,” Hayes told The Block. “The lawsuit between the New York Times and OpenAI highlights that traditional companies will likely not be able to train AIs on other’s data and profit from it. The initialization of AIs will thus tend toward a DAO structure that is decentralized and open source.”","“Any company that can be attacked in the analogue human legal field will be attacked by those who believe a for-company-profit AI implementation used their data without payment,” he continued. “It is an impossible problem to solve — how do you adequately pay every entity for their data?”","“The only way to create AIs as economic entities is for the ownership to be dispersed wide and far, such that there is no single centralized structure to attack in the traditional legal arena,” he added. “The market will quickly come to realize the entire lifecycle of an AI must be decentralized, which will in turn benefit networks such as Ethereum. Ethereum is the most robust decentralized computer in existence, and I fully expect it to peer power the future AI \/ human economy.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Potti","content":"PERSON"},{"type":"Polychain","content":"LOCATION"},{"type":"Hayes","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Akilesh Potti","content":"PERSON"},{"type":"Palantir","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"$25 million","content":"MONEY"},{"type":"Robot Ventures","content":"ORGANIZATION"},{"type":"Gensyn","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Big Tech","content":"ORGANIZATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"July last year","content":"DATE"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Arthur","content":"PERSON"},{"type":"Sreeram Kannan","content":"PERSON"},{"type":"AIs","content":"ORGANIZATION"},{"type":"second half of the year","content":"DATE"},{"type":"last year","content":"DATE"},{"type":"Citadel","content":"ORGANIZATION"},{"type":"Niraj Pant","content":"PERSON"},{"type":"Illia Polosukhin","content":"PERSON"},{"type":"Tarun Chitra","content":"PERSON"},{"type":"Modulus","content":"ORGANIZATION"},{"type":"Autonolas","content":"PERSON"}],"hashtag":["CRYPTO"],"authors":["James Hunt","The Block"]}