{"summary":"The Terraform Labs co-founder was arrested while trying to leave Montenegro on a private jet last month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227368\/do-kwon-fake-passport-charge-montenegro","publishDate":"2023-04-20T10:20:59","id":8831,"type":null,"title":"Do Kwon charged with using false passport in Montenegro: DL News","category":["COMPANIES"],"content":["Terraform Labs co-founder Do Kwon has been <a href=\"https:\/\/www.dlnews.com\/articles\/people-culture\/do-kwon-charged-false-passport-terra-crypto-king\/\" data-v-f87c67ca=\"\">charged with using a fake passport<\/a> by authorities in Montenegro, DL News reported, citing a court filing.&nbsp;","Kwon, a South Korean national, was <a href=\"https:\/\/www.theblock.co\/post\/222286\/do-kwon-terra-luna-arrested-montenegro\" data-v-f87c67ca=\"\">arrested while trying to leave Montenegro on a private jet<\/a> last month. He is accused of trying to travel with a fake Costa Rican passport.","TerraUSD, the stablecoin created by Terraform Labs and often known by its ticker UST, collapsed in May last year, wiping out tens of billions of dollars for investors. The incident was the first of a series of crises to hit crypto markets over the course of 2022, including the bankruptcies of crypto lender Celsius and exchange giant FTX.&nbsp;","If convicted of the document-related charges, Kwon faces a sentence of three months to five years in jail, DL News said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2022","content":"DATE"},{"type":"Montenegro","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Kwon","content":"PERSON"},{"type":"May last year","content":"DATE"},{"type":"tens of billions of dollars","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"},{"type":"DL News","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["CRIME","DO KWON"],"authors":["Andrew Rummer","The Block"]}