{"summary":"Velodrome says &quot;Gabagool,&quot; a known crypto personality and one of its former team members, was responsible for stealing $350,000 in August hack.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163404\/velodrome-says-team-member-stole-350000-from-the-projects-wallet","publishDate":"2022-08-13T14:18:43","id":8832,"type":null,"title":"Velodrome says team member stole $350,000 from the project&#x27;s wallet","category":["HACKS"],"content":["Velodrome, a decentralized exchange (DEX), has identified a former team member as being the person responsible for a $350,000 theft that occurred earlier in August, the platform <a href=\"https:\/\/twitter.com\/VelodromeFi\/status\/1558499944562151425?t=8v5qCSBKu-5eHW_Ry_3dkQ&amp;s=19\" data-v-f87c67ca=\"\">announced<\/a> on Saturday.","The DEX platform said anonymous coder \"Gabagool\"—known for his Twitter handle Gabagool.eth—was responsible for the theft following an investigation. Velodrome reported&nbsp;in August a breach of one of its team wallets and stated that the attacker had drained $350,000 from the project.","Gabagool has built a following by being among a group of on-chain sleuths regularly exposing fraudulent activities by nefarious actors in the DeFi space.&nbsp;","“The Velodrome team has severed our relationship with Gabagool and are working with legal counsel to determine the best next steps,” the DEX platform added in its announcement. Velodrome also assured users that the incident did not affect their funds.","In an interview with The Block in August, when the hack occurred, Gabagool did state that the team was investigating the incident and that the targeted wallet held the team’s private salary funds.","The Block also contacted Gabagool for comments about Velodrome's accusations but has not received a response as of the time of publishing.","Velodrome is a successful implementation of the <a href=\"https:\/\/www.theblockcrypto.com\/news+\/133937\/what-the-heck-is-ve-33-and-why-did-it-cause-fantom-to-take-off\" data-v-f87c67ca=\"\">vested escrow ve (3,3) model<\/a> pioneered by Yearn Finance creator Andre Cronje. The project is a fork of the Solidly DEX built by Cronje that was supposed to launch ve (3,3) on the Fantom network. The platform <a href=\"https:\/\/www.theblock.co\/post\/160078\/velodrome-crosses-100-million-in-tvl-on-optimism\" data-v-f87c67ca=\"\">crossed $100 million<\/a> in total value <a href=\"https:\/\/defillama.com\/protocol\/velodrome\" data-v-f87c67ca=\"\">locked<\/a> on the Optimism network in July. Optimism is an Ethereum Layer 2 network.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Gabagool","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Fantom","content":"PERSON"},{"type":"Yearn Finance","content":"ORGANIZATION"},{"type":"Andre Cronje","content":"PERSON"},{"type":"$350,000","content":"MONEY"},{"type":"August","content":"DATE"},{"type":"Saturday","content":"DATE"},{"type":"Cronje","content":"PERSON"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}