{"summary":"Chair Gary Gensler warned crypto firms that they need to “comply with American laws” in a new social media video. Crypto suffers from a lack of compliance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228649\/gary-gensler-crypto-compliance","publishDate":"2023-04-27T12:29:30","id":8834,"type":null,"title":"SEC&#x27;s Gensler says crypto companies have to comply with the law","category":["EXCHANGES"],"content":["The regulatory environment for crypto in the U.S. is leading some companies to swim offshore. But that doesn't make them fish in Gary Gensler's eyes.","The Securities and Exchange Commission chair doubled down on his message that crypto markets suffer from a lack regulatory compliance, not regulatory clarity, in a new pet-themed video on Twitter.","The regulatory boss likened crypto’s compliance conundrum to calling a dog a goldfish in order to skirt leash laws.","“In many places around the country, we’re required to use a leash when you walk your dog. But let's just say you get stopped because you're walking Rover unleashed. What do you think would happen if you told the police officer that, Rover is actually a goldfish?” Gensler said. “You'd still get a citation. And that's because the law cares about what something actually is, not what you call it.\"","“It doesn't matter if you call yourself onshore or offshore. If you make securities available to American investors, you must comply with American laws,” Gensler continued. “The law is clear.”","The Gensler video comes amid a tussle between the crypto industry and the SEC regarding the regulation of cryptocurrencies. Among the most vocal is Coinbase, which recently sued the agency.","Coinbase, the largest crypto exchange in the U.S., <a href=\"https:\/\/www.theblock.co\/post\/227253\/coinbase-bermuda-offshore-derivatives-exchange\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">obtained a license<\/span><\/a> to operate in Bermuda days before <a href=\"https:\/\/www.theblock.co\/post\/228283\/coinbase-vs-the-sec-a-gamble-to-take-on-a-regulator-undefeated-on-crypto\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">filing the lawsuit<\/span><\/a> against the SEC. The company asked the SEC for a new digital asset rule last year, and is suing for an answer.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“If you're a securities exchange, clearinghouse, broker, or dealer, you must come into compliance, register with us, and deal with conflicts of interest and disclose important information,” Gensler said, without naming any specific company.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The SEC has taken a more aggressive posture toward crypto in recent months. The agency recently gave Coinbase official notice that it was the target of an investigation, for example, and <a href=\"https:\/\/www.theblock.co\/post\/226648\/sec-lawsuit-bittrex-crypto\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">sued Bittrex<\/span><\/a> for allegedly operating an unregistered securities exchange.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Gensler seemed to nod to the Bittrex lawsuit, noting that the agency recently accused a crypto platform of advising issuers to scrub language from their webpages “to pretend that their tokens weren't investment contracts” and avoid SEC scrutiny.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">“<\/span>You could say, in other words, they tried to say that their dogs were goldfish,” Gensler said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Coinbase Chief Legal Officer Paul Grewal responded to Gensler's video during a talk at CoinDesk's Consensus 2023 conference in Austin, Texas on Thursday.","\"To be clear, we would like to be able to register, but it is not simply a matter of going to the website and downloading a form as has been suggested,\" Grewal said. \"Because it can't be done, it is disingenuous to suggest otherwise.\"","(<em data-v-f87c67ca=\"\">Updates with comment from Coinbase legal officer.<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Austin","content":"LOCATION"},{"type":"Bermuda","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Grewal","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Paul Grewal","content":"PERSON"}],"hashtag":["COINBASE"],"authors":["Stephanie Murray","The Block"]}