{"summary":"ERC-4907 permits an individual to borrow an NFT for personal use without having to purchase it from the owner.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155242\/new-ethereum-token-standard-paves-way-for-rentable-nfts","publishDate":"2022-06-30T16:41:16","id":8838,"type":null,"title":"New Ethereum token standard paves way for rentable NFTs","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">A new Ethereum token standard proposal allowing rentable non-fungible tokens (NFTs) reached its final stages earlier this week.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The new rentable token type, dubbed ERC-4907, allows an NFT owner to permit another individual to use their NFT for a designated period of time. After that time ends, the user no longer has access to the NFT.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While it’s unclear whether the proposed token standard has officially gone into effect, it permits users who may not have the funds or desire to purchase an NFT to still access whatever utility that token provides, whether it’s land in a virtual world or a weapon in a blockchain-based game.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The ERC-4907 proposal was put in place by Double Protocol, a firm building out the infrastructure for rentable NFTs for gaming and metaverse use.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Potential use cases for rental NFTs include renting out land in the metaverse. For instance, an individual who owns land in Decentraland may sublet their property to another individual.&nbsp;<\/span>","There are already some ways to rent play-to-earn gaming assets through decentralized autonomous organizations (DAOs) such as <a href=\"https:\/\/www.theblock.co\/post\/148428\/merit-circle-yield-guild-games-dao-dispute\" data-v-f87c67ca=\"\">Merit Circle,<\/a> however this proposal would address the issue in a new way.&nbsp;","<span data-v-f87c67ca=\"\">Double Protocol did not respond in time to The Block’s questions about whether the token standard has gone into effect. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Double Protocol","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"4907","content":"DATE"},{"type":"Decentraland","content":"LOCATION"}],"hashtag":["ETHEREUM","TOKENS"],"authors":["MK Manoylov","The Block"]}