{"summary":"Bakkt is nixing its consumer app to focus on its business-to-business technology solutions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211042\/bakkt-exits-consumer-business-to-focus-on-b2b-as-regulators-crack-down","publishDate":"2023-02-13T08:42:12","id":8839,"type":null,"title":"Bakkt exits consumer business to focus on B2B as regulators crack down","category":["COMPANIES"],"content":["Bakkt is <a href=\"https:\/\/investors.bakkt.com\/news\/news-details\/2023\/Bakkt-to-Enhance-Focus-on-Scalable-Business-to-Business-to-Consumer-Solutions-and-Sunset-Consumer-App\/default.aspx\" data-v-f87c67ca=\"\">nixing<\/a> its consumer app to focus on its business-to-business technology solutions.","Bakkt, which offers a platform for commerce to link to cryptocurrency, said it will continue its core focus of providing businesses with crypto and loyalty experiences for their customers through SaaS and API solutions on a secure and compliant platform.","“The discontinuation of the app ensures we are supporting the relationship our partners and clients have with their customers,” said CEO Gavin Michael. “We are focusing our investment on our core solutions that have product-market fit and are positioned to scale quickly.”","The move comes as cryptocurrency prices have slumped from their 2021 high and regulators crack down on crypto companies.&nbsp;","The app will officially sunset on March 16.&nbsp;&nbsp;","Last year, Bakkt agreed to buy Apex Crypto, a platform for integrated crypto trading. Apex provides services to more than 30 signed fintech partners, serving more than five million customers.&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"March 16","content":"DATE"},{"type":"Gavin Michael","content":"PERSON"},{"type":"Apex Crypto","content":"PERSON"},{"type":"API","content":"ORGANIZATION"}],"hashtag":["FINTECH"],"authors":["Christiana Loureiro","The Block"]}