{"summary":"Billions of dollars have been invested in blockchain startups because many venture capitalists believe that blockchain is as important an invention for","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/1534\/weaknesses-in-the-web-3-0-thesis","publishDate":"2018-10-16T09:19:48","id":8843,"type":null,"title":"Weaknesses in the Web 3.0 thesis","category":["LAYER 1S"],"content":["<a href=\"https:\/\/techcrunch.com\/2018\/05\/20\/with-at-least-1-3-billion-invested-globally-in-2018-vc-funding-for-blockchain-blows-past-2017-totals\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Billions of dollars have been invested in blockchain startups<\/span><\/a><span data-v-f87c67ca=\"\"> because many venture capitalists believe that blockchain is as important an invention for the world as a whole as was the Internet and smartphones. This belief is often called the “Web 3.0 Thesis”, as proponents believe it is a consumer-friendly improvement on the current Web 2.0, which consists of mega-corporations like Google and Facebook making all the money off content that the rest of the world creates. In Web 3.0, the privacy and exploitation complaints that many have with large tech companies today are replaced by a decentralized network of transactions in which individuals are more appropriately compensated and their privacy wishes respected.<\/span>","<span data-v-f87c67ca=\"\">This is a very attractive-sounding, high-level argument, but as venture capitalists should know, the most common reason for startup failure is building something no one wants. And despite a tremendous amount of time, effort, and money having been thrown at the Web 3.0 Thesis, there is no real-world set of consumers who are actually using “Web 3.0.” While proponents argue that it’s just a matter of time, I think it useful to go back and ask how we got here -- how did we get to a point where billions of dollars have been spent on this thesis? Where did the thesis come from? Why do VCs believe it so deeply, despite having none of the usual adoption metrics that they usually require for investments of the size they’re making?<\/span>","<span data-v-f87c67ca=\"\">In this article, I will walk through the Web 3.0 Thesis in a way that explains why venture capitalists believe, and why that faith is misplaced due to an insufficiently critical analysis of their own pattern-matching.<\/span>","<span data-v-f87c67ca=\"\">I think the clearest articulation of the Web 3.0 thesis comes from <\/span><a href=\"https:\/\/twitter.com\/TechCrunch\/status\/1039272689381199874\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ben Horowitz at TC Disrupt<\/span><\/a><span data-v-f87c67ca=\"\">. It’s a video well worth watching, but it needs to be distilled to something we can analyze, and so here is my breakdown out the core elements of the thesis:<\/span>","<span data-v-f87c67ca=\"\">The usual evidence cited for (1) and (2) is the internet and smartphones. Frequently <\/span><a href=\"https:\/\/www.amazon.com\/Technological-Revolutions-Financial-Capital-Dynamics\/dp\/1843763311\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Carlota Perez’s book on Technological Revolutions<\/span><\/a><span data-v-f87c67ca=\"\"> is referenced to <\/span><a href=\"https:\/\/avc.com\/2015\/02\/the-carlota-perez-framework\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">support the idea that things take time to mature and will have disappointments and hype cycles<\/span><\/a><span data-v-f87c67ca=\"\">. It’s certainly true that technology like the internet and smartphones have followed this type of path, and so if you believe that future innovations will match this pattern, then blockchain-based applications sure seem to look like they match.<\/span>","<span data-v-f87c67ca=\"\">Part (3) follows from this being about blockchain-based applications; it’s really the main thing that an append-only, distributed ledger has that’s new. By distributing a database to many locations that can’t have any records erased, you don’t have to trust anyone about what’s in it. You (or a piece of software you have) can just check for yourself.<\/span>","<span data-v-f87c67ca=\"\">They are logical problems in this thesis that do not appear part of any of the mainstream discourse on crypto, and so I am putting them down here to spur further conversation so that we might argue in the <\/span><a href=\"https:\/\/en.wiktionary.org\/wiki\/arguo#Latin\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">original sense of the word<\/span><\/a>&nbsp;<span data-v-f87c67ca=\"\">-- so that we might make things more clear.<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“If A, then B” does not imply “if B, then A”.<\/span><\/i>","<span data-v-f87c67ca=\"\">While I think that Chris Dixon’s piece on <\/span><a href=\"http:\/\/cdixon.org\/2013\/03\/03\/what-the-smartest-people-do-on-the-weekend-is-what-everyone-else-will-do-during-the-week-in-ten-years\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">smart people and their weekends<\/span><\/a><span data-v-f87c67ca=\"\"> is excellent, I do not believe--nor do I think that a reading of history supports--a conclusion that literally everything done by enough “smart” people on the weekends will be done by everyone else in the future. For example, we could look at the focus of “linux on everything”; is <\/span><a href=\"https:\/\/linux.slashdot.org\/story\/17\/12\/24\/0321253\/could-2018-be-the-year-of-the-linux-desktop\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">2018 the Year of Linux on the Desktop?<\/span><\/a><span data-v-f87c67ca=\"\"> (Or how about <\/span><a href=\"https:\/\/www.embeddedarm.com\/blog\/netbsd-toaster-powered-by-the-ts-7200-arm9-sbc\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Linux on a toaster<\/span><\/a><span data-v-f87c67ca=\"\">?) I sure know a lot of “smart” people who have spent <\/span><a href=\"https:\/\/www.zdnet.com\/article\/14-million-raspberry-pis-sold-10-million-made-in-the-uk\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a ton of time with Raspberry Pis<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/Arduino\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Arduino<\/span><\/a><span data-v-f87c67ca=\"\">s, but I think we can all agree that after 13 years, these aren’t going to be mainstream purchases like smartphones and the internet.<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“<\/span><\/i><a href=\"http:\/\/cdixon.org\/2013\/03\/03\/what-the-smartest-people-do-on-the-weekend-is-what-everyone-else-will-do-during-the-week-in-ten-years\/\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Hobbies are what the smartest people spend their time on when they aren’t constrained by near-term financial goals.<\/span><\/i><\/a><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">” --Chris Dixon<\/span><\/i>","<span data-v-f87c67ca=\"\">One significant problem with applying Dixon’s hobbyist thesis to bitcoin and blockchain hobbyists is there absolutely have been significant near-term financial goals involved in both. Both the value of cryptocurrencies growing enormously (note that a single bitcoin has been worth <\/span><a href=\"https:\/\/www.coindesk.com\/price\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">more than $10 for more than six years now<\/span><\/a><span data-v-f87c67ca=\"\">), as well as the flood of venture capital investment in the space (and not to mention ICOs!) have created distorted incentives for people to invest their nights and weekends in any and all crypto-related activities.<\/span>","<a href=\"https:\/\/a16z.com\/2016\/02\/22\/whats-next-in-computing\/\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Q: What’s Next in Computing [2016]?<\/span><\/i><\/a>","<a href=\"https:\/\/a16z.com\/2016\/02\/22\/whats-next-in-computing\/\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">A: AI, IoT, Cars, Drones, Wearables, VR, AR<\/span><\/i><\/a><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> [Notably absent: blockchain]<\/span><\/i>","<span data-v-f87c67ca=\"\">Over the past 50 years, alongside the rise of software, we absolutely have seen new platforms for running and\/or interacting with software applications. But it’s a pretty dubious claim to say that blockchain is a compute platform, given the lack of any apps (beyond the cryptocurrencies themselves) that even “smart people on weekends” use regularly on any blockchain. <\/span>","<span data-v-f87c67ca=\"\">If we look at the history of bulletin board systems, online services like AOL, the Internet, and even the Arduino and Raspberry Pi; from inception, they were actually being used by hobbyists. They allowed hobbyists to do things that they thought were cool and couldn’t do other ways. <\/span><a href=\"https:\/\/ethereum.stackexchange.com\/questions\/383\/what-is-a-dapp\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Distributed apps<\/span><\/a>&nbsp;on blockchains<span data-v-f87c67ca=\"\">, on the other hand, <\/span><a href=\"https:\/\/www.stateofthedapps.com\/rankings\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">really aren’t used at all<\/span><\/a><span data-v-f87c67ca=\"\">. Instead --&nbsp;<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">and this is the key difference that is rarely acknowledged --&nbsp;<\/span><\/i><span data-v-f87c67ca=\"\">the hobbyists are <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">building <\/span><\/i><span data-v-f87c67ca=\"\">these so-called<\/span><span data-v-f87c67ca=\"\">&nbsp;dApps instead of <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">using<\/span><\/i><span data-v-f87c67ca=\"\">&nbsp;dApps.<\/span>","<span data-v-f87c67ca=\"\">To say this another way: If the future compute platform is apps on the blockchain, and we expect to see Carlota Perez’s cycle, we haven’t even started with respect to dApps. I think we’ve seen the cryptocurrency cycle start and extend back the hype phase, but unless you see CryptoKitties as something beyond a proof-of-concept pet-rock-like fad, we don’t even have the equivalent of the first <\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/Quantum_Link\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Q-Link<\/span><\/a><span data-v-f87c67ca=\"\"> chatroom in dApps yet. Blockchain applications aren’t a 1995-Internet equivalent; at best they’d be a 1970-Internet equivalent.<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">\"Trust is the glue of life. It’s the most essential ingredient in effective communication. It’s the foundational principle that holds all relationships.\" – Stephen R. Covey<\/span><\/i>","<span data-v-f87c67ca=\"\">The Web 3.0 thesis posits that we won’t have to rely upon trusting people and organizations any more, because if we conduct transactions through dApps, we will be able to verify everything in the blockchain. I think this misunderstands trust in a very “engineer’s-view-of-the-world” way, and I find it disappointing that we have so much writing on Austrian Economics and TCP\/IP and blockchain, but none on the dynamics of trust.<\/span>","<span data-v-f87c67ca=\"\">Trust is “<\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/Trust_(emotion)\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a measure of belief in the honesty, fairness, or benevolence of another party<\/span><\/a>.<span data-v-f87c67ca=\"\">” Humans have created mechanisms within their own countries that enable trusting strangers, by trusting a nationally known intermediary that both parties trust. My experience as an American purchaser of goods with a credit card is that I will not have to pay for defective goods and that I will not have to pay for fraudulent transactions. My credit card company has made these promises to me, and they have followed through. When I conduct private-party financial transactions, I rely upon a functional legal system (e.g., small claims court) as a backstop. I recognize that my ability to have significant trust in these transactions is not free (but certainly not prohibitively expensive), from the fees that intermediaries in transactions take, to the taxes that pay for the legal system. But nevertheless I can transaction with people I would not ordinarily trust because I have other organizations and institutions that I can.<\/span>","<span data-v-f87c67ca=\"\">And this is not just with payments. I also trust that if Equifax has poor information security, and if I am at risk of harm by that poor information security, they will pay to help protect me. And where that trust may be broken from time to time (e.g., Facebook and Cambridge Analytica, for some), I trust the social institutions that exist (e.g., federal, state, and local governments), that we as citizens have imbued with power, to help fix these problems with a variety of different tools that they have at their disposal.<\/span>","<span data-v-f87c67ca=\"\">The Web 3.0 thesis views dApps as a way to replace these trusted intermediaries in all kinds of transactions -- not just financial --&nbsp; so that they are not necessary. (And, if dApps are cheaper that those intermediaries, goods should be cheaper). Also, perhaps more importantly, dApps would be able to be become trusted intermediaries for transactions that presently do not have any existing trusted intermediaries (e.g., in countries with unstable and\/or corrupt political situations).<\/span>","<span data-v-f87c67ca=\"\">It is important to call out that dApps -- or whatever the blockchain-based solution is -- are <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">intermediaries<\/span><\/i><span data-v-f87c67ca=\"\"> to these transactions. The idea that the mainstream public will participate in “trustless” transactions flies in the face of how trust works for the average person. People trust known entities, and if we reach any moment in which dApps are used by the general public to conduct transactions, the person using the dApp is going to place his or her trust in the dApp, not mathematical proofs. The provider of the dApp is going to be indistinguishable to the general public from the centralized service provider.<\/span>","<span data-v-f87c67ca=\"\">The average person is not going to draw a distinction between losing money from an online-wallet-service-provider like Mt. Gox and losing money due to a vulnerability from someone exploiting a vulnerability in the code of a dApp. In either case, they were wronged by a party that they’re not going to trust in the future, and, further, they may not trust the entire category of similar parties (however they describe that category).<\/span>","<span data-v-f87c67ca=\"\">Keep in mind that this is not the narrative that is given in support of the Web 3.0 thesis. Instead, we are told that we will trust “<\/span><a href=\"https:\/\/medium.com\/@preethikasireddy\/eli5-what-do-we-mean-by-blockchains-are-trustless-aa420635d5f6\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">public-key cryptography and a ‘consensus mechanism’ that allows us to determine the truth<\/span><\/a>.<span data-v-f87c67ca=\"\">” (And then this is usually followed by a simplistic, multi-page explanation of both public-key cryptography and consensus mechanisms that less than 1% of the population will ever read, let alone understand). <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">This is horseshit<\/span><\/i><span data-v-f87c67ca=\"\">. &nbsp;People trust parties. If your stuff gets stolen, you’re getting mad at the identifiable person or organization whom you blame for it. You’re not going to deeply sigh and understand how the consensus mechanism was manipulated by a <\/span><a href=\"https:\/\/www.investopedia.com\/terms\/1\/51-attack.asp\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">51% attack<\/span><\/a><span data-v-f87c67ca=\"\"> or a <\/span><a href=\"https:\/\/medium.com\/@hrishiolickel\/why-smart-contracts-fail-undiscovered-bugs-and-what-we-can-do-about-them-119aa2843007\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">bug in the smart contract<\/span><\/a><span data-v-f87c67ca=\"\"> caused someone to steal your money as part of the transaction.<\/span>","<span data-v-f87c67ca=\"\">One final issue with blockchain as a trusted intermediary is that blockchain will necessarily reduce all trust relationships to transactions. A key aspect of being a human and interacting socially in the world, and building relationships with people, is that there is a crassness to reducing everything to enumeration. If you help me get my car out of a ditch, it’s usually unwanted for me to try and pay you cash for helping me. As a species, we get more benefit out of helping each other and the more karmic relationships that creates than trying to keep everyone at a zero-balance relationship with each other.<\/span>","<span data-v-f87c67ca=\"\">The most challenging part in thinking critically about the Web 3.0 thesis is that there is so much <\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/Social_proof\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">social proof<\/span><\/a><span data-v-f87c67ca=\"\"> from incredibly smart and respected and successful people who have bought into it religiously. But we can all agree that even if the Web 3.0 thesis may become true one day, it certainly hasn’t yet. As, and such, we should think about it as a hypothesis, and we should understand the <\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/Null_hypothesis\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">null hypothesis<\/span><\/a><span data-v-f87c67ca=\"\">, which, in this case, is that the present state will continue and not be disrupted by blockchain-based transactions.<\/span>","<span data-v-f87c67ca=\"\">At the very least, we should demand more from the self-interested luminaries of our time who promote the Web 3.0 thesis and the followers of this thesis who treat it more as a religion to be followed than a hypothesis meant to be tested. It is easy to understand where the belief comes from -- I’ve laid it all out above -- but it is a belief, not a foregone conclusion, and we need more arguments around it to make things clearer.<\/span>","<em data-v-f87c67ca=\"\">This post was written by Joe E, a serial technical co-founder, with four successful exits. He does not presently own nor is shorting any cryptocurrency, nor does he work for a crypto startup.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1970","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"1995","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$10","content":"MONEY"},{"type":"Drones","content":"LOCATION"},{"type":"Stephen R. Covey","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"IoT","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Chris Dixon","content":"PERSON"},{"type":"Carlota Perez","content":"PERSON"},{"type":"TC Disrupt","content":"ORGANIZATION"},{"type":"51%","content":"PERCENT"},{"type":"Equifax","content":"ORGANIZATION"},{"type":"Cambridge Analytica","content":"LOCATION"},{"type":"Joe E","content":"PERSON"},{"type":"Dixon","content":"PERSON"},{"type":"TCP","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"AOL","content":"ORGANIZATION"},{"type":"Ben Horowitz","content":"PERSON"}],"hashtag":[],"authors":["Contributor Network","The Block"]}