{"summary":"The UK&#x27;s Financial Conduct Authority (FCA) is getting serious about cryptocurrencies. According to a job posting, it is looking to hire a Crypto","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/31713\/uk-regulator-looking-to-hire-series-of-cryptocurrency-specialists","publishDate":"2019-07-16T09:04:17","id":8845,"type":null,"title":"UK regulator looking to hire series of cryptocurrency specialists","category":["CRYPTOCURRENCY"],"content":["The UK's Financial Conduct Authority (FCA) is getting serious about cryptocurrencies.","According to <a href=\"https:\/\/fca-recruitment.tal.net\/vx\/mobile-0\/appcentre-FCA_ext\/brand-4\/candidate\/so\/pm\/1\/pl\/3\/opp\/613-Crypto-Intelligence-Associate-Intelligence-Services-Team\/en-GB\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a job posting<\/a>, it is looking to hire a Crypto Intelligence Associate to join its Intelligence Services Team. It is also seeking a \"<a href=\"https:\/\/www.linkedin.com\/jobs\/view\/1355033952\/?eBP=NotAvailableFromVoyagerAPI&amp;recommendedFlavor=IN_NETWORK&amp;refId=8ad845e4-679c-4922-9491-c918d4767b5a&amp;trk=d_flagship3_search_srp_jobs\" data-v-f87c67ca=\"\">Crypto-asset Specialist Supervisor\"<\/a> as part of its efforts to build \"a new team\" dedicated to digital assets within the Financial Crime department, according to its LinkedIn job posting.","The FCA, which serves as the UK's financial regulatory body, is looking to boost their involvement in cryptoassets and cryptoasset-related businesses.","Most notably, the regulator is currently working on providing comprehensive <a href=\"https:\/\/www.fca.org.uk\/publications\/consultation-papers\/cp19-3-guidance-cryptoassets\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">guidance on cryptoassets<\/a>, aiming to provide “regulatory clarity for market participants,” and to instruct “whether the cryptoassets they use are within the regulatory perimeter.” The consultations period ended in April and the policy statement is set to be published this summer. The publication will also help the companies see what regulations apply to their business and whether they require any regulatory authorisations.&nbsp;","And it's slowly making headway too, having <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/03\/its-still-too-early-for-proper-institutions-to-invest-but-were-ready-says-uks-first-regulated-crypto-hedge-fund\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">approved<\/a> the UK's first crypto asset manager earlier this month.","But by concentrating its hiring efforts in intelligence and crime divisions, the FCA may be looking at hardening the relatively laissez-faire stance it has adopted in the UK until now.","Indeed, the regulator is already set to tighten its scrutiny of the space. Per this week's announcement, the FCA will also be <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/uks-new-economic-crime-plan-includes-action-on-cryptocurrencies\/\" data-v-f87c67ca=\"\">in charge<\/a> of maintaining a “strong AML [anti-money laundering] regime” for cryptocurrency companies, following new laws set out by the UK government, scheduled for January 2020. The FCA also recently <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/uks-financial-watchdog-proposes-to-ban-crypto-derivatives-for-retail-investors\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">proposed a ban<\/a> on the sale of cryptocurrency derivatives and exchange-traded notes to retail investors, saying the assets are “ill-suited” for consumers who lack understanding of the products.&nbsp;","The responsibility may lie with the FCA's new crypto-crime team, which is expected to have direct contact with high-risk companies, involving \"regular anti-money laundering visits,\" according to the new job description. It also notes that the recruit will report \"on how firms manage various financial crime risks,\" and the controls in place.","Meanwhile, the position of crypto intelligence associate is described as involving \"considerable amounts of liaison and stakeholder management\" with different government agencies. The aim is to obtain information on \"crypto assets, financial and economic crime linked themes and the role of various processes [] in regulating this activity,\" and to help the FCA make informed decisions about specific cases.","Regulatory uncertainty is a commonly cited concern for major institutions. Additionally, the<a href=\"https:\/\/www.theblockcrypto.com\/tiny\/bitcoin-atms-being-used-for-drug-money-laundering-in-spain-as-dealers-exploit-loophole-in-existing-eu-law\/\" data-v-f87c67ca=\"\"> Spanish police<\/a> have argued for tighter anti-money laundering controls around crypto, after discovering that bitcoin ATMs were being used to launder drug money.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"UK's Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"Intelligence Services Team","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Financial Crime","content":"ORGANIZATION"},{"type":"January 2020","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Intelligence Associate","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"summer","content":"DATE"}],"hashtag":["FCA"],"authors":["Carol Gaszcz","Isabel Woodford","The Block"]}