{"summary":"Visa said that StarkNet, a layer 2 blockchain built on top of Ethereum, may help bridge the gap between crypto and the real world by letting people who use self-custodial wallets pay their bills more easily.  ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/196442\/visa-proposes-using-starknet-for-automatic-recurring-payments","publishDate":"2022-12-19T17:54:37","id":8846,"type":null,"title":"Visa proposes using StarkNet for automatic recurring payments","category":["INFRASTRUCTURE"],"content":["Visa said that StarkNet, a layer 2 blockchain built on top of Ethereum, may help bridge the gap between crypto and the real world by letting people who use self-custodial wallets pay their bills more easily.&nbsp;&nbsp;","While automatic recurring payments are common on traditional mobile banking apps, it's a harder task on the blockchain, according to a crypto thought leadership <a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/usa.visa.com\/solutions\/crypto\/auto-payments-for-self-custodial-wallets.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/usa.visa.com\/solutions\/crypto\/auto-payments-for-self-custodial-wallets.html\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">proposal<\/a>&nbsp;from Visa. The team utilized a novel concept called account abstraction to explore how smart contracts can be implemented to enable automated and programmable payments.","“We see auto payments as a core functionality that existing blockchain infrastructure lacks,” the authors of the proposal <a href=\"https:\/\/usa.visa.com\/solutions\/crypto\/auto-payments-for-self-custodial-wallets.html\" data-v-f87c67ca=\"\">wrote<\/a>.","Visa implemented its proof of concept with crypto wallet Argent using the StarkNet scaling platform because <a href=\"https:\/\/twitter.com\/VitalikButerin\/status\/1576199542382657536?s=20&amp;t=TYlpTsq3JJUWBKF4Rk1sug\" data-v-f87c67ca=\"\">account abstraction<\/a>, which allows smart contracts to carry out transactions for a user, isn’t live yet on Ethereum. The proposal outlines a way for users to automatically send payments using the self-custodial wallet without having to sign each transaction.&nbsp;","\"Using the approach we have introduced, other real-world applications beyond recurring payments could be brought to the blockchain,\" the authors wrote.","Visa <a href=\"https:\/\/usa.visa.com\/visa-everywhere\/blog\/bdp\/2022\/12\/16\/exploring-new-avenues-1671230603572.html\" data-v-f87c67ca=\"\">has been focused<\/a> on crypto infrastructure and protocols for payments, researching areas such as privacy and security for payments that need to be improved before real-world implementations. The company said that it is open to discuss ideas in programmable payments with companies working on the subject.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"}],"hashtag":["STARKNET"],"authors":["Mike Truppa","The Block"]}