{"summary":"Tornado Cash, a popular Ethereum transaction mixing protocol, is ready to integrate the Layer 2 network Arbitrum.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/125658\/popular-ethereum-mixer-tornado-cash-is-ready-to-integrate-with-arbitrum","publishDate":"2021-11-29T08:59:12","id":8848,"type":null,"title":"Popular Ethereum mixer Tornado Cash is ready to integrate with Arbitrum","category":["ETHEREUM"],"content":["Tornado Cash, a popular Ethereum transaction mixing protocol, is ready to integrate the Layer 2 network Arbitrum.","\"The protocol's smart contracts are all set and ready to spin on Arbitrum. They just need help from the community to get deployed &amp; fly with their own wings,\" <a href=\"https:\/\/tornado-cash.medium.com\/tornado-cash-deployment-proposal-on-arbitrum-fb02e508fe74\" data-v-f87c67ca=\"\">said<\/a> Tornado Cash in a blog post on Monday.","As an Ethereum mixer, Tornado Cash improves transaction privacy. It does so by breaking the on-chain link between the sender and recipient address. In other words, it allows withdrawals to a different address, which cannot be linked with a deposit address, thus ensuring privacy. Tornado Cash uses zkSnark proof technology and is non-custodial, meaning users retain full control of their deposits to the protocol.","Tornado Cash's launch on Arbitrum means its users will be able to process Ethereum transactions faster and cheaper. Arbitrum uses optimistic rollups for its scaling technology. Rollups allow for the execution of Ethereum transactions off-chain and store only transaction data on-chain. This reduces the network's congestion, increases its speed, and reduces transaction fees.","Tornado Cash said a transaction costs ~2.5 Gwei on Arbitrum versus ~130 Gwei on Ethereum, citing data from tracker CoinTool. Gwei is a small unit of ether (ETH). A gwei or gigawei is defined as 1,000,000,000 wei, the smallest base unit of ether.","Ethereum Layer 2 solutions appear to be picking up steam. <a href=\"https:\/\/www.theblockcrypto.com\/post\/116148\/ethereum-scaling-solution-arbitrum-launches-mainnet-raises-120-million-funding\" data-v-f87c67ca=\"\">Since launching its mainnet<\/a> on August 31, the total amount of value locked (TVL) in Arbitrum has increased sharply. Its current TVL stands at over $2 billion, and the three biggest contributors for that are DeFi protocols Curve, AnySwap, SushiSwap, according to tracker <a href=\"https:\/\/defillama.com\/chain\/Arbitrum\" data-v-f87c67ca=\"\">DefiLlama<\/a>.","Arbitrum' s TVL is higher than that of rival Optimism, according to <a href=\"https:\/\/www.theblockcrypto.com\/data\/scaling-solutions\/scaling-overview\" data-v-f87c67ca=\"\">The Block's Data Dashboard.<\/a>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/scaling-overview\/value-locked-of-ethereum-optimistic-rollups\/embed\" title=\"Value Locked of Ethereum Optimistic Rollups\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Tornado Cash community members that are willing to support its deployment on Arbitrum can contribute to the deployment, it said. The Ethereum mixing protocol has recently been deployed on Binance Smart Chain, Polygon, xDAI Chain, and Avalanche.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"Arbitrum","content":"LOCATION"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"August 31","content":"DATE"},{"type":"Ethereum mixer","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["ARBITRUM","ETHEREUM"],"authors":["Yogita Khatri","The Block"]}