{"summary":"Ignite Accelerator will support up to 20 startups per year.\nEight investment partners are backing the accelerator through a $150 million investment.","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141302\/ignite-formerly-tendermint-launches-150-million-accelerator-for-web-3-projects","publishDate":"2022-04-12T10:00:12","id":885,"type":null,"title":"Ignite (formerly Tendermint) launches $150 million accelerator for Web 3 projects","category":["Startups"],"content":["<span data-v-f87c67ca=\"\">Applications are open for a new Web 3-focused startup accelerator launched on Tuesday by Ignite, a core development team within the Cosmos ecosystem.<\/span>","<span data-v-f87c67ca=\"\">Eleven investment partners have teamed up to support Ignite Accelerator to the tune of $150 million. They are Alameda Research, KuCoin Ventures, OKX Blockdream Ventures, Hashkey Capital, Chorus One, Figment, Chainlayer, Strangelove Ventures, Forbole, Everstake and Galileo.<\/span>","<span data-v-f87c67ca=\"\">“We are proud to establish a key driver of strategic growth to the Web 3 ecosystem at large, alongside exceptional like-minded partners,” said Sane Lebrun, chief growth officer of Ignite, in a statement.<\/span>","<span data-v-f87c67ca=\"\">“We have a strong track record in incubating ambitious blockchain projects so our accelerator program is an essential extension, allowing us to scale our efforts in fostering innovation in the blockchain industry,” he added.<\/span>","<span data-v-f87c67ca=\"\">Formerly known as Tendermint, the company <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/135048\/tendermint-changes-name-in-light-of-former-ceo-jae-kwons-new-project\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">changed its name<\/span><\/a><span data-v-f87c67ca=\"\"> in February this year after founder and former CEO Jae Kwon returned with plans to take back the name and use it for another project.<\/span>","<span data-v-f87c67ca=\"\">The program will support a maximum of 20 projects per year spread across two cohorts. While each session will last six months, participants will aim to have a successful mainnet launch within 12 months.<\/span>","<span data-v-f87c67ca=\"\">The initiative is Ignite’s latest product for blockchain developments. Last year it launched equity investment incubator Ignite Ventures, formerly Tendermint Ventures, which supports early-stage startup ventures with networking, operational management advice, funding and a Vancouver-based shared office space.<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, its other flagship product, Ignite CLI (formerly Starport), serves as a developer platform for building interoperable and sovereign blockchains.<\/span>"],"hashtag":[]}