{"summary":"&quot;I love freedom and I want to make sure we can be self-confident, secure individuals.&quot; For Alena Vranova, the founder of Trezor, the cryptocurrency wallet","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/1203\/casa-the-crypto-security-firm-brings-on-an-industry-heavyweight-as-it-eyes-new-opportunities","publishDate":"2018-10-03T14:08:41","id":8850,"type":null,"title":"Casa, the crypto security firm, brings on an industry heavyweight as it eyes new opportunities","category":["PEOPLE"],"content":["<span data-v-f87c67ca=\"\">\"I love freedom and I want to make sure we can be self-confident, secure individuals.\"<\/span>","For Alena Vranova, the founder of Trezor, the cryptocurrency wallet company, freedom is rooted in a person's security. When it comes to a person's wealth, Vranova's thesis is that a person is only financially free if their wealth is secure.&nbsp;","Crypto-security firm Casa on Wednesday announced Vranova would join the company from Trezor to lead strategy. Casa is making a big push&nbsp;to tackle the thorny issue of security in cryptocurrency.&nbsp;Notably, Vranaova was involved in the launch of Casa's node for bitcoin and Lightning.&nbsp;","The firm, which raised $2 million earlier this year to build out its business, is known for its security products aimed at wealthy bitcoin investors. Founded by Jeremy Welch, a developer and entrepreneur, the company provides users a way to connect their cryptocurrency wallet to Casa's systems, which require users to electronically unlock a number of different keys in order to move digital assets from one address to another. <a href=\"https:\/\/www.theblockcrypto.com\/post\/54619\/crypto-security-firm-casa-shifts-its-focus-from-selling-bitcoin-nodes-to-improving-its-multisig-solution\" data-v-f87c67ca=\"\">Casa<\/a> targets only folks&nbsp;with $500,000+ worth of crypto&nbsp; and charges a hefty $10,000 fee for its premium services.&nbsp;","The rise of crypto has made such services more necessary, according to Vranova. She told&nbsp;<em data-v-f87c67ca=\"\">The Block&nbsp;<\/em>in an interview that the firm estimates there are over 46,000 crypto millionaires who have emerged from last year's bull market, which briefly brought bitcoin above $20,000.&nbsp;","<span data-v-f87c67ca=\"\">\"We’ve seen in the last year or two more kidnappings and extortion-type situations than ever before,\" she said. \"Having your keys distributed fends off attackers.\"<\/span>","Now, Casa is trying to expand its services to less wealthy individuals with a new security checklist product geared at non-crypto experts who want to keep their holdings safe.&nbsp;\"You’re going to be able to go in and walk through the basic checklist that we walk all of our clients through,\" Vranova added. \"It is an automated way to measure your security.\"","<strong data-v-f87c67ca=\"\">Looking forward to the great hereafter<\/strong>","With Vranova onboard, the firm is looking to continue to expand its user base and product lineup, potentially tapping into the inheritance market for crypto.&nbsp;\"It is worthless&nbsp;to build up this wealth and have it disappear if you were to pass away,\" Welch said. \"We are trying to solve this problem.\"","Right now, the firm has an early option for customers in place via an emergency key, which they can leave with an executor of an estate. But there's more work to be done, Welch added.&nbsp;\"We will continue to explore opportunities there,\" he said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Welch","content":"PERSON"},{"type":"Vranaova","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"$20,000","content":"MONEY"},{"type":"Lightning","content":"ORGANIZATION"},{"type":"Casa","content":"ORGANIZATION"},{"type":"$500,000","content":"MONEY"},{"type":"$10,000","content":"MONEY"},{"type":"Alena Vranova","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"earlier this year","content":"DATE"},{"type":"Vranova","content":"LOCATION"},{"type":"Welch","content":"PERSON"},{"type":"Vranova","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}