{"summary":"Pixelmon has raised $8 million in its seed investment from investors including Animoca Brands, Delphi Ventures and Foresight Ventures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275483\/pixelmon-seed-round","publishDate":"2024-02-01T20:00:05","id":8853,"type":null,"title":"Widely mocked NFT project Pixelmon raises $8 million in seed round including Animoca Brands","category":["VENTURE CAPITAL"],"content":["Pixelmon's art reveal for its $70 million NFT sale in February 2022 was described as <a href=\"https:\/\/twitter.com\/notthreadguy\/status\/1498127608575594500\" data-v-f87c67ca=\"\">terrible<\/a>, <a href=\"https:\/\/decrypt.co\/110542\/nft-game-pixelmon-attempts-comeback-after-70m-horrible-art-reveal\" data-v-f87c67ca=\"\">horrible<\/a> and <a href=\"https:\/\/www.coindesk.com\/markets\/2022\/02\/28\/pixelmon-nft-reveal-disappoints-with-hilariously-ugly-art\/\" data-v-f87c67ca=\"\">hilariously ugly<\/a>. Since then the project has been trying to turn its fortunes around.","By September 2022, the project had replaced the artwork, brought in a new leadership team and outlined a new roadmap. Then in October 2023, it launched casual side-scroller game, Kevin the Adventurer, something that boosted the NFT project's floor price — the lowest price on offer — from 0.35 ETH ($800) to a peak of 1.85 ETH ($4,200).","Its latest move is an $8 million seed investment from prominent investors <span data-v-f87c67ca=\"\">including Animoca Brands, Delphi Ventures and Foresight Ventures (the parent company of The Block).<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The funding round also attracted participation from investors including Amber Group, 9GAG Founder Ray Chan and Immutable Co-Founder Robbie Ferguson, according to a press release.<\/span>","<span data-v-f87c67ca=\"\">Pixelmon is a decentralized gaming brand consisting of mythical creatures of the same name. It is owned by Pixelation Labs, a subsidiary under Singapore-based Web3 venture capital LiquidX Studios.<\/span>","<span data-v-f87c67ca=\"\">Giulio Xiloyannis, chief executive officer of Pixelmon and co-founder of LiquidX, told The Block that Pixelmon is currently developing four games, including PixelPals, which is slated for release this month. All four games will feature the company’s representative Pixelmon monsters, he added.<\/span>","<span data-v-f87c67ca=\"\">With its intellectual property fractionalization system, Mon Protocol, Pixelmon said it distributes the ownership of a trademarkable game character across NFT holders, giving them rights to the IP that grows alongside the community and game ecosystem.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"The decentralized IP system that Mon Protocol is establishing is significant because it will empower creative communities and IP core fan bases to participate actively in the long-term success of a consumer franchise, taking full advantage of true digital ownership and network effects,” Yat Siu, co-founder of Animoca Brands, said in the statement.<\/span>","<span data-v-f87c67ca=\"\">Pixelmon said that the team plans to use the newly raised capital to boost development across its portfolio of casual and mid-core games.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$800","content":"MONEY"},{"type":"Ray Chan","content":"PERSON"},{"type":"Kevin","content":"PERSON"},{"type":"Amber Group","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$70 million","content":"MONEY"},{"type":"October 2023","content":"DATE"},{"type":"” Yat Siu","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"February 2022","content":"DATE"},{"type":"The Block)","content":"ORGANIZATION"},{"type":"Pixelmon","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Mon Protocol","content":"ORGANIZATION"},{"type":"$8 million","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"Giulio Xiloyannis","content":"PERSON"},{"type":"$4,200","content":"MONEY"},{"type":"Delphi Ventures","content":"ORGANIZATION"},{"type":"September 2022","content":"DATE"},{"type":"Pixelation Labs","content":"ORGANIZATION"},{"type":"Robbie Ferguson","content":"PERSON"}],"hashtag":["GAME","SEED &AMP; PRE-SEED"],"authors":["Danny Park","The Block"]}