{"summary":"Citi has increased its equity stake in komgo – a startup building an Ethereum-based enterprise blockchain for trade financing – and started integrating its trade processing system with komgo’s blockchain. Komgo’s appeal lies in its partnership with prominent banks and corporations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59293\/citi-says-it-recently-topped-up-its-equity-stake-in-ethereum-based-trade-financing-platform-komgo","publishDate":"2020-03-19T16:12:57","id":8854,"type":null,"title":"Report: Citi recently &#x27;topped up&#x27; its equity stake in Komgo","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">Citi has increased its equity stake in komgo – a startup building an Ethereum-based enterprise blockchain for trade financing – and started integrating its trade processing system with komgo’s blockchain.<\/span>","<span data-v-f87c67ca=\"\">Launched in 2018 in partnership with ConsenSys, <\/span><a href=\"https:\/\/komgo.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">komgo<\/span><\/a><span data-v-f87c67ca=\"\"> features an end-to-end platform to streamline trade financing in the commodities industry. Using the platform, equities buyers and sellers can leverage distributed ledger technology (DLT) to communicate with each other as well as with their banks and services providers. The project was launched alongside a number of investor founders including Citi, Societe Generale, ING Group, and Sumitomo Mitsui Banking Corporation.<\/span>","<span data-v-f87c67ca=\"\">In a <a href=\"https:\/\/consensys.net\/blog\/enterprise-blockchain\/how-citi-and-consensys-are-using-blockchain-technology-to-help-modernize-the-commodity-trading-market\/\" data-v-f87c67ca=\"\">conversation<\/a> with ConsenSys published on March 10, Citi’s global head of commodity trade finance, Kris van Broekhoven, discussed the bank’s rationale for supporting the blockchain project.<\/span>","<span data-v-f87c67ca=\"\">\"For more than 100 years, the industry has been heavily dependent on the exchange and manual processing of paper documents,\" he said. \"Now blockchain technology serves as a catalyst to disrupt the industry towards the processing of electronic data.\"<\/span>","<span data-v-f87c67ca=\"\">Compared to other blockchain projects out there, Broekhoven said, komgo’s appeal lies in its partnership with prominent banks and corporations.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"It is one of the only consortiums that combines banks and corporates as founders,\" he said. \"This way we help to ensure that the features that komgo develops really address the pain points of a wide variety of users—beyond banks—and the platform has a number of institutions behind it that commit to transacting on the platform.\"<\/span>","<span data-v-f87c67ca=\"\">Citi was one of komgo's investor founders. According to Broekhoven, the bank recently \"topped up [its] equity to allow the company to continue developing.\"<\/span>","<span data-v-f87c67ca=\"\">Citi has also begun the process of integrating its own trade processing system with komgo to take advantage of reduced turnaround times and other benefits that komgo brings. What'<\/span><span data-v-f87c67ca=\"\">s more, now that komgo’s security setup has been further refined, Citi is starting to monitor their investment costs to ensure the project’s financial capabilities.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Right now, the platform is focusing on letters of credit, account receivables financing, and KYC. But in the future, as Broekhoven revealed, komgo will expand its features to include inventory financing and auto-matching of electronic documents.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March 10","content":"DATE"},{"type":"Sumitomo Mitsui Banking Corporation","content":"ORGANIZATION"},{"type":"KYC","content":"ORGANIZATION"},{"type":"ING Group","content":"ORGANIZATION"},{"type":"Kris van Broekhoven","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"DLT","content":"ORGANIZATION"},{"type":"Citi","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"Societe Generale","content":"ORGANIZATION"},{"type":"Broekhoven","content":"PERSON"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}