{"summary":"Projects can access a share of over 110 million MATIC in grants, mentorship and support to help develop their applications.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262381\/polygon-village-90-million-fund","publishDate":"2023-11-09T09:01:02","id":8855,"type":null,"title":"Polygon Village launches $90 million fund for ecosystem development","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Polygon developer Polygon Labs has relaunched its Polygon Village initiative, offering a new grant program of more than 110 million <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248360\/polygon-matic-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/matic-token-icon.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">MATIC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.56%\n    <\/span><\/a> <!----><\/span> — currently worth around $91.3 million — to help projects grow within the Polygon ecosystem.<\/span>","Beyond the funding available, Polygon Village 2.0 offers projects an integrated support system encompassing strategic advice, mentorship, co-working spaces and VC networking opportunities, according to a <a href=\"https:\/\/polygon.technology\/blog\" data-v-f87c67ca=\"\">blog post<\/a>.","Polygon Village 2.0 follows proposals for the <a href=\"https:\/\/www.theblock.co\/post\/250944\/polygon-matic-upgrade\" data-v-f87c67ca=\"\">Polygon 2.0 upgrade<\/a>, released in September, which aims to establish a comprehensive network of interconnected Layer 2 chains powered by zero-knowledge proofs and includes creating a POL token to replace the MATIC token in various capacities.","The initiative breaks down into three components: “Village Grants,” “Village Build Ideas” and “Village Startup Support.”","The community grants program offers an open-arms policy, welcoming projects at any developmental stage across crypto sectors, including DeFi, SocialFi, gaming and infrastructure.","From the more than $90 million available, funding includes direct grants of up to 2 million MATIC ($1.7 million) from the Polygon Foundation for later-stage projects and separate quadratic funding grants for early-stage teams.","Quadratic funding amplifies the available resources by inviting community members to make donations to projects — acting as votes on where to allocate funds. The broader the support, the bigger the match. Polygon has <a href=\"https:\/\/polygon.technology\/village\/grants\" data-v-f87c67ca=\"\">opened<\/a> two quadratic funding grants today, with more to follow.","In addition to Village Grants, Village Build Ideas is a platform for those seeking project inspiration, backed by 1:1 mentorship and support for teams selecting from a catalog of pre-prepared ideas that could become fully realized projects.","Furthermore, Polygon Village Startup Support allows projects to apply for vouchers for services ranging from smart contract audits to storage solutions and web3 infrastructure like oracles and tooling, alongside opportunities to engage with a network of tech experts, the Polygon Labs team, VCs and marketing strategists to help get their projects off the ground.","In the spirit of community connection, Polygon Village also features Village Builder Houses — real-life hubs for networking and resource-sharing in New York and Lisbon.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"$90 million","content":"MONEY"},{"type":"Polygon Foundation","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Polygon Village","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$91.3 million","content":"MONEY"},{"type":"2 million MATIC ($1.7 million","content":"MONEY"},{"type":"Polygon Village Startup Support","content":"ORGANIZATION"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"-0.56%","content":"PERCENT"},{"type":"Lisbon","content":"LOCATION"}],"hashtag":["POLYGON"],"authors":["James Hunt","The Block"]}