{"summary":"The SEC last week objected to Terraform Labs’ $166 million payment to retain Dentons as its special counsel.\nTerraform Labs called the SEC’s legal objections a “troubling example of government overreach.”","author":["Danny Park","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280531\/terraform-labs-counters-sec-claim","publishDate":"2024-03-04T22:28:43","id":886,"type":null,"title":"Terraform Labs counters SEC’s ‘slush fund’ claims, alleges government overreach","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">Terraform Labs has challenged the U.S. Securities and Exchange Commission’s objection to the company’s retention payment of Dentons U.S. LLC as special counsel in its Chapter 11 bankruptcy case, in a filing submitted to a Delaware court on Monday.<\/span>","<span data-v-f87c67ca=\"\">Last week, the <\/span><a href=\"https:\/\/www.theblock.co\/post\/279755\/sec-terraform-labs-suspicious-payment-to-lawyers\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">SEC requested the court to deny<\/span><\/a><span data-v-f87c67ca=\"\"> Terraform Labs’ retention of Dentons’ as its counsel, taking issue with the company’s $166 million payment to lawyers. SEC claimed that a part of this “suspicious” amount was transferred to “an opaque slush fund,” and that the transfer was made deliberately to avoid paying possible judgment from its enforcement action.<\/span>","<span data-v-f87c67ca=\"\">In Monday’s <\/span><a href=\"https:\/\/document.epiq11.com\/document\/getdocumentbycode?docId=4302758&amp;projectCode=TEF&amp;source=DM\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filing<\/span><\/a><span data-v-f87c67ca=\"\">, Terraform Labs again requested authority to pay legal expenses, which it said is imperative in defending against the SEC’s litigation and complying with the ongoing investigation from the Department of Justice. The objections made by the SEC are without merit and should be overruled, Terraform Labs said.<\/span>","<span data-v-f87c67ca=\"\">“That the SEC, the very party pursuing the Debtor in the SEC Enforcement Action, filed such a vehement objection to the Debtor’s spending its own funds to ensure an adequate defense in the SEC Enforcement Action is a troubling example of government overreach,” Terraform Labs said in the filing. The company claimed that the SEC’s true motives are to distract its focus before the upcoming March 25 trial.<\/span>","<span data-v-f87c67ca=\"\">The company also argued that the SEC’s accusations regarding the retention of Dentons include incorrect legal interpretations and false claims.<\/span>","<span data-v-f87c67ca=\"\">Terraform Labs filed for <\/span><a href=\"https:\/\/www.theblock.co\/post\/273683\/terraform-labs-files-chapter-11-bankruptcy-in-delaware\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Chapter 11 bankruptcy<\/span><\/a><span data-v-f87c67ca=\"\"> in the U.S. Bankruptcy Court for the District of Delaware on Jan. 21, with estimated assets and liabilities between $100 million and $500 million, according to its filing at the time. It <\/span><a href=\"https:\/\/www.theblock.co\/post\/275292\/terraform-labs-says-bankruptcy-helps-afford-appeal-against-secs-fraud-lawsuit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said in January<\/span><\/a><span data-v-f87c67ca=\"\"> that the bankruptcy protection would allow the company to pursue an appeal against the SEC.<\/span>"],"hashtag":["DO KWON","SEC"]}