{"summary":"The Solana DeFi space has lost another participant with Everlend Finance announcing the shutdown of its app.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207944\/solana-defi-lender-everlend-shuts-down-its-app-citing-liquidity-crunch","publishDate":"2023-02-02T04:58:19","id":8863,"type":null,"title":"Solana DeFi lender Everlend Finance shuts down its app citing liquidity crunch","category":["CRYPTO ECOSYSTEMS"],"content":["Solana-based DeFi lending protocol Everlend Finance has shut down its app platform, despite having sufficient runway to continue operating in the current business environment, the team said on Feb. 1.","The Everlend team has moved the platform to withdraw-only mode. Users have been urged to remove their assets. The app will continue to operate until all withdrawals have been processed, the announcement <a href=\"https:\/\/twitter.com\/EverlendFinance\/status\/1620787239520464897?t=L0XUe_RbfjqtHih0nsYVPQ&amp;s=19\" data-v-f87c67ca=\"\">stated<\/a>. The team also outlined plans to cover all raised and unused funds within the next two weeks.","Everlend attributed the decision to shut down to the liquidity crunch facing DeFi lending participants. The team stated that continuing to operate in these conditions would be a gamble.","Wednesday’s shutdown notice only concerns the Everland app front end. The Everlend team says it will open-source its codebase so others can continue to build solutions using its technology stack.","Everlend becomes the latest Solana-based DeFi lender to shutter in recent times. Friktion, another Solana-based DeFi yield platform <a href=\"https:\/\/www.theblock.co\/post\/206095\/solana-based-defi-project-friktion-shuts-down-its-front-end\" data-v-f87c67ca=\"\">shut down its front-end app<\/a> in January citing numerous challenges facing the crypto ecosystem as a whole.","Everlend <a href=\"https:\/\/defillama.com\/protocol\/everlend\" data-v-f87c67ca=\"\">controlled<\/a> almost $400,000 in total value locked at the peak of its powers, according to DeFiLlama. This figure declined significantly in November amid the fallout of the FTX collapse when funds exited protocols in the Solana ecosystem.","Founded in 2021, Everlend previously raised funds from backers such as Serum, Everstake Capital and GSR. The Ukrainian lending platform had plans to transition into a community-controlled DAO in Q1 2023.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"Feb. 1","content":"DATE"},{"type":"GSR","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"$400,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Everlend Finance","content":"ORGANIZATION"},{"type":"Everland","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Everstake Capital","content":"ORGANIZATION"},{"type":"Solana","content":"LOCATION"}],"hashtag":["LENDING","SOLANA"],"authors":["Osato Avan-Nomayo","The Block"]}