{"summary":"The Aave community is actively pursuing opportunities to broaden its footprint across diverse blockchain networks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224760\/aave-bnb-starknet-polygon-zkevm","publishDate":"2023-04-04T08:11:10","id":8864,"type":null,"title":"Aave eyes expansion to BNB Chain, Starknet and Polygon zkEVM","category":["DEFI"],"content":["DeFi lending leader Aave is rapidly looking to expand its reach to other blockchain ecosystems.","On Monday, a temperature check vote was&nbsp;<a class=\"c-link c-link--focus-visible\" href=\"https:\/\/snapshot.org\/#\/aave.eth\/proposal\/0xde90f4d29c4c5dd55cba023b29bdde8c49e37f70c3398668a78e2f173a61b4e6\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/snapshot.org\/#\/aave.eth\/proposal\/0xde90f4d29c4c5dd55cba023b29bdde8c49e37f70c3398668a78e2f173a61b4e6\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">initiated<\/a>&nbsp;to deploy Aave V3 on Starknet, with voting concluding on April 11.","The proposal details a two-stage integration process between Aave and Starknet. The first phase, which centered on establishing a cross-chain bridge between Ethereum and Starknet, has already received community approval. The proposal seeks to finalize the second phase by fully implementing the Aave protocol on Starknet.","This progress follows the community's prior endorsement to deploy the Aave V3 minimal viable version on the recently-launched Polygon zkEVM mainnet, which was&nbsp;<a class=\"c-link c-link--focus-visible\" href=\"https:\/\/snapshot.org\/#\/aave.eth\/proposal\/0x0777eb4701023508c03825e2779e6189326ed9b3d1eb6e187d1f6e0f8d154605\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/snapshot.org\/#\/aave.eth\/proposal\/0x0777eb4701023508c03825e2779e6189326ed9b3d1eb6e187d1f6e0f8d154605\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">approved<\/a>&nbsp;during the temperature-check phase.","The accepted proposal advised restricting asset inflows and implementing conservative risk parameters, allowing development and risk service providers to analyze the zkEVM network comprehensively. To mitigate risk, the proposal recommends including only three collateral types — WETH, WMATIC, and USDC — and one lending asset, USDC.","Polygon zkEVM and Starknet are zero-knowledge rollup networks, conducting off-chain computations on a secondary layer for swifter, more cost-effective transactions while focusing on security.","Aave V3 represents the third major iteration of the Aave protocol, a decentralized and non-custodial liquidity market protocol. Aave enables users to lend, borrow, and accrue interest on various crypto assets, encompassing stablecoins and other tokens. The protocol is governed by its community through the AAVE token, which is used for voting on proposals and updates.","It introduces new features and optimizations, including implementing more sophisticated risk management tools and parameters to better protect users and the protocol.","Aave-Chan Initiative founder Marc Zeller proposed today to deploy Aave V3 on BNB Chain. The expansion aims to grow Aave's presence further, tap into the Binance-associated blockchain's user base and add revenue.","\"This deployment aims to enhance the growth and collaboration between the Aave and BNB Chain communities, providing new opportunities for both ecosystems,\" the proposal <a href=\"https:\/\/governance.aave.com\/t\/arfc-aave-v3-deployment-on-bnb-chain\/12609\" data-v-f87c67ca=\"\">states<\/a>.","While the deployment would provide Aave access to BNB Chain's user base and decentralized finance ecosystem, BNB Chain also stands to benefit — as it currently lacks a flagship DeFi lending platform with Aave's reputation and user base. (Venus Protocol is currently the most-significant such protocol on BNB Chain.)","If approved, Aave V3 will deploy on BNB Chain and allow BNB, WBTC, BETH, WETH, USDC and USDT as collateral.","Before Aave V3 can be deployed on BNB Chain, feedback and input will be gathered from the Aave community — particularly regarding the proposed risk parameters and technical deployment details.","Consensus must also be reached and the proposal must be finalized and put to a governance vote.","Aave v3 is currently available on several blockchain networks, including Ethereum and Optimistic Rollup-based Layer 2s, such as Arbitrum and Optimism, the Polygon POS sidechain, and three Layer 1s: Avalanche, Harmony, and Fantom.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"Aave V3","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Chan Initiative","content":"ORGANIZATION"},{"type":"April 11","content":"DATE"},{"type":"Aave","content":"ORGANIZATION"},{"type":"BNB Chain","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Fantom","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Marc Zeller","content":"PERSON"},{"type":"Binance","content":"PERSON"}],"hashtag":["AAVE","POLYGON","STARKNET","ZKEVM"],"authors":["Adam James","Vishal Chawla","The Block"]}