{"summary":"Web3 unicorn Unstoppable Domains promotes Sandy Carter and Lisa DeLuca into leadership positions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217303\/unstoppable-domains-promotes-sandy-carter-to-chief-operating-officer","publishDate":"2023-03-06T12:01:44","id":887,"type":null,"title":"Unstoppable Domains promotes Sandy Carter to chief operating officer","category":["COMPANIES"],"content":["Web3 startup Unstoppable Domains is putting women front and center in leadership roles with two key promotions.","The startup is promoting Sandy Carter, whose current role is senior vice president and channel chief, to chief operating officer. Carter <a href=\"https:\/\/www.theblock.co\/post\/126581\/sandy-carter-unstoppable-domains\" data-v-f87c67ca=\"\">joined<\/a> Unstoppable from Amazon Web Services (AWS) where she drove partnerships in cloud, machine learning and blockchain.&nbsp;","Carter will continue to drive partnerships for Unstoppable, while also leading business development, communications and legal. Since joining in Dec. 2021, she has helped to drive partnerships to over 750 from 61, the company said in a release.","&nbsp;“She has a unique ability to lead and inspire that sets an example for the entire Web3 industry,\" said Matt Gould, CEO and co-founder of Unstoppable Domains, in the release. \"As COO and head of business development, Sandy will continue to help us redefine what it means to own your identity in web3.”","Carter will report directly to Gould who founded the startup in 2018. It's since <a href=\"https:\/\/www.theblock.co\/post\/159736\/unstoppable-domains-clinches-unicorn-status-in-65-million-series-a-round\" data-v-f87c67ca=\"\">clinched<\/a> unicorn status after raising $65 million in a Series A fundraising round last year. The startup allows users to secure domains as non-fungible tokens (NFTs) for a one-time fee. The domains can then be used in several ways from hosting crypto applications to replacing wallet addresses with an easy-to-read domain.","“By 2030, American women are <a href=\"https:\/\/www.mckinsey.com\/industries\/financial-services\/our-insights\/women-as-the-next-wave-of-growth-in-us-wealth-management\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"7\" data-v-f87c67ca=\"\">expected<\/a> to control much of the $30 trillion in financial assets that baby boomers will hold,\" said Carter in the release. \"Yet in the Web3 space, <a href=\"https:\/\/www.forbes.com\/sites\/andiekramer\/2023\/01\/24\/the-crypto-world-needs-more-women\/?sh=2c508c842743\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"8\" data-v-f87c67ca=\"\">less than 5%<\/a> of leadership roles are held by women. I’m proud to be part of a web3 company that’s leading the charge in closing this gap — both through gender parity on our leadership team, and through initiatives like Unstoppable Women of Web3.\"","Lisa DeLuca will also be playing a role in helping to close this gap. DeLuca, who joined the startup at the start of last year, has&nbsp; been promoted to senior director of engineering. Like Carter, DeLuca has an established background in industry, having spent more than 16 years at IBM as a distinguished engineer and product management director.&nbsp;","DeLuca focused on engineering and product management for emerging solutions within IBM's AI Applications division. This is an area that Unstoppable Domains has been dabbling with. Carter <a href=\"https:\/\/www.linkedin.com\/posts\/sandyacarter_artificialintelligence-machinelearning-blockchain-activity-7036238282367668224-Tjae?utm_source=share&amp;amp;utm_medium=member_desktop\" data-v-f87c67ca=\"\">announced<\/a> on LinkedIn that the company was rolling out an AI-based profile picture service for users. The startup is already <a href=\"https:\/\/unstoppabledomains.com\/blog\/categories\/web3-domains\/article\/introducing-ai-generated-domains\" data-v-f87c67ca=\"\">using<\/a> OpenAI’s GPT-3 to create AI-generated domains.","“Lisa is an exceptional leader, inventor, and engineer, and she makes Unstoppable better every day,” said Gould in the release. “Her mindset for innovation will help us continue to foster a world-class engineering organization.”","DeLuca has filed over 800 patent applications and had over 650 granted, said the company in the release.","Women have often been underrepresented in leadership roles in the technology industry. A study from Deloitte Insights <a href=\"https:\/\/www2.deloitte.com\/us\/en\/insights\/industry\/technology\/women-tech-leadership.html\" data-v-f87c67ca=\"\">shows<\/a> that the industry is starting to make progress, with women making up 25% of leadership and technical roles at large technology companies.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$65 million","content":"MONEY"},{"type":"Amazon Web Services (AWS","content":"ORGANIZATION"},{"type":"Carter","content":"PERSON"},{"type":"DeLuca","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Dec. 2021","content":"DATE"},{"type":"Lisa","content":"PERSON"},{"type":"Gould","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"GPT","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Deloitte Insights","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"IBM","content":"ORGANIZATION"},{"type":"Matt Gould","content":"PERSON"},{"type":"Sandy Carter","content":"PERSON"},{"type":"Unstoppable Women of Web3","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"Sandy","content":"PERSON"},{"type":"3","content":"DATE"},{"type":"$30 trillion","content":"MONEY"},{"type":"Lisa DeLuca","content":"PERSON"}],"hashtag":["HIRING","IDENTITY"],"authors":["Kari McMahon","The Block"]}