{"summary":"Starbucks NFTs are now available to beta testers. \nThe coffee conglomerate is also launching a marketplace powered by Nifty Gateway in 2023. ","author":["Lucy Harley-McKeown","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193312\/starbucks-nfts-are-now-available-to-beta-testers","publishDate":"2022-12-08T10:49:33","id":887,"type":null,"title":"Starbucks NFTs are now available to beta testers","category":["Metaverse &amp; NFT"],"content":["Bringing a whole new meaning to javascript, Starbucks is expanding its coffee empire to web3 in earnest, as it rolls out its loyalty program in the U.S. to beta testers.","The Polygon-based initiative allows Starbucks Rewards loyalty program members and the coffee purveyor's employees to earn and purchase digital collectibles in the form of NFTs. It was announced in <a href=\"https:\/\/www.theblock.co\/post\/169195\/polygon-chosen-for-starbucks-web3-odyssey\" data-v-f87c67ca=\"\">September.<\/a>","At the time, the company said the membership program would unlock access to \"immersive coffee experiences: from unique merchandise and artist collaborations to invitations to exclusive events.\"","The experiences, called \"journeys,\" will involve playing interactive games or taking on challenges which are designed to give the customer more in-depth knowledge of the Starbucks brand and coffee. Completing journeys will earn them NFTs, which the company has dubbed \"journey stamps.\"","The first stamps will offer a nod to Starbucks history, with NFTs inspired by its first location in Pike Place Market in Seattle as well as classic designs, according to a <a href=\"https:\/\/techcrunch.com\/2022\/12\/08\/starbucks-opens-up-its-blockchain-based-loyalty-program-and-nft-community-to-first-beta-testers\/\" data-v-f87c67ca=\"\">TechCrunch report.<\/a> Each NFT will have a point value based on its rarity and will be able to be put out for tender on the Starbucks Nifty Gateway-powered NFT marketplace, which launches next year.&nbsp;"],"hashtag":["MAINSTREAMING","ONBOARDING"]}