{"summary":"Celsius CEO Alex Mashinsky is pushing for a revival of the firm around custodial services, according to a report from the New York Times.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169710\/celsius-ceo-mashinsky-held-revival-plan-meeting-the-new-york-times","publishDate":"2022-09-13T13:27:16","id":8872,"type":null,"title":"Celsius CEO Mashinsky held revival plan meeting: The New York Times","category":["COMPANIES"],"content":["Celsius CEO Alex Mashinsky is pushing for a revival of the firm around custodial services, according to a <a href=\"https:\/\/www.nytimes.com\/2022\/09\/13\/technology\/celsius-network-crypto.html\" data-v-f87c67ca=\"\">report<\/a> from the New York Times.","Mashinsky held a meeting with employees last week where he outlined a plan to bring the firm back from bankruptcy. The Times obtained a <a href=\"https:\/\/www.youtube.com\/watch?v=40-w9r7WSKM&amp;t=1234s\" data-v-f87c67ca=\"\">recording<\/a> of the meeting, which an employee leaked to Tiffany Fong, a Celsius customer and public commentator who has <a href=\"https:\/\/www.youtube.com\/c\/tiffanyfong\" data-v-f87c67ca=\"\">publicly documented<\/a> her experience since the crash online.&nbsp;","At that meeting, Mashinsky outlined a plan that would have Celsius store crypto and charge fees on some transactions, codenamed \"Kelvin\" after another unit of temperature. The plan would be a departure from Celsius' previous \"no fee\" branding. He compared the firm's possible comeback to that of other massive corporate turnarounds, including Apple and Delta. A Celsius spokeswoman told The Times that the company regularly holds internal meetings to prepare for all scenarios.","Celsius <a href=\"https:\/\/www.theblock.co\/post\/157491\/crypto-lender-celsius-declares-chapter-11-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">filed<\/a> for Chapter 11 bankruptcy proceedings in July after it said the wider crypto market fallout created liquidity issues. However, that narrative has changed in recent weeks, with <a href=\"https:\/\/www.theblock.co\/post\/168369\/celsius-ran-a-ponzi-like-scheme-states-allege\" data-v-f87c67ca=\"\">regulators alleging in court<\/a> that the company hid its real fiscal situation, and some executives admitting to creditors that Celsius had financial troubles as early as 2020. The Department of Justice and creditor representatives are calling for an <a href=\"https:\/\/www.theblock.co\/post\/164417\/us-trustee-moves-to-appoint-examiner-in-celsius-bankruptcy-case\" data-v-f87c67ca=\"\">independent examiner<\/a> to gain further insight into the truth of Celsius' finances.&nbsp;","Though Mashinsky appears to have grand plans for a comeback, any new business plan would have to be approved through the bankruptcy process. During the meeting, Mashinsky told employees he was working with a legal entity for the creditor committee, which has weighty input in the court process. A source told The Times that after their meeting with Mashinsky, the creditor committee had significant concerns about Mashinsky's status with the company and his newfound plan, though counsel for the committee declined to comment to The Times.","Another hearing in the bankruptcy proceedings is slated for tomorrow. The court will decide whether to redact information about Celsius creditors, among other <a href=\"https:\/\/www.theblock.co\/post\/167331\/celsius-latest-bankruptcy-court-hearing-sets-stage-for-future-decisions\" data-v-f87c67ca=\"\">issues<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Delta","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"The Times","content":"ORGANIZATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Kelvin\"","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"Tiffany Fong","content":"ORGANIZATION"},{"type":"Mashinsky","content":"PERSON"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}