{"summary":"Following issues with its Chivo Wallet, El Salvador&#x27;s government has brought on at least two U.S.-based companies to help improve the app.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/133398\/heres-how-el-salvador-is-trying-to-improve-the-chivo-wallet","publishDate":"2022-02-08T18:03:24","id":8876,"type":null,"title":"Here’s how El Salvador is trying to improve the Chivo Wallet","category":["BITCOIN"],"content":["<span data-v-f87c67ca=\"\">El Salvador’s state-provided bitcoin wallet has had a rough early going. <\/span>","<span data-v-f87c67ca=\"\">But since then, the government has hired some new US companies to take on the task of improving the app.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Chivo, which now counts more than 4 million users, is a wallet that supports both Bitcoin and US dollars. <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/131452\/el-salvadors-chivo-wallet-keeps-breaking-and-users-are-seeking-answers\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The app has been experiencing issues<\/span><\/a> <span data-v-f87c67ca=\"\">over the past few months ranging from identity theft, blocked accounts and failed transactions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Several crypto firms have contributed to the project since its launch in September. While we know some basic details about their contributions to the app,&nbsp; it hasn’t always been exactly clear how they have fit together or who else might be involved. Also, the companies involved in the initial stages of the project have said little — or in some cases, nothing — about the specific problems that many Chivo users have reported.<\/span>","<span data-v-f87c67ca=\"\">Now, El Salvador has added two more companies to the roster: New York-based software company AlphaPoint and Los Angeles-based digital identity provider Netki. <\/span>","<span data-v-f87c67ca=\"\">Here’s how those two firms say they intend to improve the app.<\/span>","<span data-v-f87c67ca=\"\">According to a press release, AlphaPoint now “supports the front-end and back-end infrastructure that powers the wallet and integrates the entire ecosystem including the mobile application, mobile point-of-sale processing, merchant website portal, call-center support software, and administrative console.”<\/span>","<span data-v-f87c67ca=\"\">“Our actual application went into production in mid-December,” AlphaPoint CEO Igor Telyatnikov told The Block. He noted that the company was also “involved in the early discussions” with the El Salvador government, and first built a prototype last summer after El Salvador’s president Nayib Bukele first announced a plan to make Bitcoin legal tender last June.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">AlphaPoint has operated in the crypto space since June 2013, and has worked with more than 150 crypto exchanges, brokerages and wallets in more than 35 countries. Chivo marks the company’s first government contract.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Technology-wise, AlphaPoint technology at its core is a centralized system with a database, but it interoperates with Bitcoin and Lightning [Network] and the banking system,” <\/span><span data-v-f87c67ca=\"\">Telyatnikov said. <\/span><span data-v-f87c67ca=\"\">For Chivo, “there’s an upgraded Lightning integration.\"<\/span>","<span data-v-f87c67ca=\"\">Previously, a firm called Athena Bitcoin, known for its Bitcoin ATMs, confirmed it was responsible for developing Chivo. <\/span><span data-v-f87c67ca=\"\">“The Chivo app was developed by Athena,” CEO Eric Gravengaard told The Block in November, without giving many more details. <\/span>","<span data-v-f87c67ca=\"\">At the time Gravengaard acknowledged the early bugs with Chivo, saying: “There were some issues and our team has been hard at work on those.” But in January, Athena directed questions about more recent issues to Chivo S.A. — the company it said is in charge of the wallet's \"<\/span>usage, technical direction, and management.\"<span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It’s also unclear to what extent Athena is still working on the project — and to what extent AlphaPoint has taken over for Athena, if at all. <\/span><span data-v-f87c67ca=\"\">While the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/news+\/124816\/the-startup-behind-el-salvadors-bitcoin-wallets-is-taking-the-product-global\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">200 Chivo ATMs that Athena owns and operates<\/span><\/a><span data-v-f87c67ca=\"\"> are still functioning around the country, the company did not respond to follow-up questions on January 26 confirming its current role in Chivo.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One of the biggest complaints about Chivo has been identity theft. There have been many reports of people fraudulently using identification numbers to claim the $30 Bitcoin bonus for creating an account. At least hundreds of people have reported identity theft related to the app.<\/span>","<span data-v-f87c67ca=\"\">In October, <a href=\"https:\/\/www.coindesk.com\/business\/2021\/10\/29\/identity-thieves-exploit-el-salvadors-chivo-bitcoin-wallets-setup-process\/\" data-v-f87c67ca=\"\">reports surfaced on social media<\/a> claiming that people were apparently bypassing Chivo’s verification process, using methods like showing a photocopy of an ID instead of a real one or taking a selfie of a movie poster character instead of a real face.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Presumably, that is why Chivo has brought in a new contributor that specializes in fraud prevention. On January 18, Los Angeles-based digital identity expert Netki <\/span><a href=\"https:\/\/www.businesswire.com\/news\/home\/20220118005185\/en\/Chivo-Wallet-Identification-Verification-Partner-Netki-Successfully-Onboards-4-million-users-in-45-days-to-Facilitate-El-Salvador%E2%80%99s-Official-Bitcoin-Adoption\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced that it had joined<\/span><\/a><span data-v-f87c67ca=\"\"> the Chivo project and is providing its know-your-customer\/anti-money-laundering (KYC\/AML) product OnboardID to verify users and protect the app against fraud.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Netki confirmed over 4 million authentic accounts, and we have successfully identified and blocked attempted fraud,” Netki founder and COO Dawn Newton told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Newton said Netki joined the Chivo project “recently” after its initial launch, but did not clarify the specific date. She did not confirm what the current verification process for Chivo looks like, but said the company’s technology uses “biometrics, liveness, computer vision document analysis, and data validation” to verify the documents and individuals.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We then perform sanctions, watchlist, and adverse media screening. These technologies are combined with traditional internet security, bot, and other fraud detection techniques to take a more complete view of the onboarding process than simply analyzing a static image.”<\/span>","<span data-v-f87c67ca=\"\">According to Newton, Netki was aware of the fraud reports before the company’s software was fully deployed in Chivo.<\/span>","<span data-v-f87c67ca=\"\">“When faced with the challenge of onboarding the better part of a country’s population — as Chivo was — attempted fraud is a real and serious possibility,” said Newton. “The key for onboarding is to prevent fraud in a manner that is as efficient as possible while preserving the financial rights of legitimate users as much as possible.”<\/span>","<span data-v-f87c67ca=\"\">While Chivo users should see a marked improvement in the app with AlphaPoint and Netki’s technology going forward, some people who have reported problems in the past few months appear to still be waiting for their issues to be resolved.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For example, two people recently told The Block that they still do not have access to their Chivo accounts, for unknown reasons.<\/span>","<span data-v-f87c67ca=\"\">According to AlphaPoint’s Igor Telyatnikov, the majority of the issues were reported before AlphaPoint’s system went live, and any prior cases would need to be resolved through a queue. This is not unusual for financial apps.<\/span>","<span data-v-f87c67ca=\"\">“There’s two types of issues that could happen: There could be bugs and more technical issues that, if they’re reported to us, we’re definitely on it,” AlphaPoint’s Board Chairman (and Igor’s brother) Vadim Telyatnikov said, noting that AlphaPoint has a team in El Salvador to help with these issues. <\/span>","<span data-v-f87c67ca=\"\">He added: “As far as account-related issues, if an account is locked or something else happens, that’s an operational thing managed by the government.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In other words, AlphaPoint will help provide tools to navigate account-related problems but will have no control over blocked accounts. A representative from Netki also confirmed to The Block that it did not control blocking users’ wallets, and said that any questions regarding this should be directed to Chivo.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One issue that should be improved in the app is the Lightning Network transactions, Igor Telyatnikov said. AlphaPoint has provided a new Lightning Network integration with a new node. “If there were issues with Lightning, they should not be happening,” he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, it’s unclear how many people continue to have issues with the app, how long that backlog could take to clear and what specific tools are in place to resolve these previous issues.<\/span>","<span data-v-f87c67ca=\"\">When The Block asked what people with prior issues could expect in terms of getting them resolved, AlphaPoint’s Board Chairman Vadim Telyatnikov said:&nbsp;<\/span><span data-v-f87c67ca=\"\">“We’re working on things that are reported to us, it is possible if something was stuck before the transition and we don’t have any way to kind of research or identify it, it’s possible we might not be able to fix it.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But then, Igor Telyatnikov jumped in to clarify: “Users’ transaction history and data is all there, so I think if somebody has a legitimate issue, it will get resolved, it’s a matter of time,” he said. “That’s really the case, and I think that part of what AlphaPoint brings is the tools to resolve these kinds of issues faster.”&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Want to read more long-form articles from The Block? For access to more daily in-depth news features such as this one,&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/promotions\/join-the-block-intro\" data-v-f87c67ca=\"\">sign up for The Block's News Plus<\/a>&nbsp;membership.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$30","content":"MONEY"},{"type":"El Salvador","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Gravengaard","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Chivo S.A.","content":"ORGANIZATION"},{"type":"Vadim Telyatnikov","content":"PERSON"},{"type":"January 18","content":"DATE"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"COO Dawn Newton","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"AlphaPoint’s Board","content":"ORGANIZATION"},{"type":"Netki","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"” <\/span><span data-v-f87c67ca=\"\">Telyatnikov","content":"ORGANIZATION"},{"type":"June 2013","content":"DATE"},{"type":"El Salvador","content":"ORGANIZATION"},{"type":"mid-December","content":"DATE"},{"type":"Igor Telyatnikov","content":"PERSON"},{"type":"Newton","content":"LOCATION"},{"type":"Newton","content":"PERSON"},{"type":"Athena","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Athena Bitcoin","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"AlphaPoint","content":"ORGANIZATION"},{"type":"Los Angeles","content":"LOCATION"},{"type":"January 26","content":"DATE"},{"type":"Netki","content":"PERSON"},{"type":"Nayib Bukele","content":"ORGANIZATION"},{"type":"Eric Gravengaard","content":"PERSON"},{"type":"Chivo","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"summer","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Kristin Majcher","The Block"]}