{"summary":"Su Zhu’s crypto hedge fund Three Arrows Capital has invested in BlockFi\nThe fund bought BlockFi shares from Able Partners\nZhu said: “BlockFi has grown at an impressive rate and we are looking forward to helping propel the company forward in global markets.”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61369\/crypto-hedge-fund-three-arrows-capital-invests-in-blockfi","publishDate":"2020-04-09T09:00:15","id":888,"type":null,"title":"BlockFi says its monthly revenue has doubled since raising $30 million Series B round in February","category":["Lending"],"content":["Crypto lender BlockFi is eyeing a more substantial footprint in Asia as it reports a doubling in revenue in the past two months.","In what is perhaps a sign of that focus on Asia, Singapore-based crypto hedge fund Three Arrows Capital, co-founded by Su Zhu and Kyle Davies, has invested an undisclosed amount in crypto lender BlockFi.","Announcing the news on Thursday, BlockFi said Three Arrows Capital has been its client for nearly a year and now has become its investor via a secondary market transaction.&nbsp;Investment fund Able Partners sold BlockFi shares to Three Arrows Capital, a BlockFi spokesperson told The Block.","Three Arrows Capital’s investment in BlockFi follows the crypto lender’s $30 million <a href=\"https:\/\/www.theblockcrypto.com\/post\/55812\/blockfi-raises-30-million-as-it-looks-to-become-more-than-just-a-lender\" data-v-f87c67ca=\"\">Series B<\/a> round two months ago in February.&nbsp;The BlockFi spokesperson told The Block that since the Series B funding, the firm's monthly revenue has doubled.&nbsp;","Amanda Eilian, partner at Able Partners, confirmed the transaction, saying: \"Able Partners was proud to fund BlockFi through our accelerator program for female founders, Wingable, launched in 2018. Outside of our accelerator, Able Partners is focused on supporting companies in the ‘Positive Living’ space that are working to close the Wellness Gap. Although BlockFi is not core to that thesis, we were thrilled to support the incredible progress of Flori Marquez, Zac Prince and the whole BlockFi team.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"While we expect BlockFi will continue their successful trajectory, the recent fundraise gave us the opportunity to recycle capital to support other early-stage founders, which is needed more than ever during these turbulent times,\" Eilian added.&nbsp;","“We have had a great relationship with BlockFi and when presented an opportunity to become more involved on the investor level, the answer was evident. BlockFi has grown at an impressive rate and we are looking forward to helping propel the company forward in global markets,” said Su Zhu, co-founder and CEO of Three Arrows Capital.","Founded in 2018, BlockFi has <a href=\"https:\/\/www.theblockcrypto.com\/post\/58947\/crypto-lender-blockfi-is-raising-interest-rates-on-bitcoin-and-ether\" data-v-f87c67ca=\"\">grown<\/a> significantly within two years. The firm's revenues grew over 20 times in 2019, and it currently boasts more than $650 million in assets on the platform.","BlockFi is backed by notable investors, including Valar Ventures and Morgan Creek Digital. It has raised over $100 million in funding to date, according to Crunchbase.","<em data-v-f87c67ca=\"\">This article has been updated for clarity.<\/em>"],"hashtag":["BLOCKFI","HEDGE FUNDS","SU ZHU","THREE ARROWS CAPITAL"]}