{"summary":"Bankruptcy filing called out Sam Bankman-Fried and the rest of the failed crypto exchange&#x27;s leadership for a &quot;complete failure of corporate controls.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187982\/ftx-bankruptcy-filings-highlight-complete-failure-of-corporate-controls","publishDate":"2022-11-17T08:38:24","id":8880,"type":null,"title":"FTX bankruptcy filings highlight &#x27;complete failure of corporate controls&#x27;","category":["COMPANIES"],"content":["Fresh FTX bankruptcy filings called out Sam Bankman-Fried and the rest of the failed crypto exchange's leadership for a \"complete failure of corporate controls\" and cited the former CEO's \"incessant disruptive tweeting\" since the exchange imploded.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe company’s bankruptcy lawyers argue that Bankman-Fried is actively trying to disrupt the bankruptcy process for the myriad of corporate entities that fall under the FTX umbrella. The embattled crypto mogul has set up a fight against the lawyers and executive hired to shepherd the wind-down process, the new CEO and lead lawyer for FTX’s bankruptcy argue.&nbsp;","FTX’s bankruptcy lawyers have <a href=\"https:\/\/pacer-documents.s3.amazonaws.com\/33\/188450\/042120648186.pdf\" data-v-f87c67ca=\"\">filed<\/a> an emergency petition to move the Chapter 15 bankruptcy proceedings in the Bahamas, which are centered around FTX Digital Markets, to U.S. Bankruptcy Court in Delaware.","If granted, the move would help consolidate the myriad of bankruptcies into one U.S. court.","The filing lays out FTX’s <a href=\"https:\/\/pacer-documents.s3.amazonaws.com\/33\/188450\/042020648197.pdf\" data-v-f87c67ca=\"\">current assets<\/a> and describes the case as “unprecedented”","“In terms of the celebrity of Mr. Bankman-Fried, his unconventional leadership style, his incessant and disruptive tweeting since the Petition Date, and the almost complete lack of dependable corporate records, these Chapter 11 Cases are unprecedented,” wrote Adam Landis, a partner at Landis, Roth &amp; Cobb. “Mr. Bankman-Fried, the co-founder, and controlling owner of all of the Debtors and of FTX DM, appears to be supporting efforts by the JPLs to expand the scope of the FTX DM proceeding in the Bahamas, to undermine these Chapter 11 Cases, and to move assets from the Debtors to accounts in the Bahamas under the control of the Bahamian government.”","The filing goes on to cite Twitter direct messages between Bankman-Fried and a Vox reporter, published yesterday, as evidence of his intent to do this.","Several of FTX’s other corporate entities have already filed in Delaware for the more common Chapter 11 bankruptcy. Chapter 15, which FTX Digital Markets, the Bahamian arm of the company, is a type of bankruptcy for companies that have filed for bankruptcy protection in more than one country. FTX’s lawyers argue, in contradiction to what Bankman-Fried wants to do, that those cases should be consolidated in one bankruptcy court.","In a separate filing laying out the assets belonging to companies under the FTX corporate umbrella, the company’s new CEO, John J. Ray III, blasted Bankman-Fried’s management and agreed that the founder was trying to undermine bankruptcy proceedings.","“Never in my career have I seen such a complete failure of corporate controls and such a complete absence of trustworthy financial information as occurred here,” wrote Ray, a corporate clean-up specialist who is a veteran of the Enron bankruptcy. \"From compromised systems integrity and faulty regulatory oversight abroad, to the concentration of control in the hands of a very small group of inexperienced, unsophisticated and potentially compromised individuals, this situation is unprecedented.\"","Ray’s first day pleadings filing provides balance sheets for entities within FTX’s corporate umbrella, while saying of several that they were unaudited while Bankman-Fried was in control of the companies, so, “the information therein may not be correct as of the date stated.\"","A balance sheet for Alameda Research, Bankman-Fried’s crypto hedge fund, shows that the company lent out $4.1 billion: $1 billion to Bankman-Fried personally, $2.3 billion to a corporate entity called Paper Bird Inc., another debtor in the bankruptcy owned by Bankman-Fried, $543 million to Nishad Singh, a co-founder, $55 million to executive Ryan Salame.","Ray goes on to support an argument made by the company’s bankruptcy representatives that Bankman-Fried is actively trying to undermine the process, and that he no longer speaks for the companies.","“Finally, and critically, the Debtors have made clear to employees and the public that Mr. Bankman-Fried is not employed by the Debtors and does not speak for them. Mr. Bankman-Fried, currently in the Bahamas, continues to make erratic and misleading public statements,” Ray wrote. “Mr. Bankman-Fried, whose connections and financial holdings in the Bahamas remain unclear to me, recently stated to a reporter on Twitter: ‘F*** regulators they make everything worse” and suggested the next step for him was to “win a jurisdictional battle vs. Delaware.’”","In yet another filing, Landis also requested an extension due to the size and scope of the FTX's corporate network. If granted, the company's attorneys would file more detailed information than what was provided today by Jan. 23, 2023.","<em data-v-f87c67ca=\"\">(Updates with additional details from bankruptcy filings throughout.)<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Enron","content":"ORGANIZATION"},{"type":"$4.1 billion","content":"MONEY"},{"type":"$2.3 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Delaware","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Ray","content":"PERSON"},{"type":"Nishad Singh","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Landis","content":"LOCATION"},{"type":"Landis","content":"PERSON"},{"type":"$55 million","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Paper Bird Inc.","content":"ORGANIZATION"},{"type":"Roth &amp; Cobb","content":"ORGANIZATION"},{"type":"Ryan Salame","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Jan. 23, 2023","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Vox","content":"ORGANIZATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"John J. Ray III","content":"PERSON"},{"type":"FTX Digital Markets","content":"ORGANIZATION"},{"type":"Adam Landis","content":"PERSON"},{"type":"$543 million","content":"MONEY"}],"hashtag":["FTX"],"authors":["Colin Wilhelm","The Block"]}