{"summary":"Crypto networks Optimism and Sui are set for large token unlocks this week that will increase each of their circulating supply of tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232511\/optimism-sui-set-for-large-token-unlocks-worth-a-combined-650-million","publishDate":"2023-05-30T06:09:34","id":8881,"type":null,"title":"Optimism, Sui set for large token unlocks, worth a combined $650 million","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto networks Optimism and Sui are set for token unlocks this week that will see each of their circulating supply of tokens increase significantly.","Ethereum Layer 2 network Optimism is seeing the largest unlock, according to <a href=\"https:\/\/token.unlocks.app\/\" data-v-f87c67ca=\"\">Token Unlocks<\/a>, with 387 million tokens set to be released on May 31 — worth $590 million. This represents 9% of the total supply of tokens and a 114% increase to the current circulating supply. The tokens will primarily be split between core contributors and investors.","This comes a week ahead of Optimism's Bedrock upgrade, which is set to lower fees and improve performance. That said, the price of Optimism's native token OP has still dropped from $1.64 to $1.52 in the last 24 hours — ahead of the unlock — down 6%.","Layer 1 blockchain Sui will see a much smaller token unlock of 61 million tokens ($62 million) on June 3, which will increase its circulating supply by 13%. There will be regular unlocks like this until November, when the circulating supply will double — similar to Optimism's unlock this week.","The difference with the Sui unlock is that the tokens will be going to retail users as an airdrop, as <a href=\"https:\/\/twitter.com\/thiccythot_\/status\/1663462972893569026\" data-v-f87c67ca=\"\">noticed<\/a> by Alex, an analyst at crypto trading firm Scimitar Capital, as part of its <a href=\"https:\/\/sui.io\/community-access-program\" data-v-f87c67ca=\"\">community access program<\/a>. Some tokens will also be going to the Sui Foundation.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">So even though the OP unlock is for 114% of supply and SUI is for 13%, there are other complex factors you should consider when evaluating the relative impact on price for these events<\/span>,\" he noted on Twitter.","There have already been some big token unlocks this month. On May 28 Avalanche unlocked 9.5 milion tokens ($139 million), representing 1.3% of its token supply. However, there was no significant impact to the token's price.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$139 million","content":"MONEY"},{"type":"6%","content":"PERCENT"},{"type":"9%","content":"PERCENT"},{"type":"Sui Foundation","content":"ORGANIZATION"},{"type":"May 28","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$62 million","content":"MONEY"},{"type":"$1.52","content":"MONEY"},{"type":"1.3%","content":"PERCENT"},{"type":"114%","content":"PERCENT"},{"type":"Sui","content":"PERSON"},{"type":"June 3","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Alex","content":"PERSON"},{"type":"$590 million","content":"MONEY"},{"type":"$1.64","content":"MONEY"},{"type":"13%","content":"PERCENT"},{"type":"Scimitar Capital","content":"ORGANIZATION"},{"type":"May 31","content":"DATE"}],"hashtag":["OPTIMISM","SUI"],"authors":["Tim Copeland","The Block"]}