{"summary":"The bill, first introduced in Paraguay’s Senate in July 2021, aims to regulate commercial activities relating to virtual assets like mining. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/149240\/paraguays-crypto-industry-regulation-advances-despite-pushback-from-central-bank","publishDate":"2022-05-27T18:07:49","id":8884,"type":null,"title":"Paraguay’s crypto industry regulation advances, despite pushback from central bank","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Paraguay’s Chamber of Deputies approved the advancement of a crypto regulation bill to the Senate this week, despite pushback from the country’s central bank.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=MATnp6bngyk&amp;t=3049s\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">special session<\/span><\/a><span data-v-f87c67ca=\"\"> on May 25, deputies voted 40 to 12 in favor of moving the bill forward with modifications. The project will now return to Paraguay’s senate for further consideration.<\/span>","<span data-v-f87c67ca=\"\">The bill, first introduced in Paraguay’s Senate in July 2021, aims to regulate commercial activities relating to virtual assets. This would include licensing and supervising crypto mining companies operating in Paraguay. The proposed law does not involve making any cryptocurrency legal tender.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The purpose of this law is to regulate the production activities and commercialization of virtual or crypto assets, in order to guarantee legal, financial and fiscal security to the businesses derived from their production and commercialization,” the bill’s first article states.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While the majority of deputies agreed to advance the bill, not everyone is excited about the prospect of Paraguay regulating the crypto sector. The country’s central bank (BCP) submitted a comment in March saying that, in its view, it is unclear whether the benefits Paraguay would receive from regulating the digital asset industry would outweigh cons like “electricity consumption, loss of reputation and costs for the financial system, which would be significant.”<\/span>","<span data-v-f87c67ca=\"\">“Crypto assets do not fulfill the basic functions of money and constitute high-risk investments,” the BCP wrote in its analysis. “The intention to regulate the industry and commercialization of <\/span><span data-v-f87c67ca=\"\">virtual assets, as intended in this bill, could generate a false sense of security regarding the holding of this type of asset.”<\/span>","<span data-v-f87c67ca=\"\">The BCP<\/span> <a href=\"https:\/\/www.theblockcrypto.com\/post\/147244\/heres-why-central-bankers-are-talking-about-bitcoin-in-el-salvador-this-week\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reiterated this position<\/span><\/a><span data-v-f87c67ca=\"\"> just last week when central bankers were meeting in El Salvador to discuss financial inclusion. While many thought the event was primarily about bitcoin, the bank clarified that the meeting was not focused on cryptocurrencies and that it did not plan to discuss them at the event. The bank also reminded people that cryptocurrencies were not legal tender in Paraguay by linking to a statement it made in 2019 about their use.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Lawmakers discussed the bill at length before voting, raising concerns about issues such as electricity usage and money laundering. Deputy Basilio Núñez, for example, claimed that the project<\/span><span data-v-f87c67ca=\"\"> will “favor organized crime” and raised concerns about El Salvador’s use of bitcoin as legal tender.<\/span>","<span data-v-f87c67ca=\"\">But Carlos Rejala disagreed. “Totally the opposite,” he said, explaining that the law would be focused on the traceability of digital assets. He also <\/span><span data-v-f87c67ca=\"\">underscored that the law would not make cryptocurrencies legal tender, but rather give oversight to the digital asset industry.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May 25","content":"DATE"},{"type":"El Salvador","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"BCP","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Paraguay","content":"LOCATION"},{"type":"Basilio Núñez","content":"PERSON"},{"type":"last week","content":"DATE"},{"type":"Paraguay’s Chamber of Deputies","content":"ORGANIZATION"},{"type":"July 2021","content":"DATE"},{"type":"Carlos Rejala","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"},{"type":"El Salvador","content":"ORGANIZATION"}],"hashtag":["CRYPTO"],"authors":["Kristin Majcher","The Block"]}