{"summary":"Filecoin developers Protocol Labs have also attempted to lower the cost of contributing storage space to the network. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180450\/filecoin-releases-new-content-delivery-network-called-saturn","publishDate":"2022-10-27T11:00:51","id":8889,"type":null,"title":"Filecoin releases content delivery network called Saturn: Exclusive","category":["BLOCKCHAIN"],"content":["<span data-v-f87c67ca=\"\">The developers of decentralized storage project Filecoin have launched a content delivery network called Saturn. The goal is to help the network meet content bandwidth for decentralized apps and make it cheaper to run Filecoin nodes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Content delivery networks make up a substantial portion of the internet helping websites quickly retrieve information. Specifically, Saturn is a series of interlinked servers that will help in pulling or retrieving content for decentralized apps. It complements the main data storage layer on Filecoin, said Protocol Labs, the development firm behind Filecoin, which <\/span><span data-v-f87c67ca=\"\">started building it in the first half of 2022. <\/span>","<span data-v-f87c67ca=\"\">With the launch of its Saturn, the firm has not just provided a content delivery layer, it’s also attempted to lower the cost of being a contributor to Filecoin. Protocol Labs says it’s made the network more accessible to public contributors.<\/span>","<span data-v-f87c67ca=\"\">Up until now, the only way to contribute to the Filecoin network was to become a Storage Provider (SP), a participant who provides their excess storage space to others. However, becoming an SP requires access to significant amounts of storage capacity and can be expensive, meaning the barrier to entry is high for individuals. Storage providers have to meet a minimum of 10 terabytes (TB) in committed storage to join the Filecoin Network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On the other hand, running a Saturn CDN node needs just 1 terabyte (TB) of storage; it’s less expensive than running a Filecoin Storage Provider node. It will let more people contribute to the network bandwidth and earn the protocol's native currency, which is also called filecoin, said Protocol Labs.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">\"The launch of Saturn, Filecoin's content delivery network delivers on two key goals of Filecoin: fast, open access to humanity's most important information and to let anyone, anywhere participate in Filecoin's ecosystem,” said Filecoin Saturn Lead Ansgar Grunseid. “And with a lower barrier of entry for network participants and faster, more robust retrievals from IPFS and Filecoin, Saturn unlocks the next generation of Filecoin's growth and impact.\"<\/span>","<span data-v-f87c67ca=\"\">The Filecoin main data storage layer offers cheaper and censorship-resistant cloud storage with a capacity of 18.9 billion gigabytes (GB). It shares ideas from the InterPlanetary File System (IPFS), also developed by Protocol Labs, and allows users to rent unused hard drive space.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">All three products from Protocol Labs: Filecoin, Saturn and IPFS offer a more censorship-resistant alternative to centralized cloud services offered by Google or Amazon. Protocol Labs claims that hundreds of projects use Filecoin,<\/span> <a href=\"https:\/\/filecoin.io\/blog\/posts\/building-web3-filecoin-ethereum-better-together\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">including<\/span><\/a><span data-v-f87c67ca=\"\"> Fleek, Web3.Storage, PowerLoom, Secured Finance, Ocean Protocol, LivePeer, NFT.storage, Voodfy, among others.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Voodfy","content":"LOCATION"},{"type":"Amazon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Protocol Labs","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"the first half of 2022","content":"DATE"},{"type":"Filecoin Storage Provider node","content":"ORGANIZATION"},{"type":"Secured Finance","content":"ORGANIZATION"},{"type":"Filecoin Network","content":"ORGANIZATION"},{"type":"Fleek","content":"PERSON"},{"type":"Ocean Protocol","content":"ORGANIZATION"},{"type":"Filecoin","content":"ORGANIZATION"},{"type":"Filecoin Saturn Lead Ansgar Grunseid","content":"ORGANIZATION"},{"type":"Saturn","content":"ORGANIZATION"},{"type":"Filecoin","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}