{"summary":"The price of SOL, the native asset of the Solana network, hit an all-time high on Monday — and market watchers say several catalysts appear to be at play amid the run-up. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/114703\/solana-hits-all-time-high-as-market-watchers-say-institutional-interest-is-growing","publishDate":"2021-08-16T14:57:37","id":8891,"type":null,"title":"Solana hits all-time high as market watchers say institutional interest is growing","category":["MARKETS"],"content":["The price of SOL, the native asset of the Solana network, hit an all-time high on Monday — and market watchers say several catalysts appear to be at play amid the run-up.&nbsp;","SOL was trading up by more than 39% over the last 24 hours, reaching an all-time high of $68.24 per token. The cryptocurrency saw notable gains in the past week alongside others, including dogecoin and cardano, the latter of which hit its own all-time high on Saturday.&nbsp;","Traders in the market pointed to heightened institutional interest around the projects being built on Solana as reasons for that particular asset's market gains.&nbsp;","Crypto financial services company FalconX told The Block that Solana trading volumes have doubled since last week. That activity has been underpinned by new institutional interest, according to one trading firm executive.&nbsp;","\"I'm long, everyone that matters is probably long,\" the executive said.&nbsp;","","","Rich Rosenblum of GSR added: \"Does seem like substantial size, utilizing algos to enter, indicative of larger players than a broad retail move.\"","Solana-based projects have also seen capital inflows, such as Mango Markets. The decentralized exchange raised $70 million in a token sale last week. Degenerate Ape Academy, a non-fungible token project built on Solana, launched this week and saw trading volumes notch nearly $6 million in spite of reported platform issues.","\"There's a lot of capital going into the ecosystem,\" said one executive from a trading firm that is incubating a Solana project. The executive added that it's still early days, noting that the infrastructure for many of these projects is still being determined.","\"It's also really hard to find good rust devs which has been a bit of a bottleneck for projects in the ecosystem,\" the executive said.&nbsp;","In any case, FalconX's Aya Kantorovich said that capital continues to recycle \"into other protocols and projects building on Solana.\" Still, it looks like some traders are taking profits, according to FalconX data. While over-the-counter trading desks and proprietary trading outfits are skewed to the buy-side, hedge funds appear to be selling.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GSR","content":"ORGANIZATION"},{"type":"Rosenblum","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$70 million","content":"MONEY"},{"type":"Aya Kantorovich","content":"PERSON"},{"type":"$68.24","content":"MONEY"},{"type":"39%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Degenerate Ape Academy","content":"ORGANIZATION"},{"type":"$6 million","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Saturday","content":"DATE"}],"hashtag":["SOLANA"],"authors":["Frank Chaparro","The Block"]}