{"summary":"KeyFi founder Jason Stone is restricted from transferring or disposing of property linked to failed crypto firm Celsius.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211751\/bankruptcy-court-restricts-keyfi-founder-jason-stone-in-celsius-case","publishDate":"2023-02-14T16:07:13","id":8892,"type":null,"title":"Bankruptcy court restricts KeyFi founder Jason Stone in Celsius case","category":["COMPANIES"],"content":["KeyFi founder Jason Stone and others involved with the staking firm are barred from transferring or disposing of most property tied to the Celsius bankruptcy case, according to a temporary restraining order filed in court on Tuesday.","The restraining order against Stone and KeyFi restricts the parties from transferring or disposing of property, and notes the firm may not use “Tornado Cash or other means to conceal the location of any property that could otherwise be available to satisfy a judgment in this case.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The temporary restraining order does make note of dozens of NFTs that are deployed in decentralized finance activities, including 13 Cryptopunk NFTs and one Bored Ape Yacht Club NFT. Stone and KeyFi may “continue to deploy” the NFTs, according to the order.","If Stone or others at KeyFi believe “in good faith” that transactions unrelated to the listed NFTs need to be performed to avoid liquidation or other financial issues, the parties should send a request to Celsius and the Celsius Official Committee of Unsecured Creditors in the bankruptcy case.","Stone and KeyFi are also required to send Celsius and the creditors committee a statement of profits and losses associated with activities permitted by the temporary restraining order. The statements will be sent every two weeks beginning on Friday.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Celsius and KeyFi have been engaged in a legal battle for months, after Celsius acquired part of KeyFi in 2020. Stone sued Celsius in July, accusing the firm of mismanagement and fraud. Six weeks later, Celsius sued KeyFi and its founder, <a href=\"https:\/\/www.theblock.co\/post\/165200\/celsius-countersues-keyfi-former-employee-for-being-thieves\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">alleging<\/span><\/a> the firm engaged in stealing, losing and laundering millions of dollars worth of cryptocurrency.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"laundering millions of dollars","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Bored Ape Yacht Club NFT","content":"ORGANIZATION"},{"type":"Celsius Official Committee of Unsecured Creditors","content":"ORGANIZATION"},{"type":"Celsius","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Jason Stone","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"July","content":"DATE"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}