{"summary":"Users who had loans with Celsius have taken to social media to share their concerns over having their collaterals liquidated after being margin called.\nThe company announced on Sunday that it was pausing all withdraws, swaps, and transfers.","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152070\/celsius-users-fear-collateral-liquidation-amid-transfer-freeze","publishDate":"2022-06-17T14:50:21","id":89,"type":null,"title":"Celsius users fear collateral liquidation amid transfer freeze","category":["Lending"],"content":["<span data-v-f87c67ca=\"\">Following crypto lending firm Celsius’ decision to freeze all transfers and withdrawals Sunday, some investors have taken to social media over concerns that their loans will be liquidated as they’re unable to top off their collateral.<\/span>","Despite Celsius' historic dismissal of comparisons to it being a bank, the firm takes deposits and lends out funds much like a commercial bank like JPMorgan or Bank of America. Their high yields and low-interest rates have attracted many investors.","<span data-v-f87c67ca=\"\">In order to borrow money, users deposit funds that get locked up as collateral. However, if the value of that coin drops, they can be margin called — meaning they will get a notification to add additional funds. From then on they have 24 hours to take action in order to avoid liquidation.<\/span>","<span data-v-f87c67ca=\"\">As of Sunday, anyone with funds on the platform has been unable to withdraw, swap, and transfer. Some users took to social media to say that they have lost their collaterals. The Block has reached out to the company but has not heard back in time for publication.<\/span>","<span data-v-f87c67ca=\"\">One person on Twitter who goes by SimplyDCA shared a screen grand of an email from the company stating that their loan had been liquidated due to not having resolved an outstanding margin call or responded to previous communications.<\/span>","<span data-v-f87c67ca=\"\">“I was liquidated because I couldn’t transfer my own funds to pay off loan or post collateral. This is not the reason I unbanked myself,” <\/span><a href=\"https:\/\/twitter.com\/SimplyDCA\/status\/1536267325476937728\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">that user said<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Another one, who goes by NghiaBui101218, pointed out that they were “scared” to deposit any more funds:<\/span>","<span data-v-f87c67ca=\"\">Many on social media have recently pointed out a clause in <\/span><a href=\"https:\/\/celsius.network\/terms-of-use\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Celsius’ terms of use <\/span><\/a><span data-v-f87c67ca=\"\">that stipulates that if the company goes “bankrupt, enters liquidation or is otherwise unable to repay its obligations, any Eligible Digital Assets used in the Earn Service or as collateral under the Borrow Service may not be recoverable.”&nbsp;<\/span>","A user by the name QuickshoeRacing said that he tried to pay off his loan before Celsius even paused transfers and got a liquidation notice on Monday before the company eventually accepted the payment. While he's no longer at risk of being liquidated, the 6 BTC he had as collateral remains in the account.","\"Honestly, I don’t think paying off the loan was my best option. It would have been better to let the loan liquidate and buy BTC back using the payoff money,\" the 45-year-old engineer told The Block over direct message. \"If they didn’t have my payoff and I was at risk of liquidation, I would not have sent the payoff.\"","He claimed that at this point reaching out to customer service is the only way to close a loan.","\"Before they accepted my payoff, I received an email saying I needed to send 10 BTC to return my loan-to-value to the required 60%,\" he said.","In an FAQ posted Tuesday, Celsius said that customers who receive a margin call should reply to the email \"as soon as possible\" and tell the loans team that they want to resolve it by posting additional collateral of fully paying off the loan.","The company goes on to remind users that any additional funds they put into their account won't be available for withdrawals, swaps or transfers. The same would logically apply to any unlocked collateral.","<span data-v-f87c67ca=\"\">One other person told The Block that he used to look at Celsius as a “savings account” and a “unique way to kind of bank yourself,” but weeks ago decided to take out the funds from his custody account due to turmoil in crypto markets as a whole and speculation around the Celsius platform specifically.<\/span>","<span data-v-f87c67ca=\"\">Only last week, however, did he decide to also pay off his $135,000 loan in order to get his collateral back. He was able to pay back $95,000 initially and on Sunday <\/span><span data-v-f87c67ca=\"\">unwound an additional $15,000 only hours before the company announced it was pausing transfers.<\/span>","<span data-v-f87c67ca=\"\">“Usually the bitcoin would be set within 30 minutes and it was pending and pending and pending,” he said. “I just overexposed myself to Celsius, because at the very least — yes they have more Bitcoin than I had borrowed USDC from them — but now I sent USDC and I didn't get my bitcoin (in collateral) back.”<\/span>","<span data-v-f87c67ca=\"\">Because his loan is overcollateralized he is less concerned with being margin called, but at this point is still stuck with 5 BTC in Celsius, between the collateral and custody accounts.<\/span>","<span data-v-f87c67ca=\"\">“That's a little painful, but I'm a big boy, I understood the risks. And I was working like heck to get liquidity, to get everything off,\" he said. “This ends up being a total loss I still have other assets, I'm fine. But I imagine a lot of people are really hurting.”<\/span>"],"hashtag":[]}