{"summary":"Former FTX founder and CEO Sam Bankman-Fried attempted to influence a potential witness in the case of FTX&#x27;s collapse, prosecutors said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206462\/prosecutor-seek-to-restrict-bankman-frieds-bail-terms-after-apparent-attempts-to-influence-witnesses","publishDate":"2023-01-27T20:28:20","id":8904,"type":null,"title":"Prosecutor seeks to restrict Bankman-Fried&#x27;s bail terms after apparent attempts to influence witnesses","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">Former FTX founder and CEO Sam Bankman-Fried appears to have attempted to influence a witness in the case looking into the exchange’s collapse, prosecutors said in a letter to the court.<\/span>","<span data-v-f87c67ca=\"\">In addition to limiting his ability to contact current and former employees of companies he founded, prosecutors seek to restrict Bankman-Fried’s access to encrypted messaging services.<\/span>","<span data-v-f87c67ca=\"\">U.S. Attorneys want to restrict FTX founder and ex-CEO Sam Bankman-Fried’s access to encrypted messaging services and bar communication with former FTX and Alameda employees, after prosecutors suggested he was trying to influence witnesses, <\/span><a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.590940\/gov.uscourts.nysd.590940.50.0.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">according to<\/span><\/a> <span data-v-f87c67ca=\"\">court documents.<\/span>","<span data-v-f87c67ca=\"\">U.S. prosecutors contend Bankman-Fried’s messages were “suggestive of an effort to influence” the testimony of a witness. The witness is said to have received instructions via encryption messaging app Signal for “liquidating Alameda’s investments to satisfy FTX customer withdrawals” to cover a $45 million hole in FTX US’s balance sheet in November.<\/span>","<span data-v-f87c67ca=\"\">“I would really love to reconnect and see if there’s a way for us to have a constructive relationship, use each other as resources when possible, or at least vet things with each other,” SBF wrote to \"Witness-1\" on Jan. 15.&nbsp;<\/span>","\"This is particularly concerning given that the defendant is aware that Witness-1 has information that would tend to inculpate the defendant,\" the document said. \"The appeal for a 'constructive relationship' likewise<br data-v-f87c67ca=\"\">\nimplies that Witness-1 should align with the defendant. This is particularly concerning given that the defendant is aware that Witness-1 has information that would tend to inculpate the defendant.\"","<span data-v-f87c67ca=\"\">He also communicated directly with the current general counsel of FTX US, who officials contend may be a trial witness.<\/span>","Bankman-Fried made contact with other current and former FTX employees over email and via Signal, which is consistent with “a history of using the application for obstructive purposes,” the document said.","<span data-v-f87c67ca=\"\">The disgraced CEO's current bond imposes no limitations in terms of contacting prospective witnesses in the ongoing case.<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"$45 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Jan. 15","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"1","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"}],"hashtag":["CRIME","SAM BANKMAN-FRIED"],"authors":["Jeremy Nation","The Block"]}