{"summary":"The animated show, which actress Mila Kunis co-produced, is one of the first television series to be fully funded by non-fungible tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113239\/stoner-cats-nft-sale-rakes-in-over-8-million-despite-technical-cat-astrophes","publishDate":"2021-08-02T10:29:04","id":8906,"type":null,"title":"Stoner Cats sale rakes in over $8 million despite technical ‘cat-astrophes’","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">A recent token sale for Mila Kunis’ newly launched NFT animated show Stoner Cats sold out its collection of NFTs for 3,647 ETH (about $8.4 million). The sale finished in less than 40 minutes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Stoner Cats is one of the first television shows that will be fully funded by non-fungible tokens, or NFTs, which are digital collectibles that exist on the blockchain. The show follows a family of cats and the old woman they live with. The cats are voiced by several well-known names in the entertainment world and beyond, including Ashton Kutcher, Jane Fonda, Chris Rock, and even Ethereum co-founder Vitalik Buterin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The sale, which featured a collection of 10,420 NFTs of digital cats with unique traits, was created to fund and promote the show’s production. By shelling out 0.35 ETH (about $800) for a Stoner Cat NFT, users could unlock access to all episodes of the television show — in addition to owning the NFT itself.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But it wasn’t all smooth sailing. The sale encountered technical issues, which led to many users not receiving their tokens despite paying transaction fees. According to <\/span><a href=\"https:\/\/duneanalytics.com\/queries\/91839\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Dune Analytics<\/span><\/a><span data-v-f87c67ca=\"\">, such affected users were set back by 344 ETH, worth $700,000.<\/span>","<span data-v-f87c67ca=\"\">Stoner Cats co-star Ashton Kutcher has stated that the Stoner Cats team will “personally gift” ETH to cover all failed transaction fees.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The problem occurred largely because there were so many users trying to quickly buy the NFTs, causing Ethereum transaction fees to skyrocket and clogging up the Ethereum blockchain. And the way that Ethereum works is that, even if the transaction fails, users still end up having to pay for the transaction fees.<\/span>","<span data-v-f87c67ca=\"\">“We followed the industry standards and haven’t found any glitches. But, we believe we should hold ourselves to higher standards. We learned a lot and are going to write it all up and share it,” Kutcher <\/span><a href=\"https:\/\/twitter.com\/aplusk\/status\/1421294525016854529?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweeted<\/span><\/a><span data-v-f87c67ca=\"\"> this weekend.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Since the sale, many of the Stoner Cat tokens have been put up for auction on NFT marketplace <\/span><a href=\"https:\/\/opensea.io\/collection\/stoner-cats-official?search[sortAscending]=false&amp;search[sortBy]=PRICE&amp;search[toggles][0]=ON_AUCTION\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">OpenSea<\/span><\/a><span data-v-f87c67ca=\"\">, with minimum starting bids set as high as 59 ETH (about $153,000).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Lisa Sterbakov, partner at Orchid Farm Productions and a member of the team behind Stoner Cats, the team wanted to find a way to retain creative control and financial ownership of the show.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">After several weeks of planning and sitting on Zoom calls, what started as a traditional Hollywood-like show turned into an NFT project.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Unfortunately, the machine that creates content has all these hurdles in place, especially for a story that people haven’t seen before,” Sterbakov told The Block. “By funding the show through NFTs, we are giving artists the opportunity to get their work out and do it quickly.”<\/span>","<span data-v-f87c67ca=\"\">According to Sterbakov, the team also wanted to get immediate feedback from viewers and involve them in the production process somehow.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We have our arc and we know the big story we want to tell, but there are lots of smaller parts that we want to include with input from the community,” Sterbakov said. “For instance, in a scene with graffiti, we could put community members’ handles.”<\/span>","<span data-v-f87c67ca=\"\">Sterbakov said the team hasn’t yet decided how many seasons of Stoner Cats will be produced, but the first season, which is currently running, will have five six-minute episodes. Users that bought a Stoner Cat NFT will have access to all of the show’s episodes as well any new series the production team releases in the future.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lisa Sterbakov","content":"PERSON"},{"type":"Ashton Kutcher","content":"PERSON"},{"type":"$800","content":"MONEY"},{"type":"$153,000","content":"MONEY"},{"type":"Chris Rock","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"weekend","content":"DATE"},{"type":"Hollywood","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Stoner Cats","content":"ORGANIZATION"},{"type":"Kutcher","content":"PERSON"},{"type":"Stoner Cat NFT","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Sterbakov","content":"LOCATION"},{"type":"Sterbakov","content":"PERSON"},{"type":"Jane Fonda","content":"PERSON"},{"type":"Mila Kunis","content":"PERSON"},{"type":"$8.4 million","content":"MONEY"},{"type":"$700,000","content":"MONEY"},{"type":"Orchid Farm Productions","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Saniya More","The Block"]}