{"summary":"Banning crypto assets may not be an effective approach for countries to manage risk over the long run, according to the IMF.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236199\/imf-crypto-ban","publishDate":"2023-06-23T11:16:44","id":8911,"type":null,"title":"IMF says banning crypto assets may not be effective long-term","category":["POLICY"],"content":["Banning crypto assets may not be an effective approach for countries to manage risk over the long run, according to the International Monetary Fund.","“While a few countries have completely banned crypto assets given their risks, this approach may not be effective in the long run,” the international financial organization said in a <a href=\"https:\/\/www.imf.org\/en\/News\/Articles\/2023\/06\/22\/cf-interest-in-cb-digital-currencies-picks-up-in-latam-the-caribbean-while-crypto-use-varies\" data-v-f87c67ca=\"\">post<\/a> discussing interest in central bank digital currencies in Latin America and the Caribbean.&nbsp;","Instead, the IMF said that “the region should focus on addressing the drivers of crypto demand, including citizens’ unmet digital payment needs, and on improving transparency, by recording crypto asset transactions in national statistics.”","As cryptocurrencies present varying risks in different countries, the IMF said the emphasis should be on mitigating such risks while still “leveraging the potential benefits of the technological innovation associated with crypto assets.”","The position contrasts IMF comments made in a <a href=\"https:\/\/www.theblock.co\/post\/214649\/imf-calls-for-coordinated-action-over-fears-crypto-could-undermine-global-monetary-system\" data-v-f87c67ca=\"\">statement<\/a> in February, relating to an executive board meeting earlier that month where it ​​called for a “coordinated response” over fears crypto could undermine the global monetary system. While directors agreed strict bans on crypto were “not the first-best option,\" some directors thought “outright bans should not be ruled out.\"","Latin America and the Caribbean are leading the way in the adoption of digital assets, according to IMF <a href=\"https:\/\/www.imf.org\/en\/Publications\/WP\/Issues\/2023\/02\/17\/Crypto-Assets-and-CBDCs-in-Latin-America-and-the-Caribbean-Opportunities-and-Risks-529717\" data-v-f87c67ca=\"\">research<\/a>, with Brazil, Argentina, Colombia and Ecuador <a href=\"https:\/\/blog.chainalysis.com\/reports\/2022-global-crypto-adoption-index\/\" data-v-f87c67ca=\"\">ranked among the top 20<\/a> for global adoption. El Salvador hit the headlines in 2021, giving <a href=\"https:\/\/www.theblock.co\/post\/107699\/el-salvador-becomes-the-first-country-ever-to-make-bitcoin-legal-tender\" data-v-f87c67ca=\"\">bitcoin legal tender<\/a> status. Other countries in the region are making significant progress in introducing CBDCs to enhance financial inclusion or lower cross-border payment costs, the IMF said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"International Monetary Fund","content":"ORGANIZATION"},{"type":"Argentina","content":"LOCATION"},{"type":"Colombia","content":"LOCATION"},{"type":"Ecuador","content":"LOCATION"},{"type":"Caribbean","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"IMF","content":"ORGANIZATION"},{"type":"Brazil","content":"LOCATION"},{"type":"February","content":"DATE"}],"hashtag":["CBDCS"],"authors":["James Hunt","The Block"]}