{"summary":"High-frequency trading service Woo Network joins a list of 24 AML-approved crypto exchange and custody platforms in Taiwan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168547\/crypto-exchange-woo-network-secures-aml-approval-in-taiwan","publishDate":"2022-09-08T05:54:26","id":8912,"type":null,"title":"Crypto exchange Woo Network secures AML approval in Taiwan","category":["REGULATION"],"content":["Woo Network, a crypto exchange platform that touts its \"deep liquidity,\" has obtained anti-money laundering (AML) regulatory approval in Taiwan, the company announced on Thursday.","The approval means that Woo Network can implement AML compliance measures in line with regulatory provisions in Taiwan, according to the announcement. As such, the platform can offer crypto trading and custody services in Taiwan.","Chloe Tsai, Woo Network’s legal chief stated that the AML approval was a precursor for the platform securing a banking partner. This partnership will see the crypto exchange able to offer cryptocurrency to fiat trading.","Woo Network founder Jack Tan called the regulatory nod an “important milestone” for the company. The crypto exchange is the only foreign platform to receive an AML approval from Taiwan’s financial regulator, the announcement said.","Woo Network <a href=\"https:\/\/www.theblock.co\/linked\/123803\/defi-liquidity-provider-woo-network-raises-30-million-in-series-a-round\" data-v-f87c67ca=\"\">secured $30 million<\/a> in a Series A funding round in November. Investors in the capital raise included PSP, ACP Capital, Crypto.com Capital — and the recently bankrupted Three Arrows Capital.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"ACP Capital","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Chloe Tsai","content":"PERSON"},{"type":"Jack Tan","content":"PERSON"},{"type":"$30 million","content":"MONEY"},{"type":"Taiwan","content":"LOCATION"},{"type":"November","content":"DATE"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}