{"summary":"The proposal calls for the Aave DAO to trigger the Gauntlet insolvency fund and part of its treasury to cover the bad debt.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189606\/llama-and-gauntlet-submit-proposal-to-cover-1-6-million-in-bad-debt-on-aave","publishDate":"2022-11-23T16:19:25","id":8914,"type":null,"title":"Llama and Gauntlet submit proposal to cover $1.6 million in bad debt on Aave","category":["CRYPTO ECOSYSTEMS"],"content":["DeFi management platform Llama and DeFi risk management outfit Gauntlet have submitted a governance proposal on Aave to cover the DeFi lender’s $1.6 million bad debt brought on by Tuesday’s short attempt linked to Mango Markets exploiter Avraham Eisenberg.","The <a href=\"https:\/\/governance.aave.com\/t\/arc-repay-excess-debt-in-crv-market-for-aave-v2-eth\/10779?u=llamaxyz\" data-v-f87c67ca=\"\">proposal<\/a> calls for the use of Gauntlet’s insolvency fund and the Aave treasury to cover the bad debt. Gauntlet’s insolvency fund <a href=\"https:\/\/etherscan.io\/address\/0x7667095Caa12b79fCa489ff6E2198Ca01fDAe057\" data-v-f87c67ca=\"\">holds<\/a> 4,923 staked Aave tokens, which is currently worth $283,000. The DeFi lender's treasury itself is worth $165 million, based on the last financial <a href=\"https:\/\/llama.xyz\/reports\/aave\/october-2022-financials.pdf\" data-v-f87c67ca=\"\">report<\/a> by Llama, and can be used to cover the excess debt, the proposal added.","Aave racked up bad debt due to a publicized short on Curve DAO (CRV) tokens. One trader borrowed 92 million CRV worth $57 million on the DeFi lending platform and proceeded to sell them continuously, causing <a href=\"https:\/\/www.theblock.co\/post\/189028\/curve-dao-token-plunges-14-under-heavy-short-selling-pressure\" data-v-f87c67ca=\"\">an initial decline<\/a> in the CRV price as the token dipped to a two-year low of $0.40. The short seller, however, suffered a squeeze as the CRV token <a href=\"https:\/\/www.theblock.co\/post\/189167\/curve-token-jumps-50-amid-squeeze-on-big-short-position\" data-v-f87c67ca=\"\">price rallied above $0.60<\/a>.","This squeeze eventually liquidated the short seller’s debt position on Aave, and the liquidations left the DeFi protocol with debt amounting to $1.6 million.","The proposal stated that the debt coverage process could help to optimize the Aave DAO treasury. Aave’s treasury holds “a large number of low-value long tail assets,” the proposal stated. Gauntlet and Llama said the assets may be used to recapitalize Aave’s system and make the CRV market whole in the process.","The Aave DAO community will discuss the proposal in the coming days. Gauntlet and Llama will provide details on how the debt coverage process will unfold if the DAO favors the proposal.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$57 million","content":"MONEY"},{"type":"CRV","content":"ORGANIZATION"},{"type":"$1.6 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$0.60","content":"MONEY"},{"type":"$0.40","content":"MONEY"},{"type":"$165 million","content":"MONEY"},{"type":"Avraham Eisenberg","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$283,000","content":"MONEY"},{"type":"Llama","content":"ORGANIZATION"},{"type":"Llama","content":"LOCATION"},{"type":"Llama","content":"PERSON"}],"hashtag":["DAOS","LENDING"],"authors":["Osato Avan-Nomayo","The Block"]}