{"summary":"On this episode of The Scoop Cascarilla talked about the growth of its stable coin and why stable coins are a better alternative for merchants.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/37757\/charles-cascarilla-paxos","publishDate":"2019-09-04T17:20:22","id":8920,"type":null,"title":"A Conversation with Charles Cascarilla, CEO &amp; Co-Founder at Paxos","category":["PODCASTS"],"content":["<em data-v-f87c67ca=\"\">The following transcript is taken from episode eighteen of The Scoop, The Block’s first podcast. Listen below and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/conversation-charles-cascarilla-ceo-co-founder-at-paxos\/id1460134454?i=1000448480355\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>,&nbsp;<a href=\"https:\/\/open.spotify.com\/episode\/13tvtACLqhR7mekT6Rr2XP\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>,&nbsp;<a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>,&nbsp;<a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback and revision requests to&nbsp;<a href=\"\/cdn-cgi\/l\/email-protection#0979666d6a687a7d497d616c6b65666a626a7b70797d66276a6664\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"04746b606765777044706c6166686b676f67767d74706b2a676b69\">[email&nbsp;protected]<\/span><\/a>. This transcript has been edited for clarity and length.<\/em>","<em data-v-f87c67ca=\"\"> Paxos wears many hats in the blockchain ecosystem. It offers one of the better known stable coins, $PAX. Operates a crypto currency exchange, that's itBit and the company provides products that help large firms use blockchain to improve their settlement systems. But at the heart of Paxos (according to CEO <a href=\"https:\/\/www.linkedin.com\/in\/charlescascarilla\" data-v-f87c67ca=\"\">Charles Cascarilla<\/a>) is to move the financial system onto the blockchain -- it's a move he says could prevent future financial calamities like what the market saw in 2008. On this episode of The Scoop Cascarilla talked about the growth of its stable coin and why stable coins are a better alternative for merchants. I hope you enjoy the episode <\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK4614612130\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Ladies and gentlemen thank you so much for tuning into The Scoop. We are joined by a very special guest whose last name I will probably incorrectly pronounce -- Charles Cascarilla. It's Chad at Paxos he's the CEO, their brave leader. This is my favorite time to record a podcast. It's around 1:30PM in New York. Right. Or 2 o'clock. What time is it? It's 2:30 I've been told. We're very excited to dive in. Paxos is a New York based blockchain firm. Their best probably known in the crypto space for operating itBit which is a Bitcoin Ethereum exchange. They also have $PAX which is one of the larger better known stable coins. And they also are involved in settlement solutions and other enterprise blockchain efforts. We're really excited to talk to Chad. And like I was saying before we turn the mics on I feel like when I talk to folks about what you guys do they know Paxos, they know how long you've been at it but maybe they only know you for one of those things as opposed to the sum of its parts. So I think a really cool place to start would be you know, what is that elevator pitch that you convey to folks about what Paxos does and what exactly is the North Star?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> Yeah I think it's a great question and it's really fundamental to what Paxos is about. When we think about why we started the company and I think about what got me excited to start the company. It's that there is 600 trillion dollars of assets in the world and we believe they're gonna end up on a blockchain. Maybe that takes 20 years or 30 years I don't know how long it takes but they're going to end up on a blockchain. And how you go from basically paper databases and COBOL mainframes and whatever system someone is on and really do a database upgrade is I think one of the big stories in financial services. I have a lot of conviction because of my background. I've seen how the plumbing of the financial system works and it needs this kind of shift and it will create a safer financial system; it's one that will be decentralized, not centralized, will be open -- you'll have a lot of access. That was really the big idea that we have a lot of conviction and that led to us to creating Paxos. The whole point of Paxos is, how can we enable assets to move at the speed of the Internet? How can we enable the movement of any assets at anytime in a trustworthy way? And our vision of how you need to do that is by operating in a regulated way as a trust company which we are. Operate as a custodian where we can hold people's assets where they're safer than if they were even in a bank and be able to put them into a blockchain environment. We think about what we do whether it's itBit or whether it's $PAX whether it's some of the new products we're going to be launching soon. We're acting as a custodian, we're holding your assets, in the case of real world assets -- tokenizing them and in the case of many real world assets or otherwise we have a whole post trade product suite that can help enable you to use our custody services and our tokenization services. It's all about, we're going to hold your assets and we're going to transform them for you to be able to go use them as you want and maybe even use them on some of the products that we have.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So let's think about your background you were at a hedge fund for 15 years you co-founded Cedar Hill Capital and you were there for 15 years thinking about it from the asset management portfolio manager perspective: how does what Paxos does change the game for let's just say the firm you were at before Paxos?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> There's a couple of problems that we saw and from the perspective I was sitting in at that time, 1. This was an asset management company so it's a financial services company. At the same time it's a user of the financial system and the third thing is we were investing in financial services companies so it was really completely centered on understanding the financial system, using it and building a financial services company. That gave us a really great vantage point to understand a lot of the problems in the financial system. As we went to the financial crisis we were short subprime, short commercial real estate and then we actually created a distressed mortgage fund and were long distressed mortgages and that whole process we really climbed into the plumbing of the system and it was so clear to us from that vantage point that the plumbing of the system was actually exacerbating the crisis in a really fundamental way. And if you look at where the world is today even, the plumbing hasn't changed at all. There's more capital there's more regulation but the actual way things work, it's still COBOL mainframes, it's still slow multiday settlements. If there's another financial crisis we're gonna have the same systemic problems that we had 10 years ago and that to me is really scary. It was having that perspective and then coming across blockchain that led us to create Paxos and that's where this conviction comes from that taking assets from where they sit today putting them into a blockchain decentralized world that has open access will be one of the biggest things that happens because it creates real freedom for people to be able to control their own financial lives in a way that you can't do right now, you're always dependent upon some centralized intermediary and you have to be dependent that they're going to survive or they're going to survive because they've been guaranteed that place by the state. And that's not a vision of the world that we really think should persist. It needs to change and needs to get better.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> So you mentioned blockchain a few times but we haven't mentioned like a specific blockchain, you previously mentioned you think many assets are going to be tokenized on blockchain, do you think that Ethereum is going to carry that large share of the asset tokenization market?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> The short answer is yes and I don't know. At the same time -- the reason we put it on put Ethereum is because that's where thousands of tokens already are, it's battle-tested people are using it. There are drawbacks with the Ethereum just like with any blockchain because they are still early stage. There are real questions about whether or not we'll be able to scale. There's real questions about some of the changes to how the database is kept in sync. I mean there is a proof of work, proof of stake. There's lots of things that need to happen but I think Ethereum is in the pole position but it doesn't guarantee anything. There are certainly other chains that have interesting value propositions whether as EOS or TRON or Stellar or you kind of go down the list. There is a variety of what I would call these blockchains that are trying to be the ledger of record is the way I would describe it. We don't have a particular viewpoint of which one it will be beyond its very clear Ethereum is the one at the moment. There's a saying many a slip twixt the cup and the lip. We don't know exactly where it's going to end up and our goal is to tokenize assets. It's not to say this is the database you have to use. We're talking with other databases around how we can tokenize assets onto those. Aside from Ethereum we're going to be very customer driven. If everyone tomorrow says they want to go put it on a whole new blockchain, we're going to put it on a whole new blockchain. Our goal here is to tokenize assets -- not to tell you which one to use.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> Because we've seen Tether start moving off like omni which is built on bitcoin to like Ethereum and try and TRON, right? Do you see that as a possible future for $PAX stable coins where there's demand on these chains. You will be happy to deploy $PAX stable coin on EOS on TRON on Stellar.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> Absolutely.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> To peel back the onion a bit it sounds like obviously you're blockchain agnostic to an extent, at least as it pertains to these public blockchains. But I'd like to get back just quickly to what you see as blockchain helping to avoid or ameliorate the next financial crisis? Sitting in your seat making bets on the markets when all this was going down you seem to have made out pretty well because you were on the right side of some of those bets. How could have blockchain helped other folks who were not?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> You said suddenly all the world is using blockchain.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Yes you know in 2007, 2006.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> Yeah. 2006 or you know it's 2025 and everyone's on blockchain now. How would like a financial crisis be different? Well let's think about a couple of the ways in which the fact that you're using a centralized system exacerbates the crisis. We can drill into a little bit. So you know here's Lehman Brothers, Lehman fails. Everyone thought letting Lehman brothers fail would be OK. The Federal Reserve thought it was gonna be fine but what was really clear is no one actually really understood that the plumbing of the system and what happens is, you don't settle a trade immediately. You and I agree to a trade.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> T plus 2.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> Right. So we'll settle on T2, T3 or T5. Some things can be T30 -- loans or other things but we're agreed to a trade it's not like Hey all right. Frankly even in the world of bitcoin you don't really settle instantaneously either. Very hard...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Especially in the OTC world.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> And we should define settlement which is the asset and the payment move at the exact same moment of time and at the exact same moment of the trade. Now that would be like down to the sine qua non of the of the trading world which is called real time gross settlement. The trade and the settlement happen at the exact same time, exact same moment. OK. So that doesn't happen, so the next great best thing would be what's called sorry to use so much lingo here but it's called delivery versus payment. Delivery of the asset versus the payment for it. The next thing if you can't make the trade also be the settlement. Well at least have the settlement happen simultaneously where I send you something and you send me the payment. That doesn't even really happen. OK so now not only is the trade not the settlement but even the settlement -- each leg moves on its own. Well you can imagine what happens. Okay, Frank and I do a trade. I'm going to send you, I don't know let's just pick a thousand gold bars, you're going to send me a thousand dollars... I wish that was the right price but it's not. I'll send you a thousand gold bars, you send me a thousand dollars. Well who goes first? Well I mean this is like almost like a drug dealer or hostage dilemma. You send me the hostages or I send you the briefcase of cash.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Aren't there standards around like what defines default and what defines...?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> There is definitely standards around what defines default but here's the problem: we are agreeing to a trade and we're agreeing to a settlement and suddenly maybe I go first and I'm sending it to you. Guess what? You thought you were going to get paid by someone else and you didn't. The whole system is predicated on all these settlements happening and they are layered and they're layered for the next day, the next three days, the next five days, the next week. You have all these settlements that are layered into place and you're expecting that you're going to be receiving from somebody and then you can pay someone else out. Because it's not happening right when the trade happens these build up and it's counterparty risk. What's the risk that your counterparty will fail? What's the risk that if that counterparty fails other people will fail? This whole domino happens in fact because the plumbing is preventing settlement from happening both simultaneously and in real time. You need to have simultaneous settlement between me and you and if we could do it at the moment we agree to the trade, now there's really no counterparty risk in the system. By the way how does the financial system normally solve this problem? OK. Well you and I can't agree to a trade. We can't decide who goes first. We're gonna use JP Morgan or whatever, Citi Bank or somebody else as our intermediary. They're basically an escrow agent. The banking system is really an escrow agent to us doing this trade because we're afraid one of us will fail so we're going to use this person and they're called a big bank so we don't think they'll fail. Oh but they could because it's Lehman Brothers. No one plan that a big institution could fail and once they fail everyone who is relying on them to act as intermediary starts to...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So if you allow these counterparties to engage directly in a trust list network. One, or peer to peer. You remove the risk of having that acting escrow agent.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> That's centralized, too big to fail. Now they're called too big to fail. They have more capital, more regulation but you didn't remove the fact that you have a centralized system...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> How does that work? Walk me through that process if the world has adopted blockchain as their intermediary.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> Well what happens is you can remove the need to rely on a centralized intermediary for all kinds of other types of settlement. Now it's not going to happen immediately for every asset class. We're not just blue sky thinkers here, it's going to take time there's an adoption curve in the transformation that happens but a decentralized system is always more stable and more resilient than a completely centralized one. You can control a centralized one better. A decentralized one has more resilience. That's why democracy is so much more responsive then for instance you know a monarchy or whatever it might be. An autocracy. It's the same thing in the financial system, you've created you know a really stagnant system reliant on too big to fail institutions where it's not possible for them to innovate at the size and the scale that they're at with the regulation they have and we're all dependent upon them but it doesn't remove the fact that it's just a centralized system so in a future where you now have a decentralized world where counter parties can programmatically transact with each other without needing somebody else to be the escrow agent you completely open up a whole new possibility for innovation, for access to the system because only people that can access the system now are the ones that the big escrow agents will open accounts for. Well in the crypto world you see what a problem that is -- nobody can get a bank account because everyone needs a bank because they're the only ones who are allowed to hold cash. That's not the case in a stable coin world but we can get to that at a later point of the conversation. You can see how putting assets into a decentralized framework can really completely change the system.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So how is Paxos... What are the solutions you guys are offering that get us to that point? And you mentioned not tackling the entire market at once but on an asset or at least what I'm taking from what you said an asset by asset approach. So what are those solutions and which assets are you starting with? I think precious metals are probably one of the more obvious or one of the corners of the market that would make the most sense.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> When we think about assets we put them into some four broad buckets. You have crypto assets, they're already on a blockchain -- you might need a custodian, we can provide services and we do. There's cash and what I mean by cash I mean fiat cash. There are commodities and then lastly there's really kind of securities -- that's like stocks and bonds. The reason I grouped them in those categories is they have different regulatory regimes for these and they have different ways they move today. So let's talk about cash for a second. We have a stable coin, if I tell you a little more about Paxos I can explain cash. We talked a little bit about how we had this vision for how the world can change. Fundamental to that was for Paxos to become a regulated financial institution in and of itself. It's not that we don't want to create a large amount innovation but we're trying to think how can you create the most amount of innovation, means you need to have the most widespread adoption that inevitably involves regulation. We went out and created a trust company in the state of New York and this is safer than a bank. The reason a trust company is safer than a bank is because if someone gives us their assets. We hold those assets in their name as trustees segregated. If Paxos fails your assets are still there. You give your money to a bank, it's a loan. The bank then goes out and uses that money to go lend to somebody else. A bank is actually riskier than a trust company -- that's why financial market infrastructure in the U.S. has historically been set up as a trust company in the state of New York so that's what we did. That's foundational for us. It creates the ability for us to offer a variety different products. So in the case of cash we're a regulated trust company. Someone sends money to us -- we're holding it in that client's name and we then can and if you for instance sent me a thousand dollars, a conventional stable coin product; I'll send you a thousand Ethereum tokens.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Some folks might look at that from the traditional markets and think doesn't that just introduce more counterparty risk because now not only am I relying on the U.S. federal government that this money is going to be worth something and that the economy is going to be strong and there's gonna be good monetary policy but I'm also then relying on Paxos doing its job to hold the coins and to make sure that that peg stays true to one to one.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> Well I think there's an element of that, because we're regulated our stable coin is regulated. We have a bunch of different auditors so people can feel comfortable about using Paxos. We have the department of financial services does an exam a about every 4 to 6 weeks with us. Grant Thornton does our internal auditing Deloitte -- a big 4 auditor does our external auditing, within audits ar bank accounts that have the cash in them. Now importantly, the way we have it set up is the cash is basically held in FDIC insured accounts or T-Bills. You're only taking U.S. government credit risk with your cash when you put it with us. You're not taking any commercial bank risk. What happens normally is you're taking commercial bank risk. You put your money in a bank account. If it's more the FDIC limit, if that bank fails you have a problem. In our case we're putting that cash into either FDIC insured accounts or U.S. government T-Bills so they really are very safe. Clearly yet they rely on the U.S. government not inflating away the value of your dollar but I think you always have that risk. And by the way that's what happens -- it's devalued 97% since Bretton Woods, whatever it is.It's gone down a lot but it's a small amount every year so people feel comfortable using it as a medium of exchange. It's not a store of value it's a medium of exchange and that's fine. But here's a key difference: you don't rely on commercial banks which are really acting as bad middleware. When you deposit money with the bank you're tied to the banks hours of bank activity. 9-5, 5 days a week. If you want to move it and you're overseas it could take multiple days, high fees to do wiring and other transfers. This is really inefficient and by the way it's not programmable. You put cash on a blockchain, this is a really simple example of it -- you've now made cash move 24\/7, instantaneously, programmable and anyone can have an account, so anybody can open an account in their low cost accounts. It's really hard opening even consumer bank accounts these days, there's 50 million unbanked people just in the U.S. several billion worldwide. All you need is Ethereum wallet and you can have a bank account. You completely changed the access, you changed the dependencies in the system, you're not reliant on certain institutions anymore. You're not reliant on their hours. I think there's less than 10 banks in the U.S. that even have API's. Right, so I mean talk about like you're relying on old technology at the core. One of the very large banks in the country hasn't changed the core programming language since the early 70s. They do two upgrades a year on the core deposit system. It is a systemically important financial institution. I won't name the names here but everyone knows it. It's a household name. That's true for every single one of these institutions. It's very very hard for them to take what they have... They might have a nice fancy app or whatever it is. But the core systems are going back 40 or 50 years. We need to get to a new world.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So it sounds like what what you'd like for Paxos to be with $PAX at the center of it is an alternative. Not just creating systems and solutions for institutions, money managers and banks that they can use to upgrade their systems but also on the consumer side -- a replacement for the banking applications and infrastructure that exists today. I want to send money, if I want to save money, if I want to store money. I could do that through Paxos and with $PAX.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> You can and what we've done, last week we announced a partnership with ST Coins and Huobi where they're able to create their own stable coin using our infrastructure. That's really us offering our trust as a service for other institutions in the space who aren't regulated, to be able to build on our infrastructure both our technology and regulatory infrastructure in order to be able to offer very safe products for their customers. That's one example, we'll have some other examples shortly of firms taking advantage of that service. I think that's a great example of... We're able to help customers and a lot of them might not even necessarily be in the US we can help people worldwide. They may be customers of Paxos but they could just be customers of our customers so that's really exciting with ST Coin's announcement. Huobi is the number two exchange in the world by most measures. There's a whole number of other exchanges that have the same type of challenges that HOPI and others have in terms of being able to have bank accounts, being able to effectively be able to service their customers. We can help provide that service so we can provide this trusted service as an infrastructural layer. It could be accessed by a consumer. It's more likely to be accessed by an institution that has a lot of consumers. But we also we build products on infrastructure, we encourage other people to do that too.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> What's your opinion on something like DAI? -- they take the decentralized ethos to like the final level of sorts. You don't have an intermediary custodying your ETH, you just lock up your ETH to generate a stable coin that lives on Ethereum?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> I think there's a certain logic to that. I always go back to how do you create the most amount of adoption? The fact is, there's five or six trillion of FX transactions a day. 80% of that, U.S. dollars on one side of it. How do you basically begin to penetrate not just the crypto market with blockchain cash but how do you penetrate remittances? How do you penetrate payments? How do you penetrate FX trading? Is that really going to happen through this DAI method? I think that's pretty unlikely. There's a lot of things that need to be battle-tested even for it to get beyond where it's at right now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Why do you think it's unlikely?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> You're still reliant upon the value of those underlying assets in order for the DAI to hold value. It's not being used right now as a medium of exchange. It's like arguably kind of, it's attempting to be used like that but it's not really that, it's basically a synthetic version of a dollar, effectively. But it's managed in a way that's problematic, there's still people who have to maintain the programming and other things so it's not truly decentralized. It's maybe not politically controlled so to speak by a government, that's a different thing. There's still a foundation and other groups that are involved with it, right? So it's not really... Getting you away from reliance on somebody, it's just getting away from reliance on fiat.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> There's a few directions I was thinking about going in. Obviously you brought up the elephant in the room or the elephant down at 60 Center Street or who was there yesterday? Our friends over in Hong Kong at Tether and Bitfinex. What do you make of that situation? Do you think about it frequently? I remember when you came online with $PAX and the same thing with with Gemini Dollar, there was a demand or at least a demand you saw in the market for a regulated stable coin? You guys have picked up market share, circle U.S. DC. I don't know by which means they're regulated or not but they've at least got some U.S. based players backing them.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> They're not actually regulated. They have money transmission licenses but no regulator approved it","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> No one gave him them the green light to move forward with the product itself. When I talked to traders in Asia a lot of them are quite happy with an unregulated stable coin platform. Who are the people who want a regulated stable coin And why do you think with all this stuff going on with Tether and Bitfinex that you guys haven't eaten up more of their market share?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> I think things take time. I've been in the financial market for a long time, we were talking about that and I've seen examples of new products getting launched and sometimes you can't get enough liquidity when new products get launched. Other times it can happen immediately. Most of the time if it's going to happen, it's slow slow slow and then all at once. It's kind of like everyone is standing on one side of a ship and everyone runs to the other side and it looks like it's stable when everyone's standing on one side...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So who are the few folks that have run over to the other side of the ship?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> They're institutions. They're institutions, I mean just a perfect example, with ST coin or Huobi -- this is a very large institution and player in the space. I think it's inevitable that we're gonna get more change that happens. I kind of talked about a little bit about what's the whole point of this? There's 15 trillion dollars of M2. Does anyone think Visa MasterCard is going to use Tether? Does anyone think that anyone in the institutional world is going to use Tether? Come on it's never gonna happen. This is the best it can ever be for them. This is not going to go anywhere aside from where it's at. We're looking at the big picture about how you can change the whole financial system, all what you have here is, I think a small or approach to solving a problem that existed but is never going to be able to get to the scale that we're trying to talk about here.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Don't tell that to Suzu. It's an interesting point. I'm going to plug my roommate's beer company because they actually accept Paxos. It's called Tap Room and they're based in Brooklyn and you can pay with with Paxos. Why do I benefit when I go to Tap Room and I pay with $PAX which seems complicated on the face of it as opposed to just hitting my iPhone against the Apple wallet reader? Are the fees lower? Why do I benefit?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> Well first of all I think you're you're absolutely right. $PAX is still complicated and this is what I was talking about before. It hasn't penetrated into the traditional payment rails. That's where it needs to go. That's where you need to make it so simple that you don't even know that it's not blockchain cash, like you have no idea. You have a wallet that's on your phone and it says hey you have a thousand dollars and you go spend it and you tap and it goes. That's where you have to get to. Now we're not there yet.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Fair enough. But when the the merchant\/customer relationship... When my $PAX goes from me to Tap Room, is that lower fees than the credit card networks interacting with each other? Wallet to wallet?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> It will absolutely be. Merchants will feel this more than the consumer because of the smart way in which the payment system works now -- which is that consumers don't feel any of the pain, it's all merchants. But essentially, you even go to Starbucks, this is a perfect example of what we're talking about before, which is settlement risk. I know it might not seem that way but it is. So you go to Starbucks and go hey give me a latte, they give you a latte, you tap your card on there. That card is just saying yes, Frank has open line on that card and you can give him that cup of coffee. We'll give you the money in a couple of days and then Starbucks gets it either the next day or maybe two days -- depends on what kind of deal they have. So the merchant has given you your asset, right? Which you then consume. They haven't received the money yet. They don't receive it for two days, so there is actually all the settlement risk even for retailers. In the world where you're moving $PAX and you went to the Tap Room and you don't pay with a credit card, you pay with $PAX -- they immediately get the dollars, it's sitting in the merchant's hands he can go buy something with it immediately. It's not some IOU he's going to get in a day or two and you can imagine that read across the entire economy, it would be fantastic fantastic. So I think that we have to get to a different place with the penetration of stable coins into traditional payments but I can tell you we're having a lot of these conversations. It will happen. I know people right now have a credit card loaded with $PAX and they can spend it. That's very early. It's still not that great admittedly but it's still happening. It might just be people at Paxos but that's not the point. That's not the point. The real issue is that it can happen and I think it will get there and we're having conversations that it will get there. And by the way it will happen in remittances, it will happen in FX trading. But is that where Tether is going to take the industry? Is that where it's going to take the financial system? No.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Maybe Libra, maybe Facebook's Libra.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> Yeah it might be. You know there's all kinds of articles about whether it'll happen or not happen, very ambitious but I think that's where we're trying to think about. How are we going to change the financial system?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> How do you convince people that Paxos is the right stable coin versus Gemini Dollar or CUSD, right? Because they're all basically the same thing at this point.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> Well that's the interesting thing about regulation. Every stable point isn't made equal, even though everyone is backed by a dollar -- if you can't redeem it in the same timeframes. Will someone give you instant redemptions? Will someone give you insight creations? Will someone charge you a redemption fee? A creation fee? Will they be able facilitate you over the weekend? You might have one dollar from somebody and they charge you redemption fee or they won't be able to turn it into cash over the weekend and then you have something that's not the same as someone else's. That creates fluctuation and utility curves that are different. Having regulation, we describe it as we have a bankruptcy proof stable coin. Nobody else does. USDC is not bankruptcy proof. They're money transmitting and they're not approved by any regulator. It doesn't mean that they're not trustworthy companies and et cetera but nonetheless it's not a regulated stable coin. They're not using a trust company to hold people's cash fully segregated from any operating activities. Not only are we doing that -- it's required and there's oversight that proves it. We have an independent board, all these other controls. Bankruptcy proof stable coin is something everyone should care about. The last thing you want to do is say oh I thought I had a thousand dollars to spend at the Tap Room, guess what? It's only $.50 now because it wasn't really backed. Or I could go make loans to my other company or I could go do this or go do that or you know what, we commingled funds because it's not a trust company, we just have money lying around. All that's possible. What kind of stable coin do you want to base your system on? If you're saying, how are we gonna change the financial system in a fundamental way? In a way that we can all trust and that we don't even have to think about -- you're not going to do that in the way we have it set up now in the crypto world. It's going to have to grow up and be something far more robust and powerful. That's what we're trying to build. And it's because I really, 1. know the financial system and believe we need to change it, that we built Paxos this way.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> This kind of goes back to my question at the beginning, you have the post trade solutions, you have custody, you have the OTC desk, you have the exchange if Paxos seems like the right bit now does it make sense to have all of your eggs in these different baskets without that unified vision or do you open yourself up to the risk of not of not having that focus?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> When we're talking about what is the unifying vision for what we do here, we're going to hold people's assets and aside from the case in crypto, we'll tokenize those assets and then we'll provide some services and products for you to be able to take advantage of the fact that they're tokenized either with us or other people. When we think about our exchange, we think, hey we're a custodian of your crypto assets, you want a safe place to trade it? We can be a safe place for you to trade it as our custody customers or offer you that service but if you want to go trade it somewhere else we're fine with that. If you want to hold your $PAX with us or you want to hold your tokenized gold with us, that's great. If you want to come and create your own cash based coin or your own gold coin or you want to go move it somewhere else, that's completely fine with us too. So in some cases as you think you pointed out here we've built products that showcase the fact that we're acting as a custodian and hold people's assets. Increasingly what Paxos is going to be about is we want to showcase how other people are using what Paxos has built from both a regulatory infrastructure and a technology infrastructure standpoint. But the space needed... You have to go through stages -- we created these products and then we go out and say hey you could use our infrastructure to do this too.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That's interesting. I think it'd be cool to go back to Facebook a little bit just to get your opinion on what they're doing. We've been asking a lot of guests recently whether or not they think it will even happen, let alone succeed as the way they've outlined it?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> It's very ambitious. I think that's clear.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> It's kind of funny how Coinbase was one of the members, Wilts being a member of the USCC consortium it's almost like...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> Maybe it all fits together. It's hard to speculate exactly where they were going but they didn't create their own stable coin, they have a shared stable coin, Libra is kind of like a shared stable coin so maybe it fits with this concept of being but I'm just purely speculating there. I do think that it's very ambitious what Libra is trying to do. I think it's still unclear exactly what features it's really going to have, what will be backing it, how exactly it'll work. It's really hard to speculate on whether the product itself will work. What is clear is Facebook which I think is great for the space, has endorsed the concept of using blockchain for two billion plus consumers. To me that's awesome. That's exactly what we're talking about here. Blockchain is going to change the financial system and guess what? Facebook is telling us that too and the smart people of Facebook like David Marcus and others who have been in at other transformative companies like PayPal. That's what they think, that's great. You don't have to believe me, you can believe Facebook and others. I think that's awesome. The next thing is trying to take this through the political process that they're caught up in is really hard to handicap. You just can't tell where things are going to go. It'd almost be like, we can mark this to market after the August recess and see if some crazy bill makes it out of Congress that could completely change regulation for not just Libra but for the whole crypto space. That's possible. That is really hard to handicap. There are all kinds of regulatory pressures and powers of persuasion that can be brought to bear on Facebook and Libra that we can't even necessarily see so it's really hard to handicap what the combination of that type of political pressure and still early stages of the product. What does that mean? I don't know.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Yeah and it could have broader policy and regulatory implications for the entire space. I mean I haven't gotten a chance to listen to it or read up on the Senate Banking Committee hearing that happened in Washington today but if it was anything like the Facebook one two weeks ago, it's troubling from my seat to see the level of, at least with the Senate, the congressional hearing was a little bit different but the level of misinformation about the differences between or rather the nuances between different blockchain based assets and networks. But even more fascinating to me...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> That's where I would really plug Coin Center and Jerry Brito he is doing an unbelievable job in my opinion being one of the founding members of Coin Center to go out there and really educate people. Thank God for them because I think they made a huge difference for all of us in the space.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Jeremy Allaire who is the CEO of Circle and which is the founding member of the USCC consortium. They've moved or at least are planning to move a lot of their operations over to Bermuda just for you know, they run a crypto asset exchange that trades innumerable assets that some of which it's not clear if they're securities or not and from their perspective they're always talking about the lack of regulatory clarity here in the United States. PAxos and Gemini and others have kind of touted that they've taken this regulatory first approach. But surely there are some aspects of things that you think might be worth changing or is there just this notion of the regulatory environment for crypto blockchain firms is so confusing and hard to manage. Is there any validity to that?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> I think there's a lot of validity to that. We were the first to go and get a trust company. We did this in May of 2015. We've been regulated for a long time. There's a lot of burdens on being a regulated institution. We have a lot of resources we're able to carry those burdens but it's very real cost and it's a cost in terms of a lot of... In many ways access protections that aren't necessarily needed but because you're trying to fit into an old regulatory regime they're required.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So what specifically? Like what is something that you guys are doing on the regulatory front which either from your perspective in traditional capital markets doesn't make sense or you wish would be fixed or improved?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> There's all kinds of different like policies and procedures that you have to write out and put into place that you're put into place as if you know what the product is going to be but this is not a mature product, some of these products never existed before. So you're creating a whole way of doing things and documenting things before you even launch it and you're writing up huge dossiers on what you're going to do and then literally they could be out of date five minutes after you launch and you've got to change them all over again. There would be what I would call the concept of having a sandbox that could be really helpful because you can't test products, see what's going to happen, understand what they're going to do and then invest in huge amounts of infrastructure in order to maintain it as if it's going to be successful -- so you have to build everything as if it's already going to succeed, so your cost to iterate is so high.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Most of the time when you build a product, the problem that lies ahead of it is whether or not people will want it, buy it, use it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> Things you didn't even expect and understand.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Now you have the upfront cost of...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> You have huge upfront costs.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So that's an interesting question and brings me back to when I was in the courtroom yesterday. The Bitfinex attorneys and the New York Attorney General and Judge Cohen were going over what is Tether, like what is a stable coin? The judge asked, well does it fluctuate in value? Does that make a security? All resting on this this case that Bitfinex has which is that the New York attorney general's overstepping its authority because it's not a commodity, it's not FX and it's not a security. What are Stable Coins? What would you define $PAX as? Is it a commodity? Is it FX?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> We'll be really clear, in the case of $PAX Gold or $PAX, they're not securities. And that's because all we've done is we've taken ownership of a specific asset and put it on a distributed database. What we've done is we've done a database upgrade of dollars, there are dollars that are sitting in an account now and you have the... It's almost like a check but it's a check that's put on distributed database that can move around and it's the same thing with gold, you have legal title to gold, it's put on a distributed database.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So it would just be whatever the ownership is. An ownership receipt.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> That's right now by the way if you're not fully backed by dollars you might be a security then. So we've been really clear and we've talked with the SEC and others on this. If you're not one to one backed, you might be a security because you can fluctuate in value a lot. You're not just representing one asset, you're representing a basket of assets -- that kind of starts to sound like a security, right? Especially if there's somebody managing it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Does the fact that Paxos moves in price even if you can redeem it one to one does that play into whether or not... Is that a question hanging over it?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> No. No. Because at the end of the day anyone can come redeem it for us for one. We're not changing the price. The market can change whatever it wants for the price of $PAX but it should be instantaneously arbitrage which it generally is. It might trade at a small premium or discount. To get to the question is that's why all stable coins aren't equal because some of them trade at significant premiums and discounts.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That's very interesting because it was the first time I even thought of the question of what asset class a stable coin would fall under? Do you think it'd make more sense for all of these... and I don't think it would based off what you said or I don't think you would agree that it would, based off what you said, for all these blockchain based assets and cryptocurrency to just fall under a new framework managed by a new regulator who can just oversee all of it?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> This [...] but I was one of the founding members of ADAM which is the Association for digital asset markets. The idea is that it sets up rules and conduct and that's something everyone agrees to and there's 10 founding members and others who have come out with a code of conduct we'll be releasing soon and we hope others will join and there are others that are joining as well. We have that framework in mind and this is really not meant to be a regulatory agency or even an SRO (a self-regulatory agency) but maybe over time it might. I think some assets are very clearly fitting into old regimes. If you issue equity but you put it on a blockchain, all you've done is put it on a different database that doesn't mean it's not equity anymore, right? Crypto to me is property -- you own a spot on a database. There are rules for property. It shouldn't be treated like a security and it shouldn't be treated like money. It's basically, it's a spot on a database that happens to be fundable but that doesn't mean that it needs to be a security at all. Gold, you put gold on a blockchain, nothing changes. You put cash on a blockchain, I'm not sure what changes, it's just cash -- you've now moved it. You start combining certain things together it could fall into a gray area or you own something that might not be a security but it could be an asset. That's where I think crypto has gone into the gray areas is do you have property or do you have a security? And that has has crossed over for like certain things like ICOs or certain types of tokens of certain databases. That's really tricky. I don't have a great answer for what that represents. But I think some things are... People are just looking at it through the wrong lens. There's no reason in some cases there to be all this regulation over: \"I've now put an asset on a different database so suddenly like this is something completely new fangled\" there's nothing new about that. But I think blockchain itself is confused because it's called blockchain. If you just said I put it on a distributed database, it's a distributed database. You can work off of that framework a lot easier and then it doesn't get quite as complicated and I think that oftentimes is lost because it's first principle's understanding is confused.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That's interesting. What time are we at?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> That's a fast hour I feel like we go for another 1-2 hours. We have to do that at 10AM if we're going to do that though I can do that.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> If it were at 10AM it would have been 32 minutes [laughs]. I think that's a fine place to end and Chad we appreciate you coming on The Scoop and hope to have you back soon once $PAX Gold is doing something. We'll see what happens.Steven, thanks for co-hosting. Inimitable, you are.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Charles Cascarilla<\/span><\/strong> It was great to be here with both of you and I'm looking forward coming back.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> Thanks"," 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thornton","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"ST Coin","content":"ORGANIZATION"},{"type":"Steven Zheng","content":"PERSON"},{"type":"Suzu","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"Charles Cascarilla<\/span><\/strong> Well","content":"PERSON"},{"type":"Gemini Dollar","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"Frank","content":"PERSON"},{"type":"CEO of Circle","content":"ORGANIZATION"},{"type":"Chaparro<\/span><\/strong> Jeremy Allaire","content":"PERSON"},{"type":"Charles Cascarilla","content":"PERSON"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"2025","content":"DATE"},{"type":"600 trillion dollars","content":"MONEY"},{"type":"Bitfinex","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"97%","content":"PERCENT"},{"type":"Bermuda","content":"LOCATION"},{"type":"Cohen","content":"PERSON"},{"type":"$.50","content":"MONEY"},{"type":"May of 2015","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Brooklyn","content":"LOCATION"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"Huobi","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"Senate","content":"ORGANIZATION"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Tap Room","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"Paxos","content":"PERSON"},{"type":"weekend","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Chad","content":"LOCATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"ADAM","content":"ORGANIZATION"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"USCC","content":"ORGANIZATION"},{"type":"Cascarilla","content":"PERSON"},{"type":"5","content":"DATE"},{"type":"FX","content":"ORGANIZATION"},{"type":"David Marcus","content":"PERSON"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"Lehman Brothers","content":"ORGANIZATION"},{"type":"Tap Room","content":"ORGANIZATION"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Libra","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"2006","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"today","content":"DATE"},{"type":"next day","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Jerry Brito","content":"PERSON"},{"type":"Bitcoin Ethereum","content":"ORGANIZATION"},{"type":"2007","content":"DATE"},{"type":"15 trillion dollars","content":"MONEY"},{"type":"2008","content":"DATE"},{"type":"Charles Cascarilla<\/span><\/strong> You","content":"PERSON"},{"type":"Bretton Woods","content":"PERSON"},{"type":"$PAX","content":"MONEY"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Chaparro<\/span><\/strong> Maybe Libra","content":"PERSON"},{"type":"Citi Bank","content":"ORGANIZATION"},{"type":"ST Coins","content":"ORGANIZATION"},{"type":"OTC","content":"ORGANIZATION"},{"type":"MasterCard","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"two weeks ago","content":"DATE"},{"type":"Deloitte","content":"ORGANIZATION"},{"type":"Steven Zheng<\/span><\/strong> Thanks","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","Steven Zheng","The Block"]}