{"summary":"Decentralized exchange Balancer warned its liquidity providers to withdraw funds from five pools where $6.3 million of funds are at risk.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199789\/balancer-warns-6-3-million-of-funds-at-risk-urges-lps-to-remove-liquidity","publishDate":"2023-01-06T09:36:55","id":8923,"type":null,"title":"Balancer warns $6.3 million of funds at risk, urges LPs to remove liquidity","category":["CRYPTO ECOSYSTEMS"],"content":["Decentralized exchange Balancer warned its liquidity providers to withdraw funds from five pools where $6.3 million of funds are at risk.","This appears to be part of a larger potential exploit or bug, which Balancer is trying to mitigate. Balancer said that it has used emergency controls to set protocol fees to zero for some of its other pools. This was done in order to protect against an issue that it will disclose in the future. It wasn't able to do so for these five pools, hence it is <a href=\"https:\/\/twitter.com\/Balancer\/status\/1611363559685898247\" data-v-f87c67ca=\"\">encouraging<\/a> liquidity providers to withdraw their funds as quickly as possible.","The five pools are on Ethereum, Polygon, Optimism and Fantom. The largest pool is <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">DOLA \/ bb-a-USD, which currently looks after $3.6 million of funds.<\/span>","Balancer is a DeFi protocol that allows users to trade tokens in pairs called pools. Liquidity providers supply these tokens to the pools and receive fees for doing so.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Balancer","content":"ORGANIZATION"},{"type":"Fantom","content":"PERSON"},{"type":"Polygon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"$3.6 million","content":"MONEY"},{"type":"$6.3 million","content":"MONEY"}],"hashtag":["DEXS"],"authors":["Tim Copeland","The Block"]}