{"summary":"The European Parliament reviewed the progress of the digital euro and identified challenges related to its use outside the euro area.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249020\/the-eus-digital-euro-could-face-challenges-in-non-euro-member-states","publishDate":"2023-09-04T14:08:19","id":8924,"type":null,"title":"The EU&#x27;s digital euro could face challenges in non-euro member states","category":["POLICY"],"content":["The EU's digital euro might come up against challenges in non-euro member states, according to a review by the European Parliament","The report from the Economic Governance and EMU Scrutiny Unit identified challenges related to the use of the CBDC in member states outside the euro area. Chief among them is that monetary acceptance of the digital euro across the entire bloc would need the ratification of international agreements between the EU and third-countries.","\"Any arrangement between the ECB and a non-euro area national central bank would have to be preceded by an international agreement between the European Union and the third country,\" the report stated.","After reviewing the report, European Blockchain Association Head of Policy Erwin Voloder told The Block, \"CBDCs are closed loop data cycles, and will need at minimum data sharing agreements between countries.\"","\"There are complicated legal questions related to usage, wallets and jurisdiction that to date do not have a working solution, this is the biggest future challenge,\" Voloder added.","The economist said there is generally the political will within the bloc to find an agreement on how a digital euro could work within the existing payment mix. However, he said this won’t come without operational challenges at the technical level and further clarification at the level of monetary law.","In July 2021, the ECB's Governing Council initiated the <a href=\"https:\/\/www.ecb.europa.eu\/paym\/digital_euro\/investigation\/governance\/shared\/files\/ecb.degov220929.en.pdf\" data-v-f87c67ca=\"\">investigation phase<\/a> of the digital euro project. The investigation phase was aimed to address key issues regarding design and distribution of the bloc's CBDC. It is set to conclude this October, at which point the ECB will decide whether to proceed to the next stage of development and testing.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"European Parliament","content":"ORGANIZATION"},{"type":"Governing Council","content":"ORGANIZATION"},{"type":"ECB","content":"ORGANIZATION"},{"type":"European Blockchain Association Head of Policy Erwin Voloder","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"EMU","content":"ORGANIZATION"},{"type":"July 2021","content":"DATE"},{"type":"October","content":"DATE"},{"type":"European Union","content":"ORGANIZATION"}],"hashtag":["ANTI-MONEY LAUNDERING","CBDCS","ECB","EUROPEAN COMMISSION","EUROPEAN COUNCIL","EUROPEAN PARLIAMENT","LAWSUITS"],"authors":["Brian McGleenon","The Block"]}