{"summary":"The Graph is rolling out its &quot;New Era&quot; of blockchain data services, including AI-assisted querying, aimed at boosting web3 development.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261980\/the-graph-new-blockchain-data-services-ai","publishDate":"2023-11-07T12:00:04","id":8925,"type":null,"title":"The Graph set to roll out new blockchain data services, including AI-assisted querying","category":["INFRASTRUCTURE"],"content":["The Graph, an indexing and query protocol for organizing blockchain data, is rolling out a new suite of resources, including advanced data streaming services, Large Language Models for AI-assisted querying, new query languages and verifiable data into its network.","The \"New Era\" was outlined in The Graph Foundation's research and development <a href=\"https:\/\/thegraph.com\/blog\/\" data-v-f87c67ca=\"\">roadmap<\/a>. It focuses on five key objectives, including expanding its data services, enhancing tooling and UX and delivering a more resilient, flexible and efficient protocol. New Era also aims to boost performance and reduce costs for node operators, and create tools for composable data and an organized knowledge graph, according to a statement.","Additionally, the roadmap presents a solution for accessing historical data on the Ethereum blockchain once <a href=\"https:\/\/eips.ethereum.org\/EIPS\/eip-4444\" data-v-f87c67ca=\"\">EIP-4444<\/a> is implemented, which will limit the availability of such data on the network itself.","\"The Graph introduced and standardized subgraphs as the quintessential way to index and query blockchain data all across web3. With the New Era of The Graph, we are making The Graph's position in the web3 stack even clearer,\" Tegan Kline, CEO of Edge &amp; Node, one of the development teams behind The Graph protocol, said in the statement. \"The Graph has been called the Google of web3 for its indexing capabilities. With the development of innovative and diverse data use cases, The Graph will surpass comparison to the legacy web, solidifying The Graph as the go-to protocol for all data needs now and in the future so that our data is no longer held hostage by one company or a group of companies.\"","Subgraphs are structured data models that allow developers to define and query specific data points from a blockchain efficiently.","In conjunction with New Era, The Graph is also implementing its \"Sunrise of Decentralized Data\" initiative, featuring cost-free migration to the network and access to a new free query plan. Additionally, the upcoming Graph Horizon network upgrade aims to make the protocol easier to use, cost-effective and permissionless.","In June, The Graph entered its final phase of <a href=\"https:\/\/www.theblock.co\/post\/234561\/the-graph-arbitrum\" data-v-f87c67ca=\"\">migrating<\/a> to the Ethereum Layer 2 Arbitrum network to \"reduce gas fees, accelerate transaction speeds and increase accessibility to the protocol.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Edge &amp; Node","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"The Graph Foundation","content":"ORGANIZATION"},{"type":"4444","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Tegan Kline","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Graph","content":"ORGANIZATION"}],"hashtag":["DATA PROVIDERS","DECENTRALIZED INFRASTRUCTURE"],"authors":["James Hunt","The Block"]}