{"summary":"More than two million downloads and over 15 million hours played for NFL Rivals is a welcome sign for web3 gaming.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247208\/crypto-nfl-game-scores-millions-of-downloads-full-gameplay-going-live","publishDate":"2023-08-24T09:27:37","id":8926,"type":null,"title":"Crypto NFL game scores millions of downloads, full gameplay going live","category":["GAMING"],"content":["Millions of mobile gamers downloaded blockchain unicorn Mythical Games' mobile title \"NFL Rivals\" during its four-month-long soft launch.","The company is now unlocking full gameplay with football season right around the corner.","Mythical Games, the web3 company led by CEO John Linden, said NFL Rivals was downloaded more than two million times and played over 15 million times. While that's not a huge number of games per player, the metric could change as the NFL season — by far the most popular sport in the U.S. — gets underway next month.","With the blockchain-based gaming industry striving to attract mainstream gamers, NFL Rivals stands as one of the sector's strongest contenders thanks to its ability to leverage the football league's popularity. The game boasts licensing deals with both the NFL and the NFL Players Association, or NFLPA.","During the soft launch of NFL Rivals, only a limited number of players and teams were available, meaning the variety of digital assets players could accumulate was also limited. With full gameplay going live, gamers will be able to collect, own and trade in-game assets, such as items based on actual NFL players.&nbsp;","Mythical also believes that the crypto game could go a long way toward introducing a wider audience to the concept of digital ownership because players will be able to buy and sell in-game assets without leaving the mobile app on both Apple and Android devices.","NFL Rivals incorporates \"web3 digital ownership with an in-game utility that allows fans to own, collect, and trade playable digital assets,\" the company said in a statement.","The company also said it has entered into a partnership with the Miami Dolphins that will enable advertising NFL Rivals during the team's home games.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFLPA","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Miami Dolphins","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"NFL Rivals","content":"ORGANIZATION"},{"type":"NFL","content":"ORGANIZATION"},{"type":"John Linden","content":"PERSON"},{"type":"NFL Players Association","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}