{"summary":"Speakers and attendees at two events in Miami on Thursday expressed optimism that there could be a silver lining to emerge from the madness.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188282\/miamis-crypto-crowd-sees-silver-lining-around-dark-ftx-clouds","publishDate":"2022-11-18T13:58:31","id":8929,"type":null,"title":"Miami’s crypto crowd sees silver lining around dark FTX clouds","category":["EXCHANGES"],"content":["Armies of developers, VC funders and CEOs descended upon Miami for two separate crypto conferences on Thursday as the shockwaves from FTX’s spectacular collapse continued to reverberate across the industry. While concern was palpable everywhere, speakers and attendees alike worked to find a silver lining in all the madness.","At the shiny new Solana Embassy in Miami’s Wynwood arts and entertainment district, amid bright neon lights, tropical plants, and displays paying homage to various NFT projects and DAOs, QuickNode co-founder Auston Bunsen assembled a crowd that included Blockchain.com CEO Peter Smith and Steven Goldfeder, the co-founder and CEO of layer 2 network Arbitrum developer Offchain Labs. Not surprisingly, FTX was on everybody's mind.&nbsp;","Blockchain.com’s Smith said he didn’t see any immediate winners in the aftermath of the collapse, but he tried to place the event in context, noting that it wasn’t the first exchange to fail.","“Having a big exchange blow up, that’s literally happened every down market we’ve ever been through, and usually it’s the number one exchange that blows up,” he said. “At the moment, your only job as a crypto CEO, running a larger company, is to make sure that you survive. It’s a survival of the fittest. We’re sort of all playing the Hunger Games of crypto right now.”","VC funders told developers that it was time to get back to basics and away from some of the excess that have characterized the past two years.","In a panel titled “Funding your web3 startup: What’s HOT, what’s NOT?\" investors Marell Evans of Exceptional Capital, Jared Franklin of Costanoa Ventures and Bruno Faviero of Magna all agreed that it’s going to be a lot harder to raise cash post-FTX, at least in the near future.","“The top teams will continue to get funded,” Costanoa’s Franklin said, adding that he saw opportunities in security, insurance, and even the now-maligned centralized finance sector as other companies step up to fill in the gap left by FTX. “But there’s no doubt that this will have an impact and a chilling effect for probably a couple of years… The quality deals will still continue to get done. They’ll even be competitive. But a lot that’s not just won’t. And I think it’s relatively healthy. What’s unhealthy and unfortunate is the sentiment and the slower adoption that will take place, and the scrutiny.”","He said that layoffs at larger companies could spark a wave of innovation, as it will be less risky for people to go and start a company than to join a downsizing tech company. Arbitrum’s Goldfeder said he was hiring.","FTX’s close links to Miami were not lost on anyone, and it’s an opened-ended question as to how much of an impact the rapid demise of the exchange could have on the momentum. Blockchain.com moved its U.S. headquarters to Miami last year in what was a pandemic-fueled, hot crypto summer that saw a flurry of activity as the city sought to position itself as a global leader in the sector.","“It doesn’t matter if you’re a city selling an arena sponsorship or you’re a banking partner or you’re a VC investor, the net result of the FTX episode is going to be an increased focus on corporate governance, access controls and due diligence, and I think that’s going to be a net positive for the whole space,” Smith said. “I don’t think that it’s going to impact Miami in a particular way that it doesn’t impact any other city or any place. The bar for diligence and the bar for making sure that crypto companies have good governance is going to come back in fashion.\"","While Smith said he didn’t believe that there was a single crypto city, he said he loved the energy in Miami. He noted that the majority of the company’s engineering team was in the European time zone and Singapore.","“There’s a certain optimism about Miami that’s very unique, where people have this bias toward believing that the best days of Miami are in its future, rather than in its past,” he said, noting that crypto is spread out, decentralized and lives on the internet. “But the passion for crypto is probably uniquely high here in Miami, and that’s a really cool thing to be a part of.\"","Across town at a separate conference hosted by TechCrunch, Devin Finzer, the CEO of NFT marketplace giant OpenSea, said he was thinking about education on the regulatory front.","“The challenge, and something we’re investing a ton in, is really ensuring that that message gets conveyed to government regulators and ensure that there’s not sort of one size fits all solutions applied to a technology that’s fundamentally very, very diverse in nature,” he said. “Treating NFTs as securities would be a blanket solution that doesn’t make sense.”","Pratima Arora, Chief Product Officer at Chainalysis, said it was “time to build” and still too early to know the full impact the collapse of FTX will have on the industry.","“It will take time to build back trust,” she said in an interview, stating that she didn’t think there is a fundamental issue with blockchain technology itself. “This could have happened in any industry, and in the past, we’ve seen it happen in a lot of industries. So it’s not new, but it pushes us to the next phase of maturity, and we need to hold ourselves to higher standards.”","Back at the Solana Embassy at QuickNode’s “#Nodevember” conference, there was some fear that regulators might misstep with a hasty, knee-jerk reaction, while other’s pondered which might be the next company to take a hit. Goose Wayne, a core contributor at the GooseFX super app on Solana, said he’s heard that many market makers have stopped activities on some centralized exchanges as they wait to see how the dust settles, who has the reserves and who doesn’t.","“I think instead of a prolonged pessimism, where everyone is waiting to see when the next big drop is going to be, FTX accelerated the fall of all the dominoes that were on their edge in this ecosystem,” Magna’s Faviero said in an interview. “Everything that was going to crash or come down is going to come down, and then it’s just going to be the dust settling and only optimism from there. Then it’s only building and going up because all the damage will have been done.”","The event was not without humor. Hidden in the back room at the Solana Embassy were t-shirts bearing a palm tree-adorned FTX Miami logo that those in the know eagerly collected. And in the final session, nervous laughter erupted with a closing question from an audience member: “If you launch a token, how do you avoid getting into trouble?”","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Devin Finzer","content":"PERSON"},{"type":"Miami","content":"LOCATION"},{"type":"Steven Goldfeder","content":"PERSON"},{"type":"Bruno Faviero","content":"PERSON"},{"type":"Pratima Arora","content":"PERSON"},{"type":"Solana Embassy","content":"ORGANIZATION"},{"type":"Smith","content":"PERSON"},{"type":"Franklin","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Magna","content":"ORGANIZATION"},{"type":"Offchain Labs","content":"ORGANIZATION"},{"type":"Jared Franklin","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Costanoa Ventures","content":"ORGANIZATION"},{"type":"Chainalysis","content":"LOCATION"},{"type":"Marell Evans of Exceptional Capital","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Magna’s Faviero","content":"ORGANIZATION"},{"type":"Auston Bunsen","content":"PERSON"},{"type":"Goldfeder","content":"PERSON"},{"type":"Peter Smith","content":"PERSON"},{"type":"Goose Wayne","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"Solana","content":"LOCATION"},{"type":"Wynwood","content":"LOCATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}