{"summary":"Looking to comply with the U.S. Treasury&#x27;s Office of Foreign Assets Control, WalletConnect has restricted use for people in Russia.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260284\/walletconnect-restricts-use-in-russia-citing-ofac-guidelines","publishDate":"2023-10-31T16:30:53","id":8935,"type":null,"title":"WalletConnect restricts use in Russia, citing OFAC guidelines","category":["INTERNATIONAL POLICYMAKING"],"content":["WalletConnect, a web3 startup that helps consumers connect integrated crypto wallets like MetaMask, announced that it has restricted access for customers in Russia.&nbsp;","The company took to X to make the announcement and explain its motivation. \"In light of the latest legal and OFAC guidance, WalletConnect has restricted the availability of the WalletConnect Protocol in Russia,\" WalletConnect <a href=\"https:\/\/twitter.com\/walletconnect\/status\/1719405809057120457?s=61&amp;t=RulDQX64C_MCg4i19stHnw\" data-v-f87c67ca=\"\">said<\/a> in its post. OFAC stands for the U.S. Treasury's Office of Foreign Assets Control.","WalletConnect CEO Pedro Gomes said in a statement that his company moved to restrict users in Russia on Monday. At least <a href=\"https:\/\/www.theblock.co\/linked\/118158\/us-treasury-sanctions-russia-based-crypto-otc-desk-for-laundering-over-160-million-in-bitcoin\" data-v-f87c67ca=\"\">as far back as 2021<\/a>, OFAC has targeted the flow of crypto in Russia. The Russia-Ukraine war has caused the number of western countries sanctioning Russia to rise.&nbsp;","In 2021, OFAC <a href=\"https:\/\/www.theblock.co\/linked\/120816\/us-treasury-publishes-new-sanctions-guidance-for-crypto-businesses\" data-v-f87c67ca=\"\">published<\/a> guidance that suggested it expected virtual currency operators to shoulder the same responsibility for avoiding sanctions violations as other financial institutions.","Gomes also sought to explain how Ukraine was temporarily impacted, while dispelling what he considered to be misinformation. \"As part of this, on a temporary basis, we also restricted Ukraine IP addresses until we could compliantly switch back on areas of Ukraine that are not impacted by sanctions,\" he said in a statement. \"There were some incorrect reports that we blocked other non-sanctioned countries. We can confirm that no other countries were blocked.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pedro Gomes","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"U.S. Treasury's Office of Foreign Assets Control","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}