{"summary":"Worldcoin, the eyeball-scanning crypto project co-created by OpenAI’s Sam Altman, today announced the launch of a self-custodial mobile app.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229742\/sam-altman-worldcoin-app-token","publishDate":"2023-05-08T09:00:13","id":8939,"type":null,"title":"Sam Altman’s Worldcoin rolls out app as token launch looms","category":["COMPANIES"],"content":["Worldcoin, the eyeball-scanning crypto project co-created by OpenAI’s Sam Altman, today announced the launch of a self-custodial mobile app.","The so-called World App gives users a way to manage their World ID, a tool for proving personhood online, alongside a range of cryptocurrencies — including BTC, ETH, DAI, USDC abd Worldcoin’s hotly anticipated token — once it launches.","Developed by Tools For Humanity, Worldcoin’s lead software contributor, the launch of the app comes a few months <a href=\"https:\/\/www.theblock.co\/post\/219541\/sam-altmans-worldcoin-unveils-world-id-protocol-and-sdk\" data-v-f87c67ca=\"\">after the unveiling of World ID<\/a>, the identity protocol that underpins the Worldcoin project. Momentum appears to be building towards the launch of Worldcoin’s token, which it has said previously will go live in the first half of this year. Users can claim their share of the coin by getting scanned by a Worldcoin orb.","Even in testing, the app has accrued 1.5 million users and logs 60,000 transactions on a typical day, the company said. Users can deposit and withdraw funds using bank accounts or local payment tools and can send money to phone contacts or crypto addresses.","“It’s already the fastest growing wallet in the world. Today every 14 seconds a person signs up to app,” said Tiago Sada, Head of Product, Engineering and Design at Tools For Humanity.","The World app, which had been in testing in a small number of locations, is now available for download in over 80 countries. It employs a minimalist design “with only the essential functionalities of the Worldcoin and Ethereum ecosystems,” according to the announcement.","TFH has also tried to simplify the product by offering “gas-free transactions,” which it can do by covering the gas fees. The company said the app is “engineered to maximize inclusivity.” It is available on iOS and Android, is around 18MB in size, is localized to multiple languages and can be supported by phones over 10 years old. &nbsp;","“Everything at Worldcoin is about inclusivity,” Sada said, adding there is “potential” to introduce fees in the form of a few basis points for each transaction down the line.","A who’s who of crypto firms, projects and tools power the app’s back end — including Uniswap for exchange tokens, ENS usernames that can be used to direct transfers, and Ramp and MoonPay for on and off-ramps. The beta version ran on Polygon, but the full version will be based on an Ethereum rollup, per the announcement.","“The other super interesting thing about the app is just thinking about what all of these financial and identity primitives together allow you to do,” Sada said.","Worldcoin is valued at $3 billion after reportedly raising $100 million from Khosla Ventures and a16z in March 2022. The Block revealed in February that the company is <a href=\"https:\/\/www.theblock.co\/post\/210014\/sam-altman-worldcoin-fundraise\" data-v-f87c67ca=\"\">seeking another round of funding<\/a> at the same valuation.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3 billion","content":"MONEY"},{"type":"Khosla Ventures","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Sam Altman","content":"PERSON"},{"type":"Tools For Humanity","content":"ORGANIZATION"},{"type":"Worldcoin","content":"LOCATION"},{"type":"March 2022","content":"DATE"},{"type":"Tiago Sada","content":"PERSON"},{"type":"Sada","content":"PERSON"},{"type":"the first half of this year","content":"DATE"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}