{"summary":"Last year’s Robinhood GameStop debacle kicked off calls for the modernization of stock market infrastructure to democratize investment opportunities for retail investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/132319\/the-time-for-digital-securities-is-now","publishDate":"2022-01-31T09:00:10","id":8940,"type":null,"title":"The Time for Digital Securities is Now","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Last year’s Robinhood GameStop debacle kicked off calls for the modernization of stock market infrastructure to democratize investment opportunities for retail investors.<\/span>","<span data-v-f87c67ca=\"\">We are seeing increased demand from a younger generation of investors for more individual autonomy and more control over their investment actions. For example, investors are demanding the ability to take their assets off exchange and move positions from one platform to another or to earn income when their assets are lent to someone else. They seek true transparency in markets that have grown too complacent with opaque corners. They request fractional ownership and the ability to trade assets 24 hours a day, 7 days a week, 365 days a year.<\/span>","<span data-v-f87c67ca=\"\">Digital securities, to all intents and purposes, have been expressly built with this new generation of Gen Z investors in mind. Prior to 2018, <\/span><a href=\"https:\/\/www.inx.co\/digital-securities?utm_source=theblock&amp;utm_medium=article&amp;utm_campaign=jan31\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">digital securities<\/span><\/a><span data-v-f87c67ca=\"\"> or “security tokens” offered all of the attributes that investors demanded with one huge limitation - they were largely limited to accredited investors and given this, there was limited volume, and only a handful of investments available.<\/span>","<a href=\"https:\/\/www.inx.co?utm_source=theblock&amp;utm_medium=article&amp;utm_campaign=jan31\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">INX<\/span><\/a><span data-v-f87c67ca=\"\"> (NEO:INXD) realized that one way to bring digital securities mainstream was to make them available to retail investors without the lock-up periods found in exempt offerings. To enable this significant leap forward, the company spent over 950 days working with the SEC and its advisors to craft a security that appealed to regulators, investors and issuers alike. This resulted in the first fully-registered security token IPO on the blockchain.<\/span>","<span data-v-f87c67ca=\"\">Declared effective in August 2020, the <\/span><a href=\"https:\/\/securities.inx.co\/hello\/?utm_source=theblock&amp;utm_medium=article&amp;utm_campaign=jan31#\/signup\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">INX Token<\/span><\/a><span data-v-f87c67ca=\"\"> serves as an example of how a digital security can be structured for retail investors. It required a full prospectus that detailed risk disclosures for a blockchain-based security and it served to provide investors more fulsome transparency into the vision and business plan of the company.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The INX Token and its prospectus now serve as a roadmap for assets to move into the digital future. <\/span><span data-v-f87c67ca=\"\">In the digital world so many more possibilities are under your control.<\/span>","<span data-v-f87c67ca=\"\">What this potentially means is a world where 24\/7 trading becomes normal and fractional ownership is encouraged. If your platform or exchange bans you from buying or selling, simply remove your digital security and trade it elsewhere, even peer to peer. If a company drops exciting news on a Friday afternoon, investors would not have to wait through the weekend to start investing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Given digital securities seek to provide solutions to overcome legacy capital market limitations, it is inevitable for mass adoption… first a trickle, then a river, then a tsunami. Change is coming and it’s coming fast, but don’t take our word for it. Rather listen to what the former SEC Chair Jay Clayton <\/span><a href=\"https:\/\/www.ledgerinsights.com\/transcript-sec-occ-panel-discussion-on-digital-asset-regulation\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> when discussing equities as he walked out the door: “...It could very well be the case that those all become tokenized...”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"INX Token","content":"ORGANIZATION"},{"type":"Jay Clayton","content":"PERSON"},{"type":"Robinhood GameStop","content":"ORGANIZATION"},{"type":"August 2020","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"weekend","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"afternoon","content":"TIME"}],"hashtag":[],"authors":["Sponsored","The Block"]}