{"summary":"Crypto Caselaw Minute:  Tucker v. Chase Bank USA, N.A., 2019 U.S. Dist. LEXIS 128834 (S.D.N.Y Aug. 1, 2019). Disclaimer: Crypto Caselaw Minute is provided","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/35267\/court-says-crypto-cash-advance-suit-against-chase-can-go-forward","publishDate":"2019-08-08T18:30:37","id":8945,"type":null,"title":"Court says crypto cash advance suit against Chase can go forward","category":["LEGAL"],"content":["Plaintiffs alleged they used their credit cards to buy crypto in 2016 and 2017 from Coinbase","Transactions were first listed as normal transactions but changed to higher fee cash advances in 2018","Chase moved to dismiss lawsuit and court denies in part, says 2 of 4 claims can move forward","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Crypto Caselaw Minute: &nbsp;Tucker v. Chase Bank USA, N.A., 2019 U.S. Dist. LEXIS 128834 (S.D.N.Y Aug. 1, 2019). [STM]<\/strong>","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Disclaimer: Crypto Caselaw Minute is provided for educational purposes only by Nelson Rosario and Stephen Palley. These summaries are not legal advice. They are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes. &nbsp;<\/em><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">As always, Rosario summaries are “NMR” and Palley summaries are “SDP”. &nbsp;This week's guest post by Steve Middlebrook is marked \"STM\".<\/em>","When the price of bitcoin skyrocketed in late 2017, lots of people began to buy it on their credit cards. When the price plummeted in early 2018, credit card issuing banks got nervous about whether their card holders would default on their accounts. Out of caution, some banks blocked crypto purchases altogether. Others started treating crypto purchases as cash advances, which are subject to additional fees and higher interest rates. Cardholders didn’t like that, and the change in treatment led to class-action lawsuits being filed against Bank of America, Chase and State Farm Bank. While a fight over whether you can buy bitcoin with your credit card is fairly tangential to the core legal issues facing cryptocurrencies today, these cases are still important to follow because they require courts to define crypto and struggle with how to deal with this stuff in the context of standard financial agreements. Case in point is last week’s decision in the Chase litigation.","In this case, Plaintiffs alleged they used their credit cards to buy crypto in 2016 and 2017 from Coinbase and the transactions appeared as normal purchases on their statements. Starting in January 2018, however, the transactions were classified as cash advances, and cardholders were charged additional fees and higher interest rates. Plaintiffs sued the bank, alleging it had breached the cardholder agreement and violated various provisions of the Truth in Lending Act (TILA) governing credit cards.","Chase filed a motion to dismiss and last week the court dismissed two of the four claims against Chase and decided the other two could go forward. Because this case is at the motion to dismiss stage, the court wasn’t evaluating the facts of the case; it was merely determining whether, assuming everything Plaintiffs said is true, there was a valid cause of action on which to proceed.","Plaintiffs asserted that by categorizing the crypto purchases as cash advances, Chase breached the cardholder agreement. That document explains that cash advances are subject to special rules and defines the term this way:","\"The following transactions will be treated as cash advances: purchasing travelers checks, foreign currency, money orders, wire transfers or similar cash-like transactions.\"","Plaintiffs argued that the term “cash” refers to physical currency and thus “cash-like” only refers to goods that represent a legal claim to fiat currency. Chase countered that crypto transactions were “cash-like” because, like traveler’s checks, money orders, foreign currency and wire transfers, crypto may be used as a form of payment. In order to survive a motion to dismiss, Plaintiffs have to put forward a reasonable interpretation of the contract and because the court found their view of “cash-like” was plausible, it allowed the breach of contract claim to go forward. The court did not conclude that Chase’s interpretation was not reasonable or was less reasonable; merely that Plaintiff’s argument was reasonable. The court even noted that Chase cited a number of external documents to support its assertion that crypto is effectively cash, but the court did not consider them at this stage.","The rest of the opinion isn’t nearly as interesting. Given the ambiguity in the terms described above, the court allows a claim under TILA that terms and conditions are not clear and conspicuous. The issues there will likely overlap with the breach claims and turn on whether it is reasonable to read “cash-like” as encompassing crypto. In addition, the court rejected ideas that the bank changed the terms without notice and that the monthly statements were inaccurate.","This case is worth following because in the next round, the court won’t just assume the Plaintiff’s pleadings are true, it will review the evidence not considered in deciding this motion and determine whether crypto is in fact “cash-like.” That will be an interesting exercise given that the court summarizes Plaintiff’s description of cryptocurrency as “units of computer code, created by private computer programmers, that may be used as forms of currency by some private individuals.” This bizarre definition is apparently an attempt to make crypto purchases look like buying a video game or a copy of Excel. It seems like a dangerous gambit given the repercussions if this definition were to become binding precedent. Let’s hope that in future proceedings the court rejects this notion of crypto transactions as exchanging units of computer code.","&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tucker v. Chase Bank USA","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"Steve Middlebrook","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"Aug. 1, 2019","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Bank of America","content":"ORGANIZATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Chase","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"U.S. Dist","content":"ORGANIZATION"},{"type":"Chase and State Farm Bank","content":"ORGANIZATION"},{"type":"January 2018","content":"DATE"},{"type":"SDP","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"N.A.","content":"LOCATION"},{"type":"Palley","content":"PERSON"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"}],"hashtag":["COINBASE"],"authors":["Steve Middlebrook","The Block"]}