{"summary":"The Swiss non-profit Aragon Association will dissolve itself and offer ANT redemption liquidity through its 86,343 ETH treasury. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261179\/aragon-association-to-dissolve-itself-provide-liquidity-for-ant-redemption","publishDate":"2023-11-02T14:17:53","id":8946,"type":null,"title":"Aragon Association to dissolve itself, provide liquidity for ANT redemption","category":["CRYPTO ECOSYSTEMS"],"content":["The Swiss non-profit Aragon Association will dissolve itself and let users redeem its native token ANT for ETH.&nbsp;","The Aragon Association will liquidate its 86,343 ETH ($155 million) treasury so that users can redeem each ANT token for 0.0025376 ETH, the project wrote in a Thursday <a href=\"https:\/\/blog.aragon.org\/a-new-chapter-for-the-aragon-project\/\" data-v-f87c67ca=\"\">statement<\/a>. Users will have until Nov. 2, 2024 to swap their tokens. After redemption, all ANT tokens will be burned, as \"from this moment forward, there is no purpose in continuing to hold ANT.\"","\"The AA arrived at the best redemption rate it could achieve for all ANT holders by identifying the most compliant and tax efficient path forward allowing for the continuation and protection of the project. This decision could not be put to a public vote due to legal constraints, specifically regulatory risks triggered by token speculation and market manipulation,\" the Aragon Association wrote.&nbsp;","The Aragon Association will keep $11 million in funds to cover outstanding costs required for its dissolution and to hedge against regulatory uncertainty. Should unused funds exist after the dissolution, they will fund the \"new product-focused structure.\"&nbsp;","Aragon <a href=\"https:\/\/www.theblock.co\/post\/172815\/aragon-community-voting-to-transfer-treasury-funds-after-dissolving-old-dao\" data-v-f87c67ca=\"\">DAO<\/a> members considered legal <a href=\"https:\/\/docs.google.com\/presentation\/d\/1tIEch0hRenBkPbBQLQEwaxhL0JelAfHkNwYL579Q9CE\/edit#slide=id.g222f2c0afe7_1_1\" data-v-f87c67ca=\"\">action<\/a> against the Aragon Association regarding disagreements with the ETH treasury and the non-profit's transparency. The Aragon Association had promised to put the treasury under a voting DAO by <a href=\"https:\/\/blog.aragon.org\/the-future-of-aragon-treasury-slated-to-move-into-the-hands-of-ant-token-holders\/\" data-v-f87c67ca=\"\">November 2022<\/a> but failed to do so.&nbsp;","Aragon Association is the legal steward of the Aragon project, a platform aiding the development and management of decentralized autonomous organizations.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Swiss non-profit Aragon Association","content":"ORGANIZATION"},{"type":"$11 million","content":"MONEY"},{"type":"Aragon Association","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$155 million","content":"MONEY"},{"type":"Nov. 2, 2024","content":"DATE"},{"type":"November 2022","content":"DATE"},{"type":"Aragon <a href=\"https:\/\/www.theblock.co\/post\/172815\/aragon-community-voting-to-transfer-treasury-funds-after-dissolving-old-dao\" data-v-f87c67ca=\"\">DAO","content":"ORGANIZATION"}],"hashtag":["DAOS"],"authors":["MK Manoylov","The Block"]}