{"summary":"Fed Chair Powell told reporters that a digital currency isn&#x27;t currently being worked on in a &#x27;secret lab.&#x27;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283793\/fed-chair-powell-no-secret-lab-brewing-a-digital-dollar-surprise","publishDate":"2024-03-20T17:05:29","id":8948,"type":null,"title":"Fed Chair Powell: No ’secret lab’ brewing a digital dollar surprise","category":["CENTRAL BANKS"],"content":["On the heels of announcing that his committee planned to keep interest rates where they are for the time being, Federal Reserve Chair Jerome Powell told reporters that a central bank digital currency (CBDC) isn't currently being worked on in secret by the bank.&nbsp;","\"It's wrong to say that we're working on a CBDC and that we've secretly got a lab here, where we've got one, and we're just gonna spring it on Congress at the right moment. We don't,\" Powell said during a televised press conference on Wednesday. \"I haven't at all, in my own mind, made a decision that I think this is something the U.S. should be doing.\"","Powell's comments echoed similar statements he's recently made to government officials. Earlier this month, <a href=\"https:\/\/www.theblock.co\/post\/281204\/no-need-to-worry-about-a-cbdc-anytime-soon-fed-chair-jerome-powell-tells-lawmakers\" data-v-f87c67ca=\"\">Powell told<\/a> the Senate Banking Committee <span class=\"s4\" data-v-f87c67ca=\"\">the central bank was “nowhere near” making a recommendation or adopting a central bank digital currency.<\/span>","However, the Fed Chair was clear that he has people examining subjects related to a central bank digital currency and digital payments.&nbsp;","\"What we are doing, and I think what every major central bank is doing, we're trying to stay in the frontiers of what's going on in digital finance,\" Powell also said. \"These issues have become very front burner in the last five or six years.\"","The big news on Friday, as it related to the Fed, was that the <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/pressreleases\/monetary20231101a.htm\" data-v-f87c67ca=\"\" data-v-03de5780=\"\">Federal Open Market Committee<\/a> held the benchmark federal funds rate in the current range of between 5.25% and 5.50%. The move marked the first rate pause of 2024.","&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"5.50%","content":"PERCENT"},{"type":"2024","content":"DATE"},{"type":"Federal Open Market Committee","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Powell","content":"PERSON"},{"type":"5.25%","content":"PERCENT"},{"type":"Jerome Powell","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"spring","content":"DATE"},{"type":"Friday","content":"DATE"}],"hashtag":["CBDCS"],"authors":["RT Watson","The Block"]}