{"summary":"Game studio Darewise Entertainment, a subsidiary of Animoca Brands, is on the hunt for a head of degen relationships as projects shore up their community building abilities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206111\/animoca-brands-subsidiary-darewise-looks-to-hire-head-of-degen-relationships","publishDate":"2023-01-27T07:38:59","id":8952,"type":null,"title":"Animoca Brands subsidiary Darewise looks to hire &#x27;head of degen relationships&#x27;","category":["GAMING"],"content":["Game studio Darewise Entertainment, a subsidiary of Animoca Brands, is on the hunt for a head of degen relationships.","The company <a href=\"https:\/\/www.welcometothejungle.com\/en\/companies\/darewise-entertainment\/jobs\/head-of-degen-relationships?q=6d737f34f2f04cdf45cf1ee2e92d680a&amp;o=1531404\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">posted<\/a> the job ad earlier this week to join the team as it develops its play-and-earn sci-fi civilisation-building game, Life Beyond.","The head of degen relationships is expected to act as an ambassador for the game in the crypto space, connecting with key opinion leaders, communities and events, the job advert says.&nbsp;","A degen is a slang term short for 'degenerate,' typically understood as someone who buys into an asset not because they see value, rather with the belief that others will join in after them and speculate on the price swings, according to <a href=\"https:\/\/www.coingecko.com\/en\/glossary\/degen\" data-v-f87c67ca=\"\">CoinGecko<\/a>.&nbsp;","The move is in line with the growing trend of community-building and project promotion in the web3 space, which has led to the creation of new roles in community engagement and influencer marketing.","During the market downturn last year, some NFT projects such as Fractional, a startup which specializes in buying and selling fractionalized NFTs, even put out ads for 'vibe managers' who could help spread positivity and keep up the hype around their projects.","These roles often go to those who already have a following in the crypto space. Being active in communities can also lead to job opportunities. For example, last year Danny Greene, the general manager for the MeebitsDAO, took a position as <a href=\"https:\/\/www.theblock.co\/post\/162020\/meebitsdao-general-manager-to-join-yuga-labs-as-meebits-brand-lead\" data-v-f87c67ca=\"\">Meebits brand lead<\/a> at Yuga Labs.","But working with influencers to push projects and attract more retail investors has its critics, especially when a project doesn’t even have a full product yet. Retail investors have been burned investing in NFTs and tokens linked to over-hyped projects that failed to deliver.","“A lot of these projects plainly require a constant inflow of new suckers to prop up the prices of these tokens or NFTs or whatever the project is centered around,” software engineer Molly White, who runs crypto critic site Web3 is Going Great, told <a href=\"https:\/\/www.theguardian.com\/technology\/2022\/jul\/08\/nft-vibes-managers\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">The Guardian<\/a> in July last year.","She described such attempts at fostering community as an “insidious weaponization of the idea of community.”","The role isn’t the only-community focused job Darewise is currently hiring for. It’s also looking for a head of community that will work on developing and implementing community-building strategies and build relationships with key community members and influencers.","The Ethereum Foundation, Binance, Polygon are also among those looking to fill community-focused roles, according to crypto job board Degen Crypto Jobs.&nbsp;","Darewise did not respond to a request for comment.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"Life Beyond","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Degen Crypto Jobs","content":"ORGANIZATION"},{"type":"July last year","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Danny Greene","content":"PERSON"},{"type":"Molly White","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"Darewise Entertainment","content":"ORGANIZATION"}],"hashtag":["ANIMOCA BRANDS","HIRING"],"authors":["Callan Quinn","The Block"]}