{"summary":"Solana developers are working on solutions, including software patches and updates to combat network congestion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286868\/solana-network-congestion","publishDate":"2024-04-08T02:09:49","id":8957,"type":null,"title":"Solana developers rally to combat network congestion","category":["CRYPTO ECOSYSTEMS"],"content":["In recent days, the Solana network has grappled with congestion issues, leading to noticeable delays in transaction processing and a large number of transactions being dropped.","Users of the popular Phantom wallet app on Solana and other apps have notified users of congestion, advising them to expect longer wait times for their transactions to complete.","The congestion affecting the network is largely due to an influx of spam transactions, with bots attempting to prioritize their activities over those of regular users. This issue is exacerbated by a dramatic increase in transactions associated with newly released memecoins, creating an extraordinary demand for the network’s block space and resulting in impeded access for many users.","In the first quarter of 2024, the Solana blockchain experienced a significant uptick in memecoin activity, and the number of new tokens appearing on Solana DEXs <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/dex-non-custodial\/new-tokens-appearing-on-dexs\" data-v-f87c67ca=\"\">reached<\/a> a record high during this time period.","This increase in activity, large driven around meme coins, underscores the rising interest in Solana among new and retail users, attracted by the network’s affordable transaction fees. However, the influx of spam transactions has emerged as a bottleneck for the network.","Matt Sorg, a tech and product leader at the Solana Foundation, <a href=\"https:\/\/twitter.com\/tamgros\/status\/1776396573393527253\" data-v-f87c67ca=\"\">drew<\/a> a comparison between Solana’s architecture and the internet’s infrastructure. In Solana’s setup, individual validators process transactions without the use of a mempool, similar to how IP endpoints and servers operate on the internet.","Sorg explained that the network dispatches transactions directly to block leaders, bypassing any staging model or mempool where transactions might wait before being added to the chain. He suggested that an overload of spam transactions could overwhelm this system, potentially resulting in many transactions being dropped.","“There’s an issue with this process on Solana, resulting in a user not having a reliable way to get transactions included into blocks. The systems in place for fees and stake-weighted transactions aren’t being reached,” Sorg <a href=\"https:\/\/twitter.com\/tamgros\/status\/1776396573393527253\" data-v-f87c67ca=\"\">wrote<\/a> in an X post.","In response to these challenges, the Solana development team is devising effective solutions, and software patches are already being worked on but will take some time, <a href=\"https:\/\/twitter.com\/aeyakovenko\/status\/1776068458742223143\" data-v-f87c67ca=\"\">according to<\/a> co-founder Anatoly Yakovenko.","“The Solana network is, once again, being battle tested with a huge influx of traffic. Bug fixes are rolling out over the next week, and things will start to improve,” Austin Federa, strategy lead at Solana Foundation, further <a href=\"https:\/\/twitter.com\/austin_federa\/status\/1776225546176729526?s=61&amp;t=ZKA-r0zpf4G_4nZU0fcNOg\" data-v-f87c67ca=\"\">noted<\/a>.","This current congestion may extend into the network’s infrastructure, thereby impacting users’ ability to interact with the blockchain. In this regard, Anza, the developer of one of Solana’s Agave validator client, <a href=\"https:\/\/twitter.com\/anza_xyz\/status\/1776347491195388156\" data-v-f87c67ca=\"\">will introduce<\/a> fixes addressing specific issues related to its QUIC implementation. These updates are expected to enhance the client’s performance, particularly in scenarios involving high request volumes.","Another important step forward is the planned release of the 1.18 update targeted for April. This update will introduce enhancements to make transaction scheduling more deterministic, aiming to streamline the processing and reduce bottlenecks.","Then there’s the matter of implementing priority fees. Numerous applications operating on Solana currently do not utilize priority fees, leading to transactions that are either delayed or not processed. Integrating dynamic priority fees into dApps will help address user experience issues, a March <a href=\"https:\/\/solana.com\/news\/block-optimization-on-the-solana-network\" data-v-f87c67ca=\"\">blog post<\/a> from Solana Labs stated.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"first quarter of 2024","content":"DATE"},{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Solana Labs","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Austin Federa","content":"ORGANIZATION"},{"type":"Matt Sorg","content":"PERSON"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"Anza","content":"LOCATION"},{"type":"Solana","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Solana","content":"LOCATION"}],"hashtag":["DEVELOPER TOOLS","PROTOCOLS","SMART CONTRACTS","SOLANA"],"authors":["Vishal Chawla","The Block"]}