{"summary":"Ethereum’s long-awaited Merge is set to arrive next month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166380\/four-numbers-to-know-going-into-ethereums-merge","publishDate":"2022-08-29T18:56:48","id":8959,"type":null,"title":"Five numbers to know going into Ethereum’s Merge","category":["ETHEREUM"],"content":["Ethereum’s long-awaited Merge is expected to arrive next month, and would-be blockchain watchers may want to pay attention to some notable metrics.","The Merge — the final stage in Ethereum’s transition from proof-of-work to proof-of-stake — will see the so-called Beacon Chain and its fleet of validators become the underpinnings of the blockchain network.","This event follows a long phase of planning, iteration, trial-and-error and public discourse.","Here are some of the key numbers to keep in mind ahead of The Merge.","This figure refers to the number of validators in place as of August 28. The data comes from <a href=\"https:\/\/beaconcha.in\/charts\/validators\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">beaconcha.in<\/a>, which provides a number of data points about the network.","Validators are essentially the miners of the proof-of-stake blockchain. In order to participate in the network, they must stake 32 ETH. Validators function in part to create the next block of transactions, thereby extending the chain as new transactions are added to the network. They also store information about the network.","That’s the amount of ETH deposited to date in Ethereum’s staking contract. The contract was <a href=\"https:\/\/www.theblock.co\/linked\/83545\/with-release-of-deposit-address-ethereum-2-0s-phase-0-launch-date-is-in-sight\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">first launched<\/a> in November 2020 and kicked off the initial phase of Ethereum’s proof-of-stake transition.","The above figure comes from a Dune Analytics dashboard maintained by Dune co-founder Fredrik Haga.","To date, there are almost 80,000 unique depositors who have contributed funds to the staking contract and, thus have set aside the necessary funds to become a validator.","According to the data collected by Haga, the biggest depositor has deposited 288,160 ETH to the address.","Yes, that <a href=\"https:\/\/blog.ethereum.org\/2022\/08\/24\/mainnet-merge-announcement\" data-v-f87c67ca=\"\">eye-popping number<\/a> has a significant meaning for Ethereum's Merge.","It refers to a value known as Terminal Total Difficulty, which is the trigger point at which Ethereum will actually shift from proof-of-work to proof-of-stake.&nbsp;","Ethereum co-founder Vitalik Buterin tweeted earlier this month about the number's setting, stating that \"[t]his means the ethereum [proof-of-work] network now has a (roughly) fixed number of hashes left to mine.\"","This last number is only indirectly related to the Ethereum network itself but speaks to the attention being paid as of late to the upcoming upgrade.","61 was the most recent Google Trends score for “ethereum merge” in the United States, having reached 100 for August 11, as shown in the chart below.","","","Looking at the worldwide data, “ethereum merge” similarly peaked on August 11, having scored a 65 on August 25.","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dune","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Beacon Chain","content":"ORGANIZATION"},{"type":"August 11","content":"DATE"},{"type":"August 25","content":"DATE"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"August 28","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Terminal Total Difficulty","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Haga","content":"ORGANIZATION"},{"type":"Fredrik Haga","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"November 2020","content":"DATE"},{"type":"Google Trends","content":"ORGANIZATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}