{"summary":"Pantera Capital did not experience significant losses due to TerraUSD’s crash last week.\nThe crypto VC firm says it cashed out nearly 80% of its investment well before the collapse, in fact making a massive profit along the way.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147668\/terra-pantera-capital-cashed-out-80-investment-before-ust-crash","publishDate":"2022-05-18T14:06:55","id":896,"type":null,"title":"Pantera Capital cashed out 80% of its Terra investment before UST crash","category":["Investments"],"content":["Pantera Capital, one of the high-profile backers of Terraform Labs, cashed out nearly 80% of its Terra (LUNA) investment well before TerraUSD (UST) collapsed last week.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"The market has been fairly frothy over the last year and thus we'd exited the majority of our position before any of this happened,\" Joey Krug, co-chief investment officer at Pantera Capital, told The Block. \"Roughly 80% over the last year, fairly gradually over time.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPantera Capital first invested in Terraform Labs in January 2021, backing a <a class=\"editor-rtfLink\" href=\"https:\/\/www.coindesk.com\/business\/2021\/01\/26\/galaxy-coinbase-bet-25m-on-defi-using-terra-stablecoins\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">$25 million round<\/span><\/a>, according to a CoinDesk report, and then committed to participating in its <a class=\"editor-rtfLink\" href=\"https:\/\/finance.yahoo.com\/news\/terraform-labs-assembles-star-roster-160000476.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">$150 million ecosystem fund round<\/span><\/a> in July 2021, according to a statement from Terraform Labs at the time. Following the publication of this article, Krug said that Pantera never invested in a venture or ecosystem round of Terraform Labs but bought LUNA tokens from the market in the summer of 2020 after its market debut. He said that Terraform Labs mistakenly included Pantera's LUNA investment in its venture round.","\"We managed that [LUNA] position down over time as it became increasingly profitable\/large, in order to maintain a diversified portfolio,\" he <a href=\"https:\/\/twitter.com\/joeykrug\/status\/1527010613414834178?s=20&amp;t=7hIVcZO3JjSoNvC4DIq5ag\" data-v-f87c67ca=\"\">said<\/a>. \"We initially invested in LUNA because of the progress we saw in developer adoption, the payments usage, and the broader ecosystem being built on Terra.\"","Since Pantera exited most of its investment early on, it generated a significant profit, per the firm. The firm turned $1.7 million into around $170 million, Paul Veradittakit, partner at Pantera Capital, told The Block.","Meanwhile, other venture capital firms that backed Terraform are reeling under losses since Terra's native LUNA token has lost almost its entire value due to the UST crash.","The UST algorithmic stablecoin de-pegged sharply last week to levels below 10 cents, far from its target price of $1. It is still trading at that level. Meanwhile, LUNA is currently trading at a fraction of a cent, from over $80 earlier this month.","When Pantera noticed UST's de-pegging last week, it sold more of its LUNA holdings from the remaining 20% investment.","\"We got out of 2\/3 of that at an average price of $25.6,\" said Krug. \"The remainder of that was staked via LUNAX and so unable to be sold.\" <a href=\"https:\/\/blog.staderlabs.com\/introducing-lunax-b6ef85b04eaa\" data-v-f87c67ca=\"\">LunaX<\/a> is a liquid staking token by Stader Labs.","Veradittakit had promoted investing in Terra-based decentralized finance platform Anchor, which has also lost almost all of its customer funds due to the UST collapse.","Anchor's total value locked (TVL) has tanked from over $16 billion before the UST crash to now just over $150 million, according to data from <a href=\"https:\/\/defillama.com\/protocol\/anchor\" data-v-f87c67ca=\"\">DeFi Llama<\/a>.","Veradittakit had called Anchor a high \"fixed\" interest rate \"savings account.\"","\"20% APY [annual percentage yield]. A fixed-income, low-risk financial instrument with returns as high as Anchor's is truly incredible,\" Veradittakit had <a href=\"https:\/\/www.veradiverdict.com\/p\/20-apy-savings-account?s=r\" data-v-f87c67ca=\"\">said<\/a> in a Medium blog post in April 2021.","Anchor offered UST depositors a 20% APY. Due to the UST crisis, Anchor contributors recently <a href=\"https:\/\/www.theblockcrypto.com\/linked\/146509\/anchor-contributors-consider-cutting-ust-yield-to-4-from-19-5\" data-v-f87c67ca=\"\">proposed cutting<\/a> the APY to an average of 4% in an effort to make its yield reserves more sustainable.","The UST failure has had a domino effect on the Terra ecosystem. Meanwhile, Terraform hopes to amend the situation. Terraform Labs CEO Do Kwon has promoted a plan to fork Terra to create a new blockchain.","The <a href=\"https:\/\/station.terra.money\/proposal\/1623\" data-v-f87c67ca=\"\">fork proposal<\/a> went live at about 7:30 a.m. ET on Wednesday. At the time of writing, it had over 84 million LUNA voting in favor, with over 9 million against. The vote needs 188 million LUNA in favor to pass.","<em data-v-f87c67ca=\"\">Updated for clarity on the timing of Pantera's LUNA investments.&nbsp;<\/em>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":[]}