{"summary":"BitDAO, a prominent decentralized autonomous organization known for its sizable treasury, announced a merger with Mantle Network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231557\/ethereum-layer-2-mantle-network-merges-with-backer-bitdao","publishDate":"2023-05-19T07:52:32","id":8960,"type":null,"title":"Ethereum Layer 2 Mantle Network merges with backer BitDAO","category":["CRYPTO ECOSYSTEMS"],"content":["BitDAO, a prominent decentralized autonomous organization known for its sizable treasury, announced a merger with <a href=\"https:\/\/www.theblock.co\/post\/190926\/bitdao-launches-modular-ethereum-layer-2-network-mantle\" data-v-f87c67ca=\"\">Mantle Network,<\/a> an Ethereum Layer 2 solution to which it formerly provided funding. This consolidation was done following the approval of a governance proposal from BitDAO community members, titled <a href=\"https:\/\/discourse.bitdao.io\/t\/passed-bip-21-optimization-of-brand-token-and-tokenomics\/5327\/305\" data-v-f87c67ca=\"\">BIP-21.<\/a>","The merger amalgamates BitDAO’s governance framework and treasury with the technical prowess of Mantle Network, thereby creating a newly unified ecosystem.&nbsp; The primary aim is to refine branding, tokenomics, and create a unified product focus, according to a press release. In line with this, <a href=\"https:\/\/www.theblock.co\/post\/196509\/bitdao-mulls-100-million-token-buyback-for-next-year\" data-v-f87c67ca=\"\">BitDAO’s<\/a> governance token will undergo a rebranding, transitioning from BIT to a new identity, Mantle, represented by the ticker symbol MNT.","With this consolidation, Mantle Network developers inherit almost $300 million in stablecoin reserves and over 270,000 ETH ($485 million) from BitDAO, the announcement said. This capital will play a pivotal role in funding the expansion and broader adoption of Mantle Network.","“We are thrilled to witness the formal dedication of the Mantle Ecosystem, led by an exemplary case of DAO governance,” said Arjun Kalsy, head of ecosystem at Mantle. “Inheriting BitDAO’s mantle, we will usher in the phase two of Mantle Network testnet within the month of May.”","Mantle Network will progress into the second phase of its testnet, code-named “Ringwood,” in May. This phase will introduce planned technical advancements to the network. Among these advancements, key features include the integration of fraud proofs to enhance security, the onboarding of multi-party computation (MPC) validator nodes, data availability (DA) nodes, and the initiation of external audits on the code base.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mantle","content":"PERSON"},{"type":"Mantle Ecosystem","content":"PERSON"},{"type":"$485 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Mantle","content":"ORGANIZATION"},{"type":"MPC","content":"ORGANIZATION"},{"type":"$300 million","content":"MONEY"},{"type":"Ringwood","content":"LOCATION"},{"type":"Mantle Network","content":"ORGANIZATION"},{"type":"Arjun Kalsy","content":"PERSON"},{"type":"21","content":"DATE"}],"hashtag":["ASSETS","GOVERNANCE VOTES"],"authors":["Vishal Chawla","The Block"]}