{"summary":"Santander UK will limit customers to £1,000 per crypto transaction and £3,000 every month starting Nov. 15.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182693\/santander-imposes-limits-on-uk-crypto-exchange-transactions","publishDate":"2022-11-03T11:50:41","id":8961,"type":null,"title":"Santander imposes limits on UK crypto exchange transactions","category":["COMPANIES"],"content":["Santander UK, the British branch of the Spanish financial giant, has announced a £1,000 ($1,120) limit on crypto transactions for customers, citing cryptocurrency fraud warnings from regulators.","The bank also <a href=\"https:\/\/www.santander.co.uk\/personal\/support\/fraud-and-security\/cryptocurrency\" data-v-f87c67ca=\"\">said<\/a> that customers will be limited to making crypto transactions worth $3,360 during a 30-day period.","These restrictions apply to customers making crypto deposits to exchanges from their bank accounts. As such, customers can still withdraw from exchange platforms to their Santander bank accounts. The bank also stated that it will be making more changes to these limits while also adding that it could ban deposits to crypto exchanges altogether.","Santander said the restrictions are intended to protect customers from crypto investment risks. “We feel that limiting payments to cryptocurrency exchanges is the best way to make sure your money stays safe.\"","The bank’s notice maintained its ban on payments to Binance. Santander was among a number of banks and financial institutions that began <a href=\"https:\/\/www.theblock.co\/post\/110818\/santander-uk-block-payments-binance-crypto\" data-v-f87c67ca=\"\">blocking payments to Binance<\/a> last year.","Santander’s announcement also follows on the heels of Swiss authorities preparing to enforce <a href=\"https:\/\/www.theblock.co\/post\/182184\/swiss-regulator-aml-provisions-crypto-transactions\" data-v-f87c67ca=\"\">identity checks<\/a> for crypto transactions above 1000 Swiss francs ($1,005).","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3,360","content":"MONEY"},{"type":"1000 Swiss francs","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$1,120","content":"MONEY"},{"type":"$1,005","content":"MONEY"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}