{"summary":"A district judge has denied another attempt from the SEC to shield documents in its legal fight with Ripple.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173901\/judge-denies-another-sec-attempt-to-shield-documents-in-ripple-case","publishDate":"2022-09-29T17:28:30","id":8962,"type":null,"title":"Judge denies another SEC attempt to shield documents in Ripple case","category":["LEGAL"],"content":["A U.S. District Judge has rejected the Securities and Exchange Commission's (SEC) attempts to shield documents related to a <a class=\"c-link\" href=\"https:\/\/www.sec.gov\/news\/speech\/speech-hinman-061418\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.sec.gov\/news\/speech\/speech-hinman-061418\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">2018 speech <\/a>on cryptocurrencies from former Division of Corporation Finance Director Bill Hinman in its ongoing case with blockchain firm Ripple.","The commission had appealed a prior judge's decision for it to hand over the materials as part of its legal case with the crypto payments company.","The two have been locked in a legal battle since the SEC brought its <a class=\"c-link\" href=\"https:\/\/www.theblockcrypto.com\/linked\/88912\/sec-ripple-labs-lawsuit-filed-2\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblockcrypto.com\/linked\/88912\/sec-ripple-labs-lawsuit-filed-2\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">case<\/a> against Ripple in 2020, alleging the sale of its XRP token constituted an unregistered securities offering. Since then, much of the case has centered on internal documents relating to Hinman's speech, which sought to create regulatory wiggle room for some digital tokens to be exempted from securities registrations.","Ripple has continued to request the emails and memos related to the speech, and Magistrate Judge Sarah Netburn has repeatedly sided with Ripple, denying the SEC's requests for reconsideration in February and <a href=\"https:\/\/www.theblock.co\/linked\/142029\/ripple-celebrates-new-order-in-sec-case\" data-v-f87c67ca=\"\">April<\/a>. In July, the SEC once again objected, kicking the issue to District Judge Analisa Torres. Torres overruled the objection today, directing the SEC to comply with the orders and produce the documents.","The SEC has sought to avoid handing over internal communications on the speech in the discovery process, employing what Netburn <a href=\"https:\/\/www.theblock.co\/post\/157448\/judge-reaffirms-that-sec-must-produce-materials-related-to-hinman-speech-in-ripple-case\" data-v-f87c67ca=\"\">characterized<\/a> as conflicting arguments. Initially, the SEC claimed Hinman's speech consisted of personal views on crypto rather than agency-wide policy. Later, it attempted to shield the documents by claiming they were part of his SEC duties and therefore protected under a statute that provides privacy for internal deliberations for crafting policy or reaching decisions.","In the previous opinion on the matter, Netburn said the SEC was attempting to have it both ways, saying the conflicting arguments suggested \"that the SEC is adopting its litigation to further its desired goal, and not out of a faithful allegiance to the law.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. District Judge","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Division of Corporation Finance","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Hinman","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Netburn","content":"PERSON"},{"type":"Analisa Torres","content":"PERSON"},{"type":"Sarah Netburn","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Bill Hinman","content":"PERSON"},{"type":"April","content":"DATE"}],"hashtag":["SEC"],"authors":["Aislinn Keely","The Block"]}