{"summary":"Starting today, Monday, June 28th, 2021, you’ll be able to own elements of the masterpiece by participating in a one-of-a-kind NFT drop. The drop features a collection that fuses 1980s materialism with an equally pervasive counterpart: 2020’s crypto gluttony. The NFTs are available exclusively on Curio, the premier NFT platform for entertainment brands and musical artists. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109720\/american-psycho-nfts-are-dropping-on-curio","publishDate":"2021-06-28T15:00:26","id":8967,"type":null,"title":"American Psycho NFTs are Dropping on Curio","category":["SPONSORED"],"content":["<b data-v-f87c67ca=\"\">LOS ANGELES – June 28, 2021 -- <\/b><span data-v-f87c67ca=\"\">How epic would it be if a cult classic like American Psycho were immortalized on the blockchain?&nbsp;<\/span>","<span data-v-f87c67ca=\"\">If you are euphoric by even the thought, you’re in luck! Thanks to Evolution USA, a leading licensing and brand monetization agency, and Digital Collectibles Agency (DCA), the cinematic favorite <\/span><a href=\"http:\/\/oncurio.com\/collections\/american-psycho-dorsia?utm_source=paid_post_theblockcrypto&amp;utm_campaign=americanpsycho_6_28_2021&amp;utm_medium=article_promo&amp;utm_content=americanpsycho_droppage\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">American Psycho will be coming to the world of NFTs<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Starting today, Monday, June 28th, 2021 at 12 PM PDT, you’ll be able to own elements of the masterpiece by participating in a one-of-a-kind NFT drop. The drop features a collection that fuses 1980s materialism with an equally pervasive counterpart: 2020’s crypto gluttony. The NFTs are available exclusively on <\/span><a href=\"https:\/\/oncurio.com\/?utm_source=paid_post_theblockcrypto&amp;utm_campaign=americanpsycho_6_28_2021&amp;utm_medium=article_promo_curiodescription&amp;utm_content=americanpsycho\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Curio<\/span><\/a><span data-v-f87c67ca=\"\">, the premier NFT platform for entertainment brands and musical artists.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This drop not only leverages licensed work but it features official photography and creative assets from the film itself. NFT collectors in particular will appreciate the strategy behind the collection, as it maintains exclusivity while delivering on the authenticity of the American Psycho mythology.<\/span>","<span data-v-f87c67ca=\"\">The experience begins with the sale of 50 iconic business card NFTs from characters Patrick Bateman and Paul Allen each day for five days. These cards will give collectors a “reservation at <\/span><span data-v-f87c67ca=\"\">Dorsia”<\/span><span data-v-f87c67ca=\"\"> -- a reference to the impossibly exclusive restaurant in the film -- and unlock access to the complete American Psycho NFT Gallery. Each business card purchased also earns a collector 25 raffle tickets for the chance to win one of nine #1 edition American Psycho Legendary NFTs in the daily raffle.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Upon entering “Dorsia,” collectors will have the ability to view, purchase and bid on 29 officially licensed American Psycho NFTs that include movie stills, iconic accessories, and three Ultimate one-of-one animations -- including Bitcoin Psycho -- that will be auctioned off.&nbsp;&nbsp;&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With 50 editions for the Epic NFTs and 10 of the Legendary NFTs, fans can be assured that they’re buying limited edition collectibles. Exclusive reservation access expires on July 9th or when the collection sells out.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Travis J. Rutherford, Co-Founder &amp; Chief Revenue Officer at Evolution, one of the project managers, sees this platform as an amazing opportunity to “launch the first NFT auction featuring a top-tier film with unique art and original photography.” Rutherford goes on to say that he’s been “impressed with Curio's ability to transform the entertainment space through groundbreaking technology, exclusive partnerships and innovative fan engagement.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To date, the industry has seen successful auctions, galleries and exhibits featuring unique artists and entertainers but this drop takes novelty to the next level. Celebrating historical American cinema while emphasizing gamification and exclusivity of NFTs that have propelled the space to new heights, the American Psycho NFT collection is set to be another classic hit.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The American Psycho NFT collection will launch officially on June 28, 2021 on <\/span><a href=\"https:\/\/oncurio.com\/?utm_source=paid_post_theblockcrypto&amp;utm_campaign=americanpsycho_6_28_2021&amp;utm_medium=article_promo_curiodescription&amp;utm_content=americanpsycho\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">www.oncurio.com<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">-----------------<\/span>","<b data-v-f87c67ca=\"\">ABOUT EVOLUTION<\/b>","<span data-v-f87c67ca=\"\">Evolution is a leading brand monetization agency headquartered in Calabasas, California, servicing the popular culture, media, gaming, toy, personality, celebrity, character, publishing and lifestyle industry verticals. Evolution offers bespoke turn-key solutions, including strategic brand planning, market analysis, contract negotiations, legal support, product development, retail development, royalty collections, contract compliance, inventor relations as well as providing manufacturers a full service licensing acquisitions team. Evolution monetizes and enhances brand value via licensing, direct to retail partnerships, collaborations, experiential retail, direct to consumer sales and location based entertainment.<\/span>","<span data-v-f87c67ca=\"\">The agency’s clients include: Gaumont Television USA, Meredith Corporation, Stampede Ventures, Patricia Nash, Camden Media, The Dali Universe, ITV Studios, Morgan Creek Productions, Activision, TinyBuild Games, System Era Softworks, Tilting Point, OLO Industries, and The Ella Fitzgerald Charitable Foundation, among others.<\/span>","<a href=\"https:\/\/evomgt.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/evomgt.com<\/span><\/a>","<span data-v-f87c67ca=\"\"><a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"1f73767c7a716c7671785f7a697072786b317c7072\">[email&nbsp;protected]<\/a><\/span>","<b data-v-f87c67ca=\"\">ABOUT DIGITAL COLLECTIBLES AGENCY<\/b>","<span data-v-f87c67ca=\"\">Digital Collectibles Agency (DCA) brings intellectual property and entertainment franchises to the NFT market. DCA assists brands in generating revenue and engaging fans in this new and rapidly changing space. To learn more, please visit: <\/span><a href=\"https:\/\/dcagency.io\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/dcagency.io<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\">ABOUT CURIO<\/b>","<span data-v-f87c67ca=\"\">Curio delivers a new universe to serve fans through digital collectibles, driven by state-of-the-art non-fungible token (NFT) technology. Working with the biggest names in the entertainment industry, Curio brings innovative, cutting-edge engagement opportunities to delight fans and provide new ways to enhance their relationship with brands. To learn more, please visit:<\/span><a href=\"https:\/\/oncurio.com\/?utm_source=paid_ad_3&amp;utm_campaign=americanpsycho_6_28_2021&amp;utm_medium=article_promo_curiodescription&amp;utm_content=americanpsycho\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> https:\/\/oncurio.com\/<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp; &nbsp; &nbsp; <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Patrick Bateman","content":"PERSON"},{"type":"Morgan Creek Productions","content":"ORGANIZATION"},{"type":"American Psycho","content":"ORGANIZATION"},{"type":"Patricia Nash","content":"PERSON"},{"type":"Stampede Ventures","content":"ORGANIZATION"},{"type":"June 28, 2021","content":"DATE"},{"type":"1980s","content":"DATE"},{"type":"Activision","content":"ORGANIZATION"},{"type":"American Psycho NFT Gallery","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Gaumont Television USA","content":"ORGANIZATION"},{"type":"Paul Allen","content":"PERSON"},{"type":"Ella Fitzgerald Charitable Foundation","content":"ORGANIZATION"},{"type":"Camden Media","content":"ORGANIZATION"},{"type":"Dali Universe","content":"PERSON"},{"type":"Monday, June 28th, 2021","content":"DATE"},{"type":"Meredith Corporation","content":"ORGANIZATION"},{"type":"American Psycho mythology","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"July 9th","content":"DATE"},{"type":"OLO Industries","content":"ORGANIZATION"},{"type":"American Psycho NFT","content":"ORGANIZATION"},{"type":"Calabasas","content":"LOCATION"},{"type":"Travis J. Rutherford","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"Evolution USA","content":"ORGANIZATION"},{"type":"Digital Collectibles Agency (DCA","content":"ORGANIZATION"},{"type":"2020","content":"DATE"}],"hashtag":[],"authors":["Sponsored","The Block"]}