{"summary":"Flashbots Strategy Lead Hasu called the lack of neutral relays on the Ethereum ecosystem a failure — Flashbots, meanwhile, remains at the center of the censorship debate over U.S.-sanctioned Tornado Cash.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177741\/flashbots-hasu-no-neutral-relay-a-failure-amid-ethereum-censorship-debate","publishDate":"2022-10-17T15:43:30","id":8968,"type":null,"title":"Flashbots&#x27; Hasu: no neutral relay &#x27;a failure&#x27; amid Ethereum censorship debate","category":["ETHEREUM"],"content":["<span data-v-f87c67ca=\"\">Flashbots strategy lead Hasu called the lack of a neutral relay “a failure of the Ethereum ecosystem.”<\/span>","<span data-v-f87c67ca=\"\">Flashbots remains at the center of a debate over censorship on Ethereum, as a growing number of blocks are proposed via the service while it opts to ignore any transactions from sanctioned digital mixer Tornado Cash.<\/span>","Flashbots strategy lead Hasu called the lack of neutral relays on the Ethereum ecosystem a failure — Flashbots, meanwhile, remains at the center of the censorship debate over U.S.-sanctioned Tornado Cash.","“It's a failure of the Ethereum ecosystem that one month after The Merge, there is still no neutral relay. All the relays that exist are vertically integrated builder relays,” Hasu <a href=\"https:\/\/twitter.com\/hasufl\/status\/1582005123794235395?s=20&amp;t=EaQoshfZurttGMnkmY6Tkw\" data-v-f87c67ca=\"\">tweeted.<\/a>","A vertically integrated builder is “a relay that also operates a builder and hence has an incentive to favor blocks of that builder over blocks of external builders,” Hasu later told The Block via direct message on Twitter.","<a href=\"https:\/\/www.theblock.co\/post\/174386\/flashbots-now-accounts-for-39-of-ethereum-blocks-as-censorship-concerns-rise\" data-v-f87c67ca=\"\">Flashbots<\/a> provides maximal extracted value (MEV) relay services to Ethereum blockchain validators. Because it operates in the U.S., it <a href=\"https:\/\/www.theblock.co\/post\/174386\/flashbots-now-accounts-for-39-of-ethereum-blocks-as-censorship-concerns-rise\" data-v-f87c67ca=\"\">censors<\/a> all transactions from <a href=\"https:\/\/www.theblock.co\/post\/177504\/templedao-hacker-moves-funds-via-sanctioned-crypto-mixer-tornado-cash\" data-v-f87c67ca=\"\">Tornado Cash<\/a>, which was sanctioned by Department of the Treasury’s Office of Foreign Assets Control (OFAC) for money laundering. A growing number of staking services are relying on Flashbots to extract the greatest value from block validation, making censorship more widespread.","Many developers also don't trust builder relays given a lack of insight as to whether those relays are configured to favor themselves over network participants, Hasu said.&nbsp;","The stir over censorship ultimately led to the recent <a href=\"https:\/\/www.theblock.co\/post\/175709\/flashbots-co-founder-steps-down-after-disagreements-with-team-over-censorship\" data-v-f87c67ca=\"\">resignation<\/a> of Flashbots co-founder Stephane Gosselin. He told The Block that he hoped “Validators will avoid connecting to relays that perform censorship.”","Flashbots acknowledged its role in the issue of censorship, and said it will <a href=\"https:\/\/www.theblock.co\/post\/174977\/flashbots-product-lead-addresses-concerns-over-tornado-cash-censorship\" data-v-f87c67ca=\"\">take steps<\/a> to mitigate the problem. Soon after Gosselin’s departure the company announced it would release <a href=\"https:\/\/www.theblock.co\/post\/177352\/flashbots-unveils-upgrade-that-could-resolve-censorship-concerns\" data-v-f87c67ca=\"\">SUAVE<\/a>, a protocol aimed at progressively decentralizing block building by open sourcing development.&nbsp;","In addition, Flashbots product lead Robert Miller <a href=\"https:\/\/www.theblock.co\/post\/174977\/flashbots-product-lead-addresses-concerns-over-tornado-cash-censorship\" data-v-f87c67ca=\"\">previously said<\/a> the service is working to reduce supremacy by establishing protocols to submit blocks to other relays, and that Flashbots will issue a grant for the creation of a relay monitor with which users may evaluate the MEV marketplace.","However, despite these efforts, the number of blocks proposed by Flashbots continues its upward trend, with 48% of all blocks on Ethereum proposed by the MEV service in the last 24 hours based on its Transparency Dashboard.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Gosselin","content":"PERSON"},{"type":"Department of the Treasury’s Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"48%","content":"PERCENT"},{"type":"Hasu","content":"PERSON"},{"type":"Flashbots","content":"PERSON"},{"type":"Stephane Gosselin","content":"PERSON"},{"type":"Robert Miller","content":"PERSON"},{"type":"MEV","content":"ORGANIZATION"},{"type":"Transparency Dashboard","content":"ORGANIZATION"}],"hashtag":["CENSORSHIP","ETHEREUM","MEV","VALIDATORS"],"authors":["Jeremy Nation","The Block"]}