{"summary":"Hong Kong traders may only be able to trade tokens with the largest market cap, and companies may be forced to close if they don’t meet regulatory requirements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213218\/hong-kong-lift-ban-retail-crypto-trading","publishDate":"2023-02-20T05:56:31","id":8972,"type":null,"title":"Hong Kong plans to lift ban on retail crypto trading","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">Hong Kong’s regulator proposed a relaxation of rules banning retail investors from buying crypto tokens from licensed platforms on Monday. <\/span>","<span data-v-f87c67ca=\"\">The prohibition had been the source of debate in the city's legislature, with lawmakers last year pushing the regulator to relax the rules because investors were already using offshore and unregulated platforms such as FTX to place trades.<\/span>","<span data-v-f87c67ca=\"\">The regulator also announced all crypto trading platforms operating in Hong Kong need to be approved by the Securities and Futures Commission by June 2024, or else close down its operations. The SFC “will not hesitate to take enforcement action,” the regulator suggested in a new <a href=\"https:\/\/apps.sfc.hk\/edistributionWeb\/gateway\/EN\/consultation\/doc?refNo=23CP1\" data-v-f87c67ca=\"\">consultation<\/a>.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Crypto exchange Huobi will set up a new platform to apply for the SFC’s license, advisor Justin Sun <\/span><a href=\"https:\/\/twitter.com\/justinsuntron\/status\/1627602672034680832\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">confirmed<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The government has been behind changes to the city's crypto licensing rules with officials keen to position Hong Kong as a financial center for digital assets. The city's central bank only last week issued the world's first tokenized green bond, raising around $100 million to invest in clean energy technology and related projects.<\/span>","Hong Kong last year announced&nbsp; new mandatory licensing provisions for centralized crypto service providers, which come into effect on June 1.&nbsp; The SFC said Monday it was looking “to strike a better balance between investor protection and market development.”","<span data-v-f87c67ca=\"\">The regulator also suggested that only the largest tokens will be available for retail traders. <\/span><span data-v-f87c67ca=\"\">The consultation covers token admission requirements and outlines that “eligible large-cap virtual assets” need to fulfil certain market criteria issued by at least two independent index-providers.<\/span>","<span data-v-f87c67ca=\"\">The regulator also asked exchanges to explain which crypto derivative products they want to offer investors and why. Currently, licensed exchanges in the city are not allowed to sell crypto derivatives, a rule the regulator said it might change.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 1","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Securities and Futures Commission","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Huobi","content":"PERSON"},{"type":"June 2024","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["ASIAN REGULATION"],"authors":["Inbar Preiss","Benjamin Robertson","The Block"]}