{"summary":"Oh Baby Games has come out of stealth and has raised a $6 million seed round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206950\/oh-baby-games-comes-out-of-stealth-announcing-6-million-funding-round","publishDate":"2023-01-30T19:56:19","id":8976,"type":null,"title":"Oh Baby Games comes out of stealth, announcing $6 million funding round","category":["GAMING"],"content":["Crypto gaming platform Oh Baby Games came out of its stealth mode today by announcing a $6 million seed fundraising round.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe round was co-led by eGirl Capital and Synergis Capital and included participation from crypto gaming DAO, Merit Circle. A few notable angels also participated in the funding round, including Twitch co-founder Kevin Lin and several popular crypto Twitter figures, such as cl207 and inversebrah.","The first game to be released is called What The Kart and is a spin on a traditional racing cart game. This release will be followed by Rugpull Guys and a platform fighting game. Oh Baby Games plans to launch cross-game collectibles as part of its rollout strategy and launch these games in 2023.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“The Kart genre hasn’t innovated for decades. Equipment should matter. Custom garages to personalize and show off. Ghost battles against others. Player made bounties. The tracks should tell a story, not just be a continuous 3 lap loop all the time,” said Pas Tran, founder of Oh Baby Games.","Oh Baby Games has been quiet about what it has been working on, but has released teasers of the game leading up to this announcement. Tran <a href=\"https:\/\/twitter.com\/passytee\/status\/1605167902319325184?s=20&amp;t=fdcPXwOfUWZx4HNBi3D0Og\" data-v-f87c67ca=\"\">tweeted<\/a> a trailer video in December of its first game.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe Oh Baby Games team <a href=\"https:\/\/ohbabygames.com\/news\" data-v-f87c67ca=\"\">said<\/a> it has worked on games such as the Call of Duty franchise, League of Legends, and Magic: The Gathering.&nbsp;","\"We have all shipped games before, we’ve shipped games that have failed but also ones that have hit viral success. This raise allows us to move even faster,” said Tran.&nbsp;","Oh Baby Games emphasized one of its core focuses as a gaming platform is integrating the lore, community and stories of crypto Twitter. This is showcased in their in-game usage of the profile picture characters from some of their seed investors. Games are a great way to tell stories, and this aspect of its gaming platform will play a role in their user growth strategy, the company said.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kevin Lin","content":"PERSON"},{"type":"Rugpull Guys","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Synergis Capital","content":"ORGANIZATION"},{"type":"Pas Tran","content":"PERSON"},{"type":"$6 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"Merit Circle","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}