{"summary":"If you wanted to buy a Doodles NFT, the top bid for more than 10 items in that collection sits at 5.07 ETH, whereas the &#x27;buy now&#x27; price is 5.03 ETH.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217961\/blur-bid-incentives-skew-market-lead-to-offers-on-nfts-above-buy-now-prices","publishDate":"2023-03-08T06:36:09","id":898,"type":null,"title":"Blur bid incentives appear to skew market, offers on NFTs above &#x27;buy now&#x27; prices","category":["COMPANIES"],"content":["Blur's bidding-incentive model appears to be leading to an environment where buyers on the NFT marketplace are offering more than the asking price for items in collections.&nbsp;","The rise of Blur — which has eclipsed other marketplaces' trading volume since its launch in October of last year — came on the back of its capitalizing on the activity of <a href=\"https:\/\/www.theblock.co\/post\/214131\/blurs-pacman-doxxes-himself-and-outlines-plan-to-become-the-binance-of-nfts\" data-v-f87c67ca=\"\">pro traders<\/a>, which is the fastest-growing segment of the NFT market.&nbsp;It rolled out an incentive model where traders are rewarded in tokens for providing market liquidity. In each collection, the bids that take the highest “risk” earn most reward points.","As of the time of writing, if you wanted to buy a Doodles NFT, the top bid for more than ten items in that collection sits at 5.07 ETH (about $7,900), whereas the 'buy now' price is 5.03 ETH. It's the same story for other collections, including Bored Ape Yacht Club, Azuki and Moonbird NFTs.","Moonbird offers on Blur outstrip the asking price.","When a bid is made on a listed item, the seller has to accept it before the transaction goes through — whereas a buyer would trigger the transaction for the 'buy now' items.&nbsp;","Blur's CEO Tieshun Roquerre, also known as Pacman, said the discrepancy between the bid and the ask is a result of a \"spread\" and the \"fees\" charged.&nbsp;","Of course, the fees tacked onto a transaction set against the rewards for listing and bidding may mean the reverse arbitrage of the current market might not be as bad as it looks. For example, you might pay $20 in transaction fees on Ethereum and a $70 royalty fee back to the artist when a sale goes through.","5.070 x 99.5% = 5.045<br data-v-f87c67ca=\"\">\nand there is gas<br data-v-f87c67ca=\"\">\nand some floor ones might be listed by the people who made those bids","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","\"Most traders currently bidding on NFTs on Blur probably just assume that the rewards they'll receive will outweigh the costs incurred,\" said Thomas Bialek, research analyst at The Block Research.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">Updates with new headline and Blur CEO's comments discrepancy between the bid and ask on the marketplace.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$20","content":"MONEY"},{"type":"Thomas Bialek","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tieshun Roquerre","content":"PERSON"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Doodles NFT","content":"ORGANIZATION"},{"type":"$7,900","content":"MONEY"},{"type":"Pacman","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Moonbird NFTs","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"$70","content":"MONEY"},{"type":"99.5%","content":"PERCENT"}],"hashtag":["BLUR"],"authors":["Lucy Harley-McKeown","The Block"]}