{"summary":"Ledn backed away from Genesis in time to avoid being associated with its crisis.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226267\/bitcoin-lender-ledn","publishDate":"2023-04-13T14:59:02","id":8980,"type":null,"title":"How Bitcoin lender Ledn survived 2022’s crypto credit crisis","category":["CRYPTO ECOSYSTEMS"],"content":["Last year was a disaster for crypto lending companies across the board, as Celsius Network, BlockFi and the largest crypto prime brokerage Genesis Trading all succumbed to the fallout from the collapse of <a href=\"https:\/\/www.theblock.co\/post\/208412\/luna-classic-token-price-rises-to-highest-level-since-november\" data-v-f87c67ca=\"\">Terra ecosystem<\/a> amid their own reckless business practices and lack of internal controls. Yet <a href=\"https:\/\/ledn.io\/\" data-v-f87c67ca=\"\">Ledn<\/a>, which focuses just on Bitcoin and the stablecoin USDC loans, managed to stay afloat.","Many of the lenders were intertwined, and when cracks started appearing, they spread rapidly. In Ledn’s early days, in fact, Genesis was its sole partner and took out all of its loans. It begs the question of how on earth Ledn survived the year.","“We thought that it was important strategically to diversify away from being dependent on Genesis, so we started doing that very quickly,” Ledn co-founder Mauricio Di Bartolomeo said in an interview. “Then when Three Arrows hit, we got word that they had taken a big hit out of Three Arrows and it just made sense for us to finish transitioning out of that relationship.”","Bartolomeo explained that Ledn originally teamed up with Genesis in May 2020 to provide a stronger offering as competition for crypto lending heated up with new entrants like BlockFi. Yet when Ledn wanted to bring the two companies closer together, perhaps by Genesis making a strategic investment in Ledn, the idea was turned down, and Genesis started working with other lending companies like Gemini.","“That spoke loud and clear to us and that that was some sort of telling sign that we needed to diversify away from that relationship,” he said. Ledn soon started transitioning away from Genesis and opened up its doors to other borrowers. Once it started its own lending desk around May 2021, it found that some of Genesis’ borrowers came directly to Ledn to cut out the middleman.&nbsp;","As a result, by the time that the crypto credit crisis occurred, Ledn had largely transitioned away from Genesis to its own order book. So when it heard about the brokerage’s potential liabilities, it sped up the transition and closed the relationship.","Genesis wasn’t the only bullet that Ledn dodged. While many crypto lending platforms had exposure to the collapsed crypto hedge fund Three Arrows Capital — as Genesis did —&nbsp;Ledn had chosen not to work with them. “In fact, they came by our desk three times to try to get on board it. But we have pretty strict onboarding requirements, a key requirement of which is a financial statement, which they at the time weren't willing to share,” he said.","While Ledn survived the last year, it faced a number of challenges. This included customers withdrawing from the company because so many crypto lenders were collapsing, as well as a crypto market downturn and the collapse of many borrowers like Genesis. All of this made it hard to keep rates high, yet Ledn continues to offer rates of 9.5% on USDC.","Bartolomeo explained that there are two main ways the company generates yield. First, it has its lending desk, which largely lends out uncollateralized loans to market makers. He said it focuses on businesses that generate more than 50% of revenue from traditional finance in order to limit crypto exposure.","The second way is that the company effectively lets its customers loan to one another. The company offers overcollateralized Bitcoin-backed loans at 12.9% APR, which is a few percent higher than the yield it offers on borrowing USDC. Ledn then takes a fee from this spread.&nbsp;","Bartolomeo noted that for these overcollateralized loans, a lot of those providing capital are based in more developed parts of the world, such as Europe, and want to generate yield. Around 40% to 50% of them go to Latin America, “because that's an area of the world that's just way more challenged in terms of access to credit,” he said. He added that the company has processed nearly $600 million of these loans.","While market conditions have been rough, Bartolomeo said demand for loans rose during February and March. He highlighted that many former BlockFi and Genesis clients are coming to Ledn for loans.","Going ahead, Ledn plans to focus on slowly expanding its product offering while also improving its proof of reserves system that shows that all customer assets held on the platform are accounted for and in line with liabilities.","Since the company lends out its customer’s assets, it can’t show that it holds all of the assets in its own wallets. But Bartolomeo claimed that these attestations are important to show that the accounting is all being done properly — as opposed to companies like FTX, which didn’t seen to have a clue about its assets and liabilities.","The attestations are produced in partnership with The Network Firm, a company built by former employees at Armanino,&nbsp;which originally did crypto audits until the end of 2022.","On the product front, Ledn plans to provide the functionality to hold crypto on its platform without lending it out. It's also considering bringing ether to its offering.","Beyond this, the company is aiming to try and bring out loans for its customers that have much lower rates than are currently on offer, in order to try to make them more widely available.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"12.9%","content":"PERCENT"},{"type":"May 2020","content":"DATE"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"Mauricio Di Bartolomeo","content":"PERSON"},{"type":"May 2021","content":"DATE"},{"type":"9.5%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"$600 million","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"Ledn","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"40%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Ledn","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Bartolomeo","content":"PERSON"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Armanino","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN","INVESTMENT FIRMS","TRADFI BANKS"],"authors":["Tim Copeland","The Block"]}