{"summary":"The Bitcoin financial services outfit will reduce its staff by roughly 15% while also shuffling its senior leadership.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188578\/bitcoin-lender-and-custodian-unchained-capital-announces-job-cuts","publishDate":"2022-11-19T07:48:04","id":8983,"type":null,"title":"Bitcoin lender and custodian Unchained Capital announces job cuts","category":["COMPANIES"],"content":["Joe Kelly, CEO of Bitcoin financial services outfit Unchained Capital, said the company will reduce its staff by “roughly 15%” as part of efforts to manage the business during the current crypto bear market.","Unchained Capital’s job cuts are due to constraints in funding for bitcoin-backed loans, Kelly said in a <a href=\"https:\/\/unchained.com\/blog\/update-from-our-ceo\/\" data-v-f87c67ca=\"\">note<\/a> shared on Friday. These constraints, he noted, are part of a general drawdown occasioned by the year-long crypto bear market. Despite these issues, the Bitcoin lender's CEO said its loan book is still over-collateralized, with a collateral-to-principal ratio of 214%.","Kelly also said the company did not have any exposure to bankrupt crypto exchange FTX or its sister trading firm Alameda Research. Still, he said the Bitcoin lender is caught up in the current challenging crypto market and needs to plan for the long term. He added that some of the company’s hires during the last bull-market period are no longer sustainable.","The Unchained Capital CEO said affected employees will receive compensation. “We are offering a severance package that includes paying an additional 1-2 months of base pay depending on tenure, paying up to two month’s premium for health care continuation benefits, pro-rating of first year vesting of options and accelerating any bonus options, and extending the option exercise window,” Kelly said.","Unchained Capital is not the first crypto firm to announce job cuts in the current decline. Several other companies have also culled staff strength in recent months. Senior executives have <a href=\"https:\/\/www.theblock.co\/post\/183049\/mythical-games-cuts-10-of-workforce-1-day-after-top-executives-depart\" data-v-f87c67ca=\"\">departed<\/a> numerous crypto firms. These crypto job cuts are part of a <a href=\"https:\/\/www.theblock.co\/post\/186829\/amazon-set-to-lay-off-10000-employees-as-reductions-mount-nyt\" data-v-f87c67ca=\"\">broader trend<\/a> of technology firms <a href=\"https:\/\/www.theblock.co\/post\/184675\/meta-to-cut-11000-jobs-metaverse-vision\" data-v-f87c67ca=\"\">reducing<\/a> staff numbers.","Apart from the job cuts, the Bitcoin lender and custodian is also restructuring its senior leadership team. The CEO’s note revealed that the company will transition two of its executives to advisory roles.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kelly","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Friday","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Joe Kelly","content":"PERSON"},{"type":"214%","content":"PERCENT"},{"type":"Unchained Capital","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["LAYOFFS"],"authors":["Osato Avan-Nomayo","The Block"]}