{"summary":"A Senate staff memo dated April 30 explores the notion of remote voting during a time of crisis, and includes a page exploring how blockchain tech could be use for Congressional operations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63825\/congress-blockchain-voting-memo-coronavirus","publishDate":"2020-05-03T11:32:40","id":899,"type":null,"title":"Blockchain voting mulled in Senate memo as COVID-19 disrupts how Congress operates","category":["TECHNOLOGY"],"content":["The COVID-19 pandemic has disrupted&nbsp;the U.S. Congress's ability to meet and deliberate – a state of affairs that has forced a rethinking of how America's national legislature operates in a time of crisis.","And according to <a href=\"https:\/\/www.portman.senate.gov\/sites\/default\/files\/2020-04\/2020.04.30%20PSI%20Staff%20Memorandum%20-%20Remote%20Senate%20Process%20-%20Final_0.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a Senate memo<\/a> dated April 30 and obtained by The Block, blockchain-based voting could be part of the solution.","The memo was drafted in the context of the \"Roundtable on Continuity of Senate Operations and Remote Voting in Times of Crisis,\" an event hosted by the Permanent Subcommittee on Investigations, which is currently chaired by Senator Rob Portman of Ohio. As the memo explains, \"<span data-v-f87c67ca=\"\">[t]he COVID-19 virus has shut down major sectors of our society, including many functions of Congress,\" further noting:<\/span>","\"By rule and custom, the two chambers of Congress have always met in person to conduct business, including committee hearings, floor deliberation, and voting. Neither chamber has contingency plans that allow those functions to proceed remotely, but this crisis highlights the need to consider means for Congress to do its job at times when it may not be safe for members and staff to gather in person.\"","The subject of blockchain itself did not come up during <a href=\"https:\/\/www.hsgac.senate.gov\/subcommittees\/investigations\/hearings\/roundtable_-continuity-of-senate-operations-and-remote-voting-in-times-of-crisis\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">the nearly two-hour-long roundtable<\/a>, but the event did highlight the two core areas that any applicable technology would need to address: authentication and encryption. Put more simply, if any technology is going to be used for voting purposes in the Senate, it must be ensured that only actual senators are voting and outside attackers can't disrupt the process.","After a section exploring the use of end-to-end encryption technology for voting purposes, the memo posits that \"the Senate may consider blockchain.\"&nbsp;","As the memo explains in detail:","\"With its encrypted distributed ledger, blockchain can both transmit a vote securely and also verify the correct vote. Some have argued that these attributes make blockchain useful for electronic voting broadly. Blockchain can provide a secure and transparent environment for transactions and a tamper-free electronic record of all the votes. It also reduces the risks of incorrect vote tallies. Moreover, some firms have already begun to deploy blockchain-like technology to help countries, like Estonia, run elections entirely online.\"","However, the memo itself does not openly endorse using the technology, and the subsequent paragraph lays out the risks involved with its potential deployment:","\"One concern specific to the Senate is the risk that majority control of the blockchain could fall into the wrong hands. Due to the small size of the Senate, any remote blockchain voting system would need to be properly set up to eliminate any threat of a 51 percent attack to ensure that no bad actor could gain majority control of a voting chain. A 51 percent attack occurs when an actor controls more than half of a network's computing power and uses that power to exert control over the blockchain. Other security concerns for remote blockchain voting in the Senate include possible vulnerabilities from cryptographic flaws and software bugs.\"","Voting as a blockchain use case has existed for years, and some decentralized protocols and communities currently use on-chain mechanisms for governance decisions. But the path to its potential application to the public sector has been a rocky one, attracting its fair share of <a href=\"https:\/\/www.technologyreview.com\/2018\/08\/09\/2425\/why-security-experts-hate-that-blockchain-voting-will-be-used-in-the-midterm-elections\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">critics<\/a>. Still, the concept has attracted supporters as well, including former U.S. presidential candidate <a href=\"https:\/\/www.theblockcrypto.com\/linked\/37238\/2020-presidential-candidate-andrew-yang-is-in-favor-of-blockchain-voting\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Andrew Yang<\/a>.&nbsp;","The discussion around remote voting comes as the Senate <a href=\"https:\/\/www.latimes.com\/politics\/story\/2020-05-03\/lawmakers-senate-coronavirus-relief-bill\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">is set to return<\/a> to Washington, D.C. this week at the behest of Senate Majority Leader Mitch McConnell of Kentucky, while the House of Representatives has no set timeline for reconvening in person. Concerns around testing and the health risks among a population that skews older are likely to persist.","Ultimately, it's fair to say that the Senate is unlikely to embrace blockchain tech as a voting solution anytime soon. The very idea of remote voting remains controversial primarily because the legislative process hinges on personal contact and deliberation. And while some leaders in Congress appear open to the concept of remote voting, progress on this front is likely to be slow-going.","Still, the memo is a notable example of how ideas around technology – blockchain or not – circulate in the corridors of power and could reshape how Congress operates in the wake of this national health crisis.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Continuity of Senate Operations","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"19","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Ohio","content":"LOCATION"},{"type":"America","content":"LOCATION"},{"type":"Rob Portman","content":"PERSON"},{"type":"April 30","content":"DATE"},{"type":"Andrew Yang","content":"PERSON"},{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"Kentucky","content":"LOCATION"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Permanent Subcommittee on Investigations","content":"ORGANIZATION"},{"type":"Estonia","content":"LOCATION"},{"type":"51 percent","content":"PERCENT"},{"type":"D.C.","content":"LOCATION"},{"type":"Mitch McConnell","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["CONGRESS"],"authors":["Michael McSweeney","The Block"]}