{"summary":"The web3 credentials platform is launching &quot;Identity Protocol&quot; on mainnet in order to give users&#x27; control over their private data.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287647\/galxe-launches-mainnet-that-enables-cross-domain-pseudonymous-identities","publishDate":"2024-04-11T10:05:07","id":9,"type":null,"title":"Galxe launches mainnet that enables &#x27;cross-domain pseudonymous identities&#x27;","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Galxe <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/257088\/galxe-gal-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/galaxy.jpg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">GAL<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +9.85%\n    <\/span><\/a> <!----><\/span><\/span>, the Web3 credentials and rewards platform, announced Thursday that it is launching its \"Identity Protocol\" mainnet.<\/span>","The protocol will give users \"autonomy over their digital identity and private data\" by leveraging zero-knowledge proofs, the company said.&nbsp;","\"Our goal is to witness a shift in how digital identity is managed, moving away from centralized, one-size-fits-all solutions to a world where users dictate their digital presence and how it can bring value to products and platforms,\" Galxe co-founder Charles Wayn told The Block.&nbsp;","The company said it has issued, since launching in 2021, more than 200,000 credentials and has had 18 million unique wallets engage with its platform. Galxe also said it has contributed substantially to the growth of <span data-v-f87c67ca=\"\">Arbitrum, Optimism, and Polygon.<\/span>","Galxe's strategy in launching the mainnet is to augment users' control over their private data by arming them with the power to disclose personal information as they see fit when accessing different \"blockchain environments,\" according to its statement. Galxe said the new initiative is also aimed at fostering increased <span data-v-f87c67ca=\"\">interoperability.<\/span>","<span data-v-f87c67ca=\"\">\"Identity Protocol\" will allow people to use and maintain consistent \"cross-domain pseudonymous identities ... across different platforms,\" Galxe also said in its statement.<\/span>","\"The launch of Galxe Identity Protocol’s mainnet marks a crucial transition,\" said Wayn. \"By leveraging our extensive experience with millions of web3 users and the lessons learned from industry-wide challenges like scalability and privacy, we’re introducing a secure, decentralized alternative for identity verification.\"","Galxe raised $10 million in funding in 2022, with Multicoin Capital and Dragonfly Capital participating, according to a statement.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"+9.85%","content":"PERCENT"},{"type":"Charles Wayn","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Wayn","content":"PERSON"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"mainnet marks","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"Dragonfly Capital","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}