{"summary":"Tigran Gambaryan, the financial crime compliance head at Binance, was detained in a government housing unit in Nigeria along with Binance member Nadeem Anjarwalla in February.\nNigeria’s federal government recently filed tax evasion charges against Binance.","author":["Danny Park","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285535\/binance-executive-sues-nigeria","publishDate":"2024-03-28T23:32:17","id":9,"type":null,"title":"Detained Binance executive Tigran Gambaryan sues Nigerian government: reports","category":["Exchanges"],"content":["<span data-v-f87c67ca=\"\">Detained Binance executive Tigran Gambaryan filed a lawsuit against Nigeria’s National Security Adviser and the Economic and Financial Crimes Commission for violating his basic human rights, according to local reports.<\/span>","<span data-v-f87c67ca=\"\">Gambaryan’s motion declared that his detention in Nigeria soon after his arrival in February and the confiscation of his passport violates the country’s constitution that guarantees an individual’s right to personal liberty, Nigeria’s Punch News <\/span><a href=\"https:\/\/punchng.com\/detained-binance-executive-drags-efcc-nsa-to-court\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> on Thursday.<\/span>","<span data-v-f87c67ca=\"\">The financial crime compliance head for Binance also reportedly requested the court to order the immediate return of his passport and the issuance of a public apology.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Binance did not immediately respond to The Block’s request for further comment.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Nadeem Anjarwalla, Binance’s regional manager for Africa who was detained with Gambaryan, filed a similar complaint, according to Punch. Anjarwalla has recently escaped Nigerian custody, a Binance spokesperson previously <\/span><a href=\"https:\/\/www.theblock.co\/post\/284393\/nigeria-tax-evasion-charges-binance-exec-escapes-custody\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">confirmed<\/span><\/a><span data-v-f87c67ca=\"\"> with The Block.<\/span>","<span data-v-f87c67ca=\"\">Gambaryan, a U.S. citizen, and Anjarwalla, a dual citizen of the UK and Kenya, <\/span><a href=\"https:\/\/www.theblock.co\/post\/281904\/binance-executives-detained-in-nigeria\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reportedly arrived in Nigeria’s capital city Abuja<\/span><\/a><span data-v-f87c67ca=\"\"> on Feb. 25, and on the next day, they were escorted to a government property and were held there after they met with Nigerian officials.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, on Monday, the Nigerian government <\/span><a href=\"https:\/\/www.theblock.co\/post\/284393\/nigeria-tax-evasion-charges-binance-exec-escapes-custody\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filed four charges<\/span><\/a><span data-v-f87c67ca=\"\"> against the global crypto exchange for tax evasion.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Federal High Court of Nigeria scheduled the government to arraign Binance and the two executives on April 4, while the federal government said it will seek help from Interpol to arrest Anjarwalla for trial, according to Nigeria’s <\/span><a href=\"https:\/\/www.vanguardngr.com\/2024\/03\/fg-cleared-to-prosecute-binance-2-others-fleeing-officials-lawyer-withdraw\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Vanguard news<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>"],"hashtag":["BINANCE","LAWSUITS"]}