{"summary":"Decentralized exchange protocol KyberSwap has recovered approximately $4.67 million in funds following a recent security attack. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264756\/kyberswap-recovers-4-7-million-after-exploit","publishDate":"2023-11-27T06:57:42","id":9001,"type":null,"title":"KyberSwap recovers $4.7 million after exploit","category":["CRYPTO ECOSYSTEMS"],"content":["Decentralized exchange protocol KyberSwap has recovered $4.67 million in funds following a recent security attack.&nbsp;","A hacking incident resulted in a loss of <a href=\"https:\/\/www.theblock.co\/post\/264579\/kyberswap-offers-10-bounty-to-hacker-following-47-million-exploit?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">$47 million<\/a> from Kyber's concentrated liquidity pools last week.","A portion of funds' recovery was completed yesterday through negotiations with the operators of front-running bots, which extracted about $5.7 million in crypto from KyberSwap pools on the Polygon and Avalanche networks during the hack, the team <a href=\"https:\/\/twitter.com\/KyberNetwork\/status\/1728800315955437743\" data-v-f87c67ca=\"\">said<\/a>.&nbsp;","The bot operators agreed to a deal in which they would return 90% of the funds they had taken to a specified KyberSwap address on the Polygon network, with a 10% bounty as their incentive.","This negotiation is distinct from the main event’s hacker, who had previously indicated a willingness to negotiate. While the team <a href=\"https:\/\/www.theblock.co\/post\/264579\/kyberswap-offers-10-bounty-to-hacker-following-47-million-exploit\" data-v-f87c67ca=\"\">offered<\/a> a white hat bounty, that negotiation has seemingly not yet progressed.","The hacker had targeted KyberSwap’s Elastic pools, impacting funds across multiple blockchains, including Arbitrum, Optimism, Ethereum, Polygon, and Binance Smart Chain.","The vulnerability exploited by the hacker was linked to an issue with the tick interval boundaries in Kyber’s concentrated liquidity pools, which they manipulated to double the liquidity and then drain the pools.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"$4.67 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Polygon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"$5.7 million","content":"MONEY"},{"type":"$47 million","content":"MONEY"},{"type":"Kyber","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Vishal Chawla","The Block"]}