{"summary":"The Xion testnet focuses on “generalized abstraction,” an infrastructure solution aimed at removing complexities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266522\/xion-testnet-rollout","publishDate":"2023-12-07T08:24:12","id":9003,"type":null,"title":"Circle-backed Xion rolls out testnet based on &#x27;generalized abstraction&#x27;","category":["CRYPTO ECOSYSTEMS"],"content":["Xion, a blockchain that uses the USDC stablecoin as its default payment coin, has launched its testnet that focuses on “generalized abstraction,” an infrastructure solution to remove web3 user experience complexities.","The network aims to onboard users without directly using wallet accounts, signatures or other typical processes. The team is eying a mainnet release in 2024.","With this launch, Xion also released its <a href=\"https:\/\/xion.burnt.com\/whitepaper.pdf\" data-v-f87c67ca=\"\">whitepaper<\/a> for generalized abstraction. This is an expanded form of account abstraction technology, also called smart wallets, that lets users bypass the need to download crypto wallets.","The solution focuses on onboarding users onto web3 apps using familiar methods, such as email, PassKeys, and any cryptographic signature scheme used in traditional IT. The network will focus on use cases around payments, social communities, web subscriptions and games.","Xion is the first blockchain to <a href=\"https:\/\/www.theblock.co\/post\/254952\/layer-1-blockchain-that-uses-usdc-stablecoin-for-gas-fees-opens-public-testnet\" data-v-f87c67ca=\"\">integrate USDC stablecoin<\/a> across the infrastructure stack for familiar pricing. This means all products built on Xion will display prices in the stablecoin to make them user-friendly.&nbsp;","“Web3 still has a steep learning curve and scares away users who have to learn how to operate wallets, safeguard seed phrases, and send transactions to hexadecimal addresses. Generalized Abstraction is a step beyond account abstraction, as we look to streamline all aspects of using blockchain,” said Banksy Burnt, the pseudonymous founder and CEO of Burnt, a core contributor to the Xion network.","Burnt has raised over $11 million from Animoca Brands, Circle Ventures, Multicoin, HashKey, Valor, and others.&nbsp;","The Xion testnet is based on the Comet BFT consensus framework and the Cosmos SDK, a popular developer toolkit and software package leveraged in developing projects such as Injective, Osmosis and dYdX Chain.","In October, Xion announced that upon the mainnet launch, the network will be supported by an ecosystem of over seventy-five partners who aim to provide users with key functionalities, from onramp to managing on-chain communities and fee abstraction.","<em data-v-f87c67ca=\"\">The article was amended to clarify that Xion is backed by Circle Ventures, not Coinbase.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$11 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Cosmos SDK","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Injective","content":"LOCATION"},{"type":"Circle Ventures","content":"ORGANIZATION"},{"type":"Multicoin","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Banksy Burnt","content":"PERSON"},{"type":"Comet BFT","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}