{"summary":"Fantom Foundation Director Andre Cronje said it stopped providing liquidity with its MULTI tokens because of the uncertainty around Multichain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232188\/andre-cronje-fantom-foundation-multichain-situation","publishDate":"2023-05-25T08:10:05","id":9006,"type":null,"title":"Andre Cronje explains why Fantom Foundation withdrew funds in Multichain situation","category":["CRYPTO ECOSYSTEMS"],"content":["Fantom Foundation Director Andre Cronje said the foundation withdrew its funds from liquidity pools on SushiSwap out of caution with respect to the Multichain situation.","\"No point to LP at times of uncertainty,\" Cronje told The Block via Telegram, referring to Liquidity Providers, or the act of providing liquidity to a pool on a decentralized exchange.","The foundation <a href=\"https:\/\/www.theblock.co\/post\/232049\/fantom-foundation-justin-sun-hashkey-take-action-multichain-issues\" data-v-f87c67ca=\"\">withdrew<\/a> $2.4 million of MULTI, the native token of the cross-chain Multichain protocol, on May 24, as noted by on-chain analysts.","\"You can see in the wallet the funds haven't been sold, as soon as Multichain is able to release a statement around this and clear it up we will LP again,\" said Cronje.","The Multichain protocol has had five days of stuck transactions and it still has multiple cross-chain bridge pathways — Kava, zkSync, Polygon zkEVM — that are not yet online. The first purported cause was that this was due to an upgrade that was getting fixed, but the explanation was changed yesterday to an ambiguous \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">force majeure.<\/span>\" There are some concerns over the <a href=\"https:\/\/www.theblock.co\/post\/232144\/multichain-teams-silence-sparks-further-uncertainty-for-users\" data-v-f87c67ca=\"\">lack of responses<\/a> from the project's leadership team.","The Fantom blockchain is also closely connected to Multichain. <span data-v-9360dbf6=\"\" data-v-f87c67ca=\"\">According to data from The Block Research, 38% of the total-value locked on the Fantom blockchain is held within Multichain. Plus, tokens issued on Multichain make up 78% of the market cap of tokens on Fantom.<\/span>","Yet Cronje said he wasn't particularly concerned about this because the assets are secured by the multi-party computation protocol and the Fantom bridge is unaffected.","\"If something did happen, it would impact multichain-issued USDC, DAI, and wBTC. Everything else of significance is natively issued,\" he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May 24","content":"DATE"},{"type":"$2.4 million","content":"MONEY"},{"type":"Multichain","content":"ORGANIZATION"},{"type":"LP","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Multichain","content":"LOCATION"},{"type":"78%","content":"PERCENT"},{"type":"Fantom Foundation","content":"ORGANIZATION"},{"type":"Fantom","content":"PERSON"},{"type":"38%","content":"PERCENT"},{"type":"Liquidity Providers","content":"ORGANIZATION"},{"type":"Andre Cronje","content":"PERSON"},{"type":"Cronje","content":"PERSON"}],"hashtag":["CROSS-CHAIN SWAPS"],"authors":["Tim Copeland","The Block"]}