{"summary":"Burnt announced its public testnet for Xion, a Layer-1 blockchain that will use the Circle-issued USDC as its main transactional currency.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254952\/layer-1-blockchain-that-uses-usdc-stablecoin-for-gas-fees-opens-public-testnet","publishDate":"2023-10-05T10:45:23","id":9007,"type":null,"title":"Layer 1 blockchain that uses USDC for transactions opens public testnet","category":["CRYPTO ECOSYSTEMS"],"content":["Web3 developer Burnt announced the launch of its public testnet for Xion, a Layer-1 blockchain that will use the Circle-issued USDC stablecoin as its primary transactional currency.","The network will focus on uses cases around payments, social communities, web subscriptions, loyalty programs and games.","Xion will be supported by an ecosystem of over seventy-five partners who provide users with key functionalities, from onramp to managing on-chain communities and fee abstraction.","Besides using USDC for transaction fees, all products built on Xion will display prices in the stablecoin to make them user friendly.&nbsp;","\"Our long-term vision for XION is to empower user-friendly applications that harness the power of Web3 without the complexities typically associated with blockchains,\" said Burnt Banksy, CEO of Burnt.","The project has also announced a strategic investment from Circle Ventures. To date, Burnt has raised over $11 million from investors including Animoca, Circle Ventures, Coinbase, Multicoin, Spartan, HashKey, and others, according to its <a href=\"https:\/\/xion.burnt.com\/\" data-v-f87c67ca=\"\">website<\/a>.","\"We are proud to support Burnt in its mission of empowering developers to craft user-friendly experiences that abstract away the complexities typically associated with using Web3,\" said Wyatt Lonergan, Principal at Circle Ventures. \"With the beta launch of XION, developers can build purpose-built applications that leverage USDC for widespread adoption.\"","The blockchain is based on the Comet BFT consensus framework and the Cosmos SDK, a developer toolkit and software package used in creating projects such as the BNB Chain, Injective, Osmosis, and dYdX Chain.","The team clarified that while it may use the USDC stablecoin for transaction fees, there will be a native staking asset used by validators to secure the network.&nbsp;","<em data-v-f87c67ca=\"\">The headline has been updated for clarity.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$11 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Animoca","content":"LOCATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"Burnt Banksy","content":"PERSON"},{"type":"Cosmos SDK","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Injective","content":"LOCATION"},{"type":"Circle Ventures","content":"ORGANIZATION"},{"type":"Multicoin","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"Comet BFT","content":"ORGANIZATION"},{"type":"Wyatt Lonergan","content":"PERSON"}],"hashtag":["USDC"],"authors":["Vishal Chawla","The Block"]}