{"summary":"&quot;We have a message for the citizens of goblin town: Your days are numbered,&quot; Terra&#x27;s Do Kwon warned bearish market players earlier this month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139682\/terra-bitcoin-crypto-sellers-market","publishDate":"2022-03-29T16:47:50","id":9008,"type":null,"title":"Crypto sellers are staying on the sidelines as Terra moves to buy billions in bitcoin","category":["BITCOIN"],"content":["In the face of geopolitical uncertainty and tightening monetary policy, one crypto whale has hijacked the driver’s seat of the volatile market: Terra Labs’s Do Kwon.","The Forbes 30 under 30 blockchain startup founder <a href=\"https:\/\/www.theblockcrypto.com\/post\/138892\/do-kwon-reveals-plan-to-increase-usts-bitcoin-reserve-to-3-billion\" data-v-f87c67ca=\"\">revealed<\/a> his plans to purchase billions of dollars in bitcoin <a href=\"https:\/\/www.theblockcrypto.com\/post\/134871\/luna-founation-guard-token-sale\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">to serve as reserves<\/a> for its algorithmic stablecoin UST. Shortly after the announcement, Kwon issued a proclamation to crypto bears (\"goblins\") in a March 24 post on <a href=\"https:\/\/twitter.com\/stablekwon\/status\/1507146078679797763\" data-v-f87c67ca=\"\">Twitter<\/a>:","We have a message for the citizens of goblin town: <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nYour days are numbered. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nOur orange battalions will overwhelm your defenses, and return your cities to the dirt<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nYour fields will be sown with salt, so that no future bearish thoughts will grow<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe 🌕 is coming","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","The tweet appears to have been somewhat prescient, given that the price of bitcoin surged to more than $48,000 on Monday. This move triggered <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/futures\/short-liquidations\" data-v-f87c67ca=\"\">over $300 million<\/a> in short liquidations, according to data compiled by The Block.","This market comeback is also reflected in data from LMAX Group, which showed total notational volumes coming in at $777 million for this Monday (16% above the 30-day average), as the exchange group noted in a newsletter.","Indeed, executives at firms across the cryptocurrency market told The Block that Terra’s plans to buy bitcoin in the coming weeks have pushed sellers to the sidelines.","\"A lot of people front running and a lot of sellers pausing,\" Joshua Lim of Genesis said in a message to The Block. \"In the last week, we had several $50mm+ notational call buyers in BTC, across the curve from April to Dec maturities, largely positioning into the anticipated spot buying.\"","The Luna Foundation Guard – a non-profit entity that maintains the peg of UST to one dollar – has confirmed it has purchased $1 billion worth of bitcoin since the end of January. That includes about $135 million worth of purchases over the course of Monday.","\"We are buying bitcoin now because we're trying to bootstrap the reserve,\" Kwon explained during an upcoming episode of The Scoop. \"But the future model of Terra $UST is that a certain percentage of new $UST that is being minted goes to buy bitcoin all the time to build up reserves.\"","Genesis’s Lim noted that the buying is contributing “a lot” to the lack of selling pressure because traders don’t want to sell against Terra’s buying spree.","The broader crypto market has risen alongside bitcoin, with Ethereum trading up 19% over the last week and Luna itself up 11.6%.","As for buying pressure, Kyle Davies of Three Arrows Capital said traders have been sitting on cash and have been parked in stablecoins waiting for positive news to reposition themselves in the market.","\"There have been so many waves of selling in the face of negative news that funds and other market participants are sitting on big cash positions,” he said. \"As bitcoin grinds up, I expect many to chase the market higher...doesn’t really matter how much LFG is doing.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"billions of dollars","content":"MONEY"},{"type":"$50","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"Kwon","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"11.6%","content":"PERCENT"},{"type":"March 24","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"19%","content":"PERCENT"},{"type":"\" Joshua Lim of Genesis","content":"ORGANIZATION"},{"type":"$777 million","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"$48,000","content":"MONEY"},{"type":"Luna Foundation Guard","content":"ORGANIZATION"},{"type":"Kyle Davies","content":"PERSON"},{"type":"LMAX Group","content":"ORGANIZATION"},{"type":"Terra $UST","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"LFG","content":"ORGANIZATION"},{"type":"$135 million","content":"MONEY"},{"type":"16%","content":"PERCENT"},{"type":"last week","content":"DATE"},{"type":"Terra","content":"ORGANIZATION"},{"type":"$300 million","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"}],"hashtag":[],"authors":["Davis Quinton","Frank Chaparro","The Block"]}