{"summary":"Bakkt is set to acquire Apex Crypto for $55 million in cash, with another $145 million in stock to be paid if time-dependent financial targets are hit.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182614\/bakkt-acquire-apex-crypto","publishDate":"2022-11-03T08:18:26","id":9009,"type":null,"title":"Bakkt to acquire Apex Crypto for up to $200 million","category":["MERGERS & ACQUISITIONS"],"content":["Bakkt is set to acquire Apex Crypto from Apex Fintech Solutions for up to $200 million in an effort to bolster its cryptocurrency product.","Bakkt will pay $55 million in cash when the deal closes, according to a <a href=\"https:\/\/www.businesswire.com\/news\/home\/20221103005623\/en\/Bakkt-to-Acquire-Apex-Crypto\" data-v-f87c67ca=\"\">statement<\/a>. The crypto platform will also pay $45 million in stock, dependent on fourth-quarter financial targets set for Apex Crypto. An additional $100 million in stock and seller notes may also be paid, dependent on 2025 financial targets.","The deal is expected to finalize in the first half of 2023 and is subject to regulatory approval.","Apex Crypto is an integrated crypto-trading platform that offers a solution for execution, clearing, custody, cost basis and tax services for more than 30 coins and tokens. Its more than 220 clients will be memorialized, according to the statement, and have the opportunity to use Bakkt's platform solutions.","Spun out of IntercontinentalExchange in 2018, Bakkt provides back-end infrastructure for different kinds of financial services companies to offer bitcoin and loyalty reward points services. Bakkt expects the acquisition to diversify its revenue, help scale its offerings and accelerate product development.","\"We're really excited to have entered into this definitive agreement,\" Bakkt CEO Gavin Michael told The Block, adding that the deal \"will significantly bolster our crypto offerings to cover a full range of the market and an extended range of tokens, expand our footprint into additional client verticals, and provide a faster speed for going to market with these capabilities.\"","The company also notes intentions to go to market with products related to crypto staking, external transfers and NFTs. \"Our roadmap has always contemplated broadening our crypto offerings,\"&nbsp;Michael said, adding that \"in the future, we will be able to offer yield products and NFTs to both existing and new customers.\"","<em data-v-f87c67ca=\"\">Update: Added additional information and quotes from Bakkt CEO Gavin Michael.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"Bakkt","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Fintech Solutions","content":"ORGANIZATION"},{"type":"the first half of 2023","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"$45 million","content":"MONEY"},{"type":"$55 million","content":"MONEY"},{"type":"Michael","content":"PERSON"},{"type":"$200 million","content":"MONEY"},{"type":"IntercontinentalExchange","content":"ORGANIZATION"},{"type":"Gavin Michael","content":"PERSON"}],"hashtag":[],"authors":["Adam James","The Block"]}