{"summary":"Cube.Exchange has raised $12 million in a Series A funding round.\nThe round brings Cube’s valuation to $100 million, a source told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275490\/cube-crypto-exchange-series-a","publishDate":"2024-02-01T07:00:03","id":901,"type":null,"title":"Hybrid crypto exchange Cube reaches $100 million valuation in new funding round","category":["Venture Capital"],"content":["Cube.Exchange, a hybrid crypto trading platform yet to launch publicly, has raised $12 million in a Series A funding round. 6th Man Ventures led the round, with GSR Markets, Foundation Capital, ParaFi Digital, Susquehanna Private Equity Investments, Everstake Capital and others participating, Cube said Thursday.","The new round comes just over three months after Cube raised $9 million in seed funding. Cube CEO Bartosz Lipinski, a former Solana engineer, said that the company wasn't actively seeking funding but responded to \"considerable inbound interest\" from investors. \"We closed the entire round in under a month,\" Lipinski told The Block, referring to the period after Cube launched its early access mode last November.","The structure of the Series A round involved equity with token warrants, a source with direct knowledge of the matter told The Block. Lipinski confirmed that structure and said the seed round had the same structure.","The Series A round has brought Cube's post-money equity valuation to $100 million, the source said. Lipinski declined to comment on the valuation.","Cube was formed last year to protect traders from founder risk, particularly in response to previous incidents of centralized crypto venue collapses, such as the FTX exchange.","Cube uses a hybrid model with off-chain order matching and on-chain settlement. This lets users retain ownership of their assets without having to transfer them to an exchange custodial account for trading, Lipinski said.","Cube boasts multi-party computation vaults that house individual wallets for native settlement, directly holding assets on blockchains. Lipinski said this approach enables users to view their assets on-chain without relying on proof-of-reserve audits and also eliminates the need for wrapped assets.","Cube currently settles natively to Bitcoin, Ethereum, Dogecoin and Solana — and plans to support more Layer 1 networks in the future — Lipinski said.","Cube, currently in early access mode, is expected to launch publicly in the coming months. In its current phase, the platform offers users points that can be redeemed for various rewards offered by Cube.","\"For example, we just completed a program that distributed about $250,000 value in Bonk tokens,\" Lipinski said. \"We have a rewards pool right now underway for a roughly $25,000, or 175 million $GECKO token reward pool.\"","Cube plans to continue partnering with listed tokens to offer rewards pools, Lipinski said — adding that Cube currently has no immediate plans to issue its own token.","With fresh funding in place, Cube plans to \"significantly\" expand its 25-member team across various functions, Lipinski said. The platform also has plans to obtain licenses in more jurisdictions. It currently holds a virtual asset service provider license in Poland and a money services business license in Canada, and it meets \"all requirements\" for current spot trading operations in Australia, according to Lipinski.","As part of leading the Series A round, Mike Dudas, founder and managing partner of 6th Man Ventures, has joined Cube's board, Lipinski said."],"hashtag":["SERIES A"]}