{"summary":"Anchorage Digital co-founder Diogo Mónica has joined Haun Ventures as General Partner — but will continue on Anchorage&#x27;s board.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283631\/anchorage-co-founder-diogo-monica-joins-haun-ventures-as-general-partner","publishDate":"2024-03-20T09:06:09","id":9012,"type":null,"title":"Anchorage co-founder Diogo Mónica joins Haun Ventures as General Partner","category":["DEALS"],"content":["Anchorage Digital co-founder Diogo Mónica has joined Haun Ventures as General Partner.","\"[Diogo Mónica] adds an entirely new flank of experiences and capabilities to what Haun Ventures can offer builders, and his arrival represents an important step for us as we construct an elite venture franchise investing at the frontier of crypto,\" Katie Haun said in a <a href=\"https:\/\/www.haun.co\/article\/diogo-monica\" data-v-f87c67ca=\"\">blog post<\/a>.","Mónica will continue to be active with regards to Anchorage. He will move to a role as Executive Chairman of its Board, helping with hiring and strategy, according to Axios.","Haun Ventures was founded in March 2022 by Katie Haun after she left Andreessen Horowitz, where she had worked for four years. It has raised $1.5 billion to invest in projects including Aleo, Aptos and OpenSea.","Anchorage is a crypto platform that has a federal bank charter from the OCC. It looks after $50 billion of client assets and its investors include Andreessen Horowitz and Goldman Sachs.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Anchorage Digital","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Diogo Mónica","content":"PERSON"},{"type":"OCC","content":"ORGANIZATION"},{"type":"Katie Haun","content":"PERSON"},{"type":"Anchorage","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"$1.5 billion","content":"MONEY"},{"type":"$50 billion","content":"MONEY"},{"type":"Aptos","content":"LOCATION"},{"type":"Haun Ventures as General Partner","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Haun Ventures","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Board","content":"ORGANIZATION"},{"type":"Aleo","content":"PERSON"}],"hashtag":["ANDREESSEN HOROWITZ"],"authors":["Tim Copeland","The Block"]}