{"summary":"NFT marketplace OpenSea has suffered a data breach after an employee at its email delivery vendor leaked user data.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155010\/opensea-hit-by-data-breach","publishDate":"2022-06-29T23:25:47","id":9021,"type":null,"title":"OpenSea hit by data breach after email delivery partner leaks addresses","category":["DATA"],"content":["NFT marketplace OpenSea has suffered a data breach after an employee at its email delivery partner leaked user data.","In <a href=\"https:\/\/opensea.io\/blog\/safety-security\/important-update-on-email-vendor-security-incident\/\" data-v-f87c67ca=\"\">a blog post<\/a> published late on June 29, OpenSea said that an employee of Customer.io had “misused their employee access to download and share email addresses – provided by OpenSea users and subscribers to our newsletter – with an unauthorized external party.”","The leaked information included email addresses, according to the blog post, and OpenSea warned users that this could result in a&nbsp;“a heightened likelihood for email phishing attempts.”","The company said customers should assume they have been impacted by the news if they had shared their email address with OpenSea in the past.","OpenSea added in the blog post that the company is assisting Customer.io with its own internal investigation, and that the incident has been reported to law enforcement.","Screenshots <a href=\"https:\/\/twitter.com\/econoar\/status\/1542343306704732162?s=20&amp;t=Uf4dK_Yi0L8D7GG73hfZ6Q\" data-v-f87c67ca=\"\">shared on Twitter<\/a> show that OpenSea has also contacted customers by email to inform them about the breach.","<em data-v-f87c67ca=\"\">This article's headline has been updated to make it clear that OpenSea's email delivery partner Customer.io suffered the breach.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"June 29","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"OpenSea","content":"ORGANIZATION"},{"type":"OpenSea","content":"PERSON"}],"hashtag":["OPENSEA"],"authors":["Ryan Weeks","The Block"]}