{"summary":"Crypto wallet Phantom has raised $109 million in a Series B funding round and is now valued at $1.2 billion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/132464\/solana-wallet-phantom-raises-109-million-series-b-launches-ios-app","publishDate":"2022-01-31T09:35:12","id":9029,"type":null,"title":"Phantom raises $109 million in new funding, launches iOS app","category":["VENTURE CAPITAL"],"content":["Phantom, a crypto wallet for accessing the Solana ecosystem, has raised $109 million in a Series B funding round and is now valued at $1.2 billion.","Paradigm led Phantom's funding. Existing investors, including Andreessen Horowitz (a16z), Variant Fund, Jump Capital, DeFi Alliance, and Solana Ventures, also participated in the round.","This was an equity funding round and will help Phantom expand across multiple blockchains, including adding support for Ethereum before the end of this year, its CEO Brandon Millman told The Block. Phantom is also looking to launch its Android app in the first half of this year, said Millman.","Phantom has released its iOS app today. The wallet initially launched as a browser extension in July last year and has quickly grown to become the leading Solana wallet, like Ethereum's MetaMask.","Phantom claims to have gained more than two million monthly active users within just six months of its launch. MetaMask was launched in 2016 by ConsenSys and hit one million monthly active users in October 2020. Today, it has more than 21 million monthly active users.","Millman said Phantom is \"doubling down\" on Solana by focusing on mobile apps and features that will help streamline the onboarding experience for new users. \"We will accelerate the growth of the web3 ecosystem on Solana by bringing a world-class onboarding and DApp discoverability experience for users on mobile,\" he said.","Millman was previously a tech lead at 0x, an infrastructure for building decentralized exchanges, where he extensively used MetaMask. His perceived shortcomings with MetaMask and its focus on Ethereum led him to make a new wallet. He chose Solana for Phantom's initial support as there was less competition.","To meet its multichain support plans, Phantom is looking to expand its current team of 20 to at least 40 in the near future. The firm is hiring for various functions, including engineering, operations, and customer support, said Millman.","The Series B round brings Phantom's total funding to date to $118 million. It <a href=\"https:\/\/www.theblockcrypto.com\/post\/111249\/defi-wallet-solana-phantom-9-million-series-a-a16z\" data-v-f87c67ca=\"\">raised<\/a> $9 million in Series A funding led by a16z in July last year. Millman said Phantom isn't looking to raise more funds in the near future. When asked for a potential native token launch, he said there is no concrete plan yet. But launching a token is \"definitely on the table,\" Millman <a href=\"https:\/\/www.theblockcrypto.com\/news+\/118611\/a-close-look-at-phantom-solanas-take-on-metamask\" data-v-f87c67ca=\"\">told<\/a> The Block last September.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Ventures","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Millman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$109 million","content":"MONEY"},{"type":"Brandon Millman","content":"PERSON"},{"type":"$118 million","content":"MONEY"},{"type":"MetaMask","content":"ORGANIZATION"},{"type":"July last year","content":"DATE"},{"type":"October 2020","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"$9 million","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"the first half of this year","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"$1.2 billion","content":"MONEY"}],"hashtag":["SOLANA","WALLETS"],"authors":["Yogita Khatri","The Block"]}