{"summary":"DeFi-related financial crimes made up less than 1% of the total DEX transaction volume\nBut the crime rate on DEXs are going to rise in 2021, according to Chainalysis’ Chief Scientist","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/92197\/34-million-in-defi-crime-2020","publishDate":"2021-01-24T11:14:33","id":903,"type":null,"title":"Over $34 million in illegitimate crypto moved through DeFi in 2020","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">Roughly <\/span><a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/dex-non-custodial\/dex-volume-monthly\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$144.3 billion<\/span><\/a><span data-v-f87c67ca=\"\"> passed through decentralized exchanges (DEXs) in 2020, but not all transactions involved legally-obtained crypto. <\/span>","<span data-v-f87c67ca=\"\">Blockchain analysis firm Chainalysis estimates that about $34 million of decentralized finance (DeFi) transactions were conducted by criminal actors.&nbsp;<\/span>","","","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Source: Chainalysis<\/span><\/em>","<span data-v-f87c67ca=\"\">The $34 million figure might not sound like a lot — it’s only 0.02% of the estimated <\/span><a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/dex-non-custodial\/dex-volume-monthly\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DEX volume<\/span><\/a><span data-v-f87c67ca=\"\">, after all. But that number remains significant because the frequency of such activity is expected to rise in 2021, wrote Chainalysis chief scientist Jacob Illum in a draft shared with The Block.<\/span>","<span data-v-f87c67ca=\"\">One factor in this numerical growth will be purely logistical — blockchain analytics firms like Chainalysis and Elliptic haven’t found all the crime-tied activity that occurred in 2020. As such, they're likely to uncover additional instances this year, as <\/span><a href=\"https:\/\/blog.chainalysis.com\/reports\/2021-crypto-crime-report-intro-ransomware-scams-darknet-markets\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Chainalysis previously mentioned<\/span><\/a><span data-v-f87c67ca=\"\"> was the case with the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/73412\/china-arrested-suspects-of-plustoken-ponzi-scheme\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">PlusToken Ponzi scheme<\/span><\/a><span data-v-f87c67ca=\"\">. The key events date back to 2019, but many of the key players weren’t identified until the following year.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Illum mentions another reason for the increased DeFi activity rate:&nbsp;because cybercriminals have taken note of DeFi’s smart contracts, which route funds into users wallets depending on the terms stipulated in the code. There's a lack of human oversight between transactions, and Illum argues that money laundering via DeFi will increase as a result.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The question that remains is whether the most popular platforms will be those where administrators retain enough control to prevent criminal transactions, as we saw in the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/daily\/82899\/kucoin-thief-dex-money-laundering\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">KuCoin hack<\/span><\/a><span data-v-f87c67ca=\"\">,” Illum wrote.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The third is that dark markets, like Televend, are decentralizing. Televend uses encrypted automated chat bots on Telegram to connect more than 150,000 vendors to buyers. Buyers place orders on a vendor’s automated chat and then receive a BTC address generated by the bot.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Televend receives commissions on each sale, but never actually touches the funds, so there’s no central entity for law enforcement to track through blockchain analysis — the transactions blend in much more easily,” Illum wrote.&nbsp;&nbsp;<\/span>"],"hashtag":["CRIME","DEXS"]}