{"summary":"Clearpool, an uncollateralized stablecoin lending protocol, has launched on Polygon.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159992\/clearpool-launches-uncollateralized-stablecoin-lending-on-polygon","publishDate":"2022-07-28T09:00:44","id":9030,"type":null,"title":"Clearpool launches uncollateralized stablecoin lending on Polygon","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Clearpool, an uncollateralized stablecoin lending protocol, has expanded to Polygon, according to an announcement on Thursday.<br data-v-f87c67ca=\"\">\n<\/span>","<a href=\"https:\/\/www.theblockcrypto.com\/news+\/147301\/meet-clearpool-the-lending-platform-at-the-forefront-of-defi-2-0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Clearpool<\/span><\/a><span data-v-f87c67ca=\"\"> provides uncollateralized USDC loans to institutions using decentralized liquidity pools. This integration will see the launch of pools where institutions can borrow USDC stablecoin from lenders on the Polygon network.<\/span>","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/post\/141116\/polygon-releases-testnet-plans-for-a-new-scalability-focused-blockchain-call-avail?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">Polygon<\/a>, a proof-of-stake sidechain that runs alongside Ethereum’s main network, is the second blockchain for Clearpool after its Ethereum launch in March 2022. Since the initial deployment on Ethereum, the firm claims to have generated over $180 million of institutional loans from borrowers like Jane Street, Amber, Auros, FBG Capital, Folkvang, and Wintermute.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The team further announced lenders to its genesis liquidity pools Polygon will be rewarded with MATIC rewards, in addition to the USDC interest and liquidity rewards.<\/span>","<span data-v-f87c67ca=\"\">“Launching Clearpool on Polygon has been part of our plans since day one, so we are very excited to finally reach this important milestone and bring institutional DeFi to the Polygon ecosystem,” said Clearpool CEO Robert Alcorn.<\/span>","<span data-v-f87c67ca=\"\">Clearpool says it can enable uncollateralized lending with appropriate risk management, while relying on risk management tools like single-borrower liquidity pools and credit ratings. <\/span><span data-v-f87c67ca=\"\">All borrowers on Clearpool are institutions, which have to pass a stringent Know Your Customer (KYC) process to verify their identity before they can open a borrower pool. Meanwhile, there are no requirements for lenders and anyone can deposit stablecoins, hoping to earn a yield. <\/span>","<span data-v-f87c67ca=\"\">However, uncollateralized lending has been the subject of bad press in recent months. Since May, i<\/span>nstitutional players like Three Arrows Capital, Celsius Network have defaulted on unsecured loans, thereby triggering a serious financial crisis across the crypto space. Three Arrows Capital alone <a href=\"https:\/\/www.theblock.co\/post\/158169\/three-arrows-capital-3ac-creditors-list-3-5-billion-crypto-affidavits\" data-v-f87c67ca=\"\">received $3.5 billion<\/a> in loans from a wide variety of crypto companies — many of which are now trying to see if there's anything left to salvage.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"Robert Alcorn","content":"PERSON"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"Jane Street","content":"PERSON"},{"type":"Amber","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"Folkvang","content":"LOCATION"},{"type":"FBG Capital","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$180 million","content":"MONEY"},{"type":"$3.5 billion","content":"MONEY"}],"hashtag":["LENDING","POLYGON"],"authors":["Vishal Chawla","The Block"]}