{"summary":"Buterin is concerned that Bitcoin’s transaction fees won’t provide enough security when the mining revenue dries up.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167709\/two-reasons-why-vitalik-buterin-is-worried-about-bitcoins-long-term-health","publishDate":"2022-09-04T09:47:52","id":904,"type":null,"title":"Two reasons why Vitalik Buterin is worried about Bitcoin’s long-term health","category":["BITCOIN"],"content":["Ethereum co-founder Vitalik Buterin is worried that Bitcoin’s level of security is not going to be strong enough in the years to come.&nbsp;","In an <a href=\"https:\/\/noahpinion.substack.com\/p\/interview-vitalik-buterin-creator\" data-v-f87c67ca=\"\">interview<\/a> with economics writer Noah Smith, Buterin gave two reasons why he is concerned.&nbsp;","The first was that Bitcoin’s long-term security will slowly switch from mining rewards to transaction fees (as mining rewards continue to be lowered every four years). Still, he argued that current transaction fees are not high enough to provide the same level of security.&nbsp;","“First, in the long term, Bitcoin security is going to come entirely from fees, and Bitcoin is just not succeeding at getting the level of fee revenue required to secure what could be a multi-trillion-dollar system,” he said.","He noted that Bitcoin sees roughly $300,000 in fees per day, a figure that hasn’t grown much over the past five years — although it has spiked as high as $21 million. In contrast, Bitcoin miners currently earn around $18.5 million per day.","Buterin’s second point was that he claims proof of stake is a more efficient way of providing security to a blockchain network than proof of work. While Ethereum is on the verge of migrating from proof of work to proof of stake (scheduled to happen this month), this is unlikely to happen to Bitcoin — as most Bitcoiners are staunchly against it.","Yet Buterin remained optimistic that it could be a possibility.","“Of course, if Bitcoin actually gets attacked, I do expect that the political will to switch to at least hybrid proof of stake will quickly appear, but I expect that to be a painful transition,” he said.","As for the differences between proof of work and proof of stake, Buterin acknowledged the argument that the latter has stronger centralization pressures.&nbsp;","“These are definitely things that I worry about, though I think people overstate them,” he said.","In response to these issues, Buterin highlighted some problems related to the current state of staking on Ethereum — such as withdrawals not being enabled yet — but pointed out that these will be fixed within the next year or so.&nbsp;","He then compared staking to mining and claimed that large mining pools are close to certain governments, which could lead to censorship in the future (something that Ethereum is also <a href=\"https:\/\/www.theblock.co\/post\/162105\/us-treasury-sanctions-cryptocurrency-mixer-tornado-cash\" data-v-f87c67ca=\"\">grappling<\/a> with).","He added, “The highly democratized early proof of work era was a beautiful thing, and it helped tremendously in making cryptocurrency ownership more egalitarian, but it’s unsustainable and it’s not coming back.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Buterin","content":"PERSON"},{"type":"Noah Smith","content":"PERSON"},{"type":"Bitcoiners","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$300,000","content":"MONEY"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"$21 million","content":"MONEY"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"$18.5 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN","ETHEREUM","MINING","VITALIK BUTERIN"],"authors":["Tim Copeland","The Block"]}