{"summary":"Its new project lets players create their own games, including different modes and play styles.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216834\/lifeforce-becomes-latest-web3-gaming-shop-to-lean-into-user-generated-content","publishDate":"2023-03-07T08:59:54","id":9044,"type":null,"title":"LifeForce becomes latest web3 gaming shop to lean into user-generated content","category":["COMPANIES"],"content":["Game development studio LifeForce Games (LFG) is the latest to join the user-generated content trend, with its new project created so players can build their own crypto games.","The new Game Generator engine will be available after trials of LFG's forthcoming titles Spark Defense and Forge Horizon go live in March, according to a company release. Forge Horizon is a third-person shooter game and Spark Defense is a multiplayer online battle arena.","Gamers will fight it out for top spots on the leaderboard and in-game collectibles in preparation for the alpha launch of the Game Generator, where they will be able to try their hands at creating their own games.","LFG was founded by Ryan Inman, aka Boomer, and Catherine Carroll, aka Satsuma, who co-founded one of the world's biggest metaverse developers, LandVault.&nbsp;","“When we first launched, our ambition was to create a seamless and accessible environment for users to create games and share experiences,” said co-CEO Caroll in a company statement. “Our Game Generator is the realization of that ambition.”","The studio’s goal is to have a variety of games, modes and play styles available for players to get involved in building via a no-code, drag-and-drop generator. Serious builders will also have the opportunity to create battle passes and utilize in-game customizations to make their own brand-specific community games, making this an ideal fit for gamers, content creators and streamers wanting a place to engage with their communities.","LifeForce is the latest gaming shop to attempt to capitalize on user-generated content in crypto gaming. In <a href=\"https:\/\/www.theblock.co\/post\/209815\/bain-capital-crypto-backs-curio-research\" data-v-f87c67ca=\"\">February,<\/a> gaming studio Curio Research was backed to the tune of $2.9 million as it set out to create user-generated strategy games on Ethereum.","Meanwhile, metaverse heavyweight <a href=\"https:\/\/www.theblock.co\/post\/215900\/the-sandbox-sebastien-borget-future-corporate-partnerships\" data-v-f87c67ca=\"\">The Sandbox<\/a> is betting that its next wave of creators on the platform will be individuals making interactive experiences, rather than the big brands that have so far dominated the virtual world.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Curio Research","content":"ORGANIZATION"},{"type":"$2.9 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Catherine Carroll","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Ryan Inman","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Caroll","content":"PERSON"},{"type":"LFG","content":"ORGANIZATION"},{"type":"Spark Defense","content":"ORGANIZATION"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}