{"summary":"Powerful technology companies plunging into the metaverse puts the dream of a decentralized ecosystem in jeopardy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203164\/in-apple-and-metas-fight-for-vr-ar-dominance-an-open-metaverse-may-be-collateral-damage","publishDate":"2023-01-18T08:00:42","id":9045,"type":null,"title":"In Apple and Meta&#x27;s fight for VR-AR dominance, an open metaverse may be collateral damage","category":["METAVERSE & NFT"],"content":["Apple’s expected release of a new VR-AR headset later this year is setting the stage for a heated battle with Meta for control of the metaverse. &nbsp;","The real competition, however might be further out there, with a new front emerging between a decentralized internet and one that’s controlled by major corporations.","“The long-term, head-to-head battle is not going to be between Apple and Meta, but between big tech and decentralization,” said Pixelynx CEO Inder Phull, whose company is building metaverse experiences.","<span data-contrast=\"none\" data-v-f87c67ca=\"\">While exactly <a href=\"https:\/\/www.theblock.co\/post\/199868\/whats-in-a-word-metaverse-jargon-breeds-confusion\" data-v-f87c67ca=\"\">what the metaverse is<\/a> r<\/span>emains in flux, companies and investors are pouring billions of dollars into technologies eager to construct a more immersive digital landscape that includes both virtual and augmented reality (VR and AR) experiences. With a new VR-AR device set to be hitting shelves later this year, Apple is pitting itself against Meta, the leading producer of VR headsets. Whichever company is more successful will likely gain an advantage colonizing the metaverse and this has some decentralization advocates concerned.<span data-contrast=\"none\" data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Apple CEO Tim Cook<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“By Apple and Meta controlling … access to users' experiences and data, there is a risk of them exerting too much control and impeding the vision of an open metaverse,” said TJ Kawamura, co-founder of Everyrealm, a virtual land developer backed by the powerful venture capital firm <a href=\"https:\/\/www.theblock.co\/linked\/130954\/andreessen-horowitz-plans-to-raise-4-5-billion-for-new-crypto-funds\" data-v-f87c67ca=\"\">Andreessen Horowitz<\/a>.<\/span>","Most people leading or working for blockchain companies, whether it be cryptocurrency exchanges, NFT developers or gaming companies, dream of an advanced phase of the internet they call web3. Much different than the current status quo, with web3, the entire internet is decentralized. It is not controlled by a handful of major corporations like Apple, Google, Meta and Amazon, the technology companies that build the software, devices and infrastructure users depend on. &nbsp;","Creating an open metaverse will quite possibly require negotiating a new paradigm with whatever companies are in a position to profit from providing access to this future digital realm. Through the use of blockchain technology, many believe a new, more transparent and decentralized internet can be created where average users are stakeholders and have a say in how the internet is governed.","Some argue that this era of decentralization will likely take time as companies like Meta and Apple “favor closed ecosystems” while they chase mainstream adoption of AR and VR, according to Rebecca Barkin, president of Lamina1, a blockchain company dedicated to fostering an open metaverse. Lamina1 was co-founded by Neal Stephenson, the author responsible for coining the term “metaverse” with his 1992 novel “Snow Crash.”","“Lamina1 is building a layer-one blockchain to support makers of the open metaverse,” said Barkin. “Our goal is to go on a journey with developers and corporations that have communicated their support for an open internet.”","<span data-contrast=\"none\" data-v-f87c67ca=\"\">While neither Apple nor Meta has fully embraced blockchain technology at scale — Meta <a href=\"https:\/\/www.theblock.co\/post\/182451\/instagram-to-support-polygon-powered-nft-marketplace\" data-v-f87c67ca=\"\">has experimented<\/a> a little <a href=\"https:\/\/www.theblock.co\/linked\/131658\/meta-backed-diem-in-talks-to-sell-off-assets-report\" data-v-f87c67ca=\"\">with crypto<\/a> and non-fungible tokens —&nbsp;the latter of the two has made efforts which suggests it favors an&nbsp;open metaverse.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Last year, <a href=\"https:\/\/www.theblock.co\/post\/153299\/tech-giants-opt-into-newly-formed-metaverse-standards-forum\" data-v-f87c67ca=\"\">Meta joined more than 30 companies<\/a>, including Microsoft, Epic Games and Lamina1, to form the Metaverse Standards Forum. The organization said in a statement it would work towards concepts considered vital to achieving a decentralized metaverse: open standards and interoperability. Realizing these concepts would mean devices and systems would more easily be able to interact with one another across different platforms, regardless of who created them.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Meta joining the forum demonstrates it may be open to collaborating with other technology companies keen to build an open metaverse. But like Apple, which is famous for its ability to operate secretly, Meta has historically been very protective not only of its inner workings, but also of how its Facebook and Instagram social media platforms collect, utilize and manage data.<br data-v-f87c67ca=\"\">\n<\/span>","<b data-v-f87c67ca=\"\"><\/b>Everyrealm’s Kawamura hopes that companies which choose not to embrace the openness and transparency meant to be inherent in blockchain — especially when it comes to issues of privacy — will lose out.","“It's crucial to us that users are able to own their digital identity across all platforms,” he said. “If any of these existing platforms decides to deny users these rights, I believe builders and consumers will move to other options.”","<span data-contrast=\"none\" data-v-f87c67ca=\"\">For its part, <a href=\"https:\/\/about.fb.com\/news\/2022\/05\/ensuring-an-open-and-interoperable-metaverse\/\" data-v-f87c67ca=\"\">Meta has stated<\/a> that there “<\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">won’t be a Meta-run metaverse, just as there isn’t a ‘Microsoft internet’ or ‘Google internet’ today.” In the same statement from last May it also said that similar to today’s internet the “metaverse is not a single product … [or] an operating system like Microsoft’s Windows, or hardware like Apple’s iPhone.”<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Meta CEO Mark Zuckerberg<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">But&nbsp;internet traffic is largely consolidate among a handful of companies whether it be through Google’s search engine or&nbsp;social media platforms like Facebook and Instagram, which have billions of users. And two smartphone operating systems dominate mobile connectivity; Apple’s iOS and Google’s Android. By far, the <a href=\"https:\/\/www.statista.com\/statistics\/271496\/global-market-share-held-by-smartphone-vendors-since-4th-quarter-2009\/\" data-v-f87c67ca=\"\">two largest sellers<\/a> of mobile devices happen to be Apple and Samsung, which combined account for more than a third of the market. <\/span>&nbsp;","<span data-contrast=\"none\" data-v-f87c67ca=\"\">But Meta’s company line appears to judge circumstances differently. “L<\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">ike today’s internet, the metaverse will be a constellation of technologies, platforms, and products,” it said in its statement.&nbsp;“It won’t be built, operated or governed by any one company or institution.”<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">While it's accurate that there is not one single gatekeeper controlling all digital spaces via devices, systems and applications, the current iteration of the internet is largely controlled and monitored by a select few multibillion-dollar corporations; companies like Amazon, Apple, Microsoft and Meta. <\/span>&nbsp;","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Anyone willing to suggest that history might repeat itself with the metaverse and the development of web3 appears to have reason for concern.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“People don’t want the metaverse to be controlled by a single centralized entity, such as Mark Zuckerberg,” said Pixelynx’s Phull.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Everyrealm","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"Amazon","content":"LOCATION"},{"type":"last May","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Kawamura","content":"PERSON"},{"type":"Barkin","content":"PERSON"},{"type":"Meta","content":"PERSON"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tim Cook","content":"PERSON"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Inder Phull","content":"PERSON"},{"type":"1992","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Rebecca Barkin","content":"PERSON"},{"type":"Meta","content":"ORGANIZATION"},{"type":"Samsung","content":"ORGANIZATION"},{"type":"Meta","content":"LOCATION"},{"type":"TJ Kawamura","content":"PERSON"},{"type":"Neal Stephenson","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Metaverse Standards Forum","content":"ORGANIZATION"},{"type":"Pixelynx’s Phull","content":"ORGANIZATION"}],"hashtag":["AR","VR"],"authors":["RT Watson","The Block"]}