{"summary":"The testnet has received over 150,000 applications and will begin onboarding users in waves to ensure the network remains secure and operational.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200719\/consensys-launches-private-beta-testnet-for-zkevm-scaling-technology","publishDate":"2023-01-10T16:35:16","id":9047,"type":null,"title":"ConsenSys launches private beta testnet for zkEVM scaling technology","category":["LAYER 2S AND SCALING"],"content":["ConsenSys, the blockchain infrastructure platform behind Metamask and Infura, opened a private beta testnet for a new scaling and privacy technology called zkEVM that’s built on top of Ethereum.","ConsenSys is using the testnet <a href=\"https:\/\/www.infura.io\/resources\/network\/consensys-zkevm-beta-signup\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">to explore<\/span><\/a> the potentially disruptive technology that could improve Ethereum’s speed and transaction costs by over 100x.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp; <\/span>ZkEVM stands for zero-knowledge Ethereum Virtual Machine. It allows developers to build applications using the same tooling and coding language they are accustomed to on Ethereum, but without having to learn the cryptography and math skills needed to code in zero-knowledge.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe ConsenSys testnet has received over 150,000 applications since December.","Participants in the beta can bridge assets between the Goerli testnet and the zkEVM to test smart contracts, dapps, infrastructure and wallets. Goerli testnet is a popular test network used to launch and experiment with new applications prior to launching them in a live environment.","“We intend to learn whether the developer experience of the zkEVM has the potential to accelerate innovation in web3,” ConsenSys <a href=\"https:\/\/www.infura.io\/resources\/network\/consensys-zkevm-beta-signup\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">said<\/span><\/a> when it announced the testnet.","ZkEVMs, while promising, are still unproven in a live environment. Many are expected to launch this year, including <a href=\"https:\/\/www.theblock.co\/post\/180846\/matter-labs-releases-first-phase-of-zksync-2-0-mainnet-called-baby-alpha\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">zkSync<\/span><\/a> and Polygon Hermez, which are both further along in their testnet phases.","ConsenSys has been working on its zkEVM network for several years, and it released the technical specifications at the Ethereum DevCon Bogota conference last year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Goerli","content":"PERSON"},{"type":"Polygon Hermez","content":"ORGANIZATION"},{"type":"Bogota","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"December","content":"DATE"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}