{"summary":"An influx of Bitcoin miners into Texas has added lots of new power demand. A heatwave is making some of them power down.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/151084\/bitcoin-miners-in-texas-have-been-powering-down-amid-heatwave-and-record-electricity-demand","publishDate":"2022-06-09T16:43:28","id":9055,"type":null,"title":"Miners in Texas respond to heatwave and record power demand","category":["MINING"],"content":["High temperatures in Texas this week have led to record-breaking power use levels for the month of June, presenting a test for state's power grid. And the heatwave has had implications for some of Texas's bitcoin mining operations.","Energy demand hit a peak of 72,386 megawatts on Monday, setting a record for June — only to be surpassed the following day, when demand hit 72,785 megawatts, according to data from the Electric Reliability Council of Texas (ERCOT). The all-time record was 70,257 MW on June 23, 2021.","An influx of Bitcoin miners into the state has raised questions about <a href=\"https:\/\/www.theblockcrypto.com\/news+\/145817\/bitcoiners-take-it-as-a-given-that-a-mining-rush-will-improve-texass-grid-not-everyone-is-convinced\" data-v-f87c67ca=\"\">the potential consequences for its grid<\/a>. \"ERCOT expects sufficient generation to meet forecasted demand,\" ERCOT told The Block via email Thursday.","Many Bitcoin miners in the state have set agreements with ERCOT to power down at peak energy demand times. Advocates say this kind of flexibility can be an asset to the grid.","Bitdeer said that while this week's record-breaking temperatures were unusual, the company would respond as it normally does when demand goes up. The company curbs power during times of peak demand on the grid and when electricity prices get too high. It responds to signals from its retail electric provider, ERCOT traders, and power consultants.","\"We curtailed operations on June 7 during the late afternoon and will continue to do so when monitoring usage on the grid as well as rising temperatures,\" a Bitdeer spokesperson said via email. \"We power down by using automated software triggers when power costs reach certain price points,\" they added.","Bitcoin miner Argo said earlier this week that it had <a href=\"https:\/\/www.theblockcrypto.com\/linked\/150523\/argo-mined-25-less-bitcoin-in-may\" data-v-f87c67ca=\"\">mined 25% less bitcoin in May<\/a> for a variety of reasons — one of them being the time it had shut off power due to higher temperatures.&nbsp;","\"That was probably worth about five bitcoin, in terms of higher temperatures,\" Argo CEO Peter Wall <a href=\"https:\/\/twitter.com\/ArgoBlockchain\/status\/1534139268645494784\" data-v-f87c67ca=\"\">said in a video posted Tuesday<\/a>. \"We voluntarily curtailed a couple of times. Energy prices went up, we gave that power back to the grid and that happened on a couple of occasions.\"","Riot has recently indicated that it would also likely be curtailing operations this week as temperatures went up.","\"Next week they’re predicting 100 degrees, 5 days of 100 degrees. (...) We will turn out power off and during that time that power that we’re not using can be used in the grid itself so that it can support two or 300,ooo homes in and around our community,\" said Chad Harris, Riot's chief commercial officer on May 31 <a href=\"https:\/\/www.youtube.com\/watch?v=vfjhacVwT-w\" data-v-f87c67ca=\"\">in a video the company recently published.<\/a> \"We already know, we’re already setting up, we’re checking everything.\"","Harris was speaking at the company's Whinestone facility, which is expected to reach a total capacity of 750 megawatts when fully built out.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"June 23, 2021","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Chad Harris","content":"PERSON"},{"type":"Peter Wall","content":"PERSON"},{"type":"June 7","content":"DATE"},{"type":"Harris","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"June","content":"DATE"},{"type":"May 31","content":"DATE"},{"type":"Electric Reliability Council of Texas (ERCOT)","content":"ORGANIZATION"},{"type":"Argo","content":"PERSON"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}