{"summary":"Uniswap creator Hayden Adams and two Paradigm developers have sketched out a way to make large Ethereum trades on a DEX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112820\/uniswap-creator-paradigm-devs-are-building-a-way-to-improve-large-ethereum-trades-in-defi","publishDate":"2021-07-28T12:31:59","id":906,"type":null,"title":"Uniswap creator, Paradigm devs are trying to improve large DEX trades","category":["DEFI"],"content":["Uniswap creator Hayden Adams and two Paradigm developers, Dave White and Dan Robinson, are building a market making system for executing large trades on Ethereum.&nbsp;","Uniswap is Ethereum’s biggest decentralized exchange (DEX) while Paradigm is a crypto asset investing firm, which <a href=\"https:\/\/www.theblockcrypto.com\/post\/112014\/ftx-900-billion-funding-round\" data-v-f87c67ca=\"\">recently participated<\/a> in FTX’s $900 million round.","According to a <a href=\"https:\/\/twitter.com\/_Dave__White_\/status\/1420398743988310024?s=20\" data-v-f87c67ca=\"\">tweet thread<\/a> by White and a <a href=\"https:\/\/www.paradigm.xyz\/2021\/07\/twamm\/\" data-v-f87c67ca=\"\">paper<\/a> published on the Paradigm website, the idea is to build what they call a Time-Weighted Average Market Maker, or TWAMM.&nbsp;","Currently, most DEXs use automated market makers (AMMs), where liquidity providers create pools of funds that DEX users can trade with. But, the paper argues (referencing <a href=\"https:\/\/www.paradigm.xyz\/2021\/04\/understanding-automated-market-makers-part-1-price-impact\/\" data-v-f87c67ca=\"\">this article<\/a>) that these are inefficient and expensive for large trades.","Instead, it proposes a technique used in traditional finance: splitting orders up into many smaller pieces and executing them over a given timeframe.","“It breaks long-term orders into infinitely many infinitely small pieces and executes them smoothly against its embedded AMM over time,” tweeted White.","One key issue here is transaction fees. Every Ethereum transaction has to pay a transaction fee and these can be quite expensive, particularly for complex transactions like ones typically used by DEXs. White said, however, that this proposal manages to execute the trades in a way that’s efficient for transaction fees (using some “lucky math”).","But the idea is still in its early stages. White added: “We've sketched out the design of the TWAMM, but our work is just beginning.” He called for further developers to join them in working on this particular project.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hayden Adams","content":"PERSON"},{"type":"Dave White","content":"PERSON"},{"type":"$900 million","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"White","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Dan Robinson","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["ETHEREUM","PARADIGM","UNISWAP"],"authors":["Tim Copeland","The Block"]}