{"summary":"Grayscale CEO Michael Sonnenshein remains uncertain about a spot bitcoin ETF refiling — despite a “huge win” against the U.S. Securities and Exchange Commission.\nGBTC shares fell back 4% yesterday after initially surging 17% following Tuesday’s court ruling.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248247\/grayscale-ceo-spot-bitcoin-etf-refiling","publishDate":"2023-08-31T05:48:50","id":906,"type":null,"title":"Grayscale CEO uncertain about spot bitcoin ETF refiling despite &#x27;huge win&#x27;","category":["Regulation"],"content":["Grayscale Investments CEO Michael Sonnenshein said he was unsure whether the crypto asset manager needs to refile its application with the United States Securities and Exchange Commission to convert its GBTC product to a spot bitcoin ETF — despite its \"huge win\" against the agency.","<a href=\"https:\/\/www.theblock.co\/post\/246115\/court-hands-grayscale-win-in-long-running-suit-against-sec\" data-v-f87c67ca=\"\">The United States appeals court overturned the SEC's block on Grayscale's proposed spot bitcoin ETF<\/a> on Tuesday, stating the agency's denial of Grayscale's proposal was \"arbitrary and capricious.\"","\"We will have to see upon the final operational procedures that come through that final mandate that the court will issue,\" <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-08-30\/grayscale-gbtc-ceo-sonnenshein-unsure-if-firm-has-to-refile-for-bitcoin-etf\" data-v-f87c67ca=\"\">Sonnenshein said in an interview with Bloomberg television<\/a> on Wednesday regarding a potential refiling.","The SEC has 45 days to request a rehearing. Beyond this period, the court will issue a final mandate and further directives. \"We don’t know what the final opinion will say until we reach the end of that period,\" Sonnenshein added.","Following the ruling, the SEC can either approve the conversion of GBTC into an ETF, deny it for some other reason or force the closure of existing futures-based bitcoin ETFs, according to The ETF Store President Nathan Geraci.&nbsp;The Grayscale Bitcoin Trust is a digital asset investment product that individual investors can buy and sell in their brokerage accounts.","<a href=\"https:\/\/www.theblock.co\/post\/247959\/grayscale-bitcoin-trust-discount-shrinks-after-legal-victory\" data-v-f87c67ca=\"\">GBTC discount to net asset value narrowed from -25% to -17%<\/a>, while <a href=\"https:\/\/www.theblock.co\/post\/247947\/bitcoin-price-soars-after-grayscale-win-in-dispute-with-sec\" data-v-f87c67ca=\"\">bitcoin's value surged by 5.4% to $27,450 immediately following the court's decision<\/a>. However, GBTC fell back 4% yesterday as the market reflected on the potential for conversion.","“The discount shows that the market is more confident in conversion today than they were a few days ago, but still not completely confident that GBTC will convert,” Bloomberg analyst James Seyffart said.","It remains uncertain whether Grayscale will refile if directed, especially as GBTC charges a 2% fee — notably higher than typical ETF charges. However, Sonnenshein reiterated that the company is “committed to lowering fees when GBTC converts to an ETF.”","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/structured-products\/premium-of-gbtc\/embed\" title=\"Daily GBTC Premium\/Discount to NAV\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","&nbsp;","Grayscale’s legal victory could also have broader implications for pending spot bitcoin ETF applications.","Upcoming deadlines for the SEC’s decision to approve, reject or delay proposals from BlackRock, Bitwise, VanEck, WisdomTree, Invesco, Fidelity and Valkyrie fall from Sept. 1 to Sept. 4. However, delays are broadly anticipated so soon after the court ruling.","“There really shouldn’t be any further grounds like the SEC has been relying on to continue denying these types of products from coming to market,” Sonnenshein said.","Yesterday, <a href=\"https:\/\/www.theblock.co\/post\/248122\/bloomberg-analysts-estimate-75-per-cent-chance-spot-bitcoin-etf-2023\" data-v-f87c67ca=\"\">Bloomberg analysts said they now estimate a 75% probability of a spot bitcoin ETF launching in 2023<\/a>&nbsp;— with it being almost a \"done deal\" by the end of 2024."],"hashtag":["SEC"]}