{"summary":"ZkSync has released details on its Layer 3 technology and what it believes will unlock crypto’s “10x moments,” similar to the early days of the internet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174169\/zksync-head-of-product-sees-starfield-of-10x-moments-for-layer-3","publishDate":"2022-09-30T19:47:11","id":9062,"type":null,"title":"ZkSync head of product sees &#x27;starfield of 10x moments&#x27; for Layer 3","category":["LAYER 2S AND SCALING"],"content":["There are a vast number of similarities between the early days of the internet and where the blockchain industry is today, Newcomb said.","In 1995, the average internet speed was around 10kB and there were fewer than 30,000 websites. In just 10 years, those speeds had vastly increased, ease of use to build had improved, and the number of websites created surpassed 6 billion.","The 10x moments are defined by improvements in the following areas: Speed, the costs to build, the ease of building, and trust, Newcomb said.","ZkSync’s Layer 2 mainnet launches on Oct 28. Upon launch, its Layer 2 solution is expected to increase transactions per second (TPS) by around 10-20 times, compared with Ethereum, and enable developers to build zero knowledge-based applications using the industry standard Solidity language. This obviates the difficult task of learning a native ZK language to build applications.","“Think of Layer 2 as one-blockchain-size-fits-them-all. It scales Ethereum by anywhere from 10 to 100x. When you get up into Layer 3, I would say it’s a starfield of 10x moments,” Newcomb said on <a href=\"https:\/\/www.theblock.co\/post\/173663\/zksync-head-of-product-ethereum-learning-to-scale-will-be-like-coming-out-of-platos-cave?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">The Scoop.<\/a>","Layer 3s could enable massive increases in TPS, native bridging that removes non-native bridge hacks, and unlock brand new uses for blockchain technology via application customization.","At the Layer 3 level, developers can choose what data they want for security and privacy, enabling huge increases in TPS by allowing developers to customize their chain exactly to their project's needs.","Newcomb used the analogy of a game to illustrate the concept. Within a game environment, it’s important that credit card information has the highest security and privacy guarantees to ensure no user information is stolen. Conversely, specific game data like the color of an in-game item does not need to have the same security or privacy guarantees, he said.","Layer 3s give developers the ability to choose what specific data they pay for to have on-chain security from Ethereum. The data that is not can be ported off-chain to a validium, which reduces transaction fees to practically zero.","ZKSync’s solution will also aim to address bridge hacks, a primary concern plaguing the industry with more than <a href=\"https:\/\/www.cnbc.com\/2022\/08\/10\/hackers-have-stolen-1point4-billion-this-year-using-crypto-bridges.html\" data-v-f87c67ca=\"\">$1.4 billion stolen<\/a> and counting.","“We have found a way to make the bridges between blockchains and Layer 3 to be native, and that’s huge because that’s a 10x moment for security, and that’s because of the way our prover works. So if all the blockchains in Layer 3 are approved by one proven technology, then they all share what’s called a circuit, and as long as you’re on that circuit, then all bridges are native.”","The ability to code using native Solidity, see huge increases in TPS, and mitigate one of the largest security issues in the industry are three 10x moments zkSync and its Layer 3 architecture provide.","The final 10x moment of improving ease of use for developers comes from its LLVM compiler, which enables the building of applications in almost any coding language – all while tapping into the above Layer 3 benefits.","“I can see a day when we open our browser and instead of seeing a lock icon in the top left... we see the Ethereum icon — that’s the sort of stuff that happens up because of Layer 3,” Newcomb said.","<iframe frameborder=\"0\" height=\"482\" src=\"https:\/\/playlist.megaphone.fm\/?e=BLOCK5904485029\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<em data-v-f87c67ca=\"\">Correction: This story has been updated to correct the spelling of Steve Newcomb's name.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.4 billion","content":"MONEY"},{"type":"1995","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Steve Newcomb","content":"PERSON"},{"type":"Newcomb","content":"PERSON"},{"type":"Oct 28","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["CRYPTO","ZKSYNC"],"authors":["Mike Truppa","The Block"]}