{"summary":"Decentralized exchange Velodrome has released Aerodrome on Coinbase’s Layer 2 Base network on Monday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247698\/velodrome-to-launch-new-dex-on-coinbases-base-network","publishDate":"2023-08-28T11:37:45","id":9064,"type":null,"title":"Velodrome launches new DEX on Coinbase&#x27;s Base network","category":["CRYPTO ECOSYSTEMS"],"content":["Velodrome Finance, the largest decentralized exchange protocol on OP Mainnet (previously Optimism) in terms of both total value locked and revenue, has deployed a new forked DEX called Aerodrome later today. The new exchange will operate on Coinbase’s Layer 2 Base network and is set to release with the support of over 20 partners.","<a href=\"https:\/\/www.theblock.co\/post\/160078\/velodrome-crosses-100-million-in-tvl-on-optimism\" data-v-f87c67ca=\"\">Velodrome<\/a> has a total value locked of <a href=\"https:\/\/defillama.com\/protocol\/velodrome\" data-v-f87c67ca=\"\">$194 million<\/a>, confirming its position as the largest DeFi protocol on the <a href=\"https:\/\/www.theblock.co\/post\/246922\/decentralized-social-media-farcaster-to-migrate-to-op-mainnet?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">OP Mainnet<\/a>.","According to the development team, it intends to capture a significant portion of both liquidity and value exchange on the Base network, similar to their operations on OP Mainnet, by leveraging elaborate DeFi incentives referred to as a \"<a href=\"https:\/\/www.theblock.pro\/research\/velodrome-experiences-boosted-growth-with-incentives-flywheel-244691\" data-v-f87c67ca=\"\">flywheel<\/a>.\"","“Velodrome’s dominance on OP Mainnet is due to its ecosystem-native liquidity layers, which have outperformed multi-chain DEXs and we aim to do the same on Base as with Aerodrome,” Alexander Cutler, the project’s co-founder, said on the strategy behind the launch.","The newly launched DEX plans to incentivize users through an airdrop of its native Aero token. The drop will be for existing users that have locked (or vote-escrowed) Velodrome (VELO) tokens in exchange for veVELO, the project's governance token.","At the time of Aerodrome’s launch, 40% of the initial Aero token supply will be distributed to veVELO holders as veAERO.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DEX","content":"ORGANIZATION"},{"type":"Alexander Cutler","content":"PERSON"},{"type":"Velodrome Finance","content":"ORGANIZATION"},{"type":"$194 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"OP Mainnet","content":"ORGANIZATION"},{"type":"Aero","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}