{"summary":"The multi-chain future is here. Ethereum was initially home for DeFi, but since then, dApps like Aave, Sushiswap, and others have expanded to many other chains like Avalanche, and the L2s like Optimism and Arbitrum.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/143393\/hashflow-introduces-bridgeless-cross-chain-swaps","publishDate":"2022-04-29T09:00:10","id":9068,"type":null,"title":"Hashflow Introduces Bridgeless Cross-chain Swaps","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">The multi-chain future is here. Ethereum was initially home for DeFi, but since then, dApps like Aave, Sushiswap, and others have expanded to many other chains like Avalanche, and the L2s like Optimism and Arbitrum.<\/span>","Total TVL leaving Ethereum to other chains has expanded dramatically over the past year","<span data-v-f87c67ca=\"\">The proliferation of many high quality Layer 1 blockchains and Layer 2 roll-ups meant that DeFi users could now trade, lend, borrow and earn yield across a variety of new ecosystems. And the key to unlocking all of that value was being able to bridge assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, instead of just bridging assets and using them in the same dApp on a different chain, what if we could create apps from the ground up that spanned multiple chains? What if we could do native cross-chain swaps? Ie. imagine selling ETH on Ethereum and receiving AVAX on Avalanche, in one single transaction!<\/span>","<span data-v-f87c67ca=\"\">While this opens up a whole host of opportunities, it also leads to new problems we may not have thought about before. Eg. How do you handle slippage in an asynchronous cross-chain environment? Traditional AMMs will have issues adapting on-chain pricing systems into a native cross-chain application because of the time delay involved. Even if the cross-chain channel experiences a slight delay, an order can fail completely due to slippage, which is harder to unwind once we’ve left the boundaries of one chain.<\/span>","<span data-v-f87c67ca=\"\">Additionally, <\/span><a href=\"https:\/\/arxiv.org\/abs\/2112.01472\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">cross-domain MEV<\/span><\/a><span data-v-f87c67ca=\"\"> will increasingly be a focus of smart arbitrageurs across the multi-chain ecosystem. MEV is a scourge in DeFi trading on Ethereum, leading to front-running, back-running, sandwich attacks – all of which lead to worse prices for users. Now, add the complexity of multi-chain relaying, where MEV can be spotted miles away. Cross-chain AMM swaps are a disaster waiting to happen.<\/span>","<span data-v-f87c67ca=\"\">This is where <\/span><a href=\"https:\/\/hashflow.com\/?utm_source=article&amp;utm_medium=link&amp;utm_campaign=the_block_2022_4_29\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Hashflow<\/span><\/a><span data-v-f87c67ca=\"\"> cross-chain swaps shine. Hashflow allows users to have the experience of trading any asset on any pairs of chains they desire. Hashflow fully protects traders from both slippage and MEV by requiring market makers to sign price quotes that remain unchanged for the duration of the trade. That means no slippage, whether the trade happens locally on one chain, or across chains. Let’s unpack that again – no matter where users initiate a trade, they can receive their assets on <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">any<\/span><\/i><span data-v-f87c67ca=\"\"> destination, without losing any value! And there’s no way to front-run or sandwich this trade since MEV bots cannot tamper with a signed quote.<\/span>","","","<span data-v-f87c67ca=\"\">Initially launched on Ethereum, Hashflow gives users the most powerful DeFi trading experience, period. No bonding curves, and no slippage – users simply request quotes from leading market makers and submit them trustlessly on-chain. By leveraging off-chain digital signatures, Hashflow is able to give market makers more control over their pricing algorithms, leading to better prices for end users. And the best part? Exactly the same experience in cross-chain swaps.<\/span>","<span data-v-f87c67ca=\"\">Hashflow’s Bridgeless Cross-chain Swaps are now live, and users can trade popular spot assets <\/span><b data-v-f87c67ca=\"\">natively across Ethereum, BNB Chain, Polygon, Avalanche, and Arbitrum<\/b><span data-v-f87c67ca=\"\"> - all facilitated by off-chain market makers. (Note: This is an experimental feature in alpha, so please only trade what you are comfortable with).<\/span>","<span data-v-f87c67ca=\"\">After launch, Hashflow will be focused on expanding to more ecosystems including Solana, Cosmos, Polkadot and others. To understand the possibilities, imagine being able to swap ETH directly for SOL, without ever having to manually bridge and then use an AMM. In the future, Hashflow will include other assets including options, derivatives and more than just spot markets.<\/span>","<span data-v-f87c67ca=\"\">Hashflow has always brought the best of CeFi to DeFi, and this remains true even in a multi-chain world.<\/span>","&nbsp;","<span data-v-f87c67ca=\"\">Start <\/span><a href=\"https:\/\/app.hashflow.com\/?utm_source=article&amp;utm_medium=link&amp;utm_campaign=the_block_2022_4_29\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">trading on Hashflow<\/span><\/a><span data-v-f87c67ca=\"\"> today.<\/span>","&nbsp;","<span data-v-f87c67ca=\"\">Website: <\/span><a href=\"https:\/\/hashflow.com\/?utm_source=article&amp;utm_medium=link&amp;utm_campaign=the_block_2022_4_29\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">hashflow.com<\/span><\/a>","<span data-v-f87c67ca=\"\">Twitter: <\/span><a href=\"https:\/\/twitter.com\/hashflownetwork\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/twitter.com\/hashflownetwork<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;<\/span>","&nbsp;","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">This post is commissioned by Hashflow and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/span><\/em><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hashflow","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Sushiswap","content":"LOCATION"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"AMM","content":"ORGANIZATION"},{"type":"Hashflow","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Arbitrum","content":"PERSON"},{"type":"ups","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}