{"summary":"Compass Mining obtained a court order granting the bitcoin miner access to its machines hosted with Dynamics Corp. in Maine.\nThe two companies have been in conflict for the past month over claims of missed payments and ‘hostage’ hardware.","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156896\/compass-mining-recovers-machines-from-hosting-provider-following-court-order","publishDate":"2022-07-11T13:26:51","id":907,"type":null,"title":"Compass Mining recovers machines from hosting provider following court order","category":["Mining"],"content":["Compass Mining has recovered the miners hosted at a facility in Maine operated by Dynamics Corp, which the miner had sued over a <a href=\"https:\/\/www.theblock.co\/post\/154356\/bitcoin-mining-firms-compass-and-dynamics-spar-over-payments-and-hostage-hardware\" data-v-f87c67ca=\"\">conflict that started with claims of missed payments.<\/a>","A court order issued on July 5 granted Compass access to the machines, the company <a href=\"https:\/\/compassmining.io\/education\/compass-mining-recovers-wrongfully-possessed-maine-mining-equipment\/\" data-v-f87c67ca=\"\">announced in a blog post on Friday<\/a>.","Per the miner, the court prohibited the facility, Dynamics Corp, from \"operating, moving, or otherwise disposing of the equipment\" and stated that Compass had the right to access the facility.","Compass sued Dynamics Corp on June 21, accusing the hosting provider of holding its machines \"hostage,\" <a href=\"https:\/\/www.law360.com\/articles\/1504872\/crypto-miner-says-hosting-co-is-holding-machines-hostage\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">according to Law360<\/a>.","Dynamics Corp <a href=\"https:\/\/twitter.com\/DynamicsMining\/status\/1541403191815950337\" data-v-f87c67ca=\"\">claimed on Twitter<\/a> that Compass had missed some of its power payments. The miner denied those accusations, claiming in a blog post that it had fulfilled all its contractual obligations.","&nbsp;\"It appears that Dynamics misunderstood the contracts that it signed with respect to its facilities and its obligations thereunder,\" it said.","Compass is now shipping back all the units from the Maine facility to its logistics and repair hub in Denver.","The company hosts mining machines from individual clients in facilities across the US and Canada. Following the court's decision, the miner has given clients the option to take back their equipment, per the statement. At the same time, it is looking for a new provider to host the remaining machines.","Compass has also faced some turmoil internally in the past couple of weeks. Its <a href=\"https:\/\/www.theblock.co\/post\/154645\/compass-mining-ceo-and-cfo-resign-as-company-cites-multiple-setbacks-and-disappointments\" data-v-f87c67ca=\"\">CEO and CFO resigned<\/a> at the end of June, as the company cited \"multiple setbacks and disappointments.\" And last week, the company announced it was <a href=\"https:\/\/www.theblock.co\/post\/156439\/compass-mining-cuts-staff-by-15-reduces-salaries-for-senior-employees\" data-v-f87c67ca=\"\">cutting staff by 15%<\/a> and reducing senior-level salaries."],"hashtag":[]}