{"summary":"Nomura&#x27;s Laser Digital division has invested in Near-based DeFi infrastructure protocol Orderly Network via a SAFT round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/181701\/nomura-laser-digital-invests-orderly-network-token-round","publishDate":"2022-11-01T09:00:57","id":9071,"type":null,"title":"Nomura unit invests in Orderly Network&#x27;s token round at $200 million valuation","category":["VENTURE CAPITAL"],"content":["Laser Digital, the crypto subsidiary of Japanese banking giant Nomura, has joined the roster of investors in Orderly Network, a DeFi infrastructure protocol built on the Near blockchain.","The capital injection is additional to the $20 million seed round <a href=\"https:\/\/www.theblock.co\/linked\/150730\/orderly-bags-20-million-raise-in-boost-for-defi-protocol\" data-v-f87c67ca=\"\">raised<\/a> in June from several backers, including Sequoia China, Pantera Capital, Dragonfly and Jump Crypto, Orderly Network said in an announcement. While the size of Laser Digital's investment wasn't disclosed, co-founder Ran Yi told The Block that it valued Orderly Network at $200 million — the same valuation attained in the seed round.&nbsp;","Orderly Network raised the funds from Laser Digital and previous backers via a simple agreement for future tokens (SAFT), Yi told The Block. The deal is Laser Digital's first publicly announced crypto investment since Nomura <a href=\"https:\/\/www.theblock.co\/post\/171700\/banking-giant-nomura-launches-crypto-vc-unit\" data-v-f87c67ca=\"\">set up<\/a> the unit in September and represents a rare foray into token investing for a bank.&nbsp;","\"Orderly is one of our first investments given its unique position of having access to deep liquidity and an order book matching engine that can accommodate high throughput and rate limits,\" Olivier Dang, head of ventures at Laser Digital, said in the announcement.","Orderly Network is a decentralized trading infrastructure protocol that allows projects to build DeFi applications. It was incubated by the Near Foundation and Woo Network. Woo Network's decentralized exchange, WooFi, is based on Orderly's infrastructure and liquidity. Orderly's mainnet went live last month and a native token will follow sometime next year, said Yi.","With fresh capital in hand from Laser Digital, Orderly Network plans to increase its team size from current around 40 people to about 50 by the end of this year by hiring across product and engineering functions, Arjun Arora, chief operating officer at Orderly Network, told The Block.","Laser Digital plans to invest in around 20 crypto startups per year, backing their early-stage to Series A rounds, according to a person familiar with the matter. The firm is particularly interested in crypto and DeFi infrastructure startups focused on serving institutions and business-to-business clients, the person said.&nbsp;","While the Nomura unit's current focus is venture capital, it also plans to enter into crypto trading, market making and asset management in the future, the person said.","Nomura itself has also invested in several crypto startups, including Bullish, Crypto Garage and Komainu — and also incubated the latter with Ledger and CoinShares. But those are all equity investments. With Laser Digital, the Japanese bank is open to backing both equity and token rounds of crypto startups, the person said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Laser Digital","content":"ORGANIZATION"},{"type":"Crypto Garage","content":"ORGANIZATION"},{"type":"Sequoia China","content":"LOCATION"},{"type":"Nomura","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Near Foundation","content":"ORGANIZATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"Orderly Network","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Jump Crypto","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Orderly Network","content":"ORGANIZATION"},{"type":"$20 million","content":"MONEY"},{"type":"Olivier Dang","content":"PERSON"},{"type":"last month","content":"DATE"},{"type":"Arjun Arora","content":"PERSON"},{"type":"$200 million","content":"MONEY"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}