{"summary":"The beverage company has partnered with digital art creator Tafi to release a collection of NFTs inspired by the Coca-Cola brand.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112779\/coca-cola-creates-its-first-collection-of-brand-inspired-nfts","publishDate":"2021-07-28T10:10:02","id":9072,"type":null,"title":"Coca-Cola creates its first collection of brand-inspired NFTs","category":["NFTS"],"content":["Can't find a personalized Coca-Cola bottle with your name on it? Maybe you'll score a customized digital wearable instead.&nbsp;","Coca-Cola has partnered with digital art and avatar company Tafi to launch its first collection of NFTs, or non-fungible tokens. NFTs are unique digital collectibles that exist on the blockchain and represent different types of files like images, audio, and video.&nbsp;","The <a href=\"https:\/\/maketafi.com\/coca-cola-nft\" data-v-f87c67ca=\"\">collection<\/a>, which Coca-Cola is offering to celebrate International Friendship Day on July 30, features an NFT \"loot box\" which contains digital wearables designed by Tafi.","Buyers can bid on the Coca-Cola Friendship Box, a digital version of a collectible vending machine, which comes with three one-of-a-kind digital assets: a custom Coca-Cola Bubble Jacket Wearable, which can be worn in virtual world Decentraland; The Sound Visualizer, which captures different audio cues like the pop of a bottle opening or the sound of the soda being poured over ice; and The Friendship Card, a digital design inspired by the company's friendship-inspired trading cards released in the 1940s.&nbsp;","\"Each NFT was created to celebrate elements that are core to the Coca-Cola brand reinterpreted for a virtual world in new and exciting ways,\" said president of the global Coca-Cola trademark, Selman Careaga. \"We are excited to share our first NFTs with the metaverse where new friendships are being forced in new ways in new worlds.\"","Besides the one-of-a-kind collectibles, the winning bidder will also have access to \"additional unique and valuable surprises,\" which will be unveiled when the loot box is digitally opened.","The sale, which will take place on popular NFT marketplace OpenSea, will open on July 30 and close on August 2. All bids must be placed with ETH.&nbsp;","All Coca-Cola proceeds from the auction will be donated to <a href=\"https:\/\/www.specialolympics.org\/\" data-v-f87c67ca=\"\">Special Olympics International<\/a>, a global sports organization that provides children and adults with intellectual and physical disabilities, with year-round training and activities.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Special Olympics International","content":"ORGANIZATION"},{"type":"July 30","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"International Friendship Day","content":"ORGANIZATION"},{"type":"Selman Careaga","content":"PERSON"},{"type":"August 2","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"1940s","content":"DATE"},{"type":"Cola","content":"ORGANIZATION"},{"type":"Decentraland","content":"LOCATION"},{"type":"Tafi","content":"PERSON"}],"hashtag":[],"authors":["Saniya More","The Block"]}