{"summary":"Bitcoin will always have buyers said Silvergate CEO Alan Lane, in a summit where he addressed the company&#x27;s stance amid market conditions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188238\/silvergate-ceo-sees-silver-lining-for-bitcoin-there-are-always-buyers","publishDate":"2022-11-17T19:58:25","id":9075,"type":null,"title":"Silvergate CEO sees silver lining for bitcoin: &#x27;There are always buyers&#x27;","category":["CENTRAL BANKS"],"content":["<span data-v-f87c67ca=\"\">Among cryptocurrencies, bitcoin is apart from the rest, Silvergate CEO Alan Lane said during the Oppenheimer Blockchain &amp; Digital Assets Summit: Web 3.0 and the Creator Economy.<\/span>","<span data-v-f87c67ca=\"\">Silvergate’s strong capital reserves and over-collateralized loan balances put the company in a strong position to weather this and forthcoming market cycles, Lane said.<\/span>","<br data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","<span data-v-f87c67ca=\"\">Silvergate CEO Alan Lane said that bitcoin stands out from other digital currencies even amid the ongoing turmoil in crypto markets. <\/span>","<span data-v-f87c67ca=\"\">He pointed, as evidence, to the breakdown of volumes of the Silvergate Exchange Network (SEN).<\/span>","<span data-v-f87c67ca=\"\">“I do think that bitcoin is separate from everything and that’s evident by how well the price has held up and by the fact that we still have an active performing SEN leverage book where we’re lending against bitcoin,” Lane said in a mid-quarter update.<\/span>","<span data-v-f87c67ca=\"\">Markets are still exhibiting a downward trend in the wake of the collapse of FTX, volatility that Silvergate was built to withstand so that customers can access U.S. dollar transfers around the clock, Lane said. He added, “whether deposits are up or down, we have the liquidity and the capital ratios to support the volatility.”<\/span>","<span data-v-f87c67ca=\"\">Silvergate claimed limited exposure to FTX with no outstanding loans, and deposits on the exchange amounting to less than 10% of $11.9 billion in customer digital asset deposits. That amount was still enough to <\/span><a href=\"https:\/\/www.theblock.co\/post\/187315\/silvergate-stock-sinks-12-on-ftx-links\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ruffle investors' feathers<\/span><\/a><span data-v-f87c67ca=\"\">, and send the company’s shares falling by 12%.<\/span>","<span data-v-f87c67ca=\"\">The market may be reeling, but Lane remained optimistic pointing out “there are always buyers, especially with bitcoin,” adding “we’ll get through this as we have prior cycles and continue to serve the industry.”<\/span>","<span data-v-f87c67ca=\"\">In terms of market-contagion risks associated with FTX, Lane said that “leveraging a token that did not have any value” was the core source of instability — seemingly in reference to the exchange's token, FTT. “That is not what Silvergate does. We move U.S. dollars,” he said.<\/span>","<span data-v-f87c67ca=\"\">For the company’s bitcoin collateralized lending product, mid-quarter there have been no losses or forced liquidations, Lane said, affirming that collateralized lending will remain solely focused on bitcoin.<\/span>","<span data-v-f87c67ca=\"\">“We don’t lend against any of these other tokens, and so we feel very good about that portfolio,” said Lane, pointing out that in the third quarter $300 million in outstanding bitcoin collateralized loans were backed by approximately $770 million in bitcoin, putting the company in a healthy position.<\/span>","<span data-v-f87c67ca=\"\">As far as general market growth, behind the U.S. dollar, Lane said that Euro markets show the most global traction for crypto to fiat exchanges. Although no additional SEN listings were announced, Lane noted that the basis for SEN to support new markets is based on the ability to trade and manage custody efficiently with correspondent banks and foreign currency trading partners.<\/span>","<span data-v-f87c67ca=\"\">On Silvergate’s future slated “tokenized dollar” stablecoin project, which the company previously said it would <\/span><a href=\"https:\/\/www.theblock.co\/post\/178173\/heres-why-silvergate-is-delaying-its-planned-stablecoin-launch\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">hold off<\/span><\/a><span data-v-f87c67ca=\"\"> launching earlier this year, Lane said that regulators are more likely to endorse permissioned networks.<\/span>","<span data-v-f87c67ca=\"\">While Lane doesn’t foresee Silvergate’s stablecoin disrupting credit card networks, he said that the settlement process would be fundamentally different, as credit cards serve as an extension of a messaging system and are not representative of final settlement.<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silvergate","content":"ORGANIZATION"},{"type":"$770 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"FTT","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Lane","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"12%","content":"PERCENT"},{"type":"Euro","content":"ORGANIZATION"},{"type":"Silvergate Exchange Network (SEN","content":"ORGANIZATION"},{"type":"$11.9 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Alan Lane","content":"PERSON"},{"type":"Oppenheimer Blockchain &amp; Digital","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$300 million","content":"MONEY"}],"hashtag":["FTX"],"authors":["Jeremy Nation","The Block"]}