{"summary":"When or if it becomes a reality is unknown but Roblox talking favorably about a future where NFTs work on the platform bodes well for web3.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262523\/roblox-ceo-teases-allowing-nfts-offers-elton-john-capes-as-example","publishDate":"2023-11-09T19:53:21","id":908,"type":null,"title":"Roblox CEO teases allowing NFTs, offers Elton John capes as example","category":["METAVERSE & NFT"],"content":["Roblox already earns hundreds of millions of dollars each quarter selling its own digital currency players use to purchase assets that work on its closed platform. But the company's founder and CEO David Baszucki can still envision eventually opening up the Roblox ecosystem to allow non-fungible tokens to be used both on his platform and others.","\"I want to highlight there's a bit of a dream here about objects and NFTs moving from platform to platform,\" said Baszucki during an <a href=\"https:\/\/www.youtube.com\/watch?v=PDr5pc9pgy4\" data-v-f87c67ca=\"\">interview on CNBC<\/a> when asked about opening up the Roblox platform to interoperability, a concept key to many people's hope for how the metaverse should function.","It wasn't clear if Baszucki was suggesting he and his colleagues shared the \"dream\" of interoperability, but he did offer a scenario he's considered. \"We do believe some day, for example ... I use the fun use case that someday Elton John may come on Roblox and make eight or ten one-unit, really cool capes, for example, and sell them for charity. And we would imagine some day that those would go off platform as an NFT, possibly get sold off platform, and then come back on platform.\"","With interoperability, digital assets, like NFTs, would be able to operate and function on various platforms — a departure from the closed ecosystems that currently exist where an avatar or item only works for one specific platform.&nbsp;","Baszucki also said he expects if that allowing interoperable NFTs on Roblox came to fruition, the creator, whether it be Elton John or Nike — his examples — \"would play a key role and have a fair amount of control in that process.\" <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nFor its part, Nike has invested in NFTs, and <a href=\"https:\/\/www.theblock.co\/post\/261478\/nike-rtfkts-crypto-universe-nears-1-4-billion-in-nft-trading-as-sneakerheads-swoon\" data-v-f87c67ca=\"\">seen decent results<\/a>, with its phygital shoe line that allows consumers to purchase limited-edition shoes when owning certain tokens it sells.&nbsp;","This is not the first time a Roblox executive has teased the possibility of allowing NFTs on the platform. Back in 2022, Roblox's then Chief Business Officer Craig Donato <a href=\"https:\/\/venturebeat.com\/games\/craig-donato-interview-how-roblox-navigates-brands-ugc-and-the-metaverse\/\" data-v-f87c67ca=\"\">mentioned NFTs<\/a> some day working on the platform almost as if it was an inevitability. But he then went on to say that making the leap into NFTs didn't seem \"super important\" at the moment. Donato left Roblox earlier this year.","And as much of a boon as it could be for NFT adoption, considering Roblox now has more than 70 million daily active users, the lack of urgency is likely to continue for some time as the platform continues to grow its user base and earn a substantial sum from selling its own currency.&nbsp;","The company <a href=\"https:\/\/ir.roblox.com\/news\/news-details\/2023\/Roblox-Reports-Third-Quarter-2023-Financial-Results\/default.aspx\" data-v-f87c67ca=\"\">reported<\/a> on Wednesday that it had generated $839.5 million in bookings during this year's third quarter, a 20% increase from the same period a year ago. Roblox classifies “bookings” as the revenue generated when users purchase \"Robux,\" an in-app currency","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2022","content":"DATE"},{"type":"Craig Donato","content":"PERSON"},{"type":"$839.5 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"David Baszucki","content":"PERSON"},{"type":"John","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Baszucki","content":"PERSON"},{"type":"Roblox","content":"ORGANIZATION"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Nike","content":"ORGANIZATION"},{"type":"third quarter","content":"DATE"}],"hashtag":[],"authors":["RT Watson","The Block"]}