{"summary":"Binance Labs has invested an undisclosed sum in Puffer Finance, an Ethereum liquid restaking protocol built on EigenLayer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275102\/binance-labs-puffer-investment","publishDate":"2024-01-30T08:00:04","id":9082,"type":null,"title":"Binance Labs invests in Ethereum liquid restaking protocol Puffer","category":["VENTURE CAPITAL"],"content":["Binance Labs, the $10 billion venture capital and incubation arm of crypto exchange Binance, has invested in Puffer Finance, an Ethereum liquid restaking protocol built on EigenLayer.","Binance Labs did not disclose the investment amount, but it said that Puffer will utilize the funds to develop its Layer 2 network, which will operate as an EigenLayer Actively Validated Service. Additionally, the funds will be used to introduce Puffer's native liquid restaking token, pufETH, to BNB Chain users, enabling them to earn staking and restaking rewards, Binance Labs said Tuesday.","Binance Labs' investment in Puffer comes as the Ethereum restaking vertical has been gaining momentum since the launch of EigenLayer last June. Last week, ClayStack <a href=\"https:\/\/www.theblock.co\/post\/274139\/claystack-ethereum-restaking-reward-points-token-launch\" data-v-f87c67ca=\"\">entered<\/a> the Ethereum restaking space via EigenLayer, and earlier this month, EigenLayer-based Renzo Protocol launched in the beta phase and has already amassed assets worth over $155 million, according to <a href=\"https:\/\/app.renzoprotocol.com\/restake\" data-v-f87c67ca=\"\">data<\/a> on its website. EigenLayer itself currently boasts a total value locked of over $2 billion, according to DeFi Llama <a href=\"https:\/\/defillama.com\/protocol\/eigenlayer\" data-v-f87c67ca=\"\">data<\/a>.","\"At a high level, Puffer is Ethereum liquid staking where you earn proof of stake rewards with validators. However, we're also conducting native restaking on EigenLayer to generate additional rewards,\" explained Puffer co-founder and CTO Jason Vranek at an event last year. \"In native restaking, you're reusing your Ethereum validator's Beacon chain ETH to secure different Eigenlayer applications or 'AVSs.'\"","Before Binance Labs' investment, Puffer raised funds from other high-profile investors, including Brevan Howard Digital, Jump Crypto and Lightspeed Faction. The project <a href=\"https:\/\/www.prnewswire.com\/news-releases\/puffer-finance-raises-5-5m-seed-funding-to-strengthen-ethereum-decentralization--scalability-301896002.html\" data-v-f87c67ca=\"\">raised<\/a> a $5.5 million seed round last August and a $650,000 pre-seed round initially.","Puffer has previously also received a grant worth $120,000 from the Ethereum Foundation for its open-source tool called Secure-Signer. The tool allows Ethereum validators to reduce the risk of slashing or penalties.","Puffer is currently running a points system, rewarding users for restaking with the platform. A Binance Labs spokesperson said Puffer's mainnet is expected to go live \"soon.\" Puffer did not immediately respond to The Block's request for comment.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Brevan Howard Digital","content":"ORGANIZATION"},{"type":"Binance Labs","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$650,000","content":"MONEY"},{"type":"$5.5 million","content":"MONEY"},{"type":"$155 million","content":"MONEY"},{"type":"$120,000","content":"MONEY"},{"type":"Puffer","content":"LOCATION"},{"type":"$2 billion","content":"MONEY"},{"type":"August","content":"DATE"},{"type":"Puffer","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Jason Vranek","content":"PERSON"},{"type":"Renzo Protocol","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EigenLayer Actively Validated Service","content":"ORGANIZATION"},{"type":"EigenLayer last June","content":"DATE"},{"type":"Lightspeed Faction","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"Binance Labs spokesperson","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Jump Crypto","content":"LOCATION"},{"type":"Puffer Finance","content":"ORGANIZATION"}],"hashtag":["BINANCE","ETHEREUM","STRATEGIC INVESTMENTS","VALIDATORS"],"authors":["Yogita Khatri","The Block"]}