{"summary":"Bridgewater Associates founder Ray Dalio said that the digital yuan will be more competitive than the digital dollar.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/106712\/digital-yuan-more-competitive-digital-dollar-bridgewaters-ray-dalio","publishDate":"2021-05-31T09:55:13","id":9085,"type":null,"title":"Ray Dalio: Digital yuan will be more competitive than digital dollar","category":["CHINA"],"content":["Ray Dalio, a billionaire investor and the founder of the world's largest hedge fund Bridgewater Associates, has said that the digital yuan will be more competitive than the digital dollar.","In an interview with CNBC on Monday, <a href=\"https:\/\/www.cnbc.com\/video\/2021\/05\/31\/digital-chinese-yuan-will-be-a-viable-alternative-for-many-investors-says-ray-dalio.html\" data-v-f87c67ca=\"\">Dalio said<\/a> he thinks the U.S. will issue a digital dollar one day, and \"it will certainly be viable.\" But it won't be the most competitive one, with its value possibly hit by growing U.S. debt levels, he added.","The digital yuan, on the other hand, will be more competitive in terms of pricing and return, said Dalio. It will be \"a very viable alternative\" to many investors if it is accepted internationally and comes with attractive interest rates, he said.","\"I think we're going to enter a world in which people will be thinking which currency, and the ones that have the best fundamentals will be the ones that will be most competitive and that'll be threatening to countries,\" said Dalio.","Dalio also <a href=\"https:\/\/www.cnbc.com\/video\/2021\/05\/31\/ray-dalio-on-whether-china-yuan-could-become-a-global-reserve-currency.html\" data-v-f87c67ca=\"\">expects<\/a> China's yuan to become a top reserve currency sooner than expected.","China is currently the world's largest trading nation, meaning it is the number one country in exports and imports. Dalio expects more trade and more financial transactions to be denominated in yuan.","\"I think you're going to see the renminbi become a more significant, a strong currency, stable currency, more attractive-returning currency, and also a more widely used currency ... in the years ahead,\" said Dalio.","Currently, the dollar is the world's largest reserve currency with a share of nearly 60%, according to <a href=\"https:\/\/data.imf.org\/?sk=E6A5F467-C14B-4AA8-9F6D-5A09EC4E62A4\" data-v-f87c67ca=\"\">data<\/a> from the International Monetary Fund (IMF). China's yuan currently has a share of about 2%, behind the euro, Japanese yen, and British pound, per the IMF data. But Dalio expects the yuan share to increase to around 10% to 15% in five to 10 years' time.","\"I think incrementally it will happen faster probably than most people expect,\" he said. \"A lot has to do not just with what China does. It has to do with what the dollar does.\"","China is nearing the launch of its digital yuan after over six years of research and development, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/104540\/hands-on-china-new-digital-yuan-wallet\" data-v-f87c67ca=\"\">as The Block has previously reported<\/a>. The U.S., on the other hand, has only recently started exploring the idea of creating a digital version of its currency. The Federal Reserve <a href=\"https:\/\/www.theblockcrypto.com\/linked\/105583\/federal-reserve-cbdc-discussion-paper\" data-v-f87c67ca=\"\">plans to<\/a> publish a discussion paper this summer on the potential issuance of a digital dollar.","In the interview, Dalio also said that the digital yuan would compete with bitcoin, an \"alternative currency.\" But the digital yuan will not completely take over the crypto market, he said. \"Nothing ever completely takes over anything.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"International Monetary Fund (IMF","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2%","content":"PERCENT"},{"type":"Dalio","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"IMF","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Ray Dalio","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"euro","content":"ORGANIZATION"},{"type":"Bridgewater Associates","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Yogita Khatri","The Block"]}