{"summary":"Despite FTX&#x27;s high-profile failure, a small but vocal universe of the failed company&#x27;s clients want to see it back in action.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222461\/ftx-sbf-clients-want-reboot-despite-scam","publishDate":"2023-03-31T07:48:00","id":9099,"type":null,"title":"Some FTX clients want to reboot SBF&#x27;s collapsed crypto exchange","category":["POLICY"],"content":["Prosecutors alleged that the FTX collapse was “one of the biggest financial frauds in American history.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","That hasn’t stopped some customers from hoping the crypto exchange gets back in business.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Despite FTX’s headline-grabbing implosion, there is a small universe of FTX clients who want to see the exchange back in action. They track the troubled exchange’s financial statements in bankruptcy court, tally up the “reboot” meetings disclosed in lawyers’ hourly bills and document it all online.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“FTX is not SBF. … The management team that ruined the business is not involved in FTX anymore,” said Sunil Kavuri, an FTX creditor who says he has a seven-figure sum locked on the defunct exchange. Kavuri is suing former CEO Samuel Bankman-Fried and a raft of celebrities who endorsed FTX. “The underlying business, run properly, makes money. So for me, it makes zero economic sense to dismantle a profit-making business. And also it will generate returns in order to pay back users.”","The enthusiasm for reviving the exchange has left some industry experts scratching their heads.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Is there any goodwill left? Like, what is the value?” said Aaron Kaplan, the founder and co-CEO of Prometheum, a digital asset infrastructure firm. “Fool me once, shame on you. Fool me twice, shame on me.”","For his part, Bankman-Fried said through a spokesperson that he supports restarting his troubled crypto exchange. He noted FTX Japan resumed customer withdrawals last month.&nbsp;","“Mr. Bankman-Fried has said since day one that any exchange that is solvent should be reopened so customers can retrieve their funds. The exchange in Japan has already reopened, and Mr. Bankman-Fried believes that the U.S. exchange should open today,” Bankman-Fried spokesperson Mark Botnick said in a text message. R<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">ecent financial statements made in court by FTX officials contradict Bankman-Fried’s claim that FTX.US is solvent.<\/span>","Bankman-Fried is accused of using FTX customer funds to prop up his crypto trading firm Alameda Research, making illegal political donations, bank fraud, and bribing one or more Chinese government officials.&nbsp;","The former FTX boss, who had pleaded not guilty to all charges, could spend the rest of his life in jail if he is convicted.","Three members of Bankman-Fried’s inner circle have already pleaded guilty and are expected to testify against him in court. The former FTX CEO awaits an October trial.","Still, the small group of FTX customers rooting for a reboot insist there’s a valuable business underneath all the (alleged) fraud.&nbsp;","FTX collapsed in a blaze last fall. The crypto behemoth revealed it was short a stunning $8 billion in customer cash, its once-revered CEO left his Bahamian headquarters in handcuffs and 9 million users were locked out of their accounts. The unlikely push to restart the company comes even after court filings reveal details about how the previous management team seem to have run their firms into the ground.","New FTX CEO John Ray III, a veteran corporate restructuring specialist best known for maximizing returns for creditors in Enron's bankruptcy, has floated rebooting the company. He took the helm of the exchange in November, when the company filed in the U.S. Bankruptcy Court for the District of Delaware.","“Everything is on the table,” Ray <a href=\"https:\/\/www.wsj.com\/articles\/new-ftx-chief-says-crypto-exchange-could-restart-11674143168\" data-v-f87c67ca=\"\">told the Wall Street Journal<\/a> in January. “If there is a path forward on that, then we will not only explore that, we’ll do it.”","Ray's comment sent the price of FTX’s utility token jumping, even though lawyers for the bankrupt exchange have marked FTT as an essentially worthless item on their balance sheets.&nbsp;","Travis Kling, the chief investment officer at Ikigai Asset Management, recently <a href=\"https:\/\/twitter.com\/Travis_Kling\/status\/1633898511191162901\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">called<\/span><\/a> a potential restart “one of the most bullish outcomes possible for creditors.” Ikigai held a majority of its assets on FTX.","The company’s caretaker leadership has so far focused on selling off some parts of its business, clawing back funds in bankruptcy court and cooperating with the prosecutors handling with Bankman-Fried’s criminal case. Ray has not given an indication that a reboot will happen any time soon, if it actually goes forward.&nbsp;","Proponents of an FTX reboot, as far-fetched as the idea may seem, doggedly track FTX’s progress in bankruptcy court filings. The law firm for FTX’s Official Committee of Unsecured Creditors has held several “reboot of exchange” meetings, according to fee statements filed in bankruptcy court. The committee and the law firm, Paul Hastings, did not comment.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Ray is obligated to try to maximize the value of FTX’s assets, but it’s too early to tell whether restarting FTX would be the most valuable option, said Matthew Gold, a partner at the law firm Kleinberg, Kaplan, Wolff &amp; Cohen. Any restructuring plan would be subject to approval from the bankruptcy court.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“It's certainly on their mind, but the answer will vary considerably depending on the underlying business issues at stake,” Gold said. “The legal side of getting a plan through is a process, but if the business realities support it, the plan process can move forward in a relatively straightforward way.”","Other high-profile bankrupt crypto firms have taken this step. Defunct crypto lender Celsius, for example, has proposed giving its largest creditors equity in a new company run by the investment firm NovaWulf. Voyager Digital, another failed crypto lender, proposed selling assets to Binance.US as part of a court-approved restructuring plan, though that faces unusual pushback from the U.S. government.","“If FTX has a fundamentally sound business model, that’s the key, right? A fundamentally sound business model, that it offers something that people want, that customers want, that it can provide because it has the infrastructure in place,” said Joe Moldovan, a partner at the law firm Morrison Cohen. “Because if whatever failings there were with the company can be fixed, then FTX can survive in some capacity.”","To FTX skeptics, rebooting the exchange sounds more like a pipe dream than a possibility. The exchange was valued at $32 billion at its peak.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“In theory, from the perspective of a creditor who thinks their money is completely lost, it may seem to be a good idea to reboot FTX. However, in practice these reboot methods encourage creditors to deposit more money in the hope to be bailed out,” said Joseph Collement, general counsel for Bitcoin.com. “This is the oldest scam in crypto. If you want to withdraw your money, first you have to deposit more.”","If FTX were to restart business — especially in the United States — it is not clear how the exchange could operate in an increasingly strict regulatory environment. Regulators’ aggressive posture would make it more challenging for FTX to operate now than it did up until last fall said Kaplan, the Prometheum co-CEO.","A <a href=\"https:\/\/www.theblock.co\/post\/223143\/binance-details-from-cftc-complaint\" data-v-f87c67ca=\"\">recent CFTC complaint<\/a> brought against FTX's rival Binance highlighted how that offshore exchange courted U.S. users despite not being legally registered to do business in the U.S. The Bahamian portion of FTX, its main arm, would have faced similar scrutiny from regulators had the firm not gone bankrupt first, after a Texas securities regulator was able to <a href=\"https:\/\/www.theblock.co\/post\/179515\/ftx-not-yet-facing-enforcement-action-says-texas-regulator\" data-v-f87c67ca=\"\">open an account on the site<\/a>.","Since FTX went bankrupt, other major crypto exchanges have faced new scrutiny from regulators. Kraken <a href=\"https:\/\/www.theblock.co\/post\/210332\/kraken-settles-sec-charges-over-its-staking-program\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">settled<\/span><\/a> with the Securities and Exchange Commission for $30 million, SEC staff suggested Binance.US is operating an unregulated securities exchange in the United States, and the commission just delivered a Wells notice to Coinbase, typically a harbinger of a coming enforcement action.","“The overwhelming probability is that they are not compliant and don't operate in a manner that would allow them to be compliant with the federal securities laws,” Kaplan said of FTX. “I don't know if the average retail trader, who to my understanding was the group of investors that was most significantly harmed in this debacle, would want to participate on that platform anymore.\"","Carlos Domingo, the founder and CEO of Securitize, a platform for investing in private markets consistent with U.S. regulations, said the alleged fraud that occurred at FTX should keep the company out of the industry, regardless of its new leadership.","“The level of fraud associated with the FTX brand is beyond the pale. Companies and actors that give digital assets such a bad name should die and not be revived to become Frankensteins lingering around the ecosystem.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp; <\/span>Investors are much better off focusing on companies that have a track record of good behavior, a willingness to register and strong regulatory compliance,” Domingo said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Proponents of the reboot acknowledge they were hoodwinked by Bankman-Fried and others who ran FTX until last year. Still, they say the company should outlast its disgraced founders.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Absolutely do I feel scammed, but that scam really was played on me by former management,” the operator of the “<a href=\"https:\/\/twitter.com\/AFTXcreditor\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">@AFTXcreditor<\/span><\/a>” Twitter account, who tracks reboot efforts, said in a telephone interview. “FTX was a highly profitable exchange, which was robbed by a highly unprofitable hedge fund. And in that scenario, it makes complete sense to me to refinance this profitable business to resume activity and to generate profits and equity value which could be repurposed for making creditors more whole than they currently are.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Companies with tarnished reputations can survive, noted Moldovan, even if that means reopening under a new name or splitting up assets. Any possible reboot will come down to whether FTX can exit the bankruptcy process with a viable business.&nbsp;","“Chapter 11 is a process which is within the absolute American personality,” Moldovan said. “Which is a country that lives on second chances.\"","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Update: This story has been updated to amend the description of Securitize.<\/i>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunil Kavuri","content":"PERSON"},{"type":"Enron","content":"ORGANIZATION"},{"type":"$32 billion","content":"MONEY"},{"type":"Paul Hastings","content":"PERSON"},{"type":"fall","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Matthew Gold","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"last fall","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kaplan","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"NovaWulf","content":"ORGANIZATION"},{"type":"FTX Japan","content":"ORGANIZATION"},{"type":"Aaron Kaplan","content":"PERSON"},{"type":"Samuel Bankman","content":"PERSON"},{"type":"John Ray III","content":"PERSON"},{"type":"Carlos Domingo","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"FTX’s Official Committee of Unsecured Creditors","content":"ORGANIZATION"},{"type":"Joseph Collement","content":"PERSON"},{"type":"U.S","content":"LOCATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Ikigai Asset Management","content":"ORGANIZATION"},{"type":"SBF","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Mark Botnick","content":"PERSON"},{"type":"Kleinberg, Kaplan, Wolff &amp; Cohen","content":"ORGANIZATION"},{"type":"Domingo","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Fried","content":"ORGANIZATION"},{"type":"Japan","content":"LOCATION"},{"type":"Texas","content":"LOCATION"},{"type":"$30 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Joe Moldovan","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"Travis Kling","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Morrison Cohen","content":"PERSON"},{"type":"$8 billion","content":"MONEY"},{"type":"the District of Delaware","content":"ORGANIZATION"}],"hashtag":["BANKRUPTCY FILINGS","FTX","SAM BANKMAN-FRIED"],"authors":["Stephanie Murray","The Block"]}