{"summary":"The CF Staking Reward Rate Series gives institutional investors reward rates from certain proof-of-stake protocols. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264981\/cf-benchmarks-launches-staking-index-series-for-institutional-clients","publishDate":"2023-11-28T10:02:09","id":91,"type":null,"title":"CF Benchmarks launches staking index series for institutional clients","category":["COMPANIES"],"content":["Crypto benchmark indices provider CF Benchmarks launched a staking index series for institutional clients.&nbsp;","Called the CF Staking Reward Rate Series, the data provides investors with the reward rates from certain proof-of-stake protocols, offering institutional clients a more relevant reflection of daily staking rewards, according to a company statement.&nbsp;","The indices from the new <a href=\"https:\/\/www.theblock.co\/post\/196306\/cme-group-cf-benchmarks-launch-new-defi-reference-rates-for-aave-curve-and-synthetix\" data-v-f87c67ca=\"\">CF<\/a>&nbsp;Staking Reward Rate Series have been registered with the European Union's Benchmark Regulation. The reward rate data comes from four institutional non-custodial staking providers, the firm added.&nbsp;","\"Proof of Stake has become a popular consensus mechanism because it opens transaction validation and network governance to token holders,” Sui Chung, CEO of <a href=\"https:\/\/www.theblock.co\/post\/245823\/cme-cf-benchmarks-apac-bitcoin-ether\" data-v-f87c67ca=\"\">CF Benchmarks<\/a>, said in a statement. \"The CF Staking Reward Rate Series now offers a comprehensive overview of the proof-of-stake space, opening it up to prospective investors.\"&nbsp;","\"Indices already form the baseline for financial products in most asset-classes that exist today,\" Chung added. \"Indices like the CF Staking Reward Rate will become core infrastructure for a new generation of products and services that enable investors to gain exposure to this high potential activity.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Sui Chung","content":"PERSON"},{"type":"CF Staking Reward Rate","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"European Union's Benchmark Regulation","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"CF Benchmarks","content":"ORGANIZATION"},{"type":"Proof of Stake","content":"ORGANIZATION"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}