{"summary":"The new network is said to allow users access to any blockchain network with one account. \nChain Signatures aims to defragment liquidity scattered across different blockchains.","author":["Danny Park","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284678\/near-foundation-chain-signatures","publishDate":"2024-03-26T22:00:03","id":910,"type":null,"title":"Near Protocol will let users sign transactions on third-party chains from single wallet","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">Near Foundation has launched Chain Signatures, a protocol that will let users sign transactions on third-party blockchains from one single Near account. Chain Signatures is live on Near's testnet, and its mainnet launch expected by early May, according to a Near spokesperson.<\/span>","<span data-v-f87c67ca=\"\">Chain Signatures is powered by a decentralized multi-party computation (MPC) network and secured by Near network validators. <\/span>","<span data-v-f87c67ca=\"\">It<\/span> enables Near accounts, including smart contracts, to sign transactions for any blockchain. Any Near account can control any number of addresses on all blockchains, enabling new use cases around decentralized finance. <span data-v-f87c67ca=\"\">In future, it will receive additional security from EigenLayer as well, according to the foundation.<\/span>","<span data-v-f87c67ca=\"\">“Decentralized Finance (DeFi) on non-smart contract chains is now possible for the first time on many networks including Bitcoin,” Near Foundation stated. “Developers can easily build DeFi products that utilize assets from other chains without bridging these assets.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Chain Signatures currently supports Ethereum, Cosmos chains, Dogecoin, Bitcoin and XRP Ledger, and will soon support Solana, TON Network, Polkadot, and others, according to Near.<\/span>","It includes a \"Multichain Gas Relayer,\" which removes the need to have the native gas token of another chain in order to transact; instead they can just use Near or NEP-141 tokens to cover gas on any chain."],"hashtag":["DECENTRALIZED INFRASTRUCTURE"]}