{"summary":"A group of developers have released their own implementation of the ERC-404 idea, which fuses ERC-20 tokens with NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277271\/crypto-developers-introduce-rival-erc-404-implementation-called-dn-404","publishDate":"2024-02-13T05:58:43","id":9102,"type":null,"title":"Crypto developers introduce rival ERC-404 implementation called DN-404","category":["CRYPTO ECOSYSTEMS"],"content":["A group of crypto developers released their alternative implementation of the experimental ERC-404 token standard in a bid to achieve the same results in a more efficient way.","The ERC-404 token standard was <a href=\"https:\/\/www.theblock.co\/post\/276477\/these-developers-are-mashing-erc-20-tokens-and-nfts-together-will-it-work\" data-v-f87c67ca=\"\">launched on Feb. 2 by the Pandora team<\/a>, with the goal of combining ERC-20 tokens and NFTs. The broad idea was to provide native fractionalization of NFTs, by enabling them to be split apart and brought back together at will, although this leads to some potential interesting side effects, like the returning NFT potentially being different.","However, the tokens had a <a href=\"https:\/\/www.theblock.co\/post\/277040\/erc-404-token-prices-dip-as-rival-implementation-approaches\" data-v-f87c67ca=\"\">significant impact on Ethereum transaction fees<\/a>, driving them up across the board. In response, this rival group of developers reckoned they could create a more efficient implementation, one that would have a lesser impact.","On Feb. 12, the developers released their version, called DN-404, which they <a href=\"https:\/\/twitter.com\/0xQuit\/status\/1757174145610400064\" data-v-f87c67ca=\"\">estimate<\/a> results in a 20% reduction of the transaction fee impact.","\"<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">The premise of ERC-404 was to create a single contract that can act as both a fungible and non-fungible token. However, this can't be done without introducing exploits and breaking standards,\" said one of the developers, who is pseudonymously <a href=\"https:\/\/twitter.com\/0xCygaar\/status\/1757136657286119916\" data-v-f87c67ca=\"\">known as cygaar<\/a>. \"Our approach instead uses two contracts - a \"base\" ERC-20 with a \"mirror\" ER-C721.\"<\/span>","By splitting the two elements up into separate, more standard contracts, this could reduce issues. “<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">The result is that everything returns to the way it should be. The ERC-721 and ERC-20 contracts both exist, and both function as standalone products, but under the hood they run on shared 404 rails,” <a href=\"https:\/\/twitter.com\/0xQuit\/status\/1757162239637737494\" data-v-f87c67ca=\"\">added quit<\/a>, another pseudonymous developer behind the project.<\/span>","The developers noted that the code is unaudited and therefore carries some risk. In contrast to the ERC-404 initiative, they have not introduced their token-NFT hybrid using this code.","\"<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">I want to be clear - while I had a ton of fun building this, I still see 404 as more of a gimmick than anything else. However, the space has shown a desire to continue using it, and so we decided it was worth making an implementation that was efficient and safe to use,\" quit said.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Pandora","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Feb. 2","content":"DATE"},{"type":"20","content":"DATE"},{"type":"Feb. 12","content":"DATE"}],"hashtag":["ASSETS","DEVELOPER TOOLS","PROTOCOLS","SMART CONTRACTS","TOKENIZATION"],"authors":["Tim Copeland","The Block"]}