{"summary":"The crypto mogul, clad in a simple beige jumpsuit, remained stoic as he learned of his fate.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285465\/ftx-founder-sam-bankman-fried-to-serve-up-to-24-25-years-in-prison","publishDate":"2024-03-28T14:08:09","id":9104,"type":null,"title":"FTX founder Sam Bankman-Fried to serve up to 24.25 years in prison","category":["EXCHANGES"],"content":["FTX founder Sam Bankman Fried was sentenced to nearly 25 years in prison on Thursday, marking the conclusion of a criminal fraud trial involving the loss of $8 billion by retail investors.&nbsp;","Judge Lewis Kaplan of the U.S. District Court for the Southern District of New York handed down the 24.25-year sentence and ordered the former billionaire to pay back up to $11 billion in investor and lender losses, citing Bankman-Fried's “apparent lack of remorse” and “flexibility with the truth.” The issued prison term falls 15 years short of prosecutors’ sentencing recommendation.&nbsp;","Bankman-Fried's lawyers attempted to reframe the public’s perception of the crypto wunderkind, calling him “a beautiful puzzle” who led his doomed companies with “math in his head” rather than “malice in his heart.”","“Sam was not a ruthless financial serial killer who set out every morning to hurt people,” defense lawyer Mark Mukasey said.","Judge Kaplan disagreed. The seasoned jurist spotlighted three instances in which Bankman-Fried committed perjury during his trial, including one instance in which the executive claimed he only became aware of the multi-billion-dollar hole in Alameda’s balance sheets right before his crypto empire’s spectacular implosion.","“He knew it was wrong. He knew it was criminal,” Judge Kaplan said Thursday before a packed courtroom.&nbsp;","The crypto mogul, clad in a simple beige jumpsuit, remained stoic as he learned of his fate. Standing stiffly with his hands clasped together in front of him like a corpse in repose, he showed a noticeable shift in demeanor from his former kingpin persona. He bowed his head and bumbled through his final comments to the court in the lead-up to the judge's ruling.&nbsp;","<span data-v-f87c67ca=\"\">“I made selfish decisions,” Bankman-Fried said in his remarks, which revisited several of the defense's key talking points during his weeks-long criminal trial. Among those arguments was the assertion that customers' funds were lost in a “liquidity crisis” precipitated by FTX staff's mismanagement of users' accounts and the company's broader operations.<\/span>","<span data-v-f87c67ca=\"\">The former executive's prepared comments also included several nods to his colleagues and co-conspirators Gary Wang, Caroline Ellison and Nishad Singh.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“They built something really beautiful, and I threw all of that away,\" Bankman-Fried said.<\/span>","Bankman-Fried was found guilty on November 2 of seven criminal counts, including two counts each of wire fraud and conspiracy to commit wire fraud, as well as several counts of conspiracy to commit securities and commodities fraud, among other criminal acts. The maximum prison term for those crimes is 110 years, according to a probation officer.&nbsp;&nbsp;","Judge Kaplan recommended that Bankman-Fried serve time in a medium—or low-security prison near the California Bay Area. The judge reasoned that the former FTX CEO’s social skill deficiencies and “association with vast wealth” make him a target for aggression by fellow inmates.&nbsp;","&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Kaplan","content":"PERSON"},{"type":"November 2","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"$11 billion","content":"MONEY"},{"type":"Nishad Singh","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Sam Bankman Fried","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"California Bay Area","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"Gary Wang","content":"PERSON"},{"type":"Mark Mukasey","content":"PERSON"},{"type":"$8 billion","content":"MONEY"},{"type":"Lewis Kaplan","content":"PERSON"}],"hashtag":[],"authors":["Elizabeth Napolitano","Zack Abrams","The Block"]}