{"summary":"Davies, in a lengthy Twitter Spaces event on Monday, said he&#x27;d use the new OPNX  crypto trading platform to &quot;donate&quot; funds back to 3AC creditors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237613\/kyle-davies-evokes-karma-says-hell-donate-some-opnx-earnings-to-3ac-creditors","publishDate":"2023-07-03T18:29:02","id":9107,"type":null,"title":"Kyle Davies evokes karma, says he&#x27;ll donate some OPNX earnings to 3AC creditors","category":["COMPANIES"],"content":["Three Arrows Capital co-founder Kyle Davies said that karma is guiding him to give back to his creditors.","Davies, in a lengthy <a href=\"https:\/\/twitter.com\/i\/spaces\/1YqKDoqbLvOxV?s=20\" data-v-f87c67ca=\"\">Twitter Spaces<\/a> event on Monday, said he'd use the new <a href=\"https:\/\/www.theblock.co\/post\/229047\/opnx-dubai-regulator-reprimand\" data-v-f87c67ca=\"\">OPNX <\/a>crypto trading platform he co-founded with Mark Lamb to \"donate\" funds back to 3AC creditors, if they get in early.&nbsp;","\"We've set up the first ever shadow recovery process,\" Davies explained. \"This SRP is a way for Su and I to donate to creditors which are early and supporting. If there are some that don’t want to deal with us, then they don’t have to.\"","\"And also this is entirely separate from the liquidation,\" he added. \"Teneo is the liquidator. They will sell the firm’s assets and distribute it to creditors separately. But we have a number of creditors who were early that are whole or more already. And we have this process where we will donate over time. Again, entirely voluntary. This is something that we want to do. And it’s only for people who wanted to participate. If they don’t want to, they don’t have to. But if they do, and they want to get involved, and the supported us before and the want to support us in the future, then by all means...\"","\"Are you trying to get people to buy a security?\" Bitcoiner Simon Dixon chimed in asking.","\"No no no,\" Davis insisted. \"Su and I are donating future earnings to this process. There's no token here.\"","\"There's no tradable asset here?\" crypto trader Ran Neuer asked.","\"No, not at all. There's no token here.\" Davies said. \"When thinking about life philosophies with Mark and Su, one of the things we really believe in is karma and something greater than all of us. For some people, that can be religion, philosophy, but we have this in common that there's something greater. And so we very much believe that if we do good and we say, to creditors who lost money, they have a way to make more back. If we do bad and they do well, then that's great. And that's good karma, or whatever you want to call it.\"&nbsp;","Three Arrows Capital filed for <a href=\"https:\/\/www.theblock.co\/post\/155578\/three-arrows-capital-files-for-chapter-15-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">Chapter 15<\/a> bankruptcy protection on July 1, 2022. Court filings revealed that the firm owed <a href=\"https:\/\/www.theblock.co\/post\/158169\/three-arrows-capital-3ac-creditors-list-3-5-billion-crypto-affidavits\" data-v-f87c67ca=\"\">$3.5 billion<\/a> to 27 crypto firms, and liquidators are seeking to obtain <a href=\"https:\/\/www.theblock.co\/post\/236717\/3ac-liquidators-seek-1-3-billion-from-zhu-davies-bloomberg\" data-v-f87c67ca=\"\">$1.3 billion<\/a> in funds from Davies and Su personally.","(<em data-v-f87c67ca=\"\">With reporting assistance from Sarah Wynn.<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kyle Davies","content":"PERSON"},{"type":"Mark","content":"PERSON"},{"type":"$1.3 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SRP","content":"ORGANIZATION"},{"type":"Davis","content":"PERSON"},{"type":"Simon Dixon","content":"PERSON"},{"type":"Mark Lamb","content":"PERSON"},{"type":"Ran Neuer","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Teneo","content":"ORGANIZATION"},{"type":"Davies","content":"PERSON"},{"type":"July 1, 2022","content":"DATE"},{"type":"$3.5 billion","content":"MONEY"},{"type":"Sarah Wynn","content":"PERSON"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}