{"summary":"Utah&#x27;s top federal judge found that the SEC made &#x27;false or misleading&#x27; statements in the course of its case against crypto firm DEBT Box.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265778\/utahs-top-judge-threatens-sec-lawyers-with-sanctions-over-misrepresentations-in-crypto-case","publishDate":"2023-12-02T17:02:02","id":9109,"type":null,"title":"Utah&#x27;s top judge threatens SEC lawyers with sanctions over &#x27;misrepresentations&#x27; in crypto case","category":["THE BLOCK"],"content":["The Securities and Exchange Commission (SEC) has been ordered by Utah's top federal judge to explain statements made over the course of its efforts to implement and maintain a temporary restraining order (TRO) against crypto firm DEBT Box , a new court filing <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.utd.141167\/gov.uscourts.utd.141167.215.0.pdf\" data-v-f87c67ca=\"\">shows<\/a>.&nbsp;","The TRO was dissolved in October after Judge Robert J. Shelby, Chief United States district judge for the District of Utah, found several of the SEC's statements arguing for the order to be \"false or misleading.\"&nbsp;","The SEC claimed at the time that DEBT Box was actively in the process of moving assets overseas in order to escape the SEC's jurisdiction, closing bank accounts in June 2023 in order to \"move investor funds\" overseas to the United Arab Emirates \"for the express purpose of evading the federal securities laws.\"","In an additional detailed <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.utd.141167\/gov.uscourts.utd.141167.214.0.pdf\" data-v-f87c67ca=\"\">filing<\/a> explaining his order, Shelby explained that the SEC's claim during a July 28th hearing on the TRO that the defendants had closed 33 bank accounts in the past 48 hours constituted \"the most significant evidence\" that DEBT Box was attempting to move funds overseas. That evidence, along with statements made by the SEC that the defendants were blocking investigators from viewing certain social media pages, helped convince the judge to approve the TRO.&nbsp;","However, in a motion to dissolve the TRO filed in September, the defendants argued that, in fact, zero bank accounts were closed in June or July 2023. Rather, the thirteen of the defendants' bank accounts that had been closed had all been closed on or before January 2023 — and nine of the accounts were closed by banks, not the defendants.","\"There was no evidence that any bank accounts closed in the 48 hours preceding the ex parte hearing,\" Shelby wrote in his filing.&nbsp;","Shelby also found the SEC's characterizations of statements by the defendants to be misleading and questioned the SEC's claim that the defendants were blocking investigators from viewing certain sites, given the SEC characterized their investigation as \"covert.\"&nbsp;","Judge Shelby wrote that he’s “...concerned the Commission made materially false and misleading representations” in the context of arguing for the TRO. Shleby also noted that the TRO was an ‘extraordinary relief’ which also led to the appointment of a Temporary Receiver, who was given “full power over all funds, assets, collateral, premises . . . choses in action, books, records, papers and other property belonging to” DEBT Box, its affiliates, and its subsidiaries.","As such, Shelby ordered the SEC to argue why sanctions should not be imposed upon the Commission’s lawyers, and laid out several questions for the agency regarding the evidence it used to support its assertions in court. For example, Shelby wrote, “If the investigation had been covert, what factual support did counsel possess and rely on when representing Defendants had ‘taken action to block SEC investigative staff from viewing their social media sites?‘”","The sanctions, which according to the Federal rule Shelby cites “shall be limited to what is sufficient to deter repetition of such conduct,” may include monetary penalties, but could also be limited to “directives of a nonmonetary nature.” The agency’s response is due in fourteen days, and a spokesperson told Fortune, “We are in receipt of the order to show cause and will respond to the court as directed.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chief United States","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"TRO","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"January 2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"United Arab Emirates","content":"ORGANIZATION"},{"type":"District of Utah","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Utah","content":"LOCATION"},{"type":"Robert J. Shelby","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"Shelby","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"July 2023","content":"DATE"},{"type":"June 2023","content":"DATE"}],"hashtag":[],"authors":["Zack Abrams","The Block"]}