{"summary":"Livepeer, a decentralized video streaming platform built on Ethereum, has raised $20 million.\nLivepeer plans to scale its go-to-market efforts, technical capabilities, and support more blockchains, CEO Doug Petkanics told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112920\/ethereum-video-streaming-platform-livepeer-20-million-series-b","publishDate":"2021-07-29T07:00:18","id":911,"type":null,"title":"Ethereum-based video streaming platform Livepeer raises $20 million","category":["Venture Capital"],"content":["Livepeer, a decentralized video streaming platform built on the Ethereum blockchain, has raised $20 million in a new funding round. This was a Series B for equity, Livepeer co-founder and CEO Doug Petkanics told The Block.","Digital Currency Group led the round, with Northzone, Coinbase Ventures, CoinFund, Animal Ventures, and 6th Man Ventures — a venture capital firm co-founded by The Block's founder Mike Dudas — also participating in the round.","Livepeer plans to deploy the fresh capital across three areas — ramping up its go-to-market efforts, expanding its technical capabilities, and supporting more blockchains — Petkanics told The Block. To that end, Livepeer also plans to increase its current team of 18 to around 30 by the end of the year.","Founded in 2017, Livepeer <a href=\"https:\/\/livepeer.org\/primer\" data-v-f87c67ca=\"\">provides<\/a> a platform for users to transcode videos in a decentralized way at a cheaper cost. Transcoding is the process of reformatting a raw video file to ensure an optimal viewing experience. Anyone can join Livepeer and help transcode a video by contributing their computer's resources and earn fees in ether (ETH) or a stablecoin. But to earn fees, users have to first buy Livepeer's token LPT.&nbsp;","Through its platform, Livepeer claims to reduce costs associated with video transcoding by ten times compared to centralized offerings such as Amazon Web Services.","Petkanics said Livepeer's usage has grown to over 2.5 million minutes of unique input video transcoded per week, up from 1 million minutes per week two months ago and a \"couple hundred thousand\" per week early in the year.","\"We believe the creator economy, enabled by cost-effective video streaming and crypto-centric primitives, are a powerful combination and will lead to better economic alignment between creators, consumers, and the platforms that connect them,\" he said.&nbsp;","Some of the users currently utilizing Livepeer are PlayDJ.tv, Korkuma.com, and Vimm.tv, among others, said Petkanics. With the growing creator economy, Livepeer aims to capture a larger share of the $70 billion video streaming market.&nbsp;","The Series B funding round brings Livepeer's total funding to date to $31 million. The project has <a href=\"https:\/\/www.theblockresearch.com\/livepeer-a-dark-horse-in-the-decentralized-compute-stack-98489\" data-v-f87c67ca=\"\">previously raised<\/a> $11 million."],"hashtag":["ETHEREUM","SERIES B"]}