{"summary":"Core Scientific reached a deal with B. Riley for a $70 million debtor-in-possession loan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207110\/core-scientific-reaches-deal-with-b-riley-for-70-million-replacement-loan","publishDate":"2023-01-31T10:36:46","id":9114,"type":null,"title":"Core Scientific reaches deal with B. Riley for $70 million replacement loan","category":["CRYPTO INFRASTRUCTURE"],"content":["Bankrupt bitcoin miner Core Scientific has reached a new $70 million loan agreement with B. Riley.","The company has asked the court to approve the financing as a replacement for the $75 million debtor-in-possession (DIP)&nbsp;loan the miner got from convertible notes shareholders as part of its prearranged bankruptcy deal, according to a <a href=\"https:\/\/www.theblock.co\/post\/198519\/blackrock-among-bankrupt-miner-core-scientifics-creditors\" data-v-f87c67ca=\"\">filing<\/a> from Jan. 30.","The miner said that the \"ad hoc committee of shareholders are supportive of the debtors’ entry into the Replacement DIP Facility and the payoff of the Original DIP Facility prior to final approval.\"","The deal will give Core Scientific \"up to 15 months of runway and significant flexibility\" since it has no \"plan-related milestones and is not conditioned on seeking approval of any specific Chapter 11 plan.\"","\"It also contains economic terms that are reasonable and generally superior to those provided under the Original DIP Facility …. The Replacement DIP Facility lays the foundation on which the debtors will seek to negotiate a consensual chapter 11 plan with all of their key constituents and maximize value for all stakeholders,\" the filing said.","There is a hearing scheduled for Wednesday, which was previously intended as a final hearing for the original DIP loan.","Approval of the replacement DIP loan from B. Riley \"on an interim and ultimately final basis, will enable the debtors to pay off the Original DIP Facility and is the best source of post-petition financing currently available to the debtors,\" the document stated.","The loan will have a 10% interest rate and a 12-month maturity with a three-month extension. It will be secured by \"all property and assets\" of the borrower, including but not limited to its North Carolina facility, with first-priority liens on unencumbered assets as of the petition date.","B. Riley agreed to provide<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>$35 million in a single borrowing on the closing date, with the remaining amount made available following the entry of the replacement final DIP order, the filing said.","B. Riley is already one Core Scientific's largest creditors, having provided the company $75 million in bridge promissory notes.","<em data-v-f87c67ca=\"\">(This story has been updated with additional details about the loan structure.)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"North Carolina","content":"LOCATION"},{"type":"$75 million","content":"MONEY"},{"type":"$35 million","content":"MONEY"},{"type":"B. Riley","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Jan. 30","content":"DATE"},{"type":"Original DIP Facility","content":"ORGANIZATION"},{"type":"$70 million","content":"MONEY"},{"type":"miner Core Scientific","content":"ORGANIZATION"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}