{"summary":"Essential, a startup focused on building intent-based infrastructure, raised $5.15 million in seed funding.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252242\/essential-raises-5-15-million-to-build-intent-based-infrastructure","publishDate":"2023-09-21T04:05:05","id":9123,"type":null,"title":"Essential raises $5.15 million to build intent-based infrastructure","category":["VENTURE CAPITAL"],"content":["Essential, a startup focused on building intent-based infrastructure, raised $5.15 million in seed funding.","Maven 11 led the round, alongside participating investors Robot Ventures, Karatage, Batuhan Dasgin, Skip, James Prestwich, Brandon Curtis, Eclipse founder Neel Somani and others, according to an announcement today.","Founded earlier this year, Essential is trying to rewire transaction supply chains in crypto to minimize value extraction by what it describes as “rent-seeking intermediaries,” for the benefit of users. To do that, its team is focused on building intent-based infrastructure — a relatively new technology that proponents hope will bring user experience and efficiency gains to blockchains.","According to today’s announcement, so-called “intents” describe a desired end state rather than a set of instructions to be executed. What that means for users is that they are exposed to many different on-chain solutions rather than a single pathway provided by whatever app they happen to be interacting with.","In an interview, co-founder and CEO Liesl Eichholz gave the example of swapping tokens on a decentralized exchange. In that scenario, users are typically exposed only to that DEX and whatever smart contract they’re interacting with. “With an intent-based system, a user can just say this is what I want to do,” Eichholz said. “The services are specialized in finding the best solution that exists on-chain.”","<span data-v-f87c67ca=\"\">The core bits of infrastructure Essential is building currently include an intent standard for <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.69%\n    <\/span><\/a> <!----><\/span><\/span>, a domain-specific language (or DSL) for intent expression and a “fully intent-centric blockchain protocol,” per the announcement.&nbsp;<\/span>","Since closing the seed round in April, the startup <a href=\"https:\/\/blog.essential.builders\/introducing-erc-7521-generalized-intents\/\" data-v-f87c67ca=\"\">designed and proposed an ERC<\/a> (Ethereum request for comment) to bring composability to intent-centric products on Ethereum and other EVM chains while making “significant progress” on the DSL, which would form the basis of its planned protocol.","“The Essential team realizes that the current transaction-based model of interacting with blockchains results in poor UX,” said Balder Bomans, managing partner at Maven 11, in a statement. “The better alternative is to instead work based off of user-expressed intents, which we believe will pave the way for UX that rivals Web2 UX — but without the intermediaries and walled gardens that are inherent to Web2.”","Essential did not disclose a valuation for the seed round.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Eclipse","content":"ORGANIZATION"},{"type":"Neel Somani","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$5.15 million","content":"MONEY"},{"type":"Liesl Eichholz","content":"PERSON"},{"type":"Brandon Curtis","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Balder Bomans","content":"PERSON"},{"type":"Karatage","content":"PERSON"},{"type":"James Prestwich","content":"PERSON"},{"type":"Batuhan Dasgin","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"DSL","content":"ORGANIZATION"},{"type":"-0.69%","content":"PERCENT"},{"type":"Eichholz","content":"PERSON"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["Ryan Weeks","The Block"]}