{"summary":"The SEC should turn down a slew of spot bitcoin exchange-traded fund applications, according to letters by an NGO.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243977\/ngo-calls-on-sec-to-reject-spot-bitcoin-etf-applications","publishDate":"2023-08-09T12:33:03","id":9125,"type":null,"title":"NGO calls on SEC to reject spot bitcoin ETF applications","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission should turn down a slew of recent spot bitcoin exchange-traded fund <a href=\"https:\/\/www.theblock.co\/post\/243635\/cathie-wood-expects-another-delay-for-arks-proposed-bitcoin-etf\" data-v-f87c67ca=\"\">applications<\/a> over concerns about possible investor harm, according to letters filed by nonprofit organization Better Markets.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The crypto industry has seen $2 trillion in losses, several enforcement actions, bankruptcies, lawsuits and criminal prosecutions, Stephen Hall, Better Markets’ legal director and securities specialist, said in a <a href=\"https:\/\/bettermarkets.org\/newsroom\/sec-should-reject-bitcoin-etf-filings-because-they-will-expose-investors-to-fraud-manipulation-and-other-investor-harms\/\" data-v-f87c67ca=\"\">statement<\/a> on Wednesday.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">“Meanwhile, the principal beneficiaries of the crypto craze are the criminals who use it to facilitate ransomware, money laundering, and illegal conduct of all types. It is within this context that the SEC must evaluate [the] latest wave of Bitcoin ETF filings this month,” Hall said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Better Markets filed two letters on Tuesday, commenting specifically on eight applications for a spot bitcoin ETF. Applications for those products have flooded in over the past several months, sparked in part after BlackRock first filed in June.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The SEC has not yet approved of a spot bitcoin ETF and has rejected previous efforts. Chair Gary Gensler has raised concerns about fraud and manipulation when <a href=\"https:\/\/www.theblock.co\/post\/241820\/gensler-raises-concerns-about-fraud-and-manipulation-when-asked-about-bitcoin-etfs\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">asked<\/span><\/a> about pending applications.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">“<\/span><span class=\"s2\" data-v-f87c67ca=\"\">Our comment letters urge the SEC to remain consistent with its previous orders disapproving such filings and reject the eight proposed rule changes pending before the agency,” Hall said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Firms vying for a spot bitcoin ETF have named Coinbase as a surveillance sharing partner in an effort to differentiate their applications from ones that have failed in the past and help assuage regulator fears about market manipulation.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Better Markets said “only a small portion” of global spot bitcoin trading occurs on Coinbase, despite its national presence.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">“Hence, relying on an exchange that represents such a small fraction of the overall trading of bitcoin for market surveillance of a commodity that has a reputation for being heavily manipulated via wash trading would add very little, if any, value to detecting or deterring manipulation of a spot bitcoin-based ETP,”&nbsp; Hall said in one comment letter.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Better Markets also noted that Coinbase is not registered with the SEC or the Commodity Futures Trading Commission, while citing its legal trouble with the SEC.<\/span>","Coinbase declined to comment.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">Better Markets is a nonprofit founded during the wake of the 2008 financial crisis that focuses on public interest in financial markets and reform.&nbsp;<\/span>","Other stakeholders have <a href=\"https:\/\/www.theblock.co\/post\/242986\/sec-hears-from-cricketer-musician-and-physicist-on-proposed-bitcoin-etfs\" data-v-f87c67ca=\"\">piped<\/a> in on whether the spot bitcoin ETF applications should go through, including a cricketer, musician and physicist.&nbsp;","<em data-v-f87c67ca=\"\">Updates with SEC declining to comment<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2 trillion","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Stephen Hall","content":"PERSON"},{"type":"2008","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Hall","content":"PERSON"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}