{"summary":"In an exclusive interview with The Block, Howard has for the first time laid out the full extent of his crypto empire. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/146212\/alan-howard-crypto-interview","publishDate":"2022-05-25T06:04:05","id":9127,"type":null,"title":"Hedge fund manager Alan Howard explains why he’s investing across the entire crypto ecosystem","category":["INSTITUTIONAL INVESTORS"],"content":["<span data-v-f87c67ca=\"\">British billionaire Alan Howard turned heads when he began <\/span><a href=\"https:\/\/www.theblockcrypto.com\/news+\/108122\/billionaire-alan-howard-crypto-investments\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">investing heavily in crypto startups<\/span><\/a><span data-v-f87c67ca=\"\"> in late 2020. But although it quickly became clear that the 58-year-old hedge fund heavyweight was dedicating a significant amount of time to the sector, few could have guessed quite how deep down the crypto rabbit hole he had gone.<\/span>","<span data-v-f87c67ca=\"\">In an exclusive interview with The Block, Howard — who generally keeps a low profile in the press — has for the first time laid out the full extent of his burgeoning crypto empire.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It is an operation that encapsulates an array of crypto infrastructure and investment management plays, spanning public and private market investing; equity and tokens; centralized and decentralized ecosystems; and even, albeit in a personal capacity, non-fungible tokens (NFTs) and generative art.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“<\/span>You have to be in, and have exposure to, the crypto world to understand what is going on there, to identify the challenges and opportunities you’ll face and to know what infrastructure you will have to build to meet those challenges and opportunities head on<span data-v-f87c67ca=\"\">,” said Howard, who responded to The Block’s questions in writing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“<\/span>In short, this is an important macro trend and a new asset class that can, and likely will, impact the evolution of technology and the economy at large for many years to come<span data-v-f87c67ca=\"\">,” he said. <\/span><span data-v-f87c67ca=\"\">“<\/span>As I balance my broad thesis with the reality that digital assets are a nascent asset class, I argue that it’s most prudent to invest across the entire crypto ecosystem in a highly diversified manner.<span data-v-f87c67ca=\"\">”<\/span>","<span data-v-f87c67ca=\"\">Howard went so far as to quote <\/span><a href=\"https:\/\/www.goodreads.com\/quotes\/7-it-is-not-the-critic-who-counts-not-the-man\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Theodore Roosevelt’s famous words<\/span><\/a><span data-v-f87c67ca=\"\"> on the importance of being \"in the arena.\" Today, there are few arenas in crypto that Howard has not stepped into.<\/span>","<span data-v-f87c67ca=\"\">Howard rose to prominence as co-founder and CEO of the hedge fund Brevan Howard, which by 2013 managed some $40 billion in assets as one of the world’s largest macro funds. He stepped down as CEO in 2019.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While he has scaled back his trading, Howard told The Block that he remains “heavily involved” in various initiatives at Brevan Howard, including those relating to co-investing, strategy allocations and crypto — through an entity named BH Digital.&nbsp;<\/span><span data-v-f87c67ca=\"\">“<\/span>I couldn’t be more confident in BH’s leadership under CEO Aron Landy, and the 100+ portfolio management teams currently on the BH platform,<span data-v-f87c67ca=\"\">” he added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Set up earlier this year, BH Digital is the centerpiece in Howard’s crypto operation. Acting as Brevan Howard’s dedicated crypto arm, it helps investors such as sovereign wealth funds, pension funds, foundations and endowments gain exposure to crypto.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The organization currently manages more than $1 billion in assets and employs over 60 people. Of those, nearly 20 are portfolio managers, each with a different specialty — such as liquid tokens or seed-stage investing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“<\/span>BH Digital reflects my belief in the importance of investing across the entire ecosystem, regardless of instrument (i.e. token, equity, NFT etc.) in a diversified and well risk-managed way,<span data-v-f87c67ca=\"\">”<\/span> said Howard. <span data-v-f87c67ca=\"\">“<\/span>This ensures that your return stream is never dependent on just one strategy, one theme or one risk-taker.<span data-v-f87c67ca=\"\">”<\/span>","<span data-v-f87c67ca=\"\">What that means in practice is that BH Digital invests in the equity of both private and public crypto firms, as well as in the tokens they may issue. Though the focus is broad, Howard identified stablecoins and payments; gaming and metaverse; DeFi and derivatives; smart contract security; aggregation of wallets; marketplaces; and cross-chain tools as target subsectors.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the near future, he added, BH Digital will roll out market-making capabilities to help support new tokens by providing early liquidity — \"bootstrapping liquidity,\" in crypto-speak.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We believe our 20-year history and legacy as an active participant in derivatives trading gives us an overwhelming advantage in DeFi investing,” said Howard.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Operating simultaneously across equity and token markets can be challenging for investors who have historically focused solely on either the former, a largely illiquid asset class, or the latter, which can usually be traded readily once initial \"<\/span>lockups\" <span data-v-f87c67ca=\"\">have expired. It is a shift that venture capitalists around the world <\/span><a href=\"https:\/\/www.theblockcrypto.com\/news+\/105193\/how-venture-capitalists-are-adjusting-to-the-brave-new-world-of-defi\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">are still adjusting to<\/span><\/a><span data-v-f87c67ca=\"\"> — some faster than others.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But Howard said the blend creates “a powerful feedback loop, allowing us to provide insights on market trends and opportunities for new market entrants.”<\/span>","<span data-v-f87c67ca=\"\">“In the crypto markets, in contrast to trad-fi, I think venture investing and liquid trading should be treated as part of one universe and not two separate arenas, particularly because token projects ‘go public’ much earlier in their lifecycle,” he added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One reason some investors have been slow to come around to token investing — though by no means the only reason — is that managing token holdings is not as straightforward as sitting on unlisted equity. Besides the fact that pricing is constantly in flux, tokens also often grant holders influence over the direction of crypto projects through community voting, and can be deployed within those communities to earn yield.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Howard, BH Digital is taking community participation seriously. The organization has over 20 blockchain engineers retained full-time — through a strategic partnership with&nbsp;<\/span>Nethermind, a blockchain research and software engineering company —&nbsp;<span data-v-f87c67ca=\"\">and can lend them out to portfolio companies in need of a hand. It can also offer assistance with other functions like compliance; capital raising; custody; and media relations and hiring. Howard said BH Digital will also stake tokens and run nodes to help kickstart decentralized networks, while playing an active role in governance and voting.<\/span>","<span data-v-f87c67ca=\"\">Finally, BH Digital can give portfolio companies access to other entities within Howard’s crypto armada, which he said can help “resolve major infrastructure pain points.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The first of those is a research-based incubator named&nbsp;<\/span>Web<sup data-v-f87c67ca=\"\">N<\/sup> Group<span data-v-f87c67ca=\"\">, which has not previously been reported on.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The group offers early-stage crypto entrepreneurs help with technology, operations, community development and legal advice — all with the goal of scaling up their ideas. It is especially focused on grassroots, community-driven crypto projects.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Web<sup data-v-f87c67ca=\"\">N<\/sup>&nbsp;has, for example, incubated Geometry — a cryptography research house formed by former startup founders and cryptographers that caters to the needs of&nbsp;<\/span>mathematicians and engineers building web3 infrastructure. <span data-v-f87c67ca=\"\">The group has also backed an unnamed team of traditional financiers who are trying to push the envelope with structured products in DeFi, and indeed one of Web<sup data-v-f87c67ca=\"\">N<\/sup>’s aims is to “bridge the gap between traditional and digital finance,” Howard said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Web<sup data-v-f87c67ca=\"\">N<\/sup> also invests in the next generation of talent, working with universities and student organizations to provide grants, sponsorships and internships to students interested in digital assets,” he added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Then there is Elwood Technologies. Howard first established the company in 2018. Its early work focused on asset management — in particular on building indices offering investors exposure to blockchain and crypto. The Block revealed in June last year, however, that the business <\/span><a href=\"https:\/\/www.theblockcrypto.com\/news+\/108122\/billionaire-alan-howard-crypto-investments\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">had pivoted<\/span><\/a><span data-v-f87c67ca=\"\"> to focus on software.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Elwood now styles itself as a crypto-focused market access and trading platform for institutions. The firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/146748\/goldman-sachs-elwood-technologies-alan-howard\" data-v-f87c67ca=\"\">raised $70 million<\/a> in a Series A round co-led by Goldman Sachs and Dawn Capital earlier this month.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Elwood was created to fulfil a glaring need in the market for institutional-grade infrastructure designed to satisfy this investor class’ needs. When I began experimenting with crypto trading in 2017, I saw massive potential for the growth of this asset class,” said Howard.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Cryptocurrency infrastructure was (and still is) heavily designed around the needs of retail traders. It was inefficient, cumbersome, illiquid, and incapable of handling the high-volume transactions that institutional investors require,” he added. “I wanted a lower barrier for institutions to make it easier for them to enter the digital assets space.”&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Elwood currently boasts over 30 clients including fintech firms and neobanks, as well as tier one banks, asset managers, hedge funds and crypto exchanges. It employs more than 100 people across offices in London, New York, Singapore, Jersey and Geneva.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The last cog in Howard’s crypto machine is Coremont Digital. Coremont is a middle- and back-office service provider that began life as a Brevan Howard spinout in 2018. Coremont Digital is Coremont's crypto-focused division, which launched in 2021, and which works with asset managers in the space. Its services include portfolio management technology and trading analytics; risk analysis and reporting; full trade lifecycle support and trading processing; fund accounting; and treasury and compliance.<\/span>","<span data-v-f87c67ca=\"\">Howard is an avid art collector, with a collection that <\/span><a href=\"https:\/\/www.artnews.com\/art-collectors\/top-200-profiles\/alan-howard-2\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">includes a $43 million masterpiece by Monet<\/span><\/a><span data-v-f87c67ca=\"\">. And just as he has gone all in on crypto after years trading traditional markets, so too has he dived headfirst into generative art — a genre that exploded last year, buoyed by the NFT boom. <\/span><a href=\"https:\/\/www.theblockcrypto.com\/news+\/115199\/squiggles-art-blocks-nft-frenzy\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Art Blocks<\/span><\/a><span data-v-f87c67ca=\"\"> is perhaps the best-known purveyor of generative art, in which works are created by autonomous systems, usually in the form of code.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Block can reveal that Howard began assembling his own generative art collection after his interest was piqued by the collections put together by <\/span><a href=\"https:\/\/twitter.com\/Vince_Van_Dough?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">VincentVanDough<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/twitter.com\/jdh\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">JDH<\/span><\/a><span data-v-f87c67ca=\"\">, famed pseudonymous collectors.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“My interest in generative art was inspired by a good friend of mine who was an early collector,” said Howard. “I quickly became fascinated by this concept of an algorithm or a set of rules being the medium to create a visual output. Much attention has been given to this genre of ‘painting with code’ over the past year, but the fact that it has roots in 1960s computer art was relevant to me.”<\/span>","<span data-v-f87c67ca=\"\">Howard added that he admires the work of Dmitri Cherniak, of <\/span><a href=\"https:\/\/opensea.io\/collection\/ringers-by-dmitri-cherniak\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ringers<\/span><\/a><span data-v-f87c67ca=\"\"> fame, as well as that of Matt DesLauriers, Deaf Beef and IX Shells — and said he is keen to discover new artists.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“One way I do this is through Digital Art Salon London,” he said. “Open to everyone, my team organizes this salon on a monthly basis to bring together IRL [in real life] artists, curators and creatives in the field. The team also speaks to traditional art museums and institutions to inform them about digital art.”<\/span>","These efforts come despite the relatively recent popularity of generative art among crypto investors.&nbsp;<span data-v-f87c67ca=\"\">Even in a sector as sprawling and changeable as crypto, Howard is covering all bases.&nbsp;<\/span>","<em data-v-f87c67ca=\"\">This article was updated to reflect the fact that Howard has scaled back his trading at Brevan Howard, but has not stopped trading entirely.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monet","content":"ORGANIZATION"},{"type":"Howard —","content":"PERSON"},{"type":"Elwood","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"Dmitri Cherniak","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"$43 million","content":"MONEY"},{"type":"Dawn Capital","content":"ORGANIZATION"},{"type":"Nethermind","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"$70 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Howard’s","content":"PERSON"},{"type":"1960s","content":"DATE"},{"type":"BH Digital","content":"ORGANIZATION"},{"type":"Brevan Howard’s","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Brevan Howard","content":"ORGANIZATION"},{"type":"Alan Howard","content":"PERSON"},{"type":"London","content":"LOCATION"},{"type":"Web<sup data-v-f87c67ca=\"\">N<\/sup> Group","content":"ORGANIZATION"},{"type":"Howard","content":"LOCATION"},{"type":"Howard","content":"PERSON"},{"type":"Theodore Roosevelt","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Aron Landy","content":"PERSON"},{"type":"Geneva","content":"LOCATION"},{"type":"Howard’s crypto","content":"ORGANIZATION"},{"type":"Coremont","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Elwood Technologies","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"June last year","content":"DATE"},{"type":"Brevan Howard","content":"LOCATION"},{"type":"Brevan Howard","content":"PERSON"},{"type":"Jersey","content":"LOCATION"},{"type":"Coremont Digital","content":"ORGANIZATION"},{"type":"Matt DesLauriers","content":"PERSON"}],"hashtag":["HEDGE FUNDS"],"authors":["Ryan Weeks","The Block"]}