{"summary":"Coinbase hasn&#x27;t yet decided whether to delist assets a day after the SEC sued it for allegedly violating security regulations. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233607\/coinbase-chief-legal-officer-sec","publishDate":"2023-06-07T15:49:19","id":9129,"type":null,"title":"Coinbase hasn&#x27;t yet decided about delisting any assets after SEC lawsuit","category":["COMPANIES"],"content":["Coinbase Chief Legal Officer Paul Grewel says the firm has not yet decided whether it will delist any assets from the crypto exchange in the wake of the lawsuit its facing from the U.S. Securities and Exchange Commission.&nbsp;","\"To address the question of whether or not we're going to delist any of these assets, of course we're always looking at new facts, new information, new allegations to understand whether or not our previous analysis was incorrect,\" Grewel says in a forthcoming episode of The Scoop. \"But as I sit here today, we have made no decision at all to delist assets, and we remain confident in our original analysis.\"","Grewel's comments come after Coinbase was <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">sued<\/a> by the SEC on June 6 over <a href=\"https:\/\/www.theblock.co\/post\/233286\/sec-lawsuit-against-coinbase-raises-questions-about-cryptos-market-structure\" data-v-f87c67ca=\"\">allegations<\/a> that it violated U.S. securities rules by operating as a broker, exchange and clearing agency without registering as such.","The SEC had <a href=\"https:\/\/www.theblock.co\/post\/233369\/sec-files-temporary-restraining-order-against-binance\" data-v-f87c67ca=\"\">sued<\/a> the rival crypto exchange Binance and its CEO Changpeng 'CZ' Zhao on June 5. The firm's American arm Binance.US <a href=\"https:\/\/www.theblock.co\/post\/233566\/binance-us-to-pause-otc-trading-portal-delist-some-trading-pairs-after-sec-suit\" data-v-f87c67ca=\"\">opted<\/a> to pull about 100 trading pairs and suspend its OTC Trading Portal on June 7 in response.","For now, it seems Coinbase will not follow suit.","\"We believe we are operating not just a lawful, but an extraordinarily positive and productive business. And so until we are convinced that anything that we do is in violation of law, we're going to continue to run our business as usual,\" Grewel said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Grewel","content":"PERSON"},{"type":"Paul Grewel","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"June 7","content":"DATE"},{"type":"June 6","content":"DATE"},{"type":"June 5","content":"DATE"}],"hashtag":["COINBASE"],"authors":["MK Manoylov","Frank Chaparro","The Block"]}