{"summary":"Coinbase and Circle are planning to expand the coin in more jurisdictions, expand to new chains and strike further institutional deals. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246785\/coinbase-circle-usdc-thescoop-newsletter","publishDate":"2023-08-22T15:24:02","id":913,"type":null,"title":"Coinbase and Circle look for USDC boost amid declining supply","category":["COMPANIES"],"content":["Last Tuesday we took a temperature check of the stablecoin market following the news that <a href=\"https:\/\/www.theblock.co\/post\/243647\/paypal-stablecoin\" data-v-f87c67ca=\"\">PayPal<\/a> would partner with crypto firm Paxos on its new U.S. dollar-pegged cryptocurrency.&nbsp;","This week brought additional developments from the stablecoin space, with the news that Coinbase would take a minority stake in stablecoin provider issuer Circle. Circle, meanwhile, would take full control of USDC's governance.&nbsp;","(To be clear, apparently Coinbase did not purchase its stake. The firm's corporate communications liaisons have emphasized that it was granted equity after the consortium behind USDC shuttered.)","Like last week, we will take a bit of a journey down Memory Lane. Coinbase and Circle announced USDC at Money 20\/20 in 2018 with the original <a href=\"https:\/\/www.coinbase.com\/blog\/coinbase-and-circle-announce-the-launch-of-usdc-a-digital-dollar\" data-v-f87c67ca=\"\">ambition<\/a> to build out a consortium of members contributing to the crypto (similar to the Libra scheme before it was shuttered by regulators). USDC grew slowly at first, breaching $1 billion in total supply about 2 years after it first launched. Traders flocked to the coin during so-called \"DeFi Summer\" as a means to earn yield and seamlessly move funds between different protocols. Its breakneck growth, which brought <a href=\"https:\/\/www.theblockcrypto.com\/data\/stablecoins\/usd-pegged\/total-stablecoin-supply\" data-v-f87c67ca=\"\">supply<\/a> to near $50 billion in 2022, began to decline as the 2022-2023 crypto winter set in, and then further declines were witnessed after a de-pegging event this past spring.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Still, USDC has been a big money maker for Coinbase and Circle, with the latter firm <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-08-10\/circle-usdc-stablecoin-issuer-says-1-billion-cash-to-counter-paypal-binance#:~:text=Circle%20had%20%24779%20million%20in,for%20all%20of%20last%20year.\" data-v-f87c67ca=\"\">reporting<\/a> $779 million in revenue during the first half of the year. As for Coinbase, interest-related income came in at $201.4 million for Q2, according to its shareholder <a href=\"https:\/\/s27.q4cdn.com\/397450999\/files\/doc_financials\/2023\/q2\/Shareholder-Letter-Q2-2023.pdf\" data-v-f87c67ca=\"\">letter<\/a> for the quarter. That's an increase from $32.5 million in Q2 2022. It's no surprise that Coinbase and Circle decided against expanding CENTRE given those juicy numbers. Under the terms of the new agreement, the firms will split revenue based on the amount of USDC minted or distributed, as <a href=\"https:\/\/fortune.com\/crypto\/2023\/08\/21\/coinbase-circle-usdc-equity-centre-stablecoins\/amp\/\" data-v-f87c67ca=\"\">reported<\/a> by Fortune. The original consortium plan made sense in a smaller, more competitive crypto market, but today revenues are way too significant to split up for likely marginal gains from outside help in spurring USDC adoption. There's also more regulatory clarity coming for stablecoins, which made Circle and Coinbase comfortable enough to officially shutter CENTRE, according to a source familiar with the firm's plans.&nbsp;","As for the timing of this deal, it is curious. Obviously, PayPal's news seems relevant but I am not 100% convinced that Circle views them as a big competitor. To be clear, PayPal has had limited success with their Venmo crypto offering. In any case, USDC is losing traction, so a change needed to be made to return to former glory. The firms are planning to expand the coin in more jurisdictions, expand to new chains, and strike further institutional deals.&nbsp;","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">This first appeared in Frank Chaparro's biweekly The Scoop Newsletter.&nbsp;<a href=\"https:\/\/www.theblock.co\/newsletters\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Sign up<\/a>&nbsp;now.&nbsp;<\/em><\/strong>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$779 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"the first half of the year","content":"DATE"},{"type":"Coinbase and Circle","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"$32.5 million","content":"MONEY"},{"type":"$50 billion","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"$201.4 million","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"Circle","content":"ORGANIZATION"},{"type":"spring","content":"DATE"},{"type":"Memory Lane","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["COINBASE","USDC"],"authors":["Frank Chaparro","The Block"]}