{"summary":"The HashKey EcoPoints token has a fixed total supply of one billion HSK. The team will receive 30% of the token supply, while 65% is for &quot;ecosystem growth.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225852\/hashkey-token-hsk","publishDate":"2023-04-12T03:21:21","id":9131,"type":null,"title":"HashKey launches incentivized EcoPoints token: HSK","category":["FINANCE FIRMS"],"content":["HashKey Group <a href=\"https:\/\/www.hashkey.com\/en\/newsroom\/hashkey-group-launches-hsk\" data-v-f87c67ca=\"\">launched<\/a> its HashKey EcoPoints token, HSK, designed to incentivize contributors, users, and partners.","The token has a fixed total supply of one billion HSK. The HaskHey team will receive 30% of the token supply, while 65% is allocated for \"ecosystem growth.\" The remaining 5% is dedicated to a reserve fund.","\"HSK will power the diverse businesses of the HashKey ecosystem, activate the ecosystem's growth, and reward users and partners for contributing to the development of the ecosystem,\" the Asian virtual asset financial services group stated.","HashKey EcoPoints will be rewarded for using its exchange and future business, and \"there will be regular repurchasing and burning of HSK from circulating supply to offset dilutionary effect of reward distribution.\"","\"HSK has a fair, incentive-based distribution mechanism to ecosystem users and partners,\" it added. &nbsp;","According to HashKey, no private or public sales of HSK took place.","Furthermore, no form of fundraising was carried out through HSK.","HashKey Group is a spinoff of Chinese conglomerate Wanxiang Group and was one of the earliest investors in Ethereum in 2014.","In January, HashKey Capital <a href=\"https:\/\/www.theblock.co\/post\/202755\/crypto-hashkey-capital-third-fund-500-million\" data-v-f87c67ca=\"\">closed<\/a> its third fund, HashKey Fintech Investment III, by raising $500 million. The fund targets crypto investments with a focus on infrastructure and application builders.","HashKey's portfolio includes some high-profile companies and projects, including Aztec, Blockdaemon, dYdX, Animoca Brands, Falcon X, Polkadot and Coinlist.","<em data-v-f87c67ca=\"\">Updated with more context and information.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"Blockdaemon","content":"LOCATION"},{"type":"30%","content":"PERCENT"},{"type":"$500 million","content":"MONEY"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"HSK","content":"ORGANIZATION"},{"type":"Wanxiang Group","content":"ORGANIZATION"},{"type":"HashKey Group","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"HashKey Capital","content":"ORGANIZATION"},{"type":"Fintech Investment III","content":"ORGANIZATION"}],"hashtag":["INVESTMENT FIRMS"],"authors":["Adam James","The Block"]}