{"summary":"Over 11.7 million OP tokens were distributed directly via an airdrop to eligible wallets following a snapshot taken on Jan. 20.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210348\/op-token-trades-down-after-second-airdrop-reward-from-optimism","publishDate":"2023-02-09T16:13:42","id":9132,"type":null,"title":"OP token trades down after second airdrop reward from Optimism","category":["LAYER 2S AND SCALING"],"content":["<span data-v-f87c67ca=\"\">Optimism users who delegated their voting power or spent gas transacting on the Layer 2 network received a portion of an OP token airdrop today as part of the network’s plan to power its mainnet.<\/span>","<span data-v-f87c67ca=\"\">A total of 11,742,277.10 OP tokens ($28.5 million) were airdropped to 307,965 unique addresses, according to Optimism. The OP token allocations were designed to reward users based on the amount of OP delegated, and to serve as a partial gas fee rebate, Optimism said.<\/span>","<span data-v-f87c67ca=\"\">Additional multipliers applied to certain accounts that delegated more than 20 OP at the time of the snapshot or had 54,367 OP delegated for a certain number of days. Those who made app transactions on the network over six months or spent over $20 in gas fees were also eligible for multipliers.<\/span>","<span data-v-f87c67ca=\"\">Traders with a sudden windfall of OP tokens hit the markets with their bounty, and OP took dip in the charts, trading down just over 13%, TradingView data show.<\/span>","","","<span data-v-f87c67ca=\"\">Optimism <\/span><a href=\"https:\/\/www.theblock.co\/linked\/149464\/optimisms-governance-token-officially-goes-live\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">introduced<\/span><\/a><span data-v-f87c67ca=\"\"> the OP token to fuel its bicameral governance system via a 214 million token claim eligible to a total of 231,000 addresses in May 2022.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$20","content":"MONEY"},{"type":"May 2022","content":"DATE"},{"type":"13%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"$28.5 million","content":"MONEY"}],"hashtag":["AIRDROP","GOVERNANCE VOTES","OPTIMISM"],"authors":["Jeremy Nation","The Block"]}