{"summary":"Lawmakers on both sides of the aisle have signaled they want to pass new laws to regulate digital assets, particularly after this summer’s market crash. Tuesday’s rapid collapse and preliminary sale of FTX also figures to influence that debate.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183896\/midterm-outcome-unclear-as-vote-counting-continues","publishDate":"2022-11-09T02:50:22","id":9139,"type":null,"title":"House, Senate control unclear as vote counting continues","category":["POLICY"],"content":["It wasn’t clear which party will control the Senate after polls closed on Tuesday night, with vote counts in multiple states still too close to call early into Wednesday morning, and a runoff election likely in Georgia.","Republicans remained favorites to win a majority in the U.S. House of Representatives, but saw their hopes for a \"red wave\" creating a comfortable majority evaporate early in the night, as several Democratic incumbents in that chamber unexpectedly won re-election.&nbsp;","“While many races remain too close to call, it is clear that House Democratic members and candidates are strongly outperforming expectations across the country,” House Speaker Nancy Pelosi, D-Calif., said in a statement.","In brief remarks delivered around 2 a.m. local time in Washington, D.C., hours after they were originally scheduled, House Minority Leader Kevin McCarthy, R-Calif., declared, \"It is clear that we are going to take the House back.\"&nbsp;","Republicans still look likely to take a majority in the House, though Democrats retain a chance at keeping their slim margin in that chamber of Congress, and Republican aspirations for large gains were quickly tempered.&nbsp;","Election officials are still counting midterm election votes in key states like Georgia, Arizona, and Nevada, and the final outcome may not be clear until later in week — or in the case of a Georgia's Senate race, until after a runoff election next month if neither of the top two candidates finishes with a majority of the overall vote, as looks likely.&nbsp;","Lawmakers on both sides of the aisle have signaled they want to pass new laws to regulate digital assets, particularly after this summer’s market crash. Tuesday’s rapid collapse and preliminary sale of FTX also is expected to influence that debate.","“The recent events show the necessity of Congressional action. It’s imperative that Congress establish a framework that ensures Americans have adequate protections while also allowing innovation to thrive here in the U.S.,\" said Rep. Patrick McHenry, R-N.C., the current top Republican on the House Financial Services Committee, in a statement released Tuesday.&nbsp;","Democrats have controlled both chambers for the last two years. Shifts in majority would affect which cryptocurrency bills advance from legislative committees and how they are drafted. But President Joe Biden, a Democrat, will be the final vote, with the option of vetoing legislation or signing new bills into law.","A bipartisan commodities regulation bill introduced by Sens. Debbie Stabenow, D-Mich., and John Boozman, R-Ark., could get a committee vote later this month, but the collapse of FTX on Election Day may complicate the bill’s prospects. The exchange’s CEO, Sam Bankman-Fried, was a lead industry proponent of the bill, which also has the backing of Commodity Futures Trading Commission Chair Rostin Benham, a former Stabenow aide.","Boozman, the co-author of the commodities bill, could take control of the Senate Agriculture Committee if the Republicans prevail. Stabenow has led the committee for the last two years.&nbsp;","Meanwhile, House Financial Services Committee Chair Maxine Waters, D-Calif., and McHenry spent months this year drafting stablecoin legislation. If Republicans take control of the House, McHenry will likely be the committee chair next year. The North Carolina Republican has signaled he will continue working with Democrats and his fellow Republicans on the stablecoin bill legislation in January if it does not pass before this Congress ends.","The midterm election also marks one notable departure for crypto policy watchers. Sen. Pat Toomey, R-Pa., did not seek reelection this cycle. Toomey is the ranking Republican on the Senate Banking Committee, and has been seen as an influential voice on crypto policy by many in the industry. Sen. Tim Scott, R-S.C., is in line to take his place as the top Republican on the committee, and possible chair, depending on which party assumes control of the Senate. If Democrats retain control, Sen. Sherrod Brown, D-Ohio, is expected to continue as Senate Banking chair.","Outside of committee leadership, the House and Senate are likely to welcome several crypto-friendly candidates in January. Democrat Glenn Ivey won a congressional race in Maryland, though Francis Conole, another digital asset-friendly Democrat, was down slightly to his Republican opponent in a yet-to-be-called race for a House seat in upstate New York.&nbsp;","On the Senate side, incumbent senator Sen. Mark Kelly, D-Ariz., led Republican Blake Masters, though Arizona election officials still had much of the vote left to count. GOP megadonor Peter Thiel used digital assets to raise money to bolster the campaign of Masters, co-author of Thiel's book 'Zero to One' and former president of Thiel's foundation. In Ohio, Thiel-backed J.D. Vance, another crypto-curious politician, beat Rep. Tim Ryan, D-Ohio. Ryan was also broadly supportive of digital assets. &nbsp;","Deep-pocketed donors with ties to the crypto industry poured millions into the midterm primary elections in support of pro-crypto candidates, but spent far less on the November general election.","Crypto super PACs spent five times as much cash on Republicans in the general election than they did on Democrats during the same period, according to a review of Federal Election Commission data. That gap was fueled in part by the conservative Club for Growth, an establishment GOP organization that launched two crypto-focused super PACs this cycle. Super PACs can raise and spend unlimited amounts of money, but cannot coordinate with campaigns.&nbsp;","The Club for Growth’s crypto super PACs spent a combined $3.7 million in the November general election. Bitcoin Freedom PAC spent $249,000 opposing Democrat Cheri Beasley, who lost to Rep. Ted Budd, R-N.C. for that state's open Senate seat. Meanwhile in Utah, Crypto Freedom PAC spent $3.3 million boosting Sen. Mike Lee, R-Utah, and attacking his unsuccessful independent challenger Evan McMullin. The PAC spent smaller sums supporting Masters and Republican Senate hopeful Adam Laxalt in Nevada, in a race where the count remained uncertain early into Wednesday morning on the East Coast.&nbsp;","“We wanted to be front-and-center on the pro-free market, limited government side of the debate, and so we've engaged people that care about bitcoin and crypto to help us financially to be able to elect champions who we know will stand up for those positions,” Club for Growth President David McIntosh said on a call with reporters last week.&nbsp;","A pair of super PACs funded by crypto industry executives also boosted candidates in October and November. Crypto innovation PAC spent $325,000 for several Republican candidates, including Missouri Senate hopeful Eric Schmitt and Rep. Markwayne Mullin, R-Okla., who is running for Senate. The PAC also boosted Texas congressional candidate Wesley Hunt and Erin Houchin, who is running for a House seat in Indiana.&nbsp;","On the Democratic side, Web3 Forward PAC boosted Sen. Ron Wyden, D-Ore., who chairs the Senate Finance Committee. The super PAC also spent for a trio of House candidates: Brittany Pettersen in Colorado, and Kevin Mullin and Sydney Kamlager in California. The committee reported spending $444,000 across those races.","<em data-v-f87c67ca=\"\">With additional reporting by Colin Wilhelm.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Peter Thiel","content":"PERSON"},{"type":"Kevin McCarthy","content":"PERSON"},{"type":"John Boozman","content":"PERSON"},{"type":"Maryland","content":"LOCATION"},{"type":"Markwayne Mullin","content":"PERSON"},{"type":"Kevin Mullin","content":"PERSON"},{"type":"U.S. House of Representatives","content":"ORGANIZATION"},{"type":"Sherrod Brown","content":"PERSON"},{"type":"upstate New York","content":"LOCATION"},{"type":"Republican Senate","content":"ORGANIZATION"},{"type":"J.D. Vance","content":"PERSON"},{"type":"$325,000","content":"MONEY"},{"type":"Colin Wilhelm","content":"PERSON"},{"type":"Senate Banking","content":"ORGANIZATION"},{"type":"Adam Laxalt","content":"PERSON"},{"type":"David McIntosh","content":"PERSON"},{"type":"Debbie Stabenow","content":"PERSON"},{"type":"Mark Kelly","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Federal Election Commission","content":"ORGANIZATION"},{"type":"McHenry","content":"ORGANIZATION"},{"type":"Erin Houchin","content":"PERSON"},{"type":"Tim Ryan","content":"PERSON"},{"type":"Republican Blake Masters","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Rostin Benham","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"Georgia","content":"LOCATION"},{"type":"night","content":"TIME"},{"type":"Nancy Pelosi","content":"PERSON"},{"type":"Tim Scott","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"Colorado","content":"LOCATION"},{"type":"House","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"East Coast","content":"LOCATION"},{"type":"California","content":"LOCATION"},{"type":"Arizona","content":"LOCATION"},{"type":"Utah","content":"LOCATION"},{"type":"Ore.","content":"LOCATION"},{"type":"Ark.","content":"LOCATION"},{"type":"Boozman","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"D.C.","content":"LOCATION"},{"type":"Senate Agriculture Committee","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"},{"type":"$249,000","content":"MONEY"},{"type":"GOP","content":"ORGANIZATION"},{"type":"$3.3 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Pat Toomey","content":"PERSON"},{"type":"$444,000","content":"MONEY"},{"type":"Thiel","content":"ORGANIZATION"},{"type":"Okla.","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"Evan McMullin","content":"PERSON"},{"type":"House Financial Services Committee Chair Maxine Waters","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Pa.","content":"LOCATION"},{"type":"Ted Budd","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$3.7 million","content":"MONEY"},{"type":"Mike Lee","content":"PERSON"},{"type":"Sydney Kamlager","content":"ORGANIZATION"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Glenn Ivey","content":"PERSON"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"Ron Wyden","content":"PERSON"},{"type":"Ariz.","content":"LOCATION"},{"type":"Washington","content":"LOCATION"},{"type":"Francis Conole","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Patrick McHenry","content":"PERSON"},{"type":"Ohio","content":"LOCATION"},{"type":"2 a.m. local time","content":"TIME"},{"type":"Senate Finance Committee","content":"ORGANIZATION"},{"type":"House Minority","content":"ORGANIZATION"},{"type":"Crypto Freedom PAC","content":"ORGANIZATION"},{"type":"last two years","content":"DATE"},{"type":"North Carolina","content":"LOCATION"},{"type":"” House","content":"ORGANIZATION"},{"type":"Mich.","content":"LOCATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"Calif.","content":"LOCATION"},{"type":"Stabenow","content":"PERSON"},{"type":"Eric Schmitt","content":"PERSON"},{"type":"Cheri Beasley","content":"PERSON"},{"type":"Nevada","content":"LOCATION"},{"type":"Masters","content":"ORGANIZATION"},{"type":"Missouri Senate","content":"ORGANIZATION"},{"type":"Brittany Pettersen","content":"PERSON"},{"type":"Wesley Hunt","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Indiana","content":"LOCATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}