{"summary":"In a new interview, CLO Craig Salm said the firm is preparing its brief for the appellate court. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158778\/grayscale-clo-says-firm-is-laser-focused-on-preparing-arguments-against-sec-etf-rejection","publishDate":"2022-07-20T16:58:46","id":9140,"type":null,"title":"Grayscale CLO says firm is &quot;laser focused&quot; on SEC ETF rejection case","category":["LEGAL"],"content":["Grayscale Chief Legal Officer Craig Salm says the firm and its counsel are \"laser-focused\" in writing their brief to present to the appellate court in their case against the US Securities and Exchange Commission (SEC).","The firm <a href=\"https:\/\/www.theblock.co\/linked\/155000\/grayscale-files-suit-against-sec-following-rejection-of-gbtc-conversion-bid\" data-v-f87c67ca=\"\">brought a case<\/a> against the SEC last month after the securities regulator <a href=\"https:\/\/www.theblock.co\/post\/154924\/sec-rejects-grayscales-bid-to-convert-gbtc-to-a-bitcoin-etf\" data-v-f87c67ca=\"\">denied<\/a> its most recent attempt to convert its Grayscale Bitcoin Trust (GBTC) to a spot bitcoin exchange-traded fund (ETF) to market. The SEC has yet to allow a spot bitcoin product to reach the market, with repeated denials citing a lack of sufficient protection against market manipulation.","In the lead up to its denials, during which time the SEC rejected multiple similar products, Grayscale pushed back on the regulator's arguments. It sent a <a href=\"https:\/\/www.theblock.co\/post\/125817\/grayscale-argues-the-secs-bitcoin-etf-treatment-could-violate-the-apa\" data-v-f87c67ca=\"\">letter<\/a> to the agency arguing that the repeated rejections could violate the Administrative Procedure Act (APA), since the SEC has approved multiple bitcoin futures ETFs. According to spot bitcoin ETF supporters, any manipulation found in the spot market would affect the futures market, making the SEC's willingness to approve a futures product but not a spot offering inconsistent.","Now Grayscale is locked in a legal battle with the SEC to hammer out that argument. In an interview at Bloomberg's crypto event eon July 19, Salm said that because the issuer is challenging a decision from a federal agency, its complaint bypasses district courts and goes straight to the appellate level, which will save time in a possibly lengthy legal battle.&nbsp;","\"Based on discussions with our counsel, we're hearing at the appellate level anywhere from 9 to 12 months — could be shorter, could be longer,\" Salm said. \"Litigation is inherently uncertain in terms of timing.\"","The case is at the start of the process, and Grayscale is primarily focused on putting together its legal arguments to present before the court. Salm said the argument is \"straightforward and simple.\"","\"You have futures ETFs. You have spot ETFs. They both draw their pricing based on the underlying markets, so if you're okay with one, you should also be okay with the other.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Craig Salm","content":"PERSON"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"APA","content":"ORGANIZATION"},{"type":"July 19","content":"DATE"},{"type":"Salm","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Aislinn Keely","The Block"]}