{"summary":"The project looked after its users’ private keys on their behalf. It’s now planning to scrap that and refund those affected.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/127270\/96-private-keys-stolen-from-vulcan-forged-in-140-million-theft","publishDate":"2021-12-13T06:36:50","id":9143,"type":null,"title":"96 private keys stolen from Vulcan Forged in $140 million theft","category":["HACKS"],"content":["Earlier today, 96 private keys were stolen from the crypto gaming ecosystem Vulcan Forged, enabling the attacker to siphon off $140 million in cryptocurrency.","Vulcan Forged offers a smorgasbord of crypto activities. It is primarily a game studio, offering six different blockchain-based games. But it also has an NFT marketplace and its own decentralized exchange, where users can trade its token PYR.","When someone registers an account with Vulcan Forged, the platform creates a set of blockchain wallets for them on the Ethereum, Polygon and VeChain blockchains. Rather than have the user manage their own private keys, the platform does so on their behalf.&nbsp;","According to the project’s own wiki, it works with wallet management service Venly (formerly Arkane Network) to create its wallets —&nbsp;a service also used by Atari, Matic and the Blockchain Game Alliance.&nbsp;","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">\"Venly Servers or Solutions have not been compromised. The Venly team is actively helping the Vulcan Forged team with data analytics to help them understand and recover from this unfortunate event. Official communication will follow soon.\" said Venly CEO Tim Dierckxens.<\/span>","The 96 wallets that were affected contained 4.5 million PYR, worth $140 million at the time of the attack. That’s 9% of the project’s total supply of tokens, according to CoinGecko, and 23.7% of the circulating supply. Other assets including ether (ETH) and polygon (MATIC) <a href=\"https:\/\/twitter.com\/VulcanForged\/status\/1470298466366730246\" data-v-f87c67ca=\"\">may have also<\/a> been taken.","After the exploit was discovered — but before it was announced — Vulcan Forged <a href=\"https:\/\/discord.com\/channels\/759537056153337906\/762789107189022750\/919753056407654400\" data-v-f87c67ca=\"\">told<\/a> its community to remove funds from the liquidity pools on decentralized exchanges. This would make it harder for the attacker to cash out the funds, without using centralized exchanges where they might need identity documents.","Despite this, the attacker has sold significant amounts of PYR for ETH, selling small batches of tokens at a time. But they still have 2 million PYR (currently worth $47 million) sitting untouched in <a href=\"https:\/\/etherscan.io\/address\/0xe3cd90be37a79d9da86b5e14e2f6042cd0e53b66\" data-v-f87c67ca=\"\">one wallet<\/a>.","This selling pressure has dropped the price of PYR. It was at $31 prior to the attack and is now at $24 — down 22%.","Vulcan Forged has <a href=\"https:\/\/twitter.com\/VulcanForged\/status\/1470282822040829952\" data-v-f87c67ca=\"\">said<\/a> the project’s treasury will send out PYR and Vulcan Forged’s LAVA tokens to those affected. They will need to set up accounts with MetaMask and will receive the tokens there. Anyone who had ETH or MATIC stolen will receive the equivalent amount in PYR. So far, half of the funds have <a href=\"https:\/\/twitter.com\/VulcanForged\/status\/1470354826265567235?s=20\" data-v-f87c67ca=\"\">been reimbursed<\/a>.","“We have contacted all exchanges to blacklist that address. It also seems the wallet owner may have KYCd [completed Know Your Customer checks] on an exchange we’re now in contact with,” <a href=\"https:\/\/twitter.com\/VulcanForged\/status\/1470209893114294282\" data-v-f87c67ca=\"\">tweeted<\/a> Vulcan Forged.","It <a href=\"https:\/\/twitter.com\/VulcanForged\/status\/1470282822040829952\" data-v-f87c67ca=\"\">added<\/a> that it is removing what it described as a semi-custodial solution from the Vulcan Forged ecosystem — meaning that in the future, its users will need to look after their own private keys.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Matic","content":"PERSON"},{"type":"Blockchain Game Alliance","content":"ORGANIZATION"},{"type":"$31","content":"MONEY"},{"type":"Vulcan Forged","content":"ORGANIZATION"},{"type":"9%","content":"PERCENT"},{"type":"$24","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"22%","content":"PERCENT"},{"type":"Vulcan","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Atari","content":"ORGANIZATION"},{"type":"$140 million","content":"MONEY"},{"type":"Tim Dierckxens","content":"PERSON"},{"type":"23.7%","content":"PERCENT"},{"type":"$47 million","content":"MONEY"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}