{"summary":"BlackRock CEO Larry Fink said Wednesday that he wanted to work with regulators and hear any concerns they may have about a recent filing from the asset manager for a spot bitcoin ETF.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237978\/blackrock-ceo-larry-fink-sees-bitcoin-as-digitizing-gold","publishDate":"2023-07-05T16:24:29","id":9148,"type":null,"title":"BlackRock CEO Larry Fink sees bitcoin as &#x27;digitizing gold&#x27;","category":["COMPANIES"],"content":["BlackRock CEO Larry Fink said Wednesday that he wanted to work with regulators and hear any concerns they may have about a <a href=\"https:\/\/www.theblock.co\/post\/237563\/blackrock-refile-for-spot-bitcoin-etf-naming-coinbase-as-surveillance-partner\" data-v-f87c67ca=\"\">recent filing<\/a> from the asset manager for a spot bitcoin ETF. He also said he viewed the largest cryptocurrency by market capitalization as having the role of \"digitizing gold.\"","\"We have a good track record working with our regulators and trying to make sure we're thinking about all the issues around any filing,\" he said in an interview with Fox Business, adding that he couldn't get into specifics about the application. \"We work really closely with our regulators, and we want to hear from the regulators.\"&nbsp;","\"What we're trying to do with crypto is make it more democratized and make it much cheaper for investors,\" he continued. \"Right now, the bid ask spread for crypto is very expensive. It does erode a lot of the returns...We hope our regulators look at these filings as a way to democratize crypto,\" he said.","Nasdaq last week <a href=\"https:\/\/www.theblock.co\/post\/237563\/blackrock-refile-for-spot-bitcoin-etf-naming-coinbase-as-surveillance-partner\" data-v-f87c67ca=\"\">refiled<\/a> a 19b-4 form for BlackRock's iShares Bitcoin Trust, just days after The Wall Street Journal reported that the U.S. Securities and Exchange Commission said recent filings for spot bitcoin ETF funds had not been \"clear and comprehensive.\"","The updated filing from the exchange included language that it expected to enter into surveillance sharing agreements with Coinbase.","Speaking more broadly on bitcoin, Fink compared the asset to digital gold, although he said he didn't own any personally.","\"Specifically on bitcoin, as I've said in the past, we're a believer in digitization of products,\" he added. \"Bitcoin is an international asset...It can represent an asset that people can play as an alternative.\"","BlackRock made an <a href=\"https:\/\/www.theblock.co\/post\/235056\/blackrock-takes-giant-leap-toward-spot-bitcoin-etf-with-sec-filing\" data-v-f87c67ca=\"\">initial filing<\/a> for the bitcoin ETF on June 15 in a move that was quickly followed by other asset managers including Fidelity. Bitcoin has surged in the aftermath, rising 19% over the past month, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" data-v-f87c67ca=\"\">CoinGecko<\/a>.","The SEC has yet to approve a spot bitcoin ETF, and the recent applications could face challenges from the agency as it has in the past cited concerns about fraud and potential market manipulation when assessing potential spot funds.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Larry Fink","content":"PERSON"},{"type":"Bitcoin Trust","content":"ORGANIZATION"},{"type":"Fink","content":"PERSON"},{"type":"Fox Business","content":"ORGANIZATION"},{"type":"19%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"June 15","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["BLACKROCK","SEC"],"authors":["Nathan Crooks","The Block"]}