{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/12032\/30-million-is-not-going-to-be-an-issue-said-blockchain-consultant-allegedly","publishDate":"2019-02-17T13:19:44","id":915,"type":null,"title":"&#x27;$30 million is not going to be an issue&#x27;, blockchain consultant allegedly said","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Choice Trade Holdings, Inc. v. Thomas Renna, (Superior Court of NJ, Law Division, Middlesex County, February 4, 2019) [NMR]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","Another CCM, and another lawsuit related to promises and expectations. A good rule of thumb is to be honest with people. Admit your faults, don’t promise what you can’t deliver. Everyone knows these things, but we’re all human and sometimes we don’t follow those rules. In the same vein, you really should try and avoid lying about people. You just might get sued over it, and that is an interesting component to this case.","The plaintiffs, Choice Trade Holdings, and defendant, Thomas Renna, entered into an agreement on Oct. 15, 2018. Choice Trade would pay Renna to help them promote a crypto fundraising effort they were undertaking. Allegedly, Renna made multiple representations to Choice Trade about the strength of his network, and his potential reach and ability to find potential investors on their behalf. Supposedly he said, and I quote, “getting your revenue to $30 million is not going to be an issue; that’s the easy part.” Naturally, Choice Trade was enthusiastic about the prospect of working with someone with access to so much capital who would help them with their fundraising event. They paid Renna a $30,000 signing bonus, and agreed to pay him $10,000 a month moving forward. Almost immediately things started to go wrong.","Allegedly, right after the agreement was signed the defendant told the plaintiffs that they were not ready to go through with their intended raise. Instead, as alleged in the complaint the defendant told them “you need to get your message right. Once you do that, you will raise the $700,000 in a few days. It’s not a lot of money.” The complaint continues “having said that, defendant claimed that he would ‘ work on the message’. Defendant claimed that he was working 18-hour days, seven days a week. Despite this, defendant produced few results.”","Over the next couple of months the plaintiffs asked for deliverables and updates, and the defendant’s responses were unsatisfactory to the plaintiffs. On Jan. 10, the plaintiffs sent a letter terminating their relationship with the defendant, that is when things get weird.","Up to this point this case looked like a lot of other lawsuits we cover. Blockchain consultant promises the world, client is disappointed, and well, maybe there’s some fraud. Here, allegedly after their business relationship ended, Renna somehow thought it would be a good idea to go and trash the plaintiff’s company on a variety of websites. These postings online included information that was not true about the plaintiffs. You really can’t just go and do that, because putting out false information that harms someone’s reputation is defamation, and yet, here we are.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part III of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"]Choice Trade Holdings, Inc.","content":"ORGANIZATION"},{"type":"$30,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Thomas Renna","content":"PERSON"},{"type":"Choice Trade Holdings","content":"ORGANIZATION"},{"type":"Jan. 10","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"February 4, 2019","content":"DATE"},{"type":"CCM","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"Oct. 15, 2018","content":"DATE"},{"type":"$10,000","content":"MONEY"},{"type":"Choice Trade","content":"ORGANIZATION"},{"type":"Renna","content":"PERSON"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Middlesex County","content":"LOCATION"},{"type":"(Superior Court of NJ","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"Law Division","content":"ORGANIZATION"},{"type":"$700,000","content":"MONEY"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"}],"hashtag":[],"authors":["Nelson Rosario","The Block"]}