{"summary":"The decision from Binance comes more than one month after Circle announced that it immediately ended USDC minting services on Tron.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284352\/binance-usdc-tron-discontinue","publishDate":"2024-03-25T03:53:05","id":9156,"type":null,"title":"Binance to discontinue USDC support on the Tron blockchain","category":["EXCHANGES"],"content":["Binance will discontinue support for USDC — a prominent dollar-pegged stablecoin — deposits and withdrawals on the Tron blockchain on April 5.","Deposits of TRC20 USDC tokens will no longer be credited to Binance users' accounts after 2:00 a.m UTC on the aforementioned date, the crypto exchange <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-will-cease-support-for-deposits-and-withdrawals-of-usdc-via-the-tron-network-trc20-33df0ff0e2e94259950b5c4b1f4952f7\" data-v-f87c67ca=\"\">announced<\/a> in an official blog post.","Because the change is specific only to USDC issued on the Tron blockchain, deposits and withdrawals of the stablecoin on other networks — such as Ethereum — will not be impacted.","USDC trading on Binance will also remain unaffected.","Binance's decision to remove support for TRC20 USDC comes more than one month after the stablecoin's issuer, Circle, announced that it <a href=\"https:\/\/www.theblock.co\/post\/278303\/circle-ceases-usdc-support-on-tron\" data-v-f87c67ca=\"\">immediately ended USDC minting services on Tron<\/a>.","<span data-v-f87c67ca=\"\">“As part of our risk management framework, Circle continually assesses the suitability of all blockchains where USDC is supported,” the company said at the time, explaining: <\/span><span data-v-f87c67ca=\"\">“This action aligns with our efforts to ensure that USDC remains trusted, transparent and safe.\"<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\/usdc-supply-by-blockchain\/embed\" title=\"USDC Supply by Blockchain\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Though Tron is rapidly decreasing as a home for USDC, the blockchain still holds the majority of the USDT — the dominant stablecoin — supply.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\/usdt-supply-by-blockchain-daily\/embed\" title=\"USDT Supply by Blockchain\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"April 5","content":"DATE"},{"type":"Circle","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE","USDC"],"authors":["Adam James","The Block"]}