{"summary":"Regulation, reporting, and external controls are barrelling toward crypto like the pump of a newly minted altcoin - but can the industry handle it?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154338\/the-brewing-crypto-accounting-storm","publishDate":"2022-06-27T09:00:33","id":9157,"type":null,"title":"The Brewing Crypto Accounting Storm","category":["SPONSORED"],"content":["<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\">Regulation, reporting, and external controls are barrelling toward crypto like the pump of a newly minted altcoin - <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">but can the industry handle it?<\/span><\/i>","<span data-v-f87c67ca=\"\">As Microstrategy CEO, Michael Saylor, recently noted to <\/span><a href=\"https:\/\/fortune.com\/2022\/06\/20\/bitcoin-whale-microstrategy-michael-saylor-urges-governments-to-regulate-crypto\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Fortune<\/span><\/a><span data-v-f87c67ca=\"\">, many <\/span><span data-v-f87c67ca=\"\">“crypto exchanges, offshore and onshore, are unregistered, unregulated and offer 20X leverage,” going on to infer these financial entities fall into a list he’d call the “parade of horribles.” All of this starkly contrasts the relatively buttoned-up world of <\/span><a href=\"https:\/\/ledgible.io\/enterprise-accounting\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">accounting<\/span><\/a><span data-v-f87c67ca=\"\"> and traditional finance.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Tailor your requirements as much as you want to facilitate cryptocurrency as an asset class in the modern financial ecosystem, no one is going to be able to skirt capital requirements, GAAP Accounting, and every other regulation that traditional securities have to fit into in the long run. A storm is brewing as the “parade of horribles,” a square peg, is forced into the round hole of <\/span><a href=\"https:\/\/ledgible.io\/how-to-handle-crypto-transactions-and-ensure-compliance-on-tax-returns\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">accounting regulation<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Storms aren’t always bad though, they often reinvigorate ecosystems, knocking down dead and dying foliage along the way. When storms do hit and waters rage, they flow along existing paths, slopes, channels, and hills. They flow down the familiar, the established - <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the known.<\/span><\/i>","<span data-v-f87c67ca=\"\">Transcending from this ethereal metaphor into the real world of financial reporting and cryptocurrency, we’re faced with the likely outcome of this brewing storm. The destruction of weak and damaging players in the crypto space and the flow through existing financial systems and pathways.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The pending storm facing crypto will force it into the traditional accounting sphere. CPAs, <\/span><a href=\"https:\/\/ledgible.io\/ledgibles-cryptocurrency-tax-guide-for-professionals-accountants-institutions\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tax attorneys<\/span><\/a><span data-v-f87c67ca=\"\">, accountants, and financial professionals that deal with crypto as an asset understand that this relatively newly minted class doesn’t jive with traditional finance without the pipes to facilitate it. <\/span><span data-v-f87c67ca=\"\">Like the storms that faced traditional financial players in crises past, it is guaranteed that CPAs will be called upon to conduct the forensic analysis required to clean up afterward.<\/span>","<span data-v-f87c67ca=\"\">Businesses still have to close books, publish financial statements, and function in an ecosystem molded by a history of prior crashes. In the crash of 2008, we saw a financial ecosystem collapse on the back of overleveraged credit default swaps on mortgage-backed securities. As bad as this storm of overleverage and financial mismanagement was, it brought regulation to the financial ecosystem. The brewing crypto accounting storm will further push the world of cryptocurrencies, DeFi, and traditional assets – all viewed as highly valuable to investment professionals – into the world of traditional accounting. Sure, perhaps new rules will be written to facilitate digital assets, but if the IRS’s <\/span><a href=\"https:\/\/www.irs.gov\/newsroom\/irs-reminds-taxpayers-they-must-check-a-box-on-form-1040-1040-sr-or-1040-nr-on-virtual-currency-transactions-for-2021\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">lacking concrete guidance<\/span><\/a><span data-v-f87c67ca=\"\"> on crypto is any foreshadowing, don’t expect it to come fast.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Until then, allowing crypto to flow gracefully into the ecosystems of traditional tax and accounting relies on specialized tools that bridge the gap between crypto and tradfi. The dots of a decentralized ecosystem must be connected to the buttoned-up world of accounting if we hope for mass adoption. Easing the barrier to entry for cryptocurrency is a net positive for the space, so while <\/span><a href=\"https:\/\/ledgible.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">crypto tax and accounting tools<\/span><\/a><span data-v-f87c67ca=\"\">, like Ledgible, may seem like the unglamorous underpinnings of old financial ecosystems, they’re necessary to ensure that crypto weathers the fast-approaching storm.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ledgible","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Microstrategy","content":"ORGANIZATION"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"GAAP Accounting","content":"ORGANIZATION"},{"type":"2008","content":"DATE"},{"type":"Michael Saylor","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}