{"summary":"Cosmos community members voted against proposal 868, which sought to reduce the minimum inflation of ATOM from 7% to 0%.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273899\/cosmos-hub-inflation-reduction-proposal-rejection","publishDate":"2024-01-23T02:54:26","id":9158,"type":null,"title":"Cosmos Hub rejects proposed ATOM minimum inflation reduction","category":["GOVERNANCE"],"content":["Cosmos community members voted against proposal 868, which <a href=\"https:\/\/www.theblock.co\/post\/271552\/cosmos-hub-vote-atom-inflation\" data-v-f87c67ca=\"\">sought to implement<\/a><span data-v-f87c67ca=\"\"> a major change in the network’s economic policy by reducing the minimum inflation parameter from 7% to 0% if over two-thirds of the <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248377\/cosmos-hub-atom-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/cosmos_hub.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ATOM<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.33%\n    <\/span><\/a> <!----><\/span> supply was bonded on the network. However, this suggestion did not gain support.<\/span>","Proposal 868 — <a href=\"https:\/\/www.mintscan.io\/cosmos\/proposals\/868\" data-v-f87c67ca=\"\">introduced<\/a> by Cosmos contributor Stakelab — intended to mitigate inflationary pressures on the ATOM token, especially in scenarios where a substantial portion of the coins are bonded.","Despite the potential benefits highlighted by the proposer, such as cutting down the inflation rate if total bonded tokens rise, concerns were raised about the implications of reducing the inflation rate to zero — particularly regarding the impact on the Hub's security.","The Hub acts as the central hub for the Cosmos ecosystem, facilitating communication and interoperability between different blockchains built on Cosmos. ATOM is the native token of the Hub used for transaction fees, security and governance.","48.6% of validators voted against the proposal, whereas 25% were in support and 25.9% abstained.","Notable validators that voted against the proposal, wielding substantial voting power, included Everstake, Cosmostation, Chorus One, Allnodes, Stake.fish, Swish Staking, Forbole, ShapeShift DAO, Provalidator, Keplr and many others. Validators that supported the proposal included Game, Informal, Iqlusion, Stakecito, P2P, Polkachu, Pryzm, IrisNet, Leap and more.","This latest proposal followed the accepted Proposal 848, which <a href=\"https:\/\/www.theblock.co\/post\/264683\/cosmos-community-approves-capping-atom-inflation-rate-at-10?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">set a cap<\/a> on the maximum inflation rate at 10%, down from the previous 20%, to regulate token emissions.","On Cosmos, validators vote in addition to building blocks, and voters can delegate their stake to them.","The inflation rate on Cosmos Hub has been a subject of significant discussion for the last year. Some Cosmos contributors want it to be as minimal as possible, which they believe optimizes fresh emissions.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"Stakecito","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Keplr","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Everstake","content":"LOCATION"},{"type":"20%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Allnodes","content":"LOCATION"},{"type":"ShapeShift DAO","content":"ORGANIZATION"},{"type":"Pryzm","content":"LOCATION"},{"type":"25.9%","content":"PERCENT"},{"type":"Polkachu","content":"LOCATION"},{"type":"48.6%","content":"PERCENT"},{"type":"25%","content":"PERCENT"},{"type":"Forbole","content":"LOCATION"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"Iqlusion","content":"LOCATION"},{"type":"-0.33%","content":"PERCENT"},{"type":"0%","content":"PERCENT"}],"hashtag":["COSMOS","DAOS","GOVERNANCE VOTES"],"authors":["Vishal Chawla","The Block"]}