{"summary":"Tether intends to produce energy and mine bitcoin in Uruguay.\nThe news comes shortly after the stablecoin issuer said it will regularly buy bitcoin from its profits.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232521\/tether-bitcoin-mining-uruguay","publishDate":"2023-05-30T08:35:05","id":916,"type":null,"title":"Stablecoin issuer Tether to mine bitcoin in Uruguay","category":["Companies"],"content":["Stablecoin issuer Tether has entered the bitcoin mining and energy production space.","The company will begin operations in Uruguay in partnership with an unnamed \"local licensed company,\" it announced Tuesday. Tether declined to comment on the name of the local company.","\"By harnessing the power of Bitcoin and Uruguay's renewable energy capabilities, Tether is leading the way in sustainable and responsible Bitcoin mining,\" Paolo Ardoino, CTO of Tether, said in the announcement. \"Our unwavering commitment to renewable energy ensures that every Bitcoin we mine leaves a minimal ecological footprint while upholding the security and integrity of the Bitcoin network.\"","The news comes shortly after Tether <a href=\"https:\/\/www.theblock.co\/post\/231156\/tether-bitcoin-investments-profits\" data-v-f87c67ca=\"\">said<\/a> earlier this month that it will invest up to 15% of its profits in bitcoin on a regular basis to strengthen its reserves. Today's news shows Tether's continued bullish stance on the world's largest cryptocurrency.","As for choosing Uruguay to mine bitcoin, Tether said the South American country has emerged as a global leader in renewable energy, achieving a 94% electricity generation from renewable sources, predominantly wind and solar power.","\"Blessed with abundant natural resources, Uruguay offers ideal conditions for the production of renewable energy, facilitating the establishment of wind farms, solar parks, and hydropower projects, guaranteeing a consistent supply of clean and environmentally friendly energy,\" Tether added.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The company is hiring for various roles in its new energy and bitcoin mining venture. Tether will also \"soon\" expand its bitcoin mining operations to other countries, according to its website.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Tether is the largest stablecoin issuer in the world. Its USDT stablecoin has a total supply of over 83 billion tokens,&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">according to The Block's Data Dashboard.<\/span><\/a>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["MINING COMPANIES","TETHER"]}