{"summary":"Bitcoin restaking protocol BounceBit has raised $6 million in a seed funding round co-led by Blockchain Capital and Breyer Capital.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279603\/bitcoin-restaking-protocol-bouncebit-funding-tvl","publishDate":"2024-02-28T11:05:37","id":9169,"type":null,"title":"Bitcoin restaking protocol BounceBit raises $6 million in seed funding; already boasts over $540 million in TVL","category":["VENTURE CAPITAL"],"content":["BounceBit, a Bitcoin restaking protocol under development, has raised $6 million in a seed funding round co-led by Blockchain Capital and Breyer Capital.","Other investors in the round included CMS Holdings, Bankless Ventures, NGC Ventures, Matrixport Ventures, DeFiance Capital, OKX Ventures and HTX Ventures, BounceBit said Wednesday. Several angel investors, including Nathan McCauley, co-founder and CEO of Anchorage Digital; Ashwin Aiyappan, portfolio manager at Brevan Howard; and Calvin Liu, chief strategy officer of EigenLayer, also joined the round, BounceBit added.","BounceBit was founded last December and closed the seed round last week, founder and CEO Jack Lu, formerly a partner at NGC Ventures, told The Block. Lu said the round was structured as a simple agreement for future equity (SAFE) with a token warrant. He declined to comment on valuation.","BounceBit is the sister company of Bounce Finance, a token launchpad, Lu said. He mentioned that he had been a co-founder of Bounce Finance since 2020 but resigned recently. Lu added that Bounce Finance would support the BounceBit ecosystem.","BounceBit is a Bitcoin <a href=\"https:\/\/www.theblock.co\/tag\/restaking\" data-v-f87c67ca=\"\">restaking<\/a> protocol currently live in early access mode. It claims to have already amassed <a href=\"https:\/\/bouncebit.io\/\" data-v-f87c67ca=\"\">over $545 million<\/a> in total value locked in over a month since its early access launch on Jan. 23.","Lu said BounceBit can be compared with <a href=\"https:\/\/www.theblock.co\/post\/279515\/bitcoin-babylon-testnet-nft-passes\" data-v-f87c67ca=\"\">Babylon<\/a>, Merlin Chain, and B² Network, but its technology is unique. \"Our interaction with Bitcoin is anchored on the asset level rather than the protocol level,\" he said. \"BounceBit will build a plethora of infrastructure, exploring the use-cases of restaking for various types of bitcoin.\"","BounceBit's proof-of-stake Layer 1 network supports BTC, Binance's BTCB, and BounceBit's native token, Lu said. \"This approach not only broadens BTC involvement but also enhances chain security,\" he added.","Binance's BTCB is BounceBit's primary asset because it is the easiest to access, according to Lu. \"It has a swift creation and redemption process on the Binance exchange, coupled with robust liquidity on the BNB Chain. It provides the lowest barrier to entry to the average user,\" he said.","BounceBit will also launch BounceClub and the BounceBit App Store to grow its ecosystem. \"BounceClub is an on-chain web3 domain that empowers users to design, launch, and enjoy decentralized applications (dApps) within the BTC ecosystem,\" Lu said. \"It acts as a central hub, allowing users to tailor their web3 projects to their specific needs by choosing from the diverse array of tools and components from the BounceBit App Store.\"","Currently, 15 people are working for BounceBit, and with fresh funding in place, the startup looks to hire more people and launch its testnet and mainnet in the coming weeks, Lu said. The testnet is expected to go live early next month, and the mainnet in April, coinciding with the Bitcoin halving.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Anchorage Digital","content":"ORGANIZATION"},{"type":"Matrixport Ventures","content":"ORGANIZATION"},{"type":"Bounce Finance","content":"ORGANIZATION"},{"type":"Nathan McCauley","content":"PERSON"},{"type":"BounceClub","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bankless Ventures","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"OKX Ventures","content":"ORGANIZATION"},{"type":"HTX Ventures","content":"ORGANIZATION"},{"type":"BounceBit App Store","content":"ORGANIZATION"},{"type":"Brevan Howard","content":"ORGANIZATION"},{"type":"CMS Holdings","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"$6 million","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"BounceBit","content":"PERSON"},{"type":"DeFiance Capital","content":"ORGANIZATION"},{"type":"Jack Lu","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Ashwin Aiyappan","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Jan. 23","content":"DATE"},{"type":"Breyer Capital","content":"ORGANIZATION"},{"type":"NGC Ventures","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$545 million","content":"MONEY"},{"type":"Merlin Chain","content":"PERSON"},{"type":"Babylon","content":"LOCATION"},{"type":"Calvin Liu","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BITCOIN","SEED &AMP; PRE-SEED","STAKING FIRMS"],"authors":["Yogita Khatri","The Block"]}