{"summary":"The Monetary Authority of Singapore said the framework aims to ensure “a high degree of value stability for stablecoins regulated in Singapore.”","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244894\/singapore-watchdog-finalizes-stablecoin-rules","publishDate":"2023-08-15T02:10:46","id":917,"type":null,"title":"Singapore watchdog finalizes stablecoin rules","category":["POLICY"],"content":["MAS said the framework aims to ensure “a high degree of value stability for stablecoins regulated in Singapore.”","The Monetary Authority of Singapore today finalized new rules governing stablecoins.","MAS said the framework aims to ensure “a high degree of value stability for stablecoins regulated in Singapore,” in <a href=\"https:\/\/www.mas.gov.sg\/news\/media-releases\/2023\/mas-finalises-stablecoin-regulatory-framework\" data-v-f87c67ca=\"\">an announcement<\/a> issued Tuesday afternoon Asia time.","The watchdog had kicked off a public consultation on the framework in October last year and said it factored feedback into the new rules’ design.","The framework will apply to any single-currency stablecoins pegged to the Singapore Dollar or any other G10 currency issued in Singapore.","MAS said potential issuers will need to meet several key requirements. Those include the need to maintain suitable reserve assets to ensure stability; a requirement that they maintain a minimum capital base and liquid assets; the ability to return the par value of stablecoins to holders within five business days from a redemption request; and disclosure requirements.","Ms Ho Hern Shin, Deputy Managing Director (Financial Supervision) at MAS, said in a written statement, “MAS’ stablecoin regulatory framework aims to facilitate the use of stablecoins as a credible digital medium of exchange, and as a bridge between the fiat and digital asset ecosystems. We encourage SCS issuers who would like their stablecoins recognised as 'MAS regulated stablecoins' to make early preparations for compliance.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ho Hern Shin","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SCS","content":"ORGANIZATION"},{"type":"MAS","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"October last year","content":"DATE"},{"type":"afternoon","content":"TIME"}],"hashtag":["ASIAN REGULATION"],"authors":["Ryan Weeks","The Block"]}