{"summary":"The collaboration aims to provide solutions for crypto exchanges, financial institutions and government agencies in the country.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264310\/kpmg-chainalysis-crypto-crime-canada","publishDate":"2023-11-22T09:02:29","id":9171,"type":null,"title":"KPMG and Chainalysis join forces to combat rising crypto crime in Canada","category":["COMPANIES"],"content":["Big Four accounting firm KPMG’s Canadian arm has teamed up with blockchain data platform Chainalysis to help organizations combat rising crypto-related fraud.","The collaboration sees KPMG joining Chainalysis’ “Solution Provider” program, offering “rigorous monitoring, support, governance and risk management to crypto exchanges, financial institutions, law enforcement and government agencies,\" according to a statement.","KPMG professionals will become “Chainalysis Certified Investigators” as part of the program, designed to help them assist clients in detecting and preventing illicit crypto-based activity, adhere to evolving crypto regulations and enhance existing anti-money laundering compliance.","\"Crypto asset exchanges, crypto-native companies, financial institutions, government and law enforcement agencies are increasingly looking for innovative ways to help them 'follow the crypto' to investigate criminal activity,\" Enzo Carlucci, forensic leader at KPMG in Canada, said. \"By teaming up with Chainalysis, KPMG clients can benefit from Chainalysis' proprietary blockchain data monitoring technology, resulting in improved identification of potentially criminal activities and faster response times,\"&nbsp;","\"By teaming up with one of Canada's largest professional services firms, our clients can leverage the expertise of KPMG's trusted forensics and crypto asset advisory professionals to establish effective know your transaction (KYT) rules, stronger anti-money laundering protocols and robust investigation strategies,\" Chainalysis co-founder and Chief Strategy Officer Jonathan Levin added.","As crypto adoption continues to grow, global illicit crypto transaction volume reached record levels last year, hitting $20.6 billion, according to Chainalysis’ <a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=4032491-1&amp;h=1205464921&amp;u=https%3A%2F%2Fwww.chainalysis.com%2Fblog%2F2023-crypto-crime-report-introduction%2F&amp;a=Chainalysis+2023+Crypto+Crime+Report\" data-v-f87c67ca=\"\">2023 Crypto Crime Report<\/a>.","In Canada, the Ontario Securities Commission Contact Centre also reported a <a href=\"https:\/\/www.canadianunderwriter.ca\/risk\/getting-fraud-prevention-programs-right-is-crucial-for-commercial-clients-1004231122\/\" data-v-f87c67ca=\"\">200% increase<\/a> in crypto-related complaints since 2020.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"$20.6 billion","content":"MONEY"},{"type":"Jonathan Levin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"KPMG","content":"ORGANIZATION"},{"type":"Enzo Carlucci","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Ontario Securities Commission Contact Centre","content":"ORGANIZATION"},{"type":"200%","content":"PERCENT"},{"type":"Chainalysis","content":"PERSON"}],"hashtag":[],"authors":["James Hunt","The Block"]}