{"summary":"Optimism Foundation is proposing to grant Coinbase-backed Base 118 million OP tokens over a span of six years.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247532\/base-optimism-revenue","publishDate":"2023-08-25T13:18:38","id":9179,"type":null,"title":"Base set to receive 118M OP tokens over six years in agreement","category":["CRYPTO ECOSYSTEMS"],"content":["Coinbase-backed Layer 2 Base and the Optimism network’s governance body, The Optimism Collection, are set to collaborate on a revenue and governance sharing agreement.","An Optimism Collective <a href=\"https:\/\/optimism.mirror.xyz\/Luegue9qIbTO_NZlNVOsj25O1k4NBNKkNadp2d0MsTI?a\" data-v-f87c67ca=\"\">proposal<\/a> states Base will contribute either 2.5% of its total sequencer revenue or 15% of its net profits, whichever is greater, to the Optimism Collective, and in return, will receive up to 118 million OP tokens ($175 million) over six years, The Optimism Collective said.","The agreement is part of \"a shared commitment to the rules for upgrades and sequencing of OP Chains.\"","Since opening on Aug. 9 and backed by Coinbase on the OP Stack, Base operates as a Layer 2 chain on Ethereum and was developed using Optimism’s OP software stack. Both projects are part of what's named as the \"Superchain\" ecosystem.","\"Base and OP Mainnet will share upgrades, so the chains' blockspace remains compatible, homogeneous, and eventually interoperable in a Superchain future. How those upgrades evolve is up to Optimism governance,” the Optimism Collective added.","The development coincides with Base’s planned <a href=\"https:\/\/www.theblock.co\/post\/247268\/coinbase-base-optimism\" data-v-f87c67ca=\"\">move<\/a> toward decentralizing its network for improved security and uptime, with plans to implement fault proofs and multiple clients. Additionally, the teams at Base and Optimism are working on a \"security council\" for securely executing upgrades, and \"Pessimism,\" a real-time monitoring tool designed to detect cybersecurity threats at the earliest.","Base is also working with OP Labs on a client called OP-geth that's aiming for fault-proof diversity and minimizing network failure risks.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"The Optimism Collective","content":"ORGANIZATION"},{"type":"2.5%","content":"PERCENT"},{"type":"OP Chains","content":"ORGANIZATION"},{"type":"OP Mainnet","content":"ORGANIZATION"},{"type":"$175 million","content":"MONEY"},{"type":"OP Stack","content":"ORGANIZATION"},{"type":"OP Labs","content":"ORGANIZATION"},{"type":"Aug. 9","content":"DATE"}],"hashtag":["BASE","OPTIMISM"],"authors":["Vishal Chawla","The Block"]}