{"summary":"Genesis&#x27;s co-head of sales and trading resigned after five years at the lending and trading firm.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173519\/genesis-co-head-of-sales-and-trading-to-step-down-take-on-advisory-role","publishDate":"2022-09-28T15:57:49","id":918,"type":null,"title":"Genesis co-head of sales and trading to step down, take on advisory role","category":["COMPANIES"],"content":["Genesis co-head of sales and trading Matt Ballensweig has resigned from his role after five&nbsp;years.","Ballensweig will stay on as an advisor to the lending and trading firm \"for the foreseeable future,\" and remain in the crypto ecosystem, he <a href=\"https:\/\/twitter.com\/MattBallen4791\/status\/1575191383425441792\" data-v-f87c67ca=\"\">said on Twitter<\/a>.","\"My mission will be to help facilitate the next cycle of growth and mainstream adoption through my expertise in capital and information flow, trading and lending, yield, venture and bridging institutional participants with crypto-native opportunities,\" he said.","Ballensweig has for the past month started to transition his core responsibilities to a number of colleagues and plans to take some time off before jumping into his \"own next chapter.\"","The company's former CEO Michael Moro also <a href=\"https:\/\/www.theblock.co\/post\/164014\/genesis-ceo-michael-moro-steps-down-from-role-effective-immediately\" data-v-f87c67ca=\"\">recently departed the firm<\/a>, with the chief operating officer Derar Islim stepping into the top role in August.","\"We have a bright future with CEO @DerarIslim at the helm who I know will do a fantastic job institutionalizing and scaling our businesses into the next cycle,\" Ballensweig said Wednesday.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Michael Moro","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Matt Ballensweig","content":"PERSON"},{"type":"Ballensweig","content":"PERSON"},{"type":"Derar Islim","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["LENDING"],"authors":["Catarina Moura","The Block"]}