{"summary":"Crypto.com released a proof-of-reserves report it says enables users to verify that their assets are fully backed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193684\/crypto-com-releases-proof-of-reserves-study-conducted-by-mazars","publishDate":"2022-12-09T11:48:05","id":9180,"type":null,"title":"Crypto.com releases proof-of-reserves study conducted by Mazars","category":["THE BLOCK"],"content":["Crypto.com released a proof-of-reserves study it says enables users to verify that their assets are fully backed.","The process was conducted by Mazars Group, which compared assets held in an on-chain address proven to be controlled by Crypto.com with customer balances. The reserve ratios for various coins ranged from 101% for ether to 106% for USDT.","The exchange will allow users to self-verify funds by visiting a <a href=\"https:\/\/crypto.com\/proof-of-reserves\" data-v-f87c67ca=\"\">webpage<\/a>.&nbsp;","\"Providing audited Proof of Reserves is an important step for the entire industry to increase transparency and begin the process of restoring trust,\" CEO Kris Marszalek said in a <a href=\"https:\/\/crypto.com\/company-news\/crypto-com-releases-proof-of-reserves\" data-v-f87c67ca=\"\">statement<\/a>.","The company <a href=\"https:\/\/www.theblock.co\/post\/186601\/crypto-com-ceo-claims-1-billion-recovered-from-ftx-exposure\" data-v-f87c67ca=\"\">first announced<\/a> that it would conduct the external verification process last month, when it reported exposure of about $10 million to the collapsed FTX exchange.","Mazars, in <a href=\"https:\/\/crypto.com\/document\/proof-of-reserves\" data-v-f87c67ca=\"\">a letter<\/a> with the study, said the report did not constitute a formal audit but rather an \"Agreed-Upon<br data-v-f87c67ca=\"\">\nProcedures engagement\" that \"involves us performing the procedures that have been agreed with Crypto.com, and reporting the findings.\"","\"We do not express an opinion or an assurance conclusion,\" Mazars said. \"Had we performed additional procedures, other matters might have come to our attention that would have been reported.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"Kris Marszalek","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Mazars","content":"PERSON"},{"type":"106%","content":"PERCENT"},{"type":"$10 million","content":"MONEY"},{"type":"101%","content":"PERCENT"},{"type":"Mazars Group","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}