{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/29335\/benthos-master-fund-sees-its-latest-motions-denied-in-case-of-third-party-bitcoin-sale","publishDate":"2019-06-29T08:50:33","id":9186,"type":null,"title":"Benthos Master Fund sees its latest motions denied in case of third-party bitcoin sale","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1] Benthos Master Fund, Ltd. v. Etra, 2019 U.S. Dist. LEXIS 104492 (S.D.N.Y. decided June 20, 2019)[NMR]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>Do you ever wonder how much over the counter trading in cryptocurrency occurs? Like, is there a giant shadow market out there beyond the reach of exchanges where deals are done via handshakes and escrow accounts? Well, if you’ve had those thoughts this case is further evidence.","This particular entry in our ongoing series of Escrow Gone Wild™ starts out simple enough. Benthos Master Fund is a crypto investment firm based in California. Seeking to secure a heavy bag they reached out to New York based attorney Aaron Etra who would act as the escrow agent for the purchase of bitcoin from a third party. Seems normal enough.","Benthos entered into an agreement, the Bitcoin Agreement, with a non-party to this arbitration proceeding named Valkyrie Group LLC for the purchase of 10,000 bitcoin. The new business relationship would begin with an initial purchase of $5,000,000 worth of bitcoin. Valkyrie was run by a father-son team that claimed to be able to locate third parties willing to sell large quantities of bitcoin. The Bitcoin Agreement referenced an Escrow Agreement that indicated Etra would use his trust account and hold the $5 mil buckaroos while Valkyrie rustled up some sellers. Mkay, so far so good. August 6, 2018, Benthos wires $5 mil to Etra’s trust account. That started a timer in the agreement that in fifteen days the bitcoin had to be delivered or the money returned. Here’s what happened next.","“On August 7, 2018, Etra wired $3,000,000.00 to an unknown account, purportedly for the purpose of obtaining Bitcoin. (Id. at 17.) Shortly thereafter, Respondent Tracy Evans informed Benthos that the Bitcoin could not be obtained without releasing an additional $2,850,000.000, in additional to the first $3,000,000.00 that had already been released.3 (Id. at 18.) Benthos declined to send the additional $850,000.00. (Id.)","On August 24, 2018, Etra wired an additional $1,600,000.00 from the IOLA account to another unknown account. (Id. at 23.) On August 28, 2018, Benthos demanded the return of its $5,000,000.00”","What went wrong? Well, allegedly, Valkyrie was going to buy the bitcoin from a Russian oligarch, but said oligarch had the bitcoin in a storage facility in Dubai and couldn’t release less than 1,000 bitcoin in a single transaction, and so an additional $850k was needed to release 1,000 bitcoin. You know, just another day in crypto.","How did this end up in arbitration and federal court? Well, the agreements were subject to arbitration, but Benthos filed a motion in federal court for preliminary injunctive relief in aid of arbitration basically asking the court to force Etra et al. to stop moving money out of the trust account, produce communications between Etra with all the parties involved, and produce information about the storage facility and the other parties involved.","Over the final few months of 2018 there was some back and forth, and additional filings, after the Court ordered Etra to produce the documents and information. Benthos repeatedly felt as though Etra was not forthcoming and complying with the Court’s orders. Etra thought otherwise. Eventually, Benthos files a motion to hold Etra in contempt of court and sought to have him sanctioned. That brings us to the present day and this particular order.","Contempt of court just means you haven’t complied with a court order. Here, the Court recites the standard in it’s jurisdiction “[t]o hold a party in civil contempt, it must be shown by clear and convincing evidence that the alleged contemnor violated a “clear and unambiguous order of the court” and that “the contemnor was not reasonably diligent in attempting to comply.””","However, as the Court notes, just because you don’t meet the strict requirements of an order does not automatically mean you are in contempt. Here, Etra provided 545 pages of communications and submitted an affidavit that those were the totality of communications he had in his possession. He also returned the $400k left in his trust account. Those actions were good enough for the judge to conclude that Etra did not deliberately disregard the order, and therefore the judge denied the motion for contempt.","As for the sanctions? Well, that was denied as well, but on procedural grounds, which is not something any lawyer wants to see. Benthos was seeking sanctions, because allegedly at one point early on Etra lied in court about whether he was represented by an attorney, and falsely asserted that Benthos wanted the bitcoin transaction to be consummated and that justified his actions. Benthos thought this met the requirements that allow a “court to sanction a party if the court determines that the party has violated Rule 11(b) by making false, misleading, improper, or frivolous representations to the court.” Seems like that would suffice, but you know, there’s rules about the rules. Under the Federal Rules of Civil Procedure “[a] motion for sanctions must be made separately from any other motion and must describe the specific conduct that allegedly violates Rule 11(b).” Fed. R. Civ. P. 11(c)(2).”” Benthos included their sanctions request in the contempt motion. Denied.<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/strong><\/em>","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part III of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the Court","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"$850k","content":"MONEY"},{"type":"Federal Rules of Civil Procedure","content":"ORGANIZATION"},{"type":"2019 U.S.","content":"LOCATION"},{"type":"$850,000.00","content":"MONEY"},{"type":"$400k","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"Valkyrie","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"$5","content":"MONEY"},{"type":"$5,000,000.00”","content":"MONEY"},{"type":"August 6, 2018","content":"DATE"},{"type":"Valkyrie Group LLC","content":"ORGANIZATION"},{"type":"$3,000,000.00","content":"MONEY"},{"type":"August 24, 2018","content":"DATE"},{"type":"Dubai","content":"LOCATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Aaron Etra","content":"PERSON"},{"type":"$5,000,000","content":"MONEY"},{"type":"$2,850,000.000","content":"MONEY"},{"type":"Ltd. v. Etra","content":"LOCATION"},{"type":"Etra","content":"ORGANIZATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"Civ","content":"LOCATION"},{"type":"June 20, 2019","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Respondent Tracy Evans","content":"ORGANIZATION"},{"type":"$5 mil","content":"MONEY"},{"type":"IOLA","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"$1,600,000.00","content":"MONEY"},{"type":"Etra","content":"PERSON"},{"type":"Palley","content":"PERSON"},{"type":"August 7, 2018","content":"DATE"},{"type":"Benthos","content":"ORGANIZATION"},{"type":"August 28, 2018","content":"DATE"}],"hashtag":[],"authors":["Nelson Rosario","The Block"]}