{"summary":"In a late Friday filing in FTX&#x27;s bankruptcy case, the maker of League of Legends said it suffered severe reputational harm through its association with FTX and asked the bankruptcy court to force the failed crypto firm to end its contract.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195923\/out-of-his-league-riot-games-looks-to-distance-from-sam-bankman-fried","publishDate":"2022-12-16T21:56:27","id":9189,"type":null,"title":"Out of his &#x27;League&#x27;: Riot Games looks to distance itself from Sam Bankman-Fried","category":["EXCHANGES"],"content":["He's been kicked out of the \"League.\"&nbsp;","The maker of Sam Bankman-Fried's favorite game, <em data-v-f87c67ca=\"\">League of Legends<\/em>, wants out of its exclusive sponsorship agreement with the disgraced crypto mogul's failed firm, FTX.","In a late Friday filing in FTX's bankruptcy case, Riot Games, said it suffered severe reputational harm through its association with FTX. The company, which was the exclusive cryptocurrency exchange sponsor for the game, asked the bankruptcy court overseeing FTX's case to force the failed crypto firm to end its contract with Riot, or if the exchange refuses, to allow Riot to terminate the agreement.","Doing so will cost the gaming company — $12 million per year over the seven years of the contract. Riot said it expected $12.5 million this year through the deal, but after FTX's bankruptcy, more than $6 million is in arrears. Allowing Riot to end the deal would also allow the gaming company to seek another cryptocurrency exchange as a sponsor.","But money appears to be the least of Riot's concerns.","\"There is simply no way for FTX to cure the reputational harm already caused to Riot as a result of the highly public disrepute wrought by the debacle preceding FTX’s bankruptcy filing,\" The company said in its filing with the U.S. Bankruptcy Court for the District of Delaware. \"FTX cannot turn back the clock and undo the damage inflicted on Riot in the wake of its collapse.\"","Bankman-Fried <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1357123559273816064\" data-v-f87c67ca=\"\">touted<\/a> his affinity for the game on Twitter and in interviews, famously (or infamously) playing it during media interviews and even during a <a href=\"https:\/\/news.yahoo.com\/sam-bankman-fried-once-caught-183314308.html\" data-v-f87c67ca=\"\">venture capital funding round meeting<\/a>. And that's a problem for Riot.","\"Media outlets and Twitter commentators splashed images of Mr. Bankman-Fried playing League of Legends — Riot Games’ game — at the same time that FTX was crashing,\" the company said in its court filing. \"He is well-known among investors to play League of Legends during meetings.\"","Bankman-Fried was arrested in the Bahamas earlier this week and denied bail while awaiting extradition to the U.S. A federal grand jury in New York indicted him on multiple charges of fraud. If convicted of all charges he faces up to 115 years in prison.&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"earlier this week","content":"DATE"},{"type":"$12 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$12.5 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Riot Games","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"$6 million","content":"MONEY"},{"type":"U.S","content":"LOCATION"},{"type":"the District of Delaware","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Madhu Unnikrishnan","The Block"]}