{"summary":"Bitcoin miners are venturing into new business areas, such as offering high-performance computing services to the AI market, JPMorgan said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246242\/jpmorgan-bitcoin-miners-diversifying-halving","publishDate":"2023-08-18T10:10:13","id":919,"type":null,"title":"JPMorgan says bitcoin miners are diversifying ahead of halving","category":["COMPANIES"],"content":["Bitcoin miners are exploring new business avenues ahead of the upcoming halving event that will reduce their rewards and amid increased competition from the rising hash rate, according to JPMorgan.","Crypto miners are now providing high-performance computing services to the rapidly evolving artificial intelligence market, which could turn profitable for them, JPMorgan analysts led by Nikolaos Panigirtzoglou wrote in a report on Thursday. Their diversification into the AI market has at least partly been funded by selling newly or previously minted bitcoins in recent quarters, they added.","Both crypto mining and AI development, including training large language models, require advanced computer chips.","Applied Digital recently launched an AI cloud service and signed a $460 million deal to host AI cloud computing in its data center. Iris Energy, meanwhile, recently revived its strategy around hosting HPC services amid rising interest in AI.","Former Ethereum miners have also started offering HPC services, the JPMorgan analysts noted. After Ethereum's transition from proof-of-work to a proof-of-stake consensus model, there was a high supply of graphics processing units in the secondary market for sale, as GPUs used for Ethereum mining lost their utility.","\"With the rapid growth of AI, the increased demand for HPC is now opening a new and perhaps more profitable avenue for utilizing GPUs previously used for Ethereum mining,\" the analysts said.","Several Bitcoin miners and former Ethereum miners have conducted beta tests on offering HPC services using a small subset of their total GPU fleet, the analysts said.","\"In these beta tests, miners are reporting high profitability per unit of power consumption, much above the profitability from bitcoin mining. With bitcoin miners having already secured more than 100MW of long-term contracts with their power grids, if the profitability reported in beta tests is able to be repeated in large scale it would overshadow in the future the revenues coming from bitcoin mining at the moment,\" they added.","Bitcoin miners are also diversifying across geographies, with Russia emerging as a top destination, according to the analysts.","\"Power producers in Russia have been struggling due to the [Ukraine] war and as a result of the economic slowdown, there is a large energy surplus in Russia. Coupled with a colder climate, Russia is thus able to offer significantly cheaper energy resources to bitcoin miners,\" they said.","Last month, JPMorgan analysts <a href=\"https:\/\/www.theblock.co\/post\/239581\/jpmorgan-bitcoin-halving-stress-test-miners\" data-v-f87c67ca=\"\">said<\/a> the upcoming Bitcoin <a href=\"https:\/\/www.theblock.co\/post\/232334\/bitcoin-price-45k-jpmorgan-gold\" data-v-f87c67ca=\"\">halving<\/a> could put miners to the test with lower rewards and higher costs. Miners with lower electricity costs will fare better after the halving, while those with higher costs may struggle.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nikolaos Panigirtzoglou","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"$460 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"GPU","content":"ORGANIZATION"},{"type":"HPC","content":"ORGANIZATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["BITCOIN","MINING COMPANIES","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}