{"summary":"Two financial regulators in Beijing have warned against the risks of crypto trading.\nThey have already shut down one company for providing software used for crypto trading.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110535\/beijing-crack-down-crypto-activities","publishDate":"2021-07-06T07:04:58","id":919,"type":null,"title":"Beijing regulators shut down firm providing services used for crypto trading","category":["China"],"content":["Two financial regulators in the Chinese capital city of Beijing have taken measures to curb activities affiliated with crypto-related business.","The Business Administration Department of People's Bank of China (PBoC) and the Beijing Financial Supervision and Administration <a href=\"http:\/\/jrj.beijing.gov.cn\/\" data-v-f87c67ca=\"\">Bureau<\/a> jointly <a href=\"https:\/\/mp.weixin.qq.com\/s\/jJbuBjDYMxvbZdR71jBKlQ\" data-v-f87c67ca=\"\">issued a statement<\/a> on Tuesday that warned against the risks surrounding crypto trading activities.&nbsp;","The Business Administration Department of the PBoC is the <a href=\"https:\/\/baike.baidu.com\/item\/%E4%B8%AD%E5%9B%BD%E4%BA%BA%E6%B0%91%E9%93%B6%E8%A1%8C%E8%90%A5%E4%B8%9A%E7%AE%A1%E7%90%86%E9%83%A8\" data-v-f87c67ca=\"\">de facto Beijing division<\/a> of the Chinese central bank, which has mandates include managing the monetary policy and ensuring financial stability in the capital city.&nbsp;&nbsp;","The two regulators said in the statement they have recently cracked down on a little-known company called Beijing Qudao Cultural Development Limited that was accused of \"providing software services to crypto trading activities.\"","Following the government crackdown, the company has been deactivated and its website has been suspended, the two regulatory bodies said.&nbsp;","Based on Chinese business registration records, <a href=\"https:\/\/www.qixin.com\/company\/0b65f98a-38ab-456b-b740-0a204a0b0e97?key=%E5%8C%97%E4%BA%AC%E5%8F%96%E9%81%93%E6%96%87%E5%8C%96%E5%8F%91%E5%B1%95%E6%9C%89%E9%99%90%E5%85%AC%E5%8F%B8\" data-v-f87c67ca=\"\">Beijing Qudao<\/a> was incorporated in 2016 and had been operating in the marketing, public relations, modeling and entertainment businesses.&nbsp;","Further, the two municipal regulators warned that entities under their judicial remit shall not provide services such as business premises, ad display, marketing or paid online traffic. Financial and payment institutions under their jurisdiction must not provide any service directly or indirectly to customers related to crypto transactions, the statement added.","The move by the Beijing regulators comes weeks after the PBoC <a href=\"https:\/\/www.theblockcrypto.com\/post\/109098\/pboc-orders-chinese-banks-to-cut-off-accounts-for-crypto-otc-merchants-reiterating-2017-banking-ban\" data-v-f87c67ca=\"\">directed<\/a> domestic commercial banks to cut off the fiat currency funding channel for over-the-counter trading desks if found.&nbsp;","The recent regulatory efforts followed a comment about cracking down on bitcoin trading and mining activities from China's State Council, the country's central government cabinet.&nbsp;The high-level comment has already led to the shutdown of almost all the bitcoin mining activities in China. Here's a <a href=\"https:\/\/www.theblockcrypto.com\/daily\/110499\/a-timeline-of-chinas-bitcoin-mining-crackdown-and-how-it-goes-beyond-environmental-concerns\" data-v-f87c67ca=\"\">timeline<\/a> of all the events over the past one and half months."],"hashtag":["BITCOIN"]}