{"summary":"Robinhood&#x27;s crypto wallet is adding support for Bitcoin and Dogecoin, and it&#x27;s also enabling Ethereum swaps.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248155\/robinhood-wallet-adds-support-for-bitcoin-dogecoin-and-ethereum-swaps","publishDate":"2023-08-30T12:48:51","id":9193,"type":null,"title":"Robinhood Wallet adds support for Bitcoin, Dogecoin and Ethereum swaps","category":["COMPANIES"],"content":["&nbsp;","Less than six months since Robinhood first launched its own crypto wallet, the company is adding \"custody, send, and receive support for Bitcoin and Dogecoin,\" in addition to enabling Ethereum swaps.","The added functionality comes in response to users requesting the additional support, according to a Robinhood spokesperson.","When Robinhood Wallet <a href=\"https:\/\/www.theblock.co\/post\/216194\/robinhood-rolls-out-wallet-to-ios-customers-globally\" data-v-f87c67ca=\"\">became available<\/a> to customers using Apple devices in March, the self-custody wallet supported the Polygon and Ethereum networks and tokens including COMP, MATIC, SHIB, SOL, UNI and the USDC stablecoin.","The wallet is still not available on Android devices, but the functionality is expected to launch later this year.","Since the March announcement, Robinhood has also announced its wallet supports the Arbitrum and Optimism blockchains.","Adding Bitcoin and Dogecoin support to the mix, two of the world's most popular tokens by market cap, follows the release of Robinhood's <a href=\"https:\/\/www.theblock.co\/post\/242875\/robinhood-reports-drop-in-crypto-revenue-in-latest-earnings-report\" data-v-f87c67ca=\"\">most recent<\/a> earnings report where it said revenue from crypto fell to $31 million, compared with $38 million in the previous quarter.","While Ethereum swaps capability is now live, the functionality is not yet available to all customers, the company said.","\"In-app Ethereum swaps started rolling out to select users today for [more than 200] tokens and will become available to everyone in the coming weeks,\" the company said in a statement. \"Unlike other wallets, users can swap without holding Ethereum, and network fees are automatically deducted from the tokens they already hold.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"$38 million","content":"MONEY"},{"type":"Robinhood Wallet","content":"ORGANIZATION"},{"type":"Robinhood spokesperson","content":"ORGANIZATION"},{"type":"UNI","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"$31 million","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}