{"summary":"Matter Labs also outlined eight principles for its network to uphold, including privacy and hyperscalability.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235969\/matter-labs-releases-zksync-manifesto-showing-push-for-decentralization","publishDate":"2023-06-23T08:00:29","id":9197,"type":null,"title":"Matter Labs releases ZK Credo showing push for decentralization","category":["CRYPTO ECOSYSTEMS"],"content":["Matter Labs released a manifesto called ZK Credo reaffirming its push for a decentralized network, while stating eight principles for its network to upload.","The manifesto, which was posted on the code platform <a href=\"https:\/\/github.com\/zksync\/credo\" data-v-f87c67ca=\"\">GitHub<\/a> and the Ethereum Magicians forum for contributions and signatures, states that \"to ensure lasting protection, the community must deeply embrace the elusive concept of decentralization.”","The manifesto expresses concern about governance power concentrating in the hands of a few. It argues that, if necessary, the community should possess the ability to migrate to a new network.","This comes at a time when the zkSync network is still centralized. Currently Matter Labs still runs the prover and sequencer on its network. It has said that it plans to <a href=\"https:\/\/www.theblock.co\/post\/222596\/zksync-era-first-zkevm-goes-live-in-major-development-for-ethereum\" data-v-f87c67ca=\"\">decentralize<\/a> the sequencer. Yet the manifesto outlines that this broader journey will take some time.","“Realizing these principles requires time and perseverance. A steady, pragmatic approach to decentralization is needed,” it states.","Beyond this, the manifesto outlines eight principles that it deems crucial. These include basic decentralization tenets like censorship-resistance and trustlessness.&nbsp;","Yet it includes three principles that it argues are not met by Ethereum. These are privacy, accessibility and hyperscalability.&nbsp;","The manifesto claims that zero-knowledge technology, used by zkSync, can help it achieve all of these goals. Zero-knowledge proofs are able to increase privacy and throughputs on a blockchain network.","Matter Labs suggested that other networks could adopt the ZK Credo.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum","content":"ORGANIZATION"},{"type":"ZK Credo","content":"ORGANIZATION"},{"type":"2023","content":"DATE"}],"hashtag":["ETHEREUM","ZKSYNC"],"authors":["Tim Copeland","The Block"]}