{"summary":"Crypto exchange Coinbase is providing its blockchain analytics software to the U.S. Secret Service according to public record. The record shows that the Secret Service awarded a four-year contract to Coinbase.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/71261\/coinbase-is-selling-blockchain-analytics-software-to-the-us-secret-service","publishDate":"2020-07-11T10:36:00","id":9199,"type":null,"title":"Coinbase is selling Blockchain Analytics Software to the Secret Service","category":["LAYER 1S"],"content":["Crypto exchange Coinbase is providing its blockchain analytics software to the U.S. Secret Service, according to a <a href=\"https:\/\/beta.sam.gov\/awards\/90905932%2BAWARD#general-information\" data-v-f87c67ca=\"\">public record obtained by The Block.<\/a>","The Secret Service, which is part of the U.S. Department of Homeland Security, is charged with conducting financial crime investigations in addition to protecting the nation's top leaders.","The record shows that the Secret Service awarded a four-year contract to Coinbase in May in order to use its blockchain analytics software, called Coinbase Analytics. The contract is worth $183,750 in total and ends on May 9, 2024.","The <a href=\"https:\/\/www.usaspending.gov\/#\/award\/CONT_AWD_70US0920C70090044_7009_-NONE-_-NONE-\" data-v-f87c67ca=\"\">award also appears on USASpending.gov<\/a>, a directory for government contract awards.","","","The Secret Service is not the only government agency interested in Coinbase's analytics software. Last month, the U.S. Drug Enforcement Administration (DEA) was looking to offer Coinbase up to $250,000 to use it. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<a href=\"https:\/\/www.theblockcrypto.com\/post\/67551\/coinbase-irs-dea-analytics-neutrino\" data-v-f87c67ca=\"\">As The Block reported last month<\/a>, Coinbase wanted to sell its analytics software to two U.S. government agencies — and the Internal Revenue Service (IRS) and the DEA — but the agencies have not contracted any awards to Coinbase yet. The IRS and DEA contract opportunities are now “inactive.”","Coinbase Analytics wasn’t publicly known until The Block’s reporting last month. It is a software system that Coinbase built after its acquisition of intelligence agency Neutrino in 2019. The acquisition drew controversy due to Neutrino founders' involvement in the Italian spyware firm Hacking Team, and Coinbase ultimately parted ways with team members associated with Hacking Team.","Last month, Coinbase told The Block that \"[t]he information offered in Coinbase Analytics has always been kept completely separate from Coinbase internal data.”","It added: \"Coinbase Analytics data is fully sourced from online, publicly available data, and does not include any personally-identifiable information for anyone, regardless of whether or not they use Coinbase. Coinbase Analytics is a blockchain analytics product that we use internally for compliance and global investigations. It's an important tool to meet our regulatory requirements and protect our customers' funds. We developed Coinbase Analytics with technology from the Neutrino acquisition.\"","Following The Block's reporting, Coinbase CEO and Co-founder Brian Armstrong took to <a href=\"https:\/\/twitter.com\/brian_armstrong\/status\/1282106176000233472?s=21\" data-v-f87c67ca=\"\">Twitter<\/a> to express his views on reporting surrounding Coinbase Analytics. Armstrong states that he does not think articles regarding Coinbase Analytics are \"particularly newsworthy\" and that building a blockchain analytics service in-house helps the firm \"recoup costs\" and \" build relationships with law enforcement.\"","<em data-v-f87c67ca=\"\">Editor's note: This story has been updated with Coinbase CEO Brian Armstrong's comments on Twitter<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Coinbase Analytics","content":"ORGANIZATION"},{"type":"U.S. Drug Enforcement Administration (DEA","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"U.S. Secret Service","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Coinbase","content":"LOCATION"},{"type":"Secret Service","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"May 9, 2024","content":"DATE"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"U.S. Department of Homeland Security","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"Neutrino founders","content":"ORGANIZATION"},{"type":"DEA","content":"ORGANIZATION"},{"type":"$183,750","content":"MONEY"}],"hashtag":["COINBASE","IRS"],"authors":["Yogita Khatri","The Block"]}