{"summary":"The SEC&#x27;s Mark Uyeda said the agency needs to consider proposing rules or guidance to regulate cryptocurrencies.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261708\/sec-should-consider-proposing-rules-to-regulate-crypto-republican-commissioner-says","publishDate":"2023-11-06T10:25:10","id":9200,"type":null,"title":"SEC should consider proposing rules to regulate crypto, Republican commissioner says","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Securities and Exchange Commission's Mark Uyeda said the agency needs to consider proposing rules or guidance to regulate cryptocurrencies instead of taking a more enforcement-like approach.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Republican commissioner said the SEC could have taken steps to aid in creating laws for cryptocurrencies, but didn't.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"Unfortunately, the SEC did not take this approach and instead is pursuing a case-by-case approach through enforcement actions. As a result, it will take years to reach any type of legally-binding precedent, as matters will need to wind their way through the courts before reaching the court of appeals level,\" Uyeda said on Monday in prepared <a href=\"https:\/\/www.sec.gov\/news\/speech\/uyeda-remarks-sec-reg-outside-us-5th-annual-scott-friestad-memorial-lecture?utm_medium=email&amp;utm_source=govdelivery\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">remarks<\/span><\/a> in London.&nbsp;&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Uyeda's comments come as the SEC has been vigorous in charges against crypto firms including exchanges <a href=\"https:\/\/www.theblock.co\/post\/233206\/sec-binance-showdown-sends-shockwaves-through-crypto\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">Binance<\/span><\/a> and Coinbase. C<\/span><span class=\"s2\" data-v-f87c67ca=\"\">ases have made their way through the courts this past year, where judges have had to take a role in figuring out how laws apply to the sector.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The crypto industry has argued that they have a difficult time being compliant and still competitive without a clear regulatory path forward in the U.S.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">SEC Chair Gary Gensler has stayed true to his views that most cryptocurrencies are securities, except for bitcoin, and that crypto firms need to register with the agency. In its charges against crypto firms, the SEC often <\/span><span class=\"s4\" data-v-f87c67ca=\"\">cites the Howey Test, a 1946 U.S. Supreme Court case involving citrus groves to determine whether transactions are investment contracts and thus subject to securities laws.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Deciding what a security is can be complicated, Uyeda said on Monday.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"What is, and what is not, a security can be a difficult analysis – not just for market participants, but also for the courts who must analyze the investment contract test described by the U.S. Supreme Court in a 1946 decision,\" Uyeda said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Uyeda also criticized the SEC's approach to other parts of the capital markets, including communications around brokerage firms.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"Determining whether a person's conduct violates the federal securities laws should not be akin to the Hogwart's sorting hat from Harry Potter, where one's fate is predicted, sometimes wrongly, based on which rule or law the SEC plans to enforce in a way that it has not been interpreted before,\" Uyeda said.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"U.S. Supreme Court","content":"ORGANIZATION"},{"type":"1946","content":"DATE"},{"type":"Uyeda","content":"PERSON"},{"type":"Harry Potter","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Mark Uyeda","content":"PERSON"},{"type":"London","content":"LOCATION"},{"type":"Exchange Commission","content":"ORGANIZATION"},{"type":"Hogwart","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}