{"summary":"EigenLayer-based Ethereum restaking protocol Renzo raised $3.2 million in a seed funding round led by Maven11.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272679\/ethereum-restaking-protocol-renzo-eigenlayer-funding-valuation","publishDate":"2024-01-15T12:00:02","id":9202,"type":null,"title":"Ethereum restaking protocol Renzo raises seed round at $25 million valuation","category":["COMPANIES"],"content":["Renzo, an Ethereum restaking protocol based on EigenLayer, has raised $3.2 million in a seed funding round.","Maven11 Capital led the round, with Figment Capital, SevenX Ventures, IOSG Ventures, and several other investors participating, Renzo said Monday.","The startup was founded in August, began raising funds in November, and completed the round in December, Renzo founding contributor Lucas Kozinski told The Block. Kozinski said it was an equity with token warrant round in a 1:1 ratio, adding that it brought Renzo's post-money valuation to $25 million.","The Renzo protocol currently helps users restake ether (ETH) via <a href=\"https:\/\/www.theblock.co\/post\/222901\/eigenlayer-series-a\" data-v-f87c67ca=\"\">EigenLayer<\/a> as part of its beta mainnet release last month. The protocol plans to also support liquid staking tokens (LSTs) in its future releases.","To get started with Renzo, users need to deposit ETH (for now) and also LSTs (in the future), and they will get ezETH — Renzo's liquid restaking token (LRT), which can then be used in DeFi applications to earn additional yield over and above ETH staking yield.","\"Renzo is a third-generation protocol that can accept both native ETH and LSTs,\" Kozinski said. He referred to Stader Labs-like protocols as first-generation, which only support liquid staking, and protocols like Ether.fi as second-generation, which only support ETH restaking. \"Renzo is the first liquid restaking protocol that is designed to accept both ETH and LSTs,\" Kozinski said.","Within a month of its beta mainnet launch, Renzo has already reached a total value locked or TVL of over $35 million, according to its <a href=\"https:\/\/app.renzoprotocol.com\/restake\" data-v-f87c67ca=\"\">website<\/a>. EigenLayer's TVL stands at about $1.7 billion, according to DeFi Llama <a href=\"https:\/\/defillama.com\/protocol\/eigenlayer\" data-v-f87c67ca=\"\">data<\/a>.","When asked why users would choose to restake via Renzo, which itself is built on EigenLayer, instead of directly restaking via EigenLayer, Kozinski said how <a href=\"https:\/\/www.theblock.co\/linked\/103874\/eth2-staking-protocol-lido-raises-73-million-paradigm\" data-v-f87c67ca=\"\">Lido<\/a>, which has grown to become the largest liquid staking protocol, made crypto staking easy and accessible for everyone — and Renzo aims to do the same.","\"Whereas Lido made ETH staking liquid and accessible to everyone, Renzo abstracts away the complexities of restaking on EigenLayer,\" Kozinski said. \"EigenLayer is extremely complex and requires users to select and actively manage node operators, actively validated services, and a countless number of reward tokens while being locked in these positions for weeks. Renzo abstracts away all these complexities while allowing users to be liquid on their position.\"","With fresh capital in hand, Renzo plans to undergo additional audits of its protocol, increase the reward for its bug bounty program on the Immunefi platform, integrate with more DeFi protocols, and increase its team size of about ten people by hiring across functions, Kozinski said.","The launch of Renzo's general mainnet is also in the pipeline, which will happen post-EigenLayer's Stage 3 launch, Kozinski said. Renzo plans to also expand beyond Ethereum restaking, supporting more blockchains in the future. \"We'll support bridged liquid staking tokens on Layer 2 networks and other Layer 1 networks so users can get access to restaking without having to bridge to the mainnet — same as cross-chain staking,\" Kozinski said.","Looking ahead, Renzo also plans to hand over the protocol's governance to token holders and form a decentralized autonomous organization or a DAO. The token launch date is yet to be decided, Kozinski said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TVL","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Figment Capital","content":"ORGANIZATION"},{"type":"Lucas Kozinski","content":"PERSON"},{"type":"$35 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"LRT","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Renzo","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Kozinski","content":"PERSON"},{"type":"Lido","content":"LOCATION"},{"type":"Renzo","content":"ORGANIZATION"},{"type":"$25 million","content":"MONEY"},{"type":"$3.2 million","content":"MONEY"},{"type":"$1.7 billion","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":["ETHEREUM","SEED &AMP; PRE-SEED"],"authors":["Yogita Khatri","The Block"]}