{"summary":"AltLayer is set to launch its native utility token, ALT, on Jan. 25, with an airdrop to early supporters also planned upon listing.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273113\/altlayer-token-airdrop-early-supporters","publishDate":"2024-01-17T09:36:19","id":9206,"type":null,"title":"AltLayer set to launch native token, plans airdrop for early supporters","category":["CRYPTO ECOSYSTEMS"],"content":["AltLayer, a decentralized protocol for restaked rollups, <a href=\"https:\/\/blog.altlayer.io\/altlayers-alt-token-launch-f49bf8ac2556\" data-v-f87c67ca=\"\">announced<\/a> it will launch its native ALT token next week via Binance Launchpool.","Binance users will be able to <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/introducing-altlayer-alt-on-binance-launchpool-farm-alt-by-staking-bnb-and-fdusd-8415d71c5cce481fb8bdec3651972366\" data-v-f87c67ca=\"\">stake<\/a> BNB and the FDUSD stablecoin to farm ALT tokens over six days from 00:00 UTC on Friday, with the crypto exchange then listing the utility token on Jan. 25 at 10:00 UTC, offering ALT\/BTC, ALT\/USDT and ALT\/BNB, ALT\/FDUSD and ALT\/TRY trading pairs. Binance Launchpool’s allocation accounts for 500,000,000 ALT — 5.00% of the total 10 billion token supply.","AltLayer will also be conducting an airdrop to early supporters of the project upon listing, including its NFT holders and participants in community campaigns. The project said a snapshot of all qualified addresses was taken on Jan. 17, with more details to be shared in the coming days.","“Do note that this is the first wave of airdrop to our community. More airdrops to our wider ecosystem partners and supporters will follow in the coming months,” AltLayer added, with airdrops for qualified EigenLayer restakers and Celestia stakers also to be announced.","Residents of the United States are not eligible to participate in the airdrop or the farming of ALT tokens.","AltLayer’s protocol enables restaked rollups, merging existing rollups from stacks such as OP Stack, Arbitrum Stack, ZKStack and Polygon CDK with EigenLayer’s restaking mechanism to “bootstrap network security and build a decentralized network,” according to the team.","AltLayer's native utility token will serve as an economic bond, where it, alongside restaked assets, provides a stake that can be reduced in the case of malicious behavior. Additionally, ALT token holders will have the ability to participate in governance decisions, operators within the AltLayer ecosystem will be rewarded with ALT tokens and network participants will be required to pay protocol fees using ALT.","AltLayer previously <a href=\"https:\/\/www.theblock.co\/post\/155446\/altlayer-raises-seed-funding-blockchain\" data-v-f87c67ca=\"\">raised<\/a> $22.8 million from two rounds of private token sales, accounting for 18.5% of the total ALT token supply.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance Launchpool","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"5.00%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"Arbitrum Stack","content":"PERSON"},{"type":"18.5%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Jan. 25","content":"DATE"},{"type":"ALT\/BNB","content":"ORGANIZATION"},{"type":"$22.8 million","content":"MONEY"},{"type":"Jan. 17","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Celestia stakers","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["BINANCE","ETHEREUM"],"authors":["James Hunt","The Block"]}