{"summary":"Hong Kong’s crypto-friendly policy could mean the Chinese government is becoming more open to crypto initiatives, Chainalysis said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253777\/china-crypto-hong-kong-otc-chainalysis","publishDate":"2023-10-02T09:00:03","id":9209,"type":null,"title":"China could warm up to crypto through Hong Kong’s OTC market: Chainalysis","category":["INTERNATIONAL POLICYMAKING"],"content":["<span data-v-f87c67ca=\"\">China could be warming up to crypto through Hong Kong’s active over-the-counter crypto market despite bans on the mainland, Chainanlysis found in a new report.<\/span>","<span data-v-f87c67ca=\"\">“The increasingly close relationship between China and Hong Kong leads some to speculate that Hong Kong's growing status as a crypto hub may signal that the Chinese government is reversing course on digital assets, or at least becoming more open to crypto initiatives,” the crypto analytics firm said in a <\/span><a href=\"https:\/\/www.chainalysis.com\/blog\/eastern-asia-cryptocurrency-adoption\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report<\/span><\/a><span data-v-f87c67ca=\"\"> published today.<\/span>","<span data-v-f87c67ca=\"\">The report shows that Hong Kong ranked fifth in crypto transaction volume in East Asia between July 2022 and June 2023, with an estimated $64 billion in crypto received. That follows South Korea, Japan, mainland China and Taiwan. <\/span><span data-v-f87c67ca=\"\">“[Hong Kong’s figure] is not far behind China’s $86.4 billion received during the same time period, despite Hong Kong having a population 0.5% the size of mainland China’s,” the report said.<\/span>","<span data-v-f87c67ca=\"\">Recent developments have “created speculation that the Chinese government may be warming to cryptocurrency and that Hong Kong may be a testing ground for these efforts,” the report continued. <\/span><span data-v-f87c67ca=\"\">“Hong Kong functions as a Special Administrative Region of China, meaning it has autonomy over many aspects of policy, including regulation of cryptocurrency.\"<\/span>","<span data-v-f87c67ca=\"\">Chainalysis added that Hong Kong’s active over-the-counter market “manifests in the city’s breakdown of transaction volume by transaction size.” It added that mainland China and Hong Kong also show unique breakdowns in most-used crypto platform types, “though these numbers should be taken with a grain of salt given the anecdotal evidence that much crypto activity in both countries takes place through OTCs or through informal, grey market peer-to-peer businesses.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">China banned crypto transactions on the mainland in September 2021, but multiple local courts across the country have <\/span><a href=\"https:\/\/www.scmp.com\/tech\/policy\/article\/3233261\/local-chinese-court-argues-cryptocurrency-property-despite-beijings-crackdown\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ruled<\/span><\/a><span data-v-f87c67ca=\"\"> that cryptocurrency should be viewed as property regarding ownership.<\/span>","<span data-v-f87c67ca=\"\">Unlike its neighboring Chinese mainland’s broader crackdown on cryptocurrency trading and mining, Hong Kong has rolled out the welcome mat for crypto firms this year — even going so far <\/span><a href=\"https:\/\/www.theblock.co\/post\/228743\/hong-kong-crypto-bank-accounts\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">as encouraging banks to work with them<\/span><\/a><span data-v-f87c67ca=\"\">. In October 2022, Hong Kong authorities released a series of <\/span><a href=\"https:\/\/www.info.gov.hk\/gia\/general\/202210\/31\/P2022103000454.htm?fontSize=1\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">policy statements<\/span><\/a><span data-v-f87c67ca=\"\"> about cryptocurrencies to strengthen its position as a global financial center. In December, Hong Kong’s Legislative Council <\/span><a href=\"https:\/\/www.theblock.co\/post\/193209\/hong-kong-amendment-vasp-licensing-regime\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">passed an amendment introducing a full licensing regime<\/span><\/a><span data-v-f87c67ca=\"\"> for virtual asset service providers that took effect in June.<\/span>","<span data-v-f87c67ca=\"\">Ethereum co-founder Vitalik Buterin, however, said last month that crypto projects should <\/span><a href=\"https:\/\/www.theblock.co\/post\/251042\/vitalik-buterin-crypto-hong-kong\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">consider how stable the crypto-friendliness would be<\/span><\/a><span data-v-f87c67ca=\"\"> when setting up a presence in Hong Kong.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"0.5%","content":"PERCENT"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"$64 billion","content":"MONEY"},{"type":"Japan","content":"LOCATION"},{"type":"October 2022","content":"DATE"},{"type":"Taiwan","content":"LOCATION"},{"type":"Special Administrative Region of China","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"$86.4 billion","content":"MONEY"},{"type":"East Asia","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"July 2022","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}