{"summary":"Shareholders approved a proposed buyout of Twitter for $44 billion by billionaire Elon Musk, but the deal&#x27;s fate will be decided in court.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169766\/musks-44-billion-buyout-of-twitter-accepted-by-shareholders-ahead-of-trial","publishDate":"2022-09-13T15:28:08","id":9211,"type":null,"title":"Musk&#x27;s $44 billion buyout of Twitter accepted by shareholders ahead of trial","category":["MERGERS & ACQUISITIONS"],"content":["Twitter Inc, shareholders voted to approve a proposed $44 billion buyout of the company by billionaire Elon Musk, Bloomberg reported.","A preliminary vote held Tuesday saw a majority of shareholders support the decision to accept Musk’s $54.20-a-share offer to acquire Twitter. Shares of the company are currently trading below that offer at $41.92.","Although the deal now has the necessary shareholder approval to be ratified, in July Musk made clear his intention to <a href=\"https:\/\/www.theblock.co\/post\/156722\/elon-musk-aims-to-terminate-44-billion-twitter-deal\" data-v-f87c67ca=\"\">pull out <\/a>from the deal, citing concerns over bot and spam accounts on the social media platform. In turn, Twitter <a href=\"https:\/\/www.theblock.co\/post\/157225\/twitter-sues-elon-musk-over-44-billion-acquisition-dispute\" data-v-f87c67ca=\"\">filed<\/a> a lawsuit in an effort to compel Musk to follow through with the deal to which he signed an agreement.","The coming trial has been a source of spectacle as lawyers representing both Musk and Twitter continue to grapple over witnesses, evidence, and the court date, now set for Oct. 17 in Delaware Chancery Court.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Delaware Chancery Court","content":"ORGANIZATION"},{"type":"$44 billion","content":"MONEY"},{"type":"$41.92","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Oct. 17","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Twitter Inc","content":"ORGANIZATION"},{"type":"$54.20","content":"MONEY"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["ELON MUSK","TWITTER"],"authors":["Jeremy Nation","The Block"]}