{"summary":"Replacing FTX&#x27;s bankruptcy lawyers could be &#x27;catastrophic&#x27; for creditors, one pundit says, but doubts it&#x27;ll occur.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285047\/pressure-mounts-on-ftxs-bankruptcy-lawyers-heres-how-it-could-affect-the-case","publishDate":"2024-03-27T17:01:06","id":9212,"type":null,"title":"Pressure mounts on FTX&#x27;s bankruptcy lawyers: Here’s how it could affect the case","category":["COMPANIES"],"content":["In February 2023, it seemed that FTX’s bankruptcy law firm, Sullivan &amp; Cromwell, would have an uninterrupted run of the proceedings.","Yet, over the last few months, increasing pressure has been placed on the law firm over its ties to the exchange before it collapsed. This has ranged from a class action lawsuit against it to an independent examiner’s probe into potential conflicts of interest. The end result is uncertainty for creditors as to how this will affect the case — and what might happen if the law firm gets removed.&nbsp;","“I doubt it will change much,” said Thomas Braziel, partner at 117 Partners and 507 Capital, who has been heavily trading FTX claims. “But of course, it could be catastrophic for progress towards a confirmed bankruptcy plan if they get replaced — and any other law firm will cost just as much.”","Questions about conflicts of interest have existed since the exchange fell apart. In January 2023, multiple U.S. Senators<a href=\"https:\/\/www.theblock.co\/post\/200542\/senators-voice-concerns-over-law-firms-role-in-ftx-bankruptcy\" data-v-f87c67ca=\"\"> expressed concerns<\/a> that S&amp;C is not a disinterested party with respect to the exchange. At the same time, FTX’s former CEO, Sam Bankman-Fried, claimed the law firm pressured the exchange into bankruptcy and strong-armed him into naming its preferred CEO, John Ray III.","In January 2023, these issues were raised in a <a href=\"https:\/\/www.theblock.co\/post\/203953\/law-firm-sullivan-cromwell-to-face-scrutiny-in-ftx-bankruptcy-hearing-friday\" data-v-f87c67ca=\"\">bankruptcy hearing<\/a>, but the judge approved retaining the law firm for the proceedings. The following month, the U.S. Department of Justice denied a request for an independent examiner.","This all changed earlier this year.","In January 2024, the Third Circuit Court of Appeals in Philadelphia ruled that an independent examiner <a href=\"https:\/\/www.theblock.co\/post\/273614\/ftx-must-be-investigated-by-independent-examiner-court-rules\" data-v-f87c67ca=\"\">must investigate<\/a> FTX. Former Unabomber prosecutor Robert Cleary was appointed, and he was later allowed to launch a probe into S&amp;C’s potential conflicts of interest.&nbsp;","In February, the Moskowitz law firm <a href=\"https:\/\/www.theblock.co\/post\/277936\/ftx-creditors-file-class-action-against-bankruptcy-lawyers-over-ties-to-ftx-prior-to-its-collapse\" data-v-f87c67ca=\"\">filed a class action lawsuit<\/a> against S&amp;C on behalf of creditors. It alleges that S&amp;C was so closely involved with the exchange prior to its collapse that it should be held partially responsible for its actions. In March, two law professors published a <a href=\"https:\/\/www.theblock.co\/post\/284049\/research-paper-makes-further-allegations-regarding-ftxs-bankruptcy-lawyers-conflicts-of-interest\" data-v-f87c67ca=\"\">research paper<\/a> that made further allegations about S&amp;C’s involvement with FTX, including potential conflicts of interest and bad ethics.","Recent evidence in the case against Bankman-Fried also shows how S&amp;C pressured FTX to file for bankruptcy. “It is our strongest possible recommendation that Sam sign this now to avoid imminent losses,” wrote S&amp;C restructuring lawyer Andrew Dietderich in an email to FTX figureheads and S&amp;C lawyers at the time. In January 2023, Dietderich had declared that it was “false” to say the law firm put Bankman-Fried under extreme pressure to file for bankruptcy.","A spokesperson for S&amp;C referred The Block to a statement from the FTX debtors pushing back against the allegations, saying particular academics and others have parroted Bankman-Fried’s false narratives to elevate his standing before the court ahead of his sentencing. It said without S&amp;C’s work, billions of additional dollars would have been lost or stolen, and recovery would have been a fraction of what it currently is.","But what’s clear is that the controversy over S&amp;C’s ties to the exchange is beginning to overshadow the bankruptcy proceedings — and it has created a rather unique situation.","“In cases where there is a challenge to debtor's counsel that challenge will usually be heard early in the case,” said Matthew Gold, partner at Kleinberg Kaplan. “In FTX, because the bankruptcy judge denied the appointment of an examiner, and the appeal of that ruling took time, the result is that the examiner is beginning his work more than a year and a half after the case began. That is very unusual.”","Gold added that in most bankruptcy fraud cases, an independent trustee is usually appointed. But with FTX, an independent chief restructuring officer was hired by the existing management on the night before the exchange filed for bankruptcy so no trustee was appointed. “This, too, places FTX in a relatively small subset of cases,” he said.","How the situation plays out could have an impact on the bankruptcy proceedings.","Claims trader Braziel said the class action case might struggle to gain traction given the estimated recovery in the bankruptcy proceedings. This is currently expected to be 100% in dollar terms (although there’s a chance it <a href=\"https:\/\/www.theblock.co\/post\/284201\/the-pulse-ftx-recovery-may-include-recent-prices-ethereums-missing-canary\" data-v-f87c67ca=\"\">could be even higher<\/a>).","He expects the internal probe into S&amp;C will be rather limited but said it’s good that the examiner is looking into the issues. If this resulted in anything substantial, it’s possible that S&amp;C could be removed from the case.&nbsp;","If this happened, he estimated that it would take three to six months for the estate to get a new law firm set up and it would likely need to hire a similarly sized firm. Braziel noted that such a firm would charge the same high fees, which are typically higher at the beginning of an engagement.","Nonetheless, he does not anticipate a change in counsel.&nbsp;&nbsp;","“I don’t think S&amp;C is going to be kicked out,” Braziel said. “It all smells bad, but I don’t think you’ll find a smoking gun.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Matthew Gold","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"January 2024","content":"DATE"},{"type":"January 2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"February 2023","content":"DATE"},{"type":"the Third Circuit Court of Appeals","content":"ORGANIZATION"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Unabomber","content":"ORGANIZATION"},{"type":"Moskowitz","content":"PERSON"},{"type":"Sullivan &amp; Cromwell","content":"ORGANIZATION"},{"type":"John Ray III","content":"PERSON"},{"type":"Andrew Dietderich","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"Braziel","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Philadelphia","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Kleinberg Kaplan","content":"PERSON"},{"type":"Robert Cleary","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Thomas Braziel","content":"PERSON"},{"type":"Dietderich","content":"PERSON"}],"hashtag":["FTX"],"authors":["Tim Copeland","The Block"]}