{"summary":"Crypto developer activity on Ethereum and non-Ethereum compatible chains is down significantly in 2022.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193428\/crypto-developer-activity-falls-in-2022-with-arbitrum-an-emerging-bright-spot","publishDate":"2022-12-08T17:35:27","id":9213,"type":null,"title":"Crypto developer activity falls in 2022, with Arbitrum an emerging bright spot","category":["LAYER 2S AND SCALING"],"content":["Crypto developer activity for Ethereum and non Ethereum-compatible chains has seen significant declines in 2022.","Weekly active developers for non-EVM chains, or chains not easily compatible with Ethereum, have seen the most significant decline, <a href=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/non-evm-chains-stats\" data-v-f87c67ca=\"\">according to data from The Block.<\/a> Ethereum and Ethereum-compatible chains have also seen dips in activity, with Ethereum itself still maintaining a <a href=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/evm-chains-stats\" data-v-f87c67ca=\"\">significant<\/a>&nbsp;share of all activity.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/non-evm-chains-stats\/weekly-active-developers-for-non-evm-chains\/embed\" title=\"Weekly Active Developers for Non-EVM Chains\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Developer activity is a statistic used to gauge the health of a blockchain ecosystem; more specifically, it can be used as an indicator of developers building “killer applications” that are bringing value to users, <a href=\"https:\/\/github.com\/electric-capital\/developer-reports\/blob\/master\/dev_report_2021_updated_012622.pdf\" data-v-f87c67ca=\"\">according to Electric Capital.<\/a> The metric can have a snowball effect either way, as more activity can attract more users, which in turn attracts more developers.&nbsp;","Developer activity generally mirrors overall on-chain activity and prices, The Block research analyst Kevin Peng said. When money is taken out of the ecosystem, as happened this year, there's less money to fund new projects and developers. There’s also less incentive for quick returns.","Although activity for EVM and non-EVM chains is down significantly, unique contracts deployed on Ethereum scaling platform Arbitrum have seen significant increases in the fourth quarter, <a href=\"https:\/\/www.gokustats.xyz\/developers\/on-chain\" data-v-f87c67ca=\"\">according to Gokustats.<\/a>&nbsp;This could be due to continued speculation around the <a href=\"https:\/\/www.theblock.co\/post\/154762\/arbitrum-fees-rose-higher-than-ethereum-mainnet-for-several-hours\" data-v-f87c67ca=\"\">Arbitrum token airdrop,<\/a> which caused transaction costs on the chain to spike at the end of June and a surge to all-time highs in daily transaction count, <a href=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\" data-v-f87c67ca=\"\">according to The Block data.<\/a>","","","It also could be an indication that applications and builders in other ecosystems, such as Avalanche’s largest decentralized exchange by <a href=\"http:\/\/l\" data-v-f87c67ca=\"\">volume Trader Joe,<\/a> have taken notice of Arbitrum of late.","“It is the leading Layer 2 that has built up organically over time so it is filled with genuine builders,\" said Trader Joe’s pseudononymous marketing and community lead Blue on their motivation for launching on Arbitrum. \"We want the Liquidity Book AMM to be part of that story.”&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Joe","content":"PERSON"},{"type":"Joe’s","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Liquidity Book AMM","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"fourth quarter","content":"DATE"},{"type":"Electric Capital","content":"ORGANIZATION"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Kevin Peng","content":"PERSON"}],"hashtag":["CRYPTO"],"authors":["Mike Truppa","The Block"]}