{"summary":"Ambitious plan places 62-bitcoin wallet key on rover headed to the moon. Who pulls the key first wins the crypto.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222167\/bitcoin-treasure-hunt-on-the-moon-brilliant-scheme-or-crazy-publicity-stunt","publishDate":"2023-03-23T09:00:24","id":9215,"type":null,"title":"Bitcoin treasure hunt on the moon: Brilliant scheme or crazy publicity stunt? ","category":["METAVERSE & NFT"],"content":["<span data-contrast=\"none\" data-v-f87c67ca=\"\">A reward worth almost $2 million in bitcoin may be up for grabs by the end of this year. <\/span>&nbsp;","<span data-contrast=\"none\" data-v-f87c67ca=\"\">All treasure hunters need to do is find a way to travel more than 200,000 miles through space and then land on the moon’s surface. That’s because later this year a SpaceX rocket will carry a small lunar rover about the size of a microwave oven to the moon. Carefully attached to the rover: A coded key capable of unlocking a small fortune, 62 bitcoin.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Right now, 62 bitcoin equals almost $1.8 million. But by the time someone manages to pull off copying down the key from the rover, the digital treasure could be worth much more, argues one of the project’s leaders.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“My God, who knows the price of bitcoin in 40 years,” said Joe Vezzani, CEO of LunarCrush, the driving force behind the “first interplanetary treasure hunt” in history, a project christened Nakamoto_1, after Bitcoin’s pseudonymous creator Satoshi Nakamoto.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Vezzani runs LunarCrush, a firm that aggregates social media communication in order to analyze investment trends across cryptocurrencies and NFTs. And while the chief executive is no expert in space exploration, he admits the arduous — if not completely bonkers — challenge could take even highly motivated explorers several years to overcome.<br data-v-f87c67ca=\"\">\n<\/span>","<em data-v-f87c67ca=\"\">Screenshot of Golden Wolf NFT art being issued to fund the bitcoin treasure.<\/em>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">But he and his team are optimistic it won’t take four decades. “People have done crazier things,” he said, pointing to all the future lunar projects coming down the pike. “They’re building bases [on the moon], so at some point there will be people cruising around up there.” <\/span>&nbsp;","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The U.S. Russia, India, China, the EU and Elon Musk’s SpaceX have all <\/span><a href=\"https:\/\/www.bbc.com\/news\/science-environment-64002977\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">discussed or have planned<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> trips to the moon. Expanded exploration of the lunar surface and the future potential for space stations located there also all appear to be <\/span><a href=\"https:\/\/www.bbc.com\/future\/article\/20230317-the-epic-quest-to-build-a-permanent-moon-base\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">gaining momentum<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\">.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">With Nakamoto_1, the rover will first fulfill its duty of testing wireless data transmission along the moon’s South Pole, according to the project’s organizers. “[It] will operate continuously until the end of the lunar day, which lasts 14 Earth Days. Once the sun sets and the communication link to the lander ceases, the rover will remain dormant until it is discovered,\" said Forrest Meyen, co-founder of Lunar Outpost, the company building and outfitting the small rover before it hitches a ride to the moon.<\/span>&nbsp;","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Funding the 62-bitcoin fortune begins with the issuing of a 24,000-piece collection of NFTs scheduled to drop later this month. At $250 per NFT, LunarCrush hopes to raise as much as $6 million. The company has earmarked about 25% to pay for the treasure. An additional 25% is also set to be donated to bitcoin-related developmental and educational causes.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">To create the collection art the project enlisted the talents of Emmy-nominated animation studio Golden Wolf, which was recently acquired by the top-tier NFT brand Doodles. Golden Wolf is tasked with helping Doodles expand its franchise and content offerings.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The entire team, which also includes a Bitcoin developer tools company known as Hiro, comes across as earnest about promoting space travel and spurring ingenuity among wannabe space explorers. But the core mission appears firmly rooted in creating community around the project while generating positive buzz both for LunarCrush and the crypto industry amid a prolonged bear market mired in scandal.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“We’ve been in the space awhile and we could have built an NFT project before this,” Vezzani said, adding, “over time you’re going to see the project get more interwoven into LunarCrush,” including special benefits to some Nakamoto_1 token holders. <\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Vezzani understands that the project’s success initially hinges on selling enough NFTs to fill a digital wallet full of an amount of bitcoin that will generate interest in the lunar treasure hunt. <\/span>&nbsp;","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“That’s the stuff that keeps you up at night,” he said, adding that he believes that it will likely be years before anyone claims the treasure, but that buys his team time to eventually add more bitcoin, or even valuable NFTs, to the digital treasure chest. “People can send stuff to that public key forever.”<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“This is the part of free markets that work really well,” countered Hiro CEO Alex Miller when asked if the whole endeavor is nothing more than a spectacular publicity stunt. “You put a bounty out there and you let people figure out the best way to go get it.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Pole","content":"LOCATION"},{"type":"Golden Wolf NFT","content":"ORGANIZATION"},{"type":"Vezzani","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"$1.8 million","content":"MONEY"},{"type":"earnest","content":"LOCATION"},{"type":"Joe Vezzani","content":"PERSON"},{"type":"U.S. Russia","content":"LOCATION"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Forrest Meyen","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"Hiro CEO Alex Miller","content":"PERSON"},{"type":"India","content":"LOCATION"},{"type":"Hiro","content":"PERSON"},{"type":"Wolf","content":"PERSON"},{"type":"$6 million","content":"MONEY"},{"type":"China","content":"LOCATION"},{"type":"$250","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}