{"summary":"BNB Chain has finished a hard fork upgrade called Moran following a large hack last Friday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176511\/bnb-chain-executes-hard-fork-to-secure-network-after-100-million-hack","publishDate":"2022-10-12T07:18:39","id":9216,"type":null,"title":"BNB Chain executes hard fork to secure network after $100 million hack","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">BNB Chain has finished a hard fork upgrade called Moran in an attempt to recover and secure infrastructure following a large hack last week. <\/span>","<span data-v-f87c67ca=\"\">The hard fork — a blockchain upgrade that implements a major change to the network's underlying software —&nbsp;<\/span><span data-v-f87c67ca=\"\">went through successfully at 4 a.m. ET on Wednesday at a block height of 22,107,423. It was mainly executed to implement a software patch that resolved a critical vulnerability exploited by an unknown attacker to <\/span><a href=\"https:\/\/www.theblock.co\/post\/175403\/bnb-smart-chain-halted-amid-potential-bridge-exploit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">steal<\/span><\/a><span data-v-f87c67ca=\"\"> more than $100 million from BNB Chain's cross-chain bridge last Friday.<\/span>","<span data-v-f87c67ca=\"\">The developer team announced the upgrade with a <\/span><a href=\"https:\/\/github.com\/bnb-chain\/bsc\/releases\/tag\/v1.1.16\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">GitHub post<\/span><\/a> on Tuesday, saying it<span data-v-f87c67ca=\"\"> would carry out a hard fork to deploy a patch and re-enable the network's “cross-chain infrastructure.”<\/span>","<span data-v-f87c67ca=\"\">This cross-chain bridge allows users to transfer assets between the two separate blockchains that fall under the BNB Chain network: Beacon Chain and Smart Chain. While BNB Beacon Chain handles the network's governance and staking, the Smart Chain is used as an Ethereum Virtual Machine-compatible smart contract platform to deploy apps. Both of these chains can connect to other third-party chains with the help of Token Hub bridge as well.<\/span>","<span data-v-f87c67ca=\"\">During the exploit, the perpetrator forged security proofs, leveraging a vulnerability tied to \"iavl hash check,\" a security check baked into the bridge. In this way, the hacker was able to mint 2 million BNB tokens out of thin air, worth around $560 million at the time. On-chain data shows that the hacker<\/span> <a href=\"https:\/\/www.theblock.co\/post\/175437\/biance-bnb-chain-is-back-up-after-bridge-exploit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">transferred<\/span><\/a><span data-v-f87c67ca=\"\"> more than $100 million out to third-party chains including Ethereum, Fantom, Polygon, Avalanche and Arbitrum. The majority of the affected assets (<\/span><a href=\"https:\/\/debank.com\/profile\/0x489a8756c18c0b8b24ec2a2b9ff3d4d447f79bec\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">nearly $430 million<\/span><\/a><span data-v-f87c67ca=\"\">) remained in the hacker's wallet on the BNB Chain itself.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In response to the exploit, the team halted the blockchain, ordering all of its 44 validators — including 26 active validators — to stop operations. The team re-enabled the network later but the bridge itself remained shut until the vulnerability could be fixed. The halt was also an effort to stop the attacker in their tracks and salvage any exploited funds that the attacker had not yet moved out to other chains.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The latest hard fork today will help BNB Chain restart the bridge's full operations and secure the network's overall infrastructure. With this hard fork, the team is expected to move to its next plan of action, which is to<\/span><span data-v-f87c67ca=\"\"> conduct&nbsp;<\/span><a href=\"https:\/\/www.theblock.co\/post\/175503\/bnb-chain-governance-to-decide-what-will-happen-to-hacked-funds\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">governance votes<\/span><\/a><span data-v-f87c67ca=\"\"> to decide whether to freeze funds held in the hacker’s address on BNB Chain and \"auto-burn\" them, according to a recent post from the team.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"4 a.m.","content":"TIME"},{"type":"Token Hub","content":"ORGANIZATION"},{"type":"BNB Beacon Chain","content":"ORGANIZATION"},{"type":"Moran","content":"PERSON"},{"type":"Polygon","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Beacon Chain","content":"LOCATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"$560 million","content":"MONEY"},{"type":"Fantom","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Smart Chain","content":"ORGANIZATION"},{"type":"$430 million","content":"MONEY"}],"hashtag":["BNB CHAIN"],"authors":["Vishal Chawla","The Block"]}