{"summary":"“The network is robust in its unstructured simplicity.”      — Satoshi Nakamoto, “Bitcoin: A Peer-to-Peer Electronic Cash System” &amp;nbsp; I am sometimes","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/52053\/bitcoin-trust-and-simplicity","publishDate":"2020-01-05T12:47:54","id":9224,"type":null,"title":"Bitcoin, trust, and simplicity","category":["BITCOIN"],"content":["<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">&nbsp; &nbsp; &nbsp;— Satoshi Nakamoto, “Bitcoin: A Peer-to-Peer Electronic Cash System”<\/span><\/em>","&nbsp;","<span data-v-f87c67ca=\"\">I am sometimes asked by people why a lawyer midway through the journey of life would become interested in bitcoin or cryptocurrency and what about it, if anything, is connected with my legal practice, training and experience. <\/span>","<span data-v-f87c67ca=\"\">Ironically, perhaps, Bitcoin for me is deeply connected with the financial crisis of 2008, which (if you believe the narrative) is the crucible out of which Bitcoin itself was born. If there had been no financial collapse, I also might not have stumbled my way down this particular rabbit hole.<\/span>","<span data-v-f87c67ca=\"\">By way of personal background (nothing that you can’t find on my LinkedIn profile or law firm bio) I’d taken what some might say was a fairly conservative approach to life and career in my 20s and early 30s: college, grad school, law school, law firms, and then migration from the Midwest to D.C. to join a big firm here in the mid-aughts. I focused on insurance disputes that arose out of large construction projects (stadiums, power plants, that kind of thing).<\/span>","<span data-v-f87c67ca=\"\">Life was poodling along, in if not exactly a straight line but with some predictability, until about 2008 when I hit an unexpected fork in the road: the financial crisis of 2008, which caused two law firms to collapse (and was in my view about to do in a third around 2013, when I left it).<\/span>","<span data-v-f87c67ca=\"\">On that point, let me back up a little bit more.&nbsp;<\/span><span data-v-f87c67ca=\"\">I first suspected something was systematically wrong around 2003 or so when I went to refinance a mortgage and found that it was way too easy. <\/span>","<span data-v-f87c67ca=\"\">Something didn’t make sense. They didn’t want pay stubs, tax records, really anything, as I recall. I had also spent some time doing real estate litigation and (to make a long story short) had seen things in fairly low-level mortgage and title litigation that simply didn’t make any sense, including a company called “MERS” that was acting as something called a “nominee” in loan transactions, which wasn’t really a thing. We were told that risk was engineered out of financial transactions and money could be leveraged out of the real estate market as if from thin air.<\/span>","<span data-v-f87c67ca=\"\">It was bullshit, and the market eventually collapsed.  The firm I was with in 2008 died and I went to another that failed a couple years later, somewhat inconveniently after I made partner there. <\/span>","<span data-v-f87c67ca=\"\">Along the way, I became obsessed with the role of trust and fear as factors in lawsuit settlements, and this led to me to leave a third law firm I suspected was about to die to start (way too early, and with too little capital) a LegalTech dispute resolution platform, while opening up a solo law practice. <\/span>","<span data-v-f87c67ca=\"\">I’m going to jump back to that LegalTech platform\/fiasco a little bit more below, but it’s a good guess that if a bunch of geniuses on Wall Street hadn’t decided to repackage trillions of dollars of overvalued debt into mortgage backed securities and CDOs because of “financial engineering” I might still be an insurance coverage litigation partner at Thelen Reid in D.C., and maybe Satoshi Nakamoto wouldn’t have written that white paper either or I would never have, at the very least, found it. <\/span>","<span data-v-f87c67ca=\"\">Hard to say, of course, when we play the what-if game, but that's my guess and, regardless, here we are.<\/span>","<span data-v-f87c67ca=\"\">One thing I did know for sure about before the rise of bitcoin was trust and how the lack of it was and is central to law and legal systems. Let me explain while oversimplifying several millennia of jurisprudence along the way. <\/span>","<span data-v-f87c67ca=\"\">If you and I are in perfect agreement about a commercial arrangement and know with certainty that I will deliver your herring and you will pay me the agreed upon amount of money in exchange, we don’t need a written contract. In a world where we can see the future, we don’t need a <em data-v-f87c67ca=\"\">force majeure<\/em> clause to address roads being wiped out by a typhoon, or liquidated damages clauses or choice of law, and so forth. We just know — because we have perfect insight into the future — that the herring will be delivered and the money will be paid.<\/span>","<span data-v-f87c67ca=\"\">We can’t see the future, though, and I can’t read your mind. To address uncertainty and the lack of trust it rationally engenders, we have contracts. Bottom line : contracts were and are an incredibly innovative trust solution, and the next time you see a lawyer, make sure to thank them for coming up with these nifty things. <\/span>","<span data-v-f87c67ca=\"\">(Contracts are far from perfect of course — they don’t actually make transactions simpler ;  they add layers and layers of details to address contingencies that may or may not ever arrive. They are not simple solutions to the trust problem).<\/span>","<span data-v-f87c67ca=\"\">That’s the transactional side of trust in law : we enter into contracts to assure performance and to (hopefully) provide a rubric for dispute resolution if there is ever a problem in the future. Contracts work alright, but the reality is that if you entered into an agreement with me for herring delivery, it's probable that you want that fish delivered on time and you don’t want to end up in court. And if you do end up in court, there are a whole bunch more trust problems you will have to deal with.<\/span>","<span data-v-f87c67ca=\"\">One of the core trust problems I encounter day in and day out in civil litigation is in case settlement. Most cases settle, sometimes after years of expensive litigation. I am not looking a gift horse in the mouth, believe me — as a litigator, this keeps the lights on. But at the same time, it’s inelegant and fundamentally stupid for most people to spend two years litigating when you’re ultimately going to have a financial resolution. (The rejoinder that “sometimes you need discovery” to know what a case is worth is questionable. More information often does nothing more than <a href=\"https:\/\/www.newyorker.com\/magazine\/2017\/02\/27\/why-facts-dont-change-our-minds\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">solidify people in their positions and cause antagonism<\/a>.)<\/span>","<span data-v-f87c67ca=\"\">Obviously, if people are in a lawsuit already, there are probably some trust issues and, often, a good deal of animosity. So it’s not like the defendant and the plaintiff are going to agree to share their bottom line financial positions with each other. How am I supposed to trust that you will share your best offer with me after I share mine with you? After all, you sued me you jerk! This is a problem I saw my first day practicing law and that I still deal with on a regular basis. <\/span>","<span data-v-f87c67ca=\"\">Still, if we strip away the emotion and complexity from 99 percent of civil litigation, most lawsuits are at the end of the day about reaching a number, a financial resolution that all involved parties can live with.<\/span>","<span data-v-f87c67ca=\"\">This bugged me for years and, ultimately, I built some software in an attempt to solve the problem. The software was nifty but for a variety of reasons I couldn’t make it work as a business, and the software lives on in a repository and nowhere else. That saying that when one door closes another door opens is totally true, however, and that failure changed the trajectory of my law practice in some really neat ways. Among other things, that failed business led me to Bitcoin and the notion that software could solve a trust problem: one that didn’t require centralized intermediaries and allowed people to send software money to each other.<\/span>","<span data-v-f87c67ca=\"\">One of the design problems my own software ran into was that although we had designed a really elegant double-blind matching system that cut to the chase, everything was still centralized in a database on AWS that I controlled. And I also realized quickly that adding payment functionality would be a nightmare and defeated the purpose of my solution. <\/span>","<span data-v-f87c67ca=\"\">If you used my trustless negotiation solution you’d still be using me as an intermediary, and to make it work really well as a payment escrow, you’d have to trust me. This didn’t make much sense.<\/span>","<span data-v-f87c67ca=\"\">The Bitcoin white paper offered what seemed like a solution. And what appealed to me when I first read it in late 2013 was that it was simple and didn’t require complicated governance or design decisions to use. It asked a question — how can people pay each electronically without relying on a centralized trust based system. The solution? As the paper states plainly: “What is needed is an electronic payment system based on cryptographic proof instead of trust, allowing any two willing parties to transact directly with each other without the need for a trusted third party.”<\/span>","<span data-v-f87c67ca=\"\">There was no mythopoesis of decentralization, no claim that “governance” was going to be magically recreated and organizations deconstructed and devolved. No. None of that, just a simple elegant 9 page paper (8 if you don’t include the footnotes) that presented a technical solution for digital money that could only be spent once, and that didn’t require intermediaries like banks or governments. Here’s what I thought in 2013 and 2014 and what I still think today — Bitcoin isn’t a governance solution. Nothing of the sort. It’s a trust solution.<\/span>","Nick Szabo places this in institutional and historical context in his 2017 essay, <a href=\"https:\/\/unenumerated.blogspot.com\/2017\/02\/money-blockchains-and-social-scalability.html\" data-v-f87c67ca=\"\">Money, blockchains, and social scalability<\/a>:","\"Trust minimization is reducing the vulnerability of participants to each other’s and to outsiders’ and intermediaries’ potential for harmful behavior. &nbsp;Most institutions which have undergone a lengthy cultural evolution, such as law (which lowers vulnerability to violence, theft, and fraud), as well as technologies of security, reduce, on balance, and in more ways than the reverse, our vulnerabilities to, and thus our needs to trust, our fellow humans, compared with our vulnerabilities before these institutions and technologies evolved. In most cases an often trusted and sufficiently trustworthy institution (such as a market) depends on its participants trusting, usually implicitly, another sufficiently trustworthy institution (such as contract law). These trusted institutions in turn traditionally implement a variety of accounting, legal, security, or other controls that make them usually and sufficiently, at least for facilitating the functionality of their client institutions, trustworthy, by minimizing vulnerability to their own participants (such as accountants, lawyers, regulators, and investigators). An innovation can only partially take away some kinds of vulnerability, i.e. reduce the need for or risk of trust in other people. There is no such thing as a fully trustless institution or technology.\"","The more human engagement and interaction the protocol has, the less trust minimization you possess. &nbsp;And the further that&nbsp;<span data-v-f87c67ca=\"\">blockchain protocols\/platforms get bogged down with governance, the more complexity arises that most of them are ill-equipped to handle. &nbsp;<\/span>","","","<span data-v-f87c67ca=\"\">If you follow <a href=\"https:\/\/www.theblockcrypto.com\/author\/theblock-stephen\" data-v-f87c67ca=\"\">my written work<\/a>, you know that I've spent a lot of time writing about legal developments that have arisen from the use of cryptocurrency. I’m also not saying that Bitcoin will make all of the problems of the world go away, or that you aren’t moving your trust to software design and designers. (If there is a Bitcoin religious virtue test, I probably fail it.)&nbsp;<\/span>","<span data-v-f87c67ca=\"\">What I am saying—having read just about every published US legal opinion that addresses crypto broadly speaking—that most legal problems that arise out of the use of bitcoin and blockchain have a common theme:  agreements, relationships and communications that exist outside of the protocol. As soon as you add human action into the mix, you contradict the very premise of bitcoin's conceptual underpinnings.<\/span>","<span data-v-f87c67ca=\"\">Exchanges, fiat on\/off ramps, foundations, governance committees — all of these things may be necessary for consumer adoption and growth. At the same time, they’re a <a href=\"https:\/\/www.merriam-webster.com\/dictionary\/Hobson%27s%20choice\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Hobson’s choice<\/a> and a paradox, destroying the simple utility that Satoshi’s elegant white paper articulates. It’s also where law and human governance step in and intercede.&nbsp;<\/span><span data-v-f87c67ca=\"\">Complexity breeds conflict and leads to collapse—complexity combined with delusion is an even more dangerous mix. <\/span>","<span data-v-f87c67ca=\"\">One of the lessons I’ve learned from two decades of law practice is that if someone is using a lot of words to describe something and you don’t understand them, there’s a really good chance they either (1) don’t understand the thing themselves or (2) they are delusional, (3) they are lying, or (4) all of the preceding. <\/span><span data-v-f87c67ca=\"\">Such things are what led to the financial collapse of 2008, and what fed the ICO craze of 2017\/18 (that, and the idea of free money). <\/span>","<span data-v-f87c67ca=\"\">One of Bitcoin’s greatest strengths is (at least to me) the absence of explicit governance, the fact that it doesn’t try to reinvent corporate bylaws from scratch. The white paper set out to solve one simple but important problem. It did that and does that. <\/span>","<span data-v-f87c67ca=\"\">And, perhaps, that is and will be enough.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2003","content":"DATE"},{"type":"trillions of dollars","content":"MONEY"},{"type":"2014","content":"DATE"},{"type":"Hobson","content":"PERSON"},{"type":"Midwest","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Peer Electronic Cash System”","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Satoshi","content":"PERSON"},{"type":"2008","content":"DATE"},{"type":"99 percent","content":"PERCENT"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Nick Szabo","content":"PERSON"},{"type":"ICO","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Thelen Reid","content":"PERSON"},{"type":"AWS","content":"ORGANIZATION"},{"type":"D.C.","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Stephen Palley","The Block"]}