{"summary":"Jongchan Jang, the Korean creator of Yearn.Finance (YFI) fork Asuka token, is said to have exit scammed. Jang has shut down the Asuka.Finance website as well as all its social media accounts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/73737\/creator-of-yfi-fork-asuka-token-is-said-to-have-exit-scammed","publishDate":"2020-08-03T05:30:45","id":9226,"type":null,"title":"Creator of YFI fork Asuka token is said to have exit scammed","category":["DEFI"],"content":["Jongchan Jang, the creator of Yearn.Finance (YFI) fork Asuka token and a known person in Korean crypto community, is said to have exit scammed.","<a href=\"http:\/\/coincredible.co.kr\/archives\/4865\" data-v-f87c67ca=\"\">Korean news<\/a> <a href=\"https:\/\/joind.io\/market\/id\/2896\" data-v-f87c67ca=\"\">outlets reported<\/a> the news on Monday, saying that Jang has shut down the Asuka.Finance website as well as all its social media accounts. The price of Asuka token, once at about $1600 apiece, has reportedly tanked to about $19.","Asuka was promoted as \"Dogecoin of DeFi tokens,\" according to a <a href=\"https:\/\/boards.4channel.org\/biz\/thread\/20925369\/asukafinance-yfi-at-a-650k-market-cap\" data-v-f87c67ca=\"\">4chan board posted on Sunday<\/a>. Total supply of the token was said to be 21,000, with the first 10,000 tokens to be \"farmed\" in the first week.","\"Unlike other YFI forks like YFII or YFFI, Asuka token will allocate 5% of premine from the initial supply for expanding rewards to other pool contracts in the future. Until then, the Governance contract for Asuka token will be established, and key holders will be elected from the farmers who mined among the most,\" per the 4chan board, which received numerous responses from potential investors.","To stake Asuka tokens, users had to buy MakerDAO's DAI stablecoin, put it in a Balancer liquidity pool to receive a \"BPT\" token, and then stake that token. BPT tokens are Balancer pool tokens which represent one's share of a Balance pool.","Doo Wan Nam, MakerDAO's business development associate in the Asia-Pacific region, <a href=\"https:\/\/twitter.com\/DooWanNam\/status\/1290129360679088128\" data-v-f87c67ca=\"\">tweeted<\/a> that Jang, who once helped with ETH Classic, has dumped all of his holdings and said: \"I feel ashamed so I will runaway now.\"","Doo further said that Jang appears to be sending DAI to Binance. When reached for comment, a Binance spokesperson told The Block:","\"We have identified the relevant account(s). Binance will assist Korean law enforcement in their investigation once we receive a request from them. As always, we will continue to strive for heightened security both on our platform and for the greater crypto space.\"","It is not clear how much money users put in Asuka token. Doo said the amount involved is \"relatively small,\" apparently below $30,000.","Users can unstake Asuka tokens, said Doo, via an <a href=\"https:\/\/etherscan.io\/address\/0x7b239F1D46Cb93AbF668BeffaFFdd1A928710e2A#writeContract\" data-v-f87c67ca=\"\">Etherscan address<\/a> by clicking \"write\" under the \"exit\" row.","The YFI \"yield farming\" craze began recently when the token was giving 500% to 1000% yield per annum. YFI is the governance token of Yearn.Finance protocol, and YFII and YFFI are its other popular forks.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Jang","content":"PERSON"},{"type":"Asuka","content":"LOCATION"},{"type":"$30,000","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Doo Wan Nam","content":"PERSON"},{"type":"ETH Classic","content":"ORGANIZATION"},{"type":"Pacific","content":"LOCATION"},{"type":"Doo","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"$19","content":"MONEY"},{"type":"500%","content":"PERCENT"},{"type":"Jongchan Jang","content":"PERSON"},{"type":"1000%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"$1600","content":"MONEY"}],"hashtag":["DAI"],"authors":["Yogita Khatri","The Block"]}