{"summary":"Blockchain network provider Zilliqa has taken a step toward increasing infrastructure security and compliance of its network, which went live earlier this","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/48567\/zilliqa-blockchain-ups-its-compliance-game-via-elliptic-to-drive-enterprise-adoption","publishDate":"2019-11-27T02:10:20","id":9228,"type":null,"title":"Zilliqa blockchain ups its compliance game via Elliptic to drive ‘enterprise adoption’","category":["LAYER 1S"],"content":["Blockchain network provider Zilliqa has taken a step toward increasing infrastructure security and compliance of its network, which went live earlier this year.","Singapore-based Zilliqa has partnered with blockchain analytics startup Elliptic for the effort, according to an announcement Wednesday. Elliptic will provide Zilliqa an ongoing anti-money laundering (AML) compliance support for its native token ZIL, as well as recently launched stablecoin XSGD - pegged 1:1 to the Singapore dollar.","Put simply, Elliptic will identify and help block potential transactions linked to illicit activities on the Zilliqa network, via its blockchain transactions monitoring tool.","As it is the start of the partnership, Elliptic is yet to determine how much worth of ZIL tokens are tied to illicit activities. “We have not yet completed the work that would be required to provide these kinds of statistics,” Tom Robinson, co-founder and chief scientist of Elliptic, told The Block, adding:","“One interesting trend we're seeing is that regulators are increasingly looking to see whether blockchain monitoring capabilities are available on specific stablecoins, when considering regulatory approval. […] Financial institutions are more likely to engage with blockchains and crypto-assets for which tools exist to identify and trace risky transactions.”","Elliptic proved to be a “logical” partner as it recently announced<a href=\"https:\/\/www.theblockcrypto.com\/post\/38327\/blockchain-analytics-firm-elliptic-raises-23m-series-b-to-fund-asia-expansion\" data-v-f87c67ca=\"\"> expansion <\/a>into Asia, including Singapore, Amrit Kumar, Zilliqa’s president and chief scientific officer, told The Block, adding: “They have assessed risk on transactions worth several trillion dollars, uncovering activities related to money laundering, terrorism fundraising, fraud, and other financial crimes.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nJust last week, Elliptic <a href=\"https:\/\/www.theblockcrypto.com\/post\/47675\/blockchain-analytics-firm-elliptic-finds-over-400m-xrp-tied-to-illegal-activities\" data-v-f87c67ca=\"\">found<\/a> over $400 million worth of XRP transactions related to illicit activities, such as Ponzi schemes or scams.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Driving business<\/strong><\/span>","Zilliqa hopes to bring more enterprises to use its network via the compliance effort. “With Elliptic now as a compliance and security partner… we hope to enhance the legitimacy of our platform for enterprises who wish to build on blockchain but remain skeptical of security issues around it,” Kumar told The Block.","Currently, the most used application on the Zilliqa network is <a href=\"https:\/\/www.theblockcrypto.com\/post\/42622\/draper-backed-unstoppable-domains-rolls-out-new-domain-registry-to-boost-crypto-adoption\" data-v-f87c67ca=\"\">Unstoppable Domains<\/a>, a Draper Associates-backed blockchain domain maker. “It covers over 20% of the transaction volume on the network,” Kumar told The Block, adding:<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“Now equipped with a fully-functioning mainnet with live smart contracts on the network, enterprise adoption remains a key area of focus.\"","Zilliqa wants to drive greater decentralized finance (DeFi) initiatives on its network. The firm recently launched the <a href=\"https:\/\/www.businessinsider.sg\/xfers-launches-pilot-stablecoin-initiative-powered-by-zilliqa-to-drive-financial-inclusion-in-southeast-asia\/\" data-v-f87c67ca=\"\">XSGD stablecoin<\/a> in partnership with fintech startup Xfers. “As the first fintech startup to receive accreditation as a Widely Accepted Stored Value Facility (WA SVF) from the Monetary Authority of Singapore, Xfers will equally benefit from Elliptic’s compliance framework,” Kumar told The Block.","Zilliqa is backed by notable investors, having <a href=\"https:\/\/docs.zilliqa.com\/positionpaper.pdf\" data-v-f87c67ca=\"\">raised $22 million<\/a> in 2018 via a token sale, which saw participation from Polychain Capital, NGC Ventures and FBG Capital, among others. “We still have a comfortable runway for the next few years,” Kumar told The Block, adding that the firm may consider raising more funds in the future as it looks to build more solutions for its enterprise partners.","Founded in 2017, Zilliqa currently has 25 “core team members” and the firm is looking to hire more engineers and developers, Kumar told The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NGC","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Draper Associates","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Zilliqa","content":"PERSON"},{"type":"fintech","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Tom Robinson","content":"PERSON"},{"type":"$22 million","content":"MONEY"},{"type":"Kumar","content":"PERSON"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"Xfers","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"XRP","content":"ORGANIZATION"},{"type":"Amrit Kumar","content":"PERSON"},{"type":"Zilliqa","content":"ORGANIZATION"},{"type":"several trillion dollars","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"FBG Capital","content":"ORGANIZATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"last week","content":"DATE"}],"hashtag":["TOKENS"],"authors":["Yogita Khatri","The Block"]}