{"summary":"The DeFi platform Scream has racked up a significant amount of bad debt after hardcoding the price of depegged stablecoins to $1.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147046\/defi-lender-left-with-35-million-bad-debt-after-quoting-depegged-stablecoins-at-1","publishDate":"2022-05-16T07:49:49","id":9232,"type":null,"title":"DeFi lender left with $35 million bad debt after quoting depegged stablecoins at $1","category":["STABLECOINS"],"content":["Scream, a DeFi lending protocol on Fantom, has incurred $35 million in bad debt after failing to adjust the price of two stablecoins that lost their US dollar peg.","The two stablecoins in question are Fantom USD (fUSD) and Dei (DEI). Both coins still have a quoted price of $1, according to <a href=\"https:\/\/scream.sh\/lend\" data-v-f87c67ca=\"\">data<\/a> from Scream’s dashboard. Yet they are trading well below peg. fUSD fell to as low as $0.69 while DEI fell to $0.52 at its lowest.","Whales took advantage of this situation to deposit large amounts of FUSD and DEI at a discounted rate and drained all other stablecoins from the Scream platform. Stablecoins like Fantom USDT, FRAX, DAI, MIM, and USDC have all been siphoned off from the platform.","As such, users with supposed deposits of these stablecoins are unable to process withdrawals from Scream.","The situation with fUSD was also further exacerbated by the fact that the stablecoin’s deposit limit was set to infinity instead of zero. Coupled with FUSD becoming depegged, this situation allowed users to borrow large sums of money against the bad debt and drain the protocol’s remaining stablecoins.","The DeFi lending protocol has also <a href=\"https:\/\/defillama.com\/protocol\/scream\" data-v-f87c67ca=\"\">lost<\/a> about 50% of the total value locked in its smart contracts, according to DeFiLlama.","Scream responded to the issue with an <a href=\"https:\/\/twitter.com\/Screamdotsh\/status\/1526138091718713344\" data-v-f87c67ca=\"\">announcement<\/a> stating that it was seeking a solution to the bad debt in conjunction with the Fantom Foundation. This workaround will involve liquidating all fUSD loans currently underwater.","With fUSD depegged, Scream says it will hardcode the stablecoin’s price to $0.81. This solution could also liquidate other users whose positions were not previously at risk of liquidation.","Deus Finance DAO, meanwhile, has <a href=\"https:\/\/lafayettetabor.medium.com\/dip-7-treasury-bonds-4cc886148b9e\" data-v-f87c67ca=\"\">proposed<\/a> treasury bond sales to restore peg stability to DEI. According to the proposal, the platform will serve treasury bonds to users in exchange for collateral in the form of USDC, DAI, and FRAX.","DEI and FUSD are the latest stablecoins to lose their US dollar peg. TerraUSD (UST) kickstarted the trend last week with a dramatic drop that led to the <a href=\"https:\/\/www.theblockcrypto.com\/post\/146225\/luna-price-collapses-below-5-as-ust-slides-further-from-dollar-peg\" data-v-f87c67ca=\"\">collapse of Luna (LUNA)<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"$35 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"MIM","content":"ORGANIZATION"},{"type":"$0.81","content":"MONEY"},{"type":"Fantom Foundation","content":"ORGANIZATION"},{"type":"Deus Finance DAO","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"Fantom","content":"PERSON"},{"type":"$0.69","content":"MONEY"},{"type":"Fantom USD","content":"ORGANIZATION"},{"type":"$0.52","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"Fantom USDT","content":"PERSON"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}