{"summary":"To prevent the bankruptcy of Bitcoin miner Core Scientific, its main creditor, B. Riley Financial, Inc., offered a $72 million structured deal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195146\/b-riley-offers-72-million-to-mining-firm-core-scientific","publishDate":"2022-12-14T17:59:19","id":9238,"type":null,"title":"B. Riley offers $72 million to mining firm Core Scientific","category":["BANKRUPTCY"],"content":["B. Riley Financial, one of Core Scientific's largest creditors, argued that bankruptcy is not the the answer to Core Scientific's woes and is instead offering it a new financial lifeline.","<span data-v-f87c67ca=\"\">The creditor proposed offering “$72 million in new, non-cash pay financing on favorable terms, providing more than two years of runway for the company to achieve profitability,” according to a <a href=\"https:\/\/finance.yahoo.com\/news\/b-riley-financial-issues-open-185700926.html\" data-v-f87c67ca=\"\">letter<\/a> from B. Riley to Core Scientific's shareholders.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Bankruptcy is not necessary at all,” said B. Riley, adding that Core Scientific’s financial problems “are self-imposed and can be corrected with an open, transparent discussion and ongoing participation with its creditors and equity holders.”<\/span>","<span data-v-f87c67ca=\"\">Core Scientific earlier revealed that all options, even bankruptcy, were on the table after it opted in late October to suspend principal and interest payments towards financing and equipment lenders, a decision that surprised B. Riley, the firm said.<\/span>","<span data-v-f87c67ca=\"\">The mining firm <\/span><a href=\"https:\/\/www.theblock.co\/post\/189088\/core-scientific-warns-of-substantial-doubt-to-continue-operations-posts-435-million-loss\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> a $435 million loss in late November and stated it had “substantial doubts” regarding its capacity to raise funds, given uncertain market conditions.<\/span>","<span data-v-f87c67ca=\"\">When bitcoin prices were higher, Core Scientific’s debt, estimated by B. Riley to cover some&nbsp;<\/span><span data-v-f87c67ca=\"\">$300 million in equipment and other loans, was in a healthier position. Now, that debt is in short maturity as a result of “an aggressive, ill-conceived strategy” by the mining firm to expand mining and power facilities “while never selling Bitcoin on hand and never hedging prices,” B. Riley said.<\/span>","<span data-v-f87c67ca=\"\">The terms of the proposal from B. Riley stated that capital will be provided to allow Core Scientific to pay its debts and avoid bankruptcy, $40 million of which the creditor said it is willing to provide immediately and without any contingency.<\/span>","<span data-v-f87c67ca=\"\">“For the remainder of B. Riley's proposed new financing, at Bitcoin prices of $18,500 and below, all principal payments to equipment lenders would need to be suspended until the price of Bitcoin recovers to $18,500,” said the letter.<\/span>","<span data-v-f87c67ca=\"\">Core Scientific shares increased from $0.15 to just over $0.32 in after-hours trading, a nearly 94% gain, according to Tradingview.<\/span>","","","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Chart data from <\/span><\/i><a href=\"http:\/\/data\/\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Tradingview.com.<\/span><\/i><\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$435 million","content":"MONEY"},{"type":"$72 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"Tradingview","content":"ORGANIZATION"},{"type":"94%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"$0.15","content":"MONEY"},{"type":"B. Riley","content":"PERSON"},{"type":"$0.32","content":"MONEY"},{"type":"$300 million","content":"MONEY"},{"type":"Riley Financial","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"$18,500","content":"MONEY"}],"hashtag":["BANKRUPTCY FILINGS","INVESTMENT FIRMS","MINING COMPANIES"],"authors":["Jeremy Nation","The Block"]}