{"summary":"Obscuro Labs, the developer of the encrypted Ethereum Layer 2 network TEN, announced that it has raised $9 million in a funding round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282816\/ethereum-layer-2-ten-encryption-funding-token-valuation","publishDate":"2024-03-15T12:00:02","id":9239,"type":null,"title":"Ethereum Layer 2 TEN, focused on encryption, reaches $30 million token valuation with latest funding tranche","category":["VENTURE CAPITAL"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Obscuro Labs, the developer of the <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.68%\n    <\/span><\/a> <!----><\/span><\/span> Layer 2 network TEN (\"The Encrypted Network\"), announced that it raised $9 million in a funding round.&nbsp;<\/span><\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Enterprise blockchain firm R3 led the round, with Republic Crypto, KuCoin Labs, Big Brain Holdings, Magnus Capital and DWF Labs participating, Obscuro Labs said Friday. An R3 spokesperson confirmed to The Block that R3 led the round.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Obscuro co-founder Gavin Thomas told The Block that the $9 million round occurred in three tranches over the last two years, with the latest batch, worth nearly $3 million, closing last December. All tranches were structured as simple agreements for future equity (SAFE) with token warrants, Thomas said. He added that SAFE was optional as \"some investors were only interested in signing token warrants.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Thomas noted that the latest funding round brought Obscuro's fully diluted token valuation to $30 million.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">A former R3 executive, Thomas co-founded Obscuro in 2022 to develop TEN, an encrypted Ethereum Layer 2. More than half of Obscuro's team, seven out of 13 people, comes from R3, where they developed R3's permissioned blockchain, Corda,<\/span><strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/em><\/strong><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Thomas said. He added that R3 has supported TEN from its inception, with R3 co-founder Todd McDonald leading Obscuro's funding round.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Regarding <a href=\"https:\/\/www.theblock.co\/post\/268542\/the-origin-story-of-crypto-trading-firm-dwf-labs\" data-v-f87c67ca=\"\">DWF<\/a> <a href=\"https:\/\/www.theblock.co\/post\/267354\/how-dwf-labs-makes-deals-and-its-tendency-to-talk-about-price\" data-v-f87c67ca=\"\">Labs<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/225705\/dwf-labs-biggest-crypto-investors\" data-v-f87c67ca=\"\">a controversial firm<\/a>, being an investor in Obscuro, Thomas said that DWF Labs invested in Obscuro \"before any controversy surfaced\" and that \"controversy seems to surround their actions as a market maker, which we're not using them for. They're also one of our smallest investors.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">TEN is an Ethereum Layer 2 network focused on encryption, allowing developers to choose which parts of the smart contracts they want private and which parts public.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"TEN leverages a pragmatic technology for encrypting the ledger: Secure enclaves,\" Thomas said. \"Secure enclaves provide robust confidentiality guarantees with certainty over the code running. They allow TEN to run the Ethereum Virtual Machine in an encrypted space and therefore offer smart contracts, decentralization, scalability and encryption.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">TEN essentially generates \"confidential\" roll-ups and aims to provide efficiency similar to Optimistic-based Layer 2 networks while maintaining \"full encryption.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">When asked how TEN differs from other privacy-focused networks such as Aztec and <a href=\"https:\/\/www.theblock.co\/post\/280974\/zama-funding-cryptography-company-multicoin-capital-others\" data-v-f87c67ca=\"\">Fhenix<\/a>, Thomas said each takes a different technical approach: Aztec leverages zero-knowledge proofs, Fhenix uses fully homomorphic encryption, while TEN utilizes secure enclaves. TEN chose secure enclaves because of various factors, including performance, minimal friction as the user and developer experience is \"identical to Ethereum,\" and support amongst institutions, Thomas said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">TEN, as an encrypted Ethereum Layer 2, would \"massively open up the design space,\" allowing a new generation of on-chain games, decentralized finance, real-world assets, and institutional use cases to be developed, according to Obscuro Labs.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">TEN is currently in testnet mode and is expected to launch the mainnet in October. Meanwhile, TEN's native token will launch in June, said Thomas.<\/span>","When asked why to launch the token before the mainnet, Thomas said, \"Our token is a governance token, and we want to decentralize key decisions as much as possible in the lead-up to the mainnet.\"","\"A key one for us is the duration of the revelation period — a predefined maximum period in which transactions are revealed to help ensure regulatory compliance,\" he said. \"Along with this is the implementation of a whitelist where particular dApps can be exempt from this requirement as they have their own safeguards in place, e.g., institutional applications. We'd like the community to engage on which dApps should be included in this whitelist in preparation for mainnet.\"","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">With fresh funding, Obscuro looks to expand its 13-member team by hiring across business development and engineering functions, Thomas added.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"Magnus Capital","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Big Brain Holdings","content":"ORGANIZATION"},{"type":"Gavin Thomas","content":"PERSON"},{"type":"Thomas","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Obscuro","content":"ORGANIZATION"},{"type":"Republic Crypto","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"KuCoin Labs","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$3 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Todd McDonald","content":"PERSON"},{"type":"last two years","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"Obscuro Labs","content":"ORGANIZATION"},{"type":"Corda","content":"LOCATION"},{"type":"$9 million","content":"MONEY"},{"type":"TEN","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"-0.68%","content":"PERCENT"},{"type":"October","content":"DATE"},{"type":"Obscuro","content":"LOCATION"},{"type":"ups","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["CRYPTO","DECENTRALIZED INFRASTRUCTURE","ROLLUPS","STRATEGIC INVESTMENTS"],"authors":["Yogita Khatri","The Block"]}