{"summary":"The EOS community has canceled an ongoing payment of 67 million EOS to Block.one, part of which would have gone to Brock Pierce.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126801\/eos-community-halts-payments-worth-250-million-in-eos-to-block-one-and-brock-pierce","publishDate":"2021-12-08T12:13:59","id":924,"type":null,"title":"EOS community halts $250 million of funding to Block.one, Brock Pierce","category":["STARTUPS"],"content":["The EOS community today <a href=\"https:\/\/bloks.io\/msig\/jgo3xoeukt5z\/b\" data-v-f87c67ca=\"\">elected to stop<\/a> ongoing payments to Block.one —&nbsp;the company that originally designed the network —&nbsp;over claims that it is no longer acting in the network’s best interests.&nbsp;","Those running have stopped the issuance of 67 million EOS ($250 million) that was set to be distributed over the next six to seven years. This will also affect Brock Pierce — a co-founder of stablecoin issuer Tether and co-founder of Block.one — since Block.one <a href=\"https:\/\/b1.com\/press\/announces-network-growth-and-opportunity\/\" data-v-f87c67ca=\"\">said<\/a> he would have received around half of the tokens.","\"Through a super majority consensus, the EOS network has taken its future in its own hands by voting to fire Block.one and stop vesting tokens to them. This begins a new era for EOS and highlights the power of the blockchain to enable a community to stand up against corporate interests that don’t align with theirs,\" said Yves La Rose, leader of the EOS Network Foundation.","After collecting $4 billion in an ICO, Block.one released the software for the EOS blockchain, which went live in June 2018. It is a delegated proof-of-stake network run by the top 21 block producers, who are voted in by token holders. These 21 block producers combined have control over the whole network —&nbsp;but can be voted out of power.","In return for supporting the EOS blockchain, Block.one was set to receive 100 million EOS ($376 million) over 10 years — around 10% of the total supply.","Over the following years, the EOS community has been somewhat disappointed by Block.one’s commitment to the EOS blockchain, in terms of providing use-cases for it, according to the EOS Network Foundation (ENF). While it did a big reveal for a social media platform called Voice, it later turned out that it wouldn’t run on EOS (and largely turned into an NFT platform anyway). Block.one then announced plans to build a decentralized exchange called Bullish —&nbsp;but this wasn’t to run on EOS either.","In August 2021, a group was formed by existing EOS members and block producers called the ENF. It appointed La Rose, who formerly ran the EOS block producer EOS Nation, as its leader.","In November, La Rose made a speech outlining his plans for the network. He said that EOS had been let down by Block.one and needed to find a new way forward. “What we are experiencing is a shift whereby the EOS community is placing itself in a position to be able to move away from Block.one, essentially forking them out,” he said.","A few days later, Block.one announced it had given or sold 45 million EOS to Helios, a new fund set up by Brock Pierce to serve the EOS community. Eight million of the tokens were already vested and controlled by Block.one while 37 million are still vesting (meaning they haven't been released by the network yet).&nbsp;","Block.one was contacted for comment but did not respond by press time.&nbsp;","Over the next month and a half, the ENF engaged in dialogues with Block.one. The main goal was to get hold of the EOS network’s intellectual property and the main bargaining chip was the network’s continuance of payments of EOS to Block.one.","But one key problem, according to the ENF, was that the EOS intellectual property sits on Bullish’s balance sheet, meaning that Block.one would need to purchase it from the exchange. This caused a roadblock since Block.one wouldn't publicly commit to getting the intellectual property back from Bullish.","Instead, Block.one put out a <a href=\"https:\/\/b1.com\/press\/leveraging-block-ones-eos-holdings-for-additional-network-growth-and-opportunity-part-2\/\" data-v-f87c67ca=\"\">press release<\/a> announcing that it intended to grant 30 million EOS from the tokens that it was expecting to receive to the ENF. The tokens would be handed out over time at Block.one’s discretion.&nbsp;","Yet this was unsatisfactory for the ENF, since it did not provide the community with rights over the intellectual property. As a result, the network’s block producers came together to unilaterally put a stop to ongoing payments to Block.one, including the tokens it had designated for Helios. It is unclear if these tokens will never be handed out or if further negotiations could lead to the release of the payments.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"EOS","content":"ORGANIZATION"},{"type":"Brock Pierce","content":"PERSON"},{"type":"$4 billion","content":"MONEY"},{"type":"$250 million","content":"MONEY"},{"type":"EOS Network Foundation","content":"ORGANIZATION"},{"type":"Voice","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"August 2021","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"June 2018","content":"DATE"},{"type":"$376 million","content":"MONEY"},{"type":"45 million","content":"MONEY"},{"type":"ENF","content":"ORGANIZATION"},{"type":"EOS Nation","content":"ORGANIZATION"},{"type":"Yves La Rose","content":"PERSON"},{"type":"100 million","content":"MONEY"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}