{"summary":"BlockFi’s bankruptcy plan is progressing after the firm announced its disclosure statement was conditionally approved.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242922\/blockfi-moves-one-step-closer-to-refunding-creditors","publishDate":"2023-08-03T07:10:55","id":9240,"type":null,"title":"BlockFi moves &#x27;one step closer&#x27; to refunding creditors","category":["COMPANIES"],"content":["BlockFi’s bankruptcy plan is progressing after the firm announced its disclosure statement was conditionally approved by the U.S. bankruptcy court in New Jersey.","The company <a href=\"https:\/\/www.businesswire.com\/news\/home\/20230802310688\/en\/BlockFi%E2%80%99s-Disclosure-Statement-Conditionally-Approved-by-Court\" target=\"_blank\" rel=\"noopener nofollow\" data-v-f87c67ca=\"\">issued<\/a> a statement Wednesday, urging eligible parties to vote to accept the bankruptcy plan by a September 11 voting deadline. According to BlockFi, the successful approval of the plan will \"bring these chapter 11 cases to a fair and value‑maximizing conclusion that will return client funds as quickly as possible.\"","BlockFi filed for Chapter 11 protection in November 2022, citing volatility in crypto markets and its exposure to collapsed crypto exchange FTX.","“BlockFi’s mission through this process has been to maximize recoveries for our creditors, and conditional approval of our Disclosure Statement moves us one step closer to accomplishing that goal. We are confident that our Plan provides the best path to expeditiously return crypto back to our clients and we strongly urge BlockFi’s clients to vote to accept it,\" Mark Renzi BlockFi’s chief restructuring officer said in a <a href=\"https:\/\/www.businesswire.com\/news\/home\/20230802310688\/en\/BlockFi%E2%80%99s-Disclosure-Statement-Conditionally-Approved-by-Court\" data-v-f87c67ca=\"\">statement<\/a>.","On approval of the plan, the lender said it would focus on recovering creditor funds from other bankrupt firms, including Alameda Research, <a href=\"https:\/\/www.theblock.co\/post\/242575\/ftxs-creditors-say-they-werent-looped-in-on-plan-to-recoup-funds\" data-v-f87c67ca=\"\">FTX<\/a>, and Three Arrows Capital. However, administrators and liquidators for these firms are <a href=\"https:\/\/www.theblock.co\/post\/236847\/blockfi-liquidation\" data-v-f87c67ca=\"\">opposed<\/a> to BlockFi's bankruptcy plan, arguing it downgrades their claims.","BlockFi revealed that it would waive all rights and causes of action it may have against its clients. This waiver applies only if those clients accept the voluntary third-party release offered by the bankruptcy plan. This recovery method applies to most creditors, except those who withdrew $250,000 or more from BlockFi Interest Accounts (BIA) or BlockFi Private Client (BPC) accounts on or after November 2, 2022.","Customers who moved less than $250,000 from their BIA or BPC to their BlockFi Wallet or withdrew less than $250,000 from their wallet before the platform pause on November 10, 2022, will not have to return any of those funds. Creditors claiming under $3,000, or those reducing their claim to this amount, will receive 50% of their claims in cash from BlockFi's estate.","BlockFi did not immediately respond to a request for comment.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"$3,000","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"November 2, 2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"New Jersey","content":"LOCATION"},{"type":"Mark Renzi","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November 10, 2022","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"September 11","content":"DATE"},{"type":"BPC","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"November 2022","content":"DATE"},{"type":"BIA","content":"ORGANIZATION"}],"hashtag":["THREE ARROWS CAPITAL"],"authors":["Brian McGleenon","The Block"]}