{"summary":"With the value of equipment plummeting, bitcoin prices low and energy costs high, miners are struggling to stay afloat.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/202081\/bitfarms-seeks-to-avoid-blockfi-loan-default-with-renegotiation","publishDate":"2023-01-13T09:36:13","id":9243,"type":null,"title":"Bitfarms seeks to avoid BlockFi loan default with renegotiation","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitfarms is seeking to modify a loan with BlockFi to avoid default as the value of equipment plummets.","Last year, Bitfarms’ Backbone Mining Solutions entered into a $32 million equipment financing facility with BlockFi Lending LLC. BMS owns and operates the assets of Bitfarms’ 20-megawatt active crypto mining facility in Washington state. The loan is secured by certain assets of BMS, which has a&nbsp; market value of about $5 million, while the outstanding principal and interest is approximately $20 million.&nbsp;","\"During 2022, Bitfarms began taking proactive actions to increase financial flexibility and to reduce indebtedness and capital expenditure obligations,\" Bitfarms CFO Jeff Lucas said in a <a href=\"https:\/\/www.globenewswire.com\/news-release\/2023\/01\/13\/2588504\/0\/en\/Bitfarms-Seeks-Modification-of-Equipment-Loan-Facility-to-Align-with-Market-Conditions.html\" data-v-f87c67ca=\"\">statement<\/a>. \"Considering today’s challenging market conditions, we are seeking to modify our Washington state debt facility to achieve terms that are better aligned with the market outlook and our business strategy.\"","The value of mining equipment has dropped after miners went on a spending spree when bitcoin was hitting all-time highs in 2021. But as cryptocurrency prices sank and energy costs rose, mining has become a far less lucrative venture, and miners across the board are struggling to survive.","As of December, Bitfarms and its subsidiaries had cash and unencumbered crypto assets with a value of approximately $36 million, which the company believes provides sufficient liquidity to support ongoing operations for the foreseeable future and to make future payments under its various other loan agreements.","Bitfarms and its subsidiaries have approximately $47 million of outstanding indebtedness, including approximately $20 million in debt under the BlockFi loan.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BMS","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"December","content":"DATE"},{"type":"$36 million","content":"MONEY"},{"type":"BlockFi Lending LLC","content":"ORGANIZATION"},{"type":"Bitfarms’ Backbone Mining Solutions","content":"ORGANIZATION"},{"type":"$20 million","content":"MONEY"},{"type":"$32 million","content":"MONEY"},{"type":"Jeff Lucas","content":"PERSON"},{"type":"$47 million","content":"MONEY"},{"type":"$5 million","content":"MONEY"}],"hashtag":["MINING COMPANIES"],"authors":["Christiana Loureiro","The Block"]}