{"summary":"While not a substantial price jump, the spike shows some amount of interest in the coin following the star&#x27;s SEC charge. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174849\/price-of-crypto-token-promoted-by-kim-kardashian-spiked-126-after-sec-charge-unveiled","publishDate":"2022-10-04T17:26:29","id":9244,"type":null,"title":"Kim Kardashian’s promoted token EMAX spikes 126% following charge","category":["CRYPTOCURRENCY"],"content":["The Securities and Exchange Commission's move to unveil a charge against reality TV star Kim Kardashian over her endorsement of a little-known cryptocurrency sparked headlines worldwide.","The announcement also triggered a significant but short-lived jump in the price of that cryptocurrency, called EthereumMax, according to market data.&nbsp;","<span data-v-f87c67ca=\"\">The EMAX token rose from $0.000000004232 to $0.000000009605 on Oct. 3, 2022 — a 126% increase, according to the crypto price tracker CoinGecko. The token has since fallen to $0.000000005544, still 31% above what it was before the SEC’s charge.&nbsp;<\/span>","","","As The Block reported this week, Kardashian was accused of unlawfully touting a crypto security. \"This case is a reminder that, when celebrities or influencers endorse investment opportunities, including crypto asset securities, it doesn’t mean those investment products are right for all investors,\" Gary Gensler, chairman of the SEC, said in a statement.&nbsp;","<span data-v-f87c67ca=\"\">Under U.S. rules, celebrities or other figures must disclose payments or compensation received for an endorsement. <\/span><span data-v-f87c67ca=\"\">Kardashian agreed to pay $1.26 million — or 0.07% of her $1.8 billion net worth for the charge, and may she not endorse crypto asset securities for three years.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Oct. 3, 2022","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"31%","content":"PERCENT"},{"type":"126%","content":"PERCENT"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$0.000000009605","content":"MONEY"},{"type":"$0.000000005544","content":"MONEY"},{"type":"Gary Gensler","content":"PERSON"},{"type":"$1.8 billion","content":"MONEY"},{"type":"$0.000000004232","content":"MONEY"},{"type":"0.07%","content":"PERCENT"},{"type":"Kim Kardashian","content":"PERSON"},{"type":"Kardashian","content":"PERSON"},{"type":"$1.26 million","content":"MONEY"}],"hashtag":["SEC"],"authors":["MK Manoylov","The Block"]}