{"summary":"Crypto and lobbying groups are drumming up their support for Coinbase in its call for the SEC to write rules for the crypto industry. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283472\/crypto-and-lobbying-groups-file-briefs-supporting-coinbases-push-for-sec-to-write-rules","publishDate":"2024-03-19T11:55:02","id":9245,"type":null,"title":"Crypto and lobbying groups file briefs supporting Coinbase&#x27;s push for SEC to write rules","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Crypto Council for Innovation, crypto investment firm Paradigm, the U.S. Chamber of Commerce and others are expressing their support for Coinbase in its call for the Securities and Exchange Commission to write rules for the crypto industry.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">In amicus briefs filed on Monday in the <\/span><span class=\"s2\" data-v-f87c67ca=\"\">Court of Appeals for the Third Circuit, groups said the SEC has been unclear in how it regulates crypto, that current securities laws don't fit and warned that more firms could move their business elsewhere because of the U.S. regulatory environment.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">For years, Coinbase and the SEC have argued over the need for rulemaking specific to crypto. <\/span><span class=\"s2\" data-v-f87c67ca=\"\">Coinbase first asked the SEC to issue a formal rulemaking process in July 2022 and later sued the SEC in April 2023 —&nbsp;ultimately trying to force the agency to say yes or no to its rulemaking petition. The SEC later <a href=\"https:\/\/www.theblock.co\/post\/267840\/sec-denies-coinbase-petition-for-new-crypto-rulemaking-gensler-says\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">denied<\/span><\/a> the request for new rules, and Chair Gary Gensler said that existing rules already apply to crypto. Last week, Coinbase hit back and <a href=\"https:\/\/www.theblock.co\/post\/281815\/coinbase-asks-appeals-court-to-direct-sec-to-begin-writing-rules-for-crypto\" data-v-f87c67ca=\"\"><span class=\"s6\" data-v-f87c67ca=\"\">asked<\/span><\/a> the appeals court to direct the SEC to begin writing rules for crypto.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">This comes as the SEC has charged a slew of major crypto firms, including Coinbase, for operating as an unregistered exchange, which is ongoing.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The Crypto Council for Innovation said in its <a href=\"https:\/\/media.cryptoforinnovation.org\/2024\/03\/CCI-Amicus-Brief-Coinbase-v.-SEC.pdf\" data-v-f87c67ca=\"\"><span class=\"s6\" data-v-f87c67ca=\"\">amicus brief<\/span><\/a> filed on Monday that the SEC is trying to \"enshrine an arbitrary and baseless enforcement policy\" without input from stakeholders.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"Deprived of traditional rulemaking, good actors are forced to decipher the SEC’s evolving views based on public statements by officials, litigation filings, and (sometimes contradictory) judicial rulings in enforcement actions,\" CCI said in its amicus brief. \"Industry participants seeking regulatory clarity are fleeing abroad to jurisdictions that offer the regulatory guidance the SEC refuses to provide.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The U.S. Chamber of Commerce, the world's largest business lobbying group representing three million businesses, said some of its members are firms subject to securities laws that they say could be \"adversely affected\" by the SEC's pushback to write rules for the crypto industry.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"The Commission’s refusal to set clear rules of the road causes substantial economic harm to investors and the digital-asset economy at large, and it flouts bedrock tenets of due process and administrative law,\" the Chamber said in its <a href=\"https:\/\/assets.ctfassets.net\/c5bd0wqjc7v0\/Rktyn8xqhDW3vPhKYJ23C\/569d18b59bd226115563dc0ca9080385\/2024.03.18_-24-_Chamber_Amicus_Brief.pdf\" data-v-f87c67ca=\"\"><span class=\"s6\" data-v-f87c67ca=\"\">amicus brief<\/span><\/a>.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Regulatory uncertainty around whether ether and stablecoins are securities or commodities, combined with a lack of rulemaking guidance, leaves stakeholders relying on the SEC's speeches and other statements, the Chamber said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"The SEC’s failure to provide clarity for this important new industry offers a case study in the dangers of refusing to adapt regulation to new circumstances,\" the Chamber said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Crypto operates much differently than securities, Paradigm argued in its amicus brief. The SEC's focus on an issuer that would make business decisions and make certain disclosures doesn't line up with crypto, Paradigm said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"This framework simply doesn’t work for crypto. Crypto assets do not depend on a centralized issuer,\" according to the firm's <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.ca3.121484\/gov.uscourts.ca3.121484.20.0.pdf\" data-v-f87c67ca=\"\">amicus brief<\/a>. \"Instead, they are part of decentralized networks and communities that are not controlled by a single entity.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The SEC requires securities issuers to describe past business experiences of their leadership team, but it doesn't work for crypto, Paradigm said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Oftentimes third-party contributors to a crypto project do more to enhance utility than the creators,\" Paradigm said. \"In that sense, the SEC-mandated disclosures are not just useless—they’re misleading, wrongly signaling outsized importance for individuals who might not matter.\"&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Chamber of Commerce","content":"ORGANIZATION"},{"type":"CCI","content":"ORGANIZATION"},{"type":"April 2023","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Crypto Council for Innovation","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Chamber","content":"ORGANIZATION"},{"type":"Third Circuit","content":"ORGANIZATION"},{"type":"\" Paradigm","content":"ORGANIZATION"},{"type":"July 2022","content":"DATE"},{"type":"Court of Appeals","content":"ORGANIZATION"}],"hashtag":["COINBASE","SEC"],"authors":["Sarah Wynn","The Block"]}