{"summary":"Joseph Bankman and Barbara Fried allegedly &quot;exploited their access and influence&quot; within FTX, a court filing showed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251658\/ftx-sues-sbf-parents","publishDate":"2023-09-19T03:50:30","id":9246,"type":null,"title":"FTX sues Sam Bankman-Fried’s parents to recover millions of dollars","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">Bankrupt cryptocurrency exchange FTX has sued Joseph Bankman and Barbara Fried, the parents of its founder Sam Bankman-Fried, aiming to recover millions of dollars in “fraudulently transferred and misappropriated funds.”<\/span>","<span data-v-f87c67ca=\"\">A Monday <\/span><a href=\"https:\/\/restructuring.ra.kroll.com\/FTX\/Home-DownloadPDF?id1=MjUyNzIzOA==&amp;id2=-1\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">court filing<\/span><\/a><span data-v-f87c67ca=\"\"> showed that debtors of FTX and Alameda Research filed a complaint to recover damages caused by fraudulent transfers, breaches of fiduciary duties and other alleged misconduct. <\/span><span data-v-f87c67ca=\"\">“As Bankman-Fried’s parents, Bankman and Fried exploited their access and influence within the FTX enterprise to enrich themselves, directly and indirectly, by millions of dollars, and knowingly at the expense of the debtors in these Chapter 11 Cases and their creditors,” the filing said.<\/span>","<span data-v-f87c67ca=\"\">The filing pointed out that despite presenting itself to the public as a sophisticated group of crypto exchanges and businesses, the FTX Group was a self-described “family business,\" adding: <\/span><span data-v-f87c67ca=\"\">“And together, Bankman and Fried siphoned millions of dollars out of the FTX Group for their own personal benefit and their chosen pet causes.\"<\/span>","<span data-v-f87c67ca=\"\">Bankman and Fried did not immediately respond to The Block’s requests for comment.<\/span>","<span data-v-f87c67ca=\"\">The filing detailed that, as early as 2018, Bankman described Alameda as a “family business” — a phrase he repeatedly used to refer to the FTX Group. “Even as the FTX Group descended into insolvency, Bankman and Fried profited handsomely from this ‘family business,’” the filing continued.<\/span>","<span data-v-f87c67ca=\"\">In February 2022, Bankman and Fried, both Stanford Law School professors, purchased a $16.4 million 30,000 square-foot luxury property in The Bahamas, referred to as “Blue Water” or “Old Fort Bay,” according to the filing. <\/span><span data-v-f87c67ca=\"\">“The total cash payment for Blue Water amounted to $18,914,327.82, inclusive of all costs, taxes, and fees,” the filing said. “Neither Bankman nor Fried contributed any money of their own towards the purchase of Blue Water; rather, all of the funds were sourced from cash provided by the Debtors.”<\/span>","<span data-v-f87c67ca=\"\">Bankman had also “proudly touted” that he was an early investor in Alameda — the trading arm of the FTX Group that its insiders used to misappropriate billions of dollars in customer and investor funds, according to the filing.<\/span>","<span data-v-f87c67ca=\"\">The filing showed that Bankman was rewarded for “helping perpetuate the FTX Insiders’ fraud.” He received millions of dollars in unearned “gifts” and real property, flew on privately chartered jets, expensed $1,200 per night hotel stays to the FTX Group and appeared in a Super Bowl commercial with Seinfeld writer Larry David months before the FTX Group imploded, the filing added.<\/span>","<span data-v-f87c67ca=\"\">Additionally, Bankman and Fried allegedly pushed for tens of millions of dollars in political and charitable contributions, including to Stanford University, “which were seemingly designed to boost Bankman’s and Fried’s professional and social status at the expense of the FTX Group,” the filing said.<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"misappropriate billions of dollars","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Larry David","content":"PERSON"},{"type":"Barbara Fried","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Fort Bay","content":"LOCATION"},{"type":"$1,200","content":"MONEY"},{"type":"Stanford University","content":"ORGANIZATION"},{"type":"Stanford Law School","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"The Bahamas","content":"LOCATION"},{"type":"tens of millions of dollars","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"February 2022","content":"DATE"},{"type":"$18,914,327.82","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"$16.4 million","content":"MONEY"},{"type":"FTX Group","content":"ORGANIZATION"},{"type":"Joseph Bankman","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":["BANKRUPTCY FILINGS","FTX","SAM BANKMAN-FRIED"],"authors":["Timmy Shen","The Block"]}