{"summary":"Perp DEX SynFutures has launched its V3 on the Ethereum Layer 2 Blast mainnet, which went live earlier today.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280013\/synfutures-v3-blast-mainnet-points-program-token","publishDate":"2024-02-29T16:57:26","id":9251,"type":null,"title":"SynFutures launches V3 on Blast mainnet and unveils points program; plans token launch this year","category":["COMPANIES"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">SynFutures, a decentralized derivatives exchange focused on trading crypto perpetual futures, has launched its latest version, V3, on the <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.68%\n    <\/span><\/a> <!----><\/span><\/span> Layer 2 Blast mainnet, which went live earlier today.<\/span><\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The perp DEX has today also launched its points rewards program called Oyster Odyssey. SynFutures said its V3 users will also qualify for the upcoming Blast airdrop.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"Interacting with SynFutures can qualify users for Oyster Odyssey points as well as Blast points,\" Rachel Lin, co-founder and CEO of SynFutures, told The Block. \"We're also committed to giving 100% of our Blast developer airdrop back to users, so they'll enjoy plenty of benefits.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">A source with direct knowledge of the matter said SynFutures is also planning to launch its own token this year. Last October, when the DEX raised $22 million in a Series B funding round, it <a href=\"https:\/\/www.theblock.co\/post\/258378\/synfutures-dex-funding-token-plan\" data-v-f87c67ca=\"\">said<\/a> it was open to launching its token as part of its roadmap to decentralize the project.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">SynFutures V3's launch on the Blast mainnet came right after the Layer 2 network's release. Blast, backed by high-profile investors including Paradigm, quickly gained popularity following its reveal, <a href=\"https:\/\/www.theblock.co\/post\/279293\/blast-tvl-mainnet\" data-v-f87c67ca=\"\">garnering<\/a> over $2.3 billion worth of total value locked, or TVL, before its mainnet even launched.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">SynFutures first launched V3 on the Ethereum testnet in October. It had then planned to release the main protocol on several blockchains, including Polygon and zkSync Era, another competing Ethereum Layer 2 network, before committing to Blast, launching V3 on Blast's testnet in January. Lin now said the multichain expansion is still in the plans for V3, but the project hasn't decided which chains it will deploy on next. \"Our immediate focus is on driving adoption and volume on Blast,\" she said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">SynFutures V2 is still live on the Polygon proof-of-stake chain, but the project has started phasing out support as it prioritizes the V3 rollout, Lin said, adding that V1, on the other hand, has been phased out. V1 and V2 processed over $23 billion in cumulative trading volume to date, Lin said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">With its V3 launch, SynFutures plans to grow its platform with localized expansion, Lin said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Currently, over 20 people are working for the Singapore-based firm. Lin plans to hire \"regional leads in business development and marketing in key markets\" and a few more people across research and product functions. It also looks to multichain expansion in the medium term, she added.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">SynFutures has raised about $38 million in total funding and is backed by investors including Pantera Capital, HashKey Capital, and SIG DT Investments (a unit of the Susquehanna International Group).<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lin","content":"PERSON"},{"type":"$2.3 billion","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"SynFutures","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$23 billion","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"SIG DT Investments","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"$22 million","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$38 million","content":"MONEY"},{"type":"Susquehanna International Group)","content":"ORGANIZATION"},{"type":"Oyster Odyssey","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"-0.68%","content":"PERCENT"},{"type":"October","content":"DATE"},{"type":"Rachel Lin","content":"PERSON"}],"hashtag":["CRYPTO","DECENTRALIZED INFRASTRUCTURE","DERIVATIVES","DEXS","ETHEREUM","POLYGON"],"authors":["Yogita Khatri","The Block"]}