{"summary":"The Federal Bureau of Investigation today warned crypto operators that entities tied to North Korea are poised to sell more than $40 million worth of bitcoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246942\/fbi-warns-north-korean-hackers-poised-to-cash-out-more-than-40-million-in-bitcoin","publishDate":"2023-08-23T06:37:24","id":9254,"type":null,"title":"FBI warns North Korean hackers poised to cash out more than $40 million in bitcoin","category":["CRYPTO ECOSYSTEMS"],"content":["The U.S. Federal Bureau of Investigation warned crypto operators that entities connected to North Korean hackers may attempt to sell more than $40 million worth of bitcoin.","The intelligence and security service <a href=\"https:\/\/www.fbi.gov\/news\/press-releases\/fbi-identifies-cryptocurrency-funds-stolen-by-dprk\" data-v-f87c67ca=\"\">issued<\/a> a statement today that it had tracked crypto stolen by entities (Lazarus Group and APT38) tied to the Democratic People’s Republic of Korea (DPRK), using tactics called “TraderTraitor.”","“The FBI believes the DPRK may attempt to cash out the bitcoin worth more than $40 million dollars,” the agency said, and added a list of Bitcoin addresses where the funds are currently held, having recently been moved.","“Private sector entities should examine the blockchain data associated with these addresses and be vigilant in guarding against transactions directly with, or derived from, the addresses,” the agency added.","The Lazarus Group in North Korea has consistently targeted the blockchain sector, utilizing spearphishing methods and malicious software to steal cryptocurrency. These attacks often begin with a multitude of spearphishing emails directed at IT employees, aiming to lure the recipients into downloading applications tainted with malware.","The U.S. government refers to these malicious applications as <a href=\"https:\/\/www.cisa.gov\/news-events\/cybersecurity-advisories\/aa22-108a\" data-v-f87c67ca=\"\">TraderTraitor<\/a>.","DPRK's TraderTraitor-affiliated actors tracked by the FBI are responsible for a number of high profile heists, including hits on Alphapo, CoinsPaid and Atomic Wallet.","Last year, the same group had carried out attacks on Harmony’s Horizon Bridge and Sky Mavis’s Ronin Bridge, the latter resulting <a href=\"https:\/\/www.theblock.co\/post\/156038\/how-a-fake-job-offer-took-down-the-worlds-most-popular-crypto-game\" data-v-f87c67ca=\"\">in the loss of some $540 million<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Federal Bureau of Investigation","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"DPRK","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"North Korea","content":"LOCATION"},{"type":"$40 million dollars","content":"MONEY"},{"type":"Mavis’s Ronin Bridge","content":"PERSON"},{"type":"Democratic People’s Republic of Korea (DPRK","content":"ORGANIZATION"},{"type":"FBI","content":"ORGANIZATION"},{"type":"$540 million","content":"MONEY"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}