{"summary":"Hong Kong, which turned crypto-friendly last year, may follow suit if the U.S. approves a spot bitcoin ETF, industry leaders say.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268582\/industry-leaders-see-hong-kong-as-next-bitcoin-etf-hub-amid-us-approval-anticipation","publishDate":"2023-12-25T01:01:22","id":9258,"type":null,"title":"Industry leaders see Hong Kong as next bitcoin ETF hub amid US approval anticipation","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">Hong Kong, a financial powerhouse that turned crypto-friendly last year, could be one of the earliest front-runners in Asia to allow spot bitcoin exchange-traded funds (ETFs) <\/span><a href=\"https:\/\/www.theblock.co\/post\/267720\/gensler-says-secs-new-look-at-spot-bitcoin-etf-applications-has-involved-recent-court-rulings\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">if the U.S. approves such ETFs<\/span><\/a>, industry leaders reckon.","<span data-v-f87c67ca=\"\">Yat Siu, chairman of web3 investor Animoca Brands, told The Block that the encouraging stance of Hong Kong’s Securities and Futures Commission toward digital assets sets a decent stage for potential spot bitcoin ETFs.<\/span>","<span data-v-f87c67ca=\"\">\"If you look at what the SFC had said about I think a month ago, it says that it was open to widen access to digital assets,” Siu said. “And frankly, Bitcoin spot ETF is, I would say, relatively uncontroversial at the end of the day.”<\/span>","The U.S. is <a href=\"https:\/\/www.theblock.co\/post\/268274\/blackrocks-proposed-spot-bitcoin-etf-gets-a-ticker-in-latest-filing-with-sec\" data-v-f87c67ca=\"\">continuing to get closer<\/a> to approving its first spot bitcoin ETF, with multiple filings adapting to the SEC's demands related to <span data-v-03de5780=\"\" data-v-f87c67ca=\"\">creation and redemption mechanism<\/span>s.","<span data-v-f87c67ca=\"\">“I would imagine that [Hong Kong] would follow, especially because the U.S. has already done a lot of the work,” Siu added, noting that there are loads of public filings and applications the Hong Kong authorities can take reference from.<\/span>","<span data-v-f87c67ca=\"\">Unlike its neighboring Chinese mainland’s broader crackdown on cryptocurrency trading and mining, Hong Kong has rolled out the welcome mat for crypto firms this year — even going so far <\/span><a href=\"https:\/\/www.theblock.co\/post\/228743\/hong-kong-crypto-bank-accounts\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">as encouraging banks to work with them<\/span><\/a><span data-v-f87c67ca=\"\">. <\/span>","<span data-v-f87c67ca=\"\">In October 2022, Hong Kong authorities released a series of <\/span><a href=\"https:\/\/www.info.gov.hk\/gia\/general\/202210\/31\/P2022103000454.htm?fontSize=1\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">policy statements<\/span><\/a><span data-v-f87c67ca=\"\"> about cryptocurrencies to strengthen its position as a global financial center. <\/span><span data-v-f87c67ca=\"\">In June, Hong Kong officially started its crypto licensing regime for virtual asset trading platforms, allowing licensed exchanges to offer retail trading services.<\/span>","<span data-v-f87c67ca=\"\">Julia Leung, chief executive officer of Hong Kong’s SFC, said in November that the regulator was <\/span><a href=\"https:\/\/www.theblock.co\/post\/261600\/hong-kong-considers-allowing-retail-access-to-spot-crypto-etfs-report\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">assessing spot crypto ETFs<\/span><\/a><span data-v-f87c67ca=\"\"> as it welcomes “proposals using innovative technology that boosts efficiency and customer experience.” Hong Kong has currently listed several futures-based crypto ETFs: Samsung Bitcoin Futures Active ETF, CSOP Bitcoin Futures ETF and CSOP Ether Futures ETF.<\/span>","<span data-v-f87c67ca=\"\">Glenn Woo, Head of Sales of APAC at web3 infrastructure firm Blockdaemon, echoed the positive sentiment in an interview with The Block this month. While there are still some concerns from traditional asset managers, “the spirit is definitely there,” he said.<\/span>","<span data-v-f87c67ca=\"\">“There is appetite there,” said Woo, who has over a decade of experience in the traditional financial industry in Hong Kong. “I’m not sure whether it's going to launch next year or the year after, but the appetite will grow after the U.S. approves their ETF first.”<\/span>","<span data-v-f87c67ca=\"\">While the demand for a spot bitcoin ETF could be strong in Hong Kong, Woo noted hesitations from potential ETF issuers and emphasized the need for collaboration between traditional financial institutions and crypto-native entities.<\/span>","<span data-v-f87c67ca=\"\">“It's going to be a collaborative effort,” Woo said, adding that there needs to be more partnerships between traditional custodians and crypto-native custody and wallet service providers to ensure the success of spot bitcoin ETFs in Hong Kong.<\/span>","<span data-v-f87c67ca=\"\">Liquidity is another concern, Woo noted. “How do they define which marketplaces these asset managers can go to to procure for that liquidity? Are they only going to allow the virtual asset service providers in Hong Kong to provide liquidity? Maybe it's not enough. Are they going to open up some U.S. venues or some other venues to pull the liquidity to support a spot ETF launch?” he asked.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">As discussions surrounding an Asian spot bitcoin ETF continue, crypto exchange WOO predicts a shift in the industry's center of gravity from the West to the East for next year.<\/span>","<span data-v-f87c67ca=\"\">“The last cycle had significant participation driven from the West, whether it was Saylor stuffing BTC into Microstrategy’s balance sheet or PayPal slinging shitcoins to millions of retail,” Jack Tan, co-founder of WOO, said. “However, we believe the next cycle will be driven from the East, with a resurgence of retail participation led by major geographies like [South] Korea, Hong Kong and Japan.”<\/span>","<span data-v-f87c67ca=\"\">Chengyi Ong, head of policy for APAC of blockchain research firm Chainalysis, labeled 2023 as the year of regulation in the region and anticipates practical implementation in 2024. “In the year ahead, we’re going to expect to see these regulatory frameworks that were introduced in 2023, take form,” Ong said, in a statement shared with The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“This is not just in lighthouse jurisdictions like Singapore and Hong Kong, but also more broadly in the region,” Ong added. “For instance, in Australia, there's an ongoing consultation paper on the regulation of digital asset platforms. In Korea, there's the virtual asset user protection act that's been passed. In 2024, we will start to see these frameworks actually be implemented, and it will take a bit of time.”<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"APAC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Samsung Bitcoin Futures Active ETF","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"October 2022","content":"DATE"},{"type":"Blockdaemon","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"East","content":"LOCATION"},{"type":"Australia","content":"LOCATION"},{"type":"Siu","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Glenn Woo","content":"PERSON"},{"type":"Julia Leung","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"SFC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"2024","content":"DATE"},{"type":"Yat Siu","content":"PERSON"},{"type":"Japan","content":"LOCATION"},{"type":"Futures Commission","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Microstrategy","content":"ORGANIZATION"},{"type":"Saylor","content":"PERSON"},{"type":"Chengyi Ong","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Jack Tan","content":"PERSON"}],"hashtag":["CRYPTO","INVESTMENT FIRMS","TRADFI BANKS"],"authors":["Timmy Shen","The Block"]}