{"summary":"Not far from Wayne Newton&#x27;s former ranch, nestled in a neighborhood that looks like a construction site gone to seed, is a massive house on Tomiyasu Lane.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/6671\/into-the-dark-heart-of-crypto-weirdness-in-las-vegas","publishDate":"2019-01-07T17:54:37","id":9261,"type":null,"title":"Into the dark heart of crypto weirdness in Las Vegas","category":["BITCOIN"],"content":["Not far from Wayne Newton's former ranch, nestled in a neighborhood that looks like a construction site gone to seed, is a massive house on&nbsp;Tomiyasu Lane. This was Mike Tyson's former mansion, the flaccid fever dream of a structure where they filmed The Hangover, and last night it was the home to a half dozen crypto startups.","It was weird.","<iframe src=\"https:\/\/www.youtube.com\/embed\/4TbnXqhHJkk\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-v-f87c67ca=\"\"><\/iframe>","The problem with cryptocurrency events is that nobody thinks enough is enough. Instead of a simple cruise you have an <a href=\"https:\/\/breakermag.com\/trapped-at-sea-with-cryptos-nouveau-riche\/\" data-v-f87c67ca=\"\">escort-studded pleasure helltrip<\/a>. Instead of a staid conference featuring boring, besuited men talking numbers you get <a href=\"https:\/\/www.businesstimes.com.sg\/investing-wealth\/crypto-wealth-sinks-us52b-in-week-of-lambos-yachts\" data-v-f87c67ca=\"\">lambos and aircraft carriers<\/a>. Instead of explaining things clearly in a quiet room you get Pink Floyd's saxophonist, \"Mixed Reality DJ &amp; Dancing,\" and \"Vibrational Sound Therapy.\"","The event that I visited was <a href=\"https:\/\/coinagenda.com\" data-v-f87c67ca=\"\">CoinAgenda's Media Showcase, <\/a>an event put on by crypto investor and PR person Michael Terpin, a former tech PR flack who turned himself into an all-singing, all-dancing blockchain house seemingly overnight. Interestingly, Terpin's personal mission is to <a href=\"http:\/\/www.stopsimcrime.org\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">prevent SIM swap attacks<\/a> because he was the guy who lost <a href=\"https:\/\/coinjournal.net\/a-complete-explanation-of-the-michael-terpin-att-lawsuit\/\" data-v-f87c67ca=\"\">$24 million<\/a> in alt coins after a hacker cleaned out his wallets which is, arguably, pretty awful. We can't fault him for that. However, we can fault him for the catering.","The event featured 15 startups ranging from the key-keeping dongle <a href=\"https:\/\/keyband.io\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/keyband.io\/&amp;source=gmail&amp;ust=1546982465144000&amp;usg=AFQjCNFOp4niLGFx7YK0rtMkaIIkCptDWw\" data-v-f87c67ca=\"\">Keyband.io<\/a>&nbsp;to&nbsp;<a href=\"https:\/\/aspirecrypto.com\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/aspirecrypto.com\/&amp;source=gmail&amp;ust=1546982465144000&amp;usg=AFQjCNEpelFm2ahSgDH5ugtlVlgb9C2NvA\" data-v-f87c67ca=\"\">Aspire,<\/a> the \"digital asset creation blockchain platform.\" Interestingly, many of these companies were looking for funding, a problem they attributed to the long crypto winter and the unpopularity\/illegality of the current ICO framework. If this event - a dark, weird affair held inside Tyson's horseshoe shaped Wonder Emporium - had been held just a year ago I can only imagine what strange delights would have awaited us. This year it wasn't caviar and hot air balloon rides but instead we got some rough chardonnay, cold noodles, and only one Lambo parked outside.","I walked in at around 9:30 and in a small corner near the entrance and entire band - sax, drums, guitars, the works - began to play a tight set of Floyd classics and Dad Rock. Scott Page, Pink Floyd's own saxophonist, roared on the old rooty-toot while Kid Rock's guitarist, Kenny Olson, gave us some twang. They played a very rousing rendition of \"Money\" while awkward men and their short, high-heeled dates toddled around the small gathered crowd and out to the pool. I didn't catch the rest of the set.","","","I have found that both&nbsp;<a href=\"https:\/\/hackernoon.com\/your-ico-pr-is-awful-7ea5ca1c9a6d\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">crypto PR and events are very bad<\/a>. Telling an exciting story about an esoteric topic requires either a great depth of understanding or a great deal of money. Crypto PR people have much of the latter to spend but little of the former. Why? Because cryptocurrencies are hard enough to understand for PhDs and dedicated subreddit users without bringing the breezy, fun-filled voices of media relations professionals. Imagine explaining Merkel Trees to the journos at Us Weekly and you'll see the disconnect.","But something was in the air last night that was particularly interesting. It's all well and good to make fun of a wonky event in the middle of a place where a tiger once shat but what can we learn from it?","First, crypto still isn't being taken seriously by the mainstream tech enthusiast. This is quickly changing but not fast enough to, say, bring 200,000 people to the desert to see the technology, relegating it to the deep outskirts. Next, this also a time of crypto maturity during which much of the gloss and glam will fall away. It hasn't quite yet - there was one guy at the event carrying a cane and wearing purple LED glasses - but there weren't many more hipsters in attendance and the DJ played to an empty pool while a foul, cold wind came up over the waters.","This party, then, was in a turning point for crypto. On one hand it was held inside of Mike Tyson's old mansion. On the other hand it was peopled by very intense, very serious crypto founders who, in a post-crash daze, seemed to have simply wandered in, found a table, and hoped for the best.","This event has a precedent. Not long ago - in about 2008 - these parties were a mainstay of the consumer electronics world. In a time before Kickstarter and hardware startups, for example, if you wanted to get your message out on the cheap you'd rent a fancy house and throw a weird party. I remember one party for a VOIP service that reminded me of cocaine robbery scene in Boogie Nights complete with glassy-eyed founder and fireworks. That this sort of hot, buzzing energy is coming to crypto is not an absolute good, to be clear, but it's interesting to see that the events are swiftly arcing from top hats, weird vests, and scantily clad Burning Man refugees into something a little more palatable.&nbsp;","I left a few minutes after I arrived. I spoke to some people, I looked at the catered pasta, and I glanced up into the Las Vegas sky as planes winged their way down to the tarmac in a long jewel of lights that extended far into the dark. Was I standing where Mike Tyson once stood as he heard about his handler's plans to <a href=\"https:\/\/www.theverge.com\/2016\/1\/4\/10708144\/mike-tyson-bitcoin-wallet-atm\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">build him a bitcoin wallet<\/a>? Did his heart race like mine did at the thought of future blockchains reeling out of this back yard like so many planes coming in for a landing? Or did he shrug, listen to some Phil Collins, and hope everything would turn out just fine.","Who knows? And did it?","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last night","content":"TIME"},{"type":"Mike Tyson","content":"PERSON"},{"type":"Wayne Newton","content":"PERSON"},{"type":"Las Vegas","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Tyson","content":"LOCATION"},{"type":"Merkel Trees","content":"ORGANIZATION"},{"type":"2008","content":"DATE"},{"type":"9:30","content":"TIME"},{"type":"Kickstarter","content":"PERSON"},{"type":"winter","content":"DATE"},{"type":"Phil Collins","content":"PERSON"},{"type":"Tomiyasu Lane","content":"PERSON"},{"type":"Terpin","content":"PERSON"},{"type":"Kenny Olson","content":"PERSON"},{"type":"Pink Floyd","content":"ORGANIZATION"},{"type":"Michael Terpin","content":"PERSON"},{"type":"$24 million","content":"MONEY"},{"type":"\"Mixed Reality DJ &amp; Dancing","content":"ORGANIZATION"}],"hashtag":[],"authors":["John Biggs","The Block"]}