{"summary":"VerifyVASP has raised $5 million at a $100 million valuation. FTX Ventures led the funding, with Peak Capital and Bcharu participating.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168559\/crypto-regtech-firm-verifyvasp-raises-funds-at-100-million-valuation","publishDate":"2022-09-08T06:12:49","id":9263,"type":null,"title":"Crypto regtech firm VerifyVASP raises funds at $100 million valuation","category":["VENTURE CAPITAL"],"content":["VerifyVASP, a Singapore-based regulatory technology (regtech) firm that provides compliance tools, <a href=\"https:\/\/medium.com\/@VerifyVASP_Team\/25d6eff8d116\" data-v-f87c67ca=\"\">announced<\/a> Thursday it has raised $5 million in Series A funding at a $100 million valuation.","FTX Ventures led the funding, VerifyVASP said, adding that Peak Capital and Bcharu participated.","Founded in 2019, VerifyVASP helps virtual asset service providers (VASPs) to comply with anti-money laundering Travel Rule requirements. Last year, the Financial Action Task Force (FATF) recommended that participating nations implement a <a href=\"https:\/\/www.theblock.co\/post\/28521\/fatf-retains-travel-rule-in-new-guidance-compelling-exchanges-to-share-customer-data\" data-v-f87c67ca=\"\">Travel Rule<\/a> for VASPs — essentially entities that facilitate transactions — in its finalized guidance. The Travel Rule seeks to curb money laundering and terrorist financing by requiring VASPs to gather and transmit names, account numbers and location information for both the sender and the recipient in a transaction.&nbsp;","VerifyVASP says it provides a members-only closed network that facilitates secured data transfers between members for Travel Rule compliance. Its members include Bybit, Deribit, Crypto.com, FTX, FTX.US and Huobi, according to its website. VerifyVASP claims to have processed more than 1.5 million Travel Rule compliant digital asset transfers amounting to $40 billion in value.&nbsp;","With fresh capital in hand, VerifyVASP says it plans to onboard more members, including small- and medium-sized digital asset businesses. To that end, it's looking to introduce a Travel Rule dashboard and a consultation service.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"FATF","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"the Financial Action Task Force","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Bybit","content":"LOCATION"},{"type":"Deribit","content":"LOCATION"},{"type":"Huobi","content":"PERSON"},{"type":"$5 million","content":"MONEY"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}