{"summary":"Nebulous, the company behind the Sia decentralized cloud storage network, has released a new platform called Skynet to enable high-speed, low-cost content distribution and file sharing. According to Nebulous CEO, Skynet has advantages over both centralized solutions like Amazon Web Services and the InterPlanetary File System (IPFS).","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56274\/sia-blockchain-developer-nebulous-releases-decentralized-file-sharing-platform","publishDate":"2020-02-18T13:38:57","id":9268,"type":null,"title":"Nebulous releases decentralized file sharing platform","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">Nebulous, the company behind the Sia decentralized cloud storage network, has released a new platform called Skynet to enable high-speed, low-cost content distribution and file sharing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Established in 2015, the Sia Network offers decentralized and permissionless storage. According to Nebulous CEO David Vorick, the network has onboarded about 1,000 to 2,000 users, who have collectively stored over four petabytes of data across over 1 million storage smart contracts.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The new file-sharing platform, Skynet, builds on the Sia network. It lets users upload a data and share the generated link with anyone they wish to. End-users can access the file without having to run full nodes. DApp developers can also use Sia, rather than centralized solutions like Amazon Web Services, as their storage layer.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Anyone can run a server that allows them to touch the link,” Vorick explained. “It’s not like Amazon’s cloud or Apple’s cloud, and the person who uploaded the file doesn’t need to seed the file. What it means is that you have this substrate for data where so long as a single person thinks that a file has a right to exist, that file is available to the entire world.”<\/span>","<span data-v-f87c67ca=\"\">Contrary to most centralized solutions where the platform has final say over whether certain content can or can’t be published, with a decentralized alternative, users have “complete sovereignty over what you publish to the world,” he added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Vorick, Skynet’s main advantages lie in its costs and speed. The price of storing data on Skynet is approximately $5 per terabyte per month – roughly ⅕ of monthly storage costs at <\/span><a href=\"https:\/\/aws.amazon.com\/s3\/pricing\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Amazon<\/span><\/a><span data-v-f87c67ca=\"\">. In terms of speed, Time to First Byte (TTFB) for a Skynet download is typically under half a second and the throughput is roughly 1 gigabit per second, he contended.<\/span>","<span data-v-f87c67ca=\"\">Going forward, the team will focus on providing additional rails and integrations for developers so they can move to Skynet with little effort and start building applications right away. The current development kit supports three programming languages (Python, Nodejs and Go) and allows users to upload and download. But the team is building out additional features, including instant migration from the InterPlanetary File System (IPFS).<\/span>","The launch of Skynet comes months after Nebulous <a href=\"https:\/\/www.theblockcrypto.com\/post\/41662\/sec-reaches-settlement-with-the-firm-behind-sia-network\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">settled<\/a> with the U.S. Securities and Exchange Commission (SEC) over securities sales it conducted in 2014 and 2015. As part of the settlement, Nebulous agreed to pay penalties and disgorgement of approximately $225,000.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"$225,000","content":"MONEY"},{"type":"Sia","content":"ORGANIZATION"},{"type":"2015","content":"DATE"},{"type":"Time to First Byte (TTFB","content":"ORGANIZATION"},{"type":"Amazon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Amazon Web Services","content":"ORGANIZATION"},{"type":"Sia Network","content":"ORGANIZATION"},{"type":"Vorick","content":"ORGANIZATION"},{"type":"$5","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Python","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"David Vorick","content":"PERSON"},{"type":"Skynet","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}