{"summary":"Episode 31 of The Scoop was recorded with Frank Chaparro and Alex Gladstein, Chief Strategy Officer of the Human Rights Foundation. Listen below, and","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49524\/alex-gladstein-cso-of-the-human-rights-foundation-discusses-the-increasing-importance-of-bitcoin-in-the-fight-for-global-human-rights","publishDate":"2019-12-06T15:15:20","id":9273,"type":null,"title":"Alex Gladstein, CSO of The Human Rights Foundation discusses the increasing importance of Bitcoin in the fight for global human rights","category":["BITCOIN"],"content":["<em data-v-f87c67ca=\"\">Episode 31 of The Scoop was recorded with Frank Chaparro and Alex Gladstein, Chief Strategy Officer of the Human Rights Foundation. Listen below, and subscribe to The Scoop on <\/em><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Apple<\/em><\/a><em data-v-f87c67ca=\"\">,&nbsp;<\/em><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Spotify<\/em><\/a><em data-v-f87c67ca=\"\">,&nbsp;<\/em><a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Google Play<\/em><\/a><em data-v-f87c67ca=\"\">,&nbsp;<\/em><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Stitcher<\/em><\/a><em data-v-f87c67ca=\"\">, or wherever you listen to podcasts. Email feedback and revision requests to&nbsp;<\/em><a href=\"\/cdn-cgi\/l\/email-protection#abdbc4cfc8cad8dfebdfc3cec9c7c4c8c0c8d9d2dbdfc485c8c4c6\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"077768636466747347736f62656b68646c64757e7773682964686a\">[email&nbsp;protected]<\/span><\/em><\/a><em data-v-f87c67ca=\"\">.<\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK7958809151\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-mce-fragment=\"1\" data-v-f87c67ca=\"\"><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><\/iframe>","In this episode of The Scoop Alex and Frank explore several human rights issues including:&nbsp;","<em data-v-f87c67ca=\"\">The transcript is provided for your convenience, please excuse any errors or typos resulting from the transcription process:<\/em>","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Ladies and gentlemen. Thank you so much for tuning in to what is a very special and timely and unique episode of The Scoop. We're here with Alex Gladstein. He's the Chief Strategy Officer at the Human Rights Foundation. We're going to be diving into the intersection of human rights, technology, Bitcoin, blockchain technology and examine what this nonprofit, which promotes the protection of human rights across the globe, does and what they think about new and innovative technologies. Alex, thanks so much for joining us here in New York today on this snowy Monday morning post the holidays. I guess the best place to start would just be an overview of your role at the Human Rights Foundation, what you guys are working on right now and how you got involved.","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Sure. Well, thanks for having me on. I started working at the Human Rights Foundation in 2007. The Human Rights Foundation is a nonprofit charity based right here in New York City, led by a group of international leaders from countries ranging from Russia to Lebanon to Venezuela to Hong Kong who believe in promoting freedom and human rights for people who live under authoritarian governments. So our sort of tagline is we like to sort of say we're promoting liberty and justice where they're most at risk. And the political science background for that is that in free societies, we as citizens have a lot of ways we can hold our governments accountable or push back on violations of our rights. We can sue our government. We can fund non-profits. We can write op-eds in newspapers. We can be angry. We can make a living making fun of our leader, right? That is only the case because we live in an open society that protects things like free expression. In authoritarian societies, which unfortunately constitute more than half the world--about four billion people live under some sort of authoritarian society--these abilities are very diminished and at times virtually nonexistent. So, you know, generally speaking, if you look at countries like Venezuela, Turkey, Russia, China, North Korea, the levels of oppression range. But, you know, in none of these countries would creating like a Greenpeace or an Amnesty International or, you know, like an ACLU type organization be possible. You'd be arrested immediately, or your bank account would be shut down and you'd be thrown in prison. You'd be harassed, at best, right? So our specialty is to like work with and help people who live under very difficult political environments. And throughout my whole career, I've been exposed to how powerful technology can be in these environments. My very first role was working with the Cuban Underground Library movement in an environment in a communist country where books are illegal unless they've been approved by the regime. So we would like smuggle in various texts, forbidden texts, films, things like that, and I thought it was so incredibly powerful, that kind of work, and that's why I ended up sticking with HRF, but we've always seen how, you know, information is power.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>It's an interesting point you raise about someone who lives in a country who doesn't have the ability to exhibit these rights, to be politically active, to organize. And if they were to try, their bank account would be shut down. And that kind of brings in--","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Or they get the crap kicked out of them or worse..","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I think that's where a lot of people like to tie in Bitcoin. A lot of crypto enthusiasts like to tie Bitcoin when they think about human rights or political activism or oppressive regimes. This idea that it's a borderless form of transaction that you can use to circumvent that. But it's not so easy, right? It's not as easy as saying, \"Well, I have this magic Internet money and now I have more freedom.\" There's there's probably a lot more to it.","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Well, I think if you look at the initial scientific creation of the Internet and of email, it wasn't immediately apparent that this would be like a massive liberation tool. Whether you were messing around with like list serves or message boards or even early online commerce, the maximum human potential impact was not sort of immediately known. I would say the same thing about Bitcoin and I think it's only because of my background and of the people that I work with and the situations that I see every day that I've started to realize that the sort of wider impact that I think Bitcoin will have in a way that's sort of similar to the Internet, to a technology that decentralized the means of production of information and access to information. Something that is going to decentralize the means of production of money and access to money, I think, will be remarkably powerful, especially as we move into a more cashless future where all money will be electronic, and we're going gonna be confronted with a situation where the money that we use every day has transformed and continues to transform away from bearer assets which give privacy and individual sort of power to, you know, controllable, \"surveillable,\" digital assets, which seed or betray your power and your information to others. So this is like a massive social transformation the world is going through right now. And the human rights community, I think, is lagging a little behind and seeing how important money and currency is to this, but at the end of the day, I do believe that financial privacy is essential for a healthy democracy. And I guess the best example I would give to the listeners would be to consider what happened in Hong Kong this summer when you saw students and others protest against this new extradition bill this summer in the millions. And people would line up to go into the underground, into the metro in Hong Kong, and instead of using their like I.D.-linked octopus card that they normally would use, they didn't want to do that because that could betray their movements and locations and their employers could find out and they could get fired or worse, right? So they were lining up in these big queues to use cash to buy one-time use top up cards. And it struck me as a really powerful reminder of the essential nature of cash in our ability to protest in an urban environment and hold our government accountable. But in 15, 20 years, there won't be paper metal money in Hong Kong. So how will these people protest for their rights and hold their government accountable? So we need a digital version of cash, and that's what I very much believe has been given to us with Bitcoin. And I think people building in the Bitcoin ecosystem are contributing to that.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>But just as the Internet wasn't a panacea to all the problems associated with authoritarian regimes and the like, nor will Bitcoin be one as well, so long as especially so long as it's able to find its way into more nefarious corners of the market. And if it's used by bad actors, it might impede the benefits that it promises.","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Sure. I think the way to look at it would be to look at a country like North Korea, actually, which has no access to outside information and see how horribly cruel and unjust and repressive it is. Necessarily, a future north Korea, which would have open information and independent journalism and free expression would be a better society. So I guess what I'm getting at is not necessarily that like--yeah, Bitcoin's certainly not a cure-all, but a society that has like open money, which is accessible to anyone and is censorship-resistant and affords us privacy I think will necessarily be a better society than one where the control of money is centralized, held by arbitrary power, and where it's able to be confiscate-able and trackable by whether it's governments or corporations. I do very much believe it will be a better society.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Since you brought up North Korea, it's certainly worth diving into the recent news over the Thanksgiving holiday of the U.S. Department of Justice arresting a theory and research scientist Virgil Griffith for visiting North Korea. He allegedly, according to the DOJ's press statement, provided information to the North Koreans via a presentation that could be used to go around sanctions using Ethereum, blockchain-related technologies. You mentioned before we turn the mikes on that we shouldn't lionize him, but also we shouldn't necessarily jump to conclusions on how he should be punished. I hope I'm not putting words in your mouth, but I think it'd be interesting for the listeners for you to explore that dichotomy. Why should he not be lionized?","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>I think we can have two different conversations about the Griffith case. We can argue about should he be punished, should he be imprisoned, etc.. I think there's a very good case to say that he shouldn't be, that he went and he shared information, which is, you know, not state secrets, et cetera, and he was providing education. I think it would be a pretty bad precedent to set for people talking about projects in the cryptocurrency and blockchain industry for them to be treated in this way if they go abroad to different countries. However, we need to really separate that from like the moral side of it here and say quite clearly and unequivocally and have an understanding that the North Korean government is a very wicked evil government that keeps hundreds of thousands of people in gulags and starves and murders and tortures millions of people over the last several decades and institutes a caste system where your family history dictates what kind of job you can have and who you can love and where you can live and where you can marry and where the government keeps the entire population completely cut off from outside information and where the elite keeps all the resources for themselves at the expense of everyone else. I mean, this is really the bottom of the barrel when it comes to governance in the world today. We need to be able to unequivocally say that aiding or abetting this regime in any way is bad. And you don't want to do that. I mean, it's like the least ironic for the character of this person, but this is the least cypherpunk thing you could possibly imagine would be to aid and abet the world's most vicious tyranny. But that's what he went and did. So regardless of what we think or determine with regard to his punishment in the United States, I think we should be unequivocal about that people who care about a free world with privacy and rights and freedoms should not be training or providing education or expertise to regime officials in North Korea.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I think my fellow podcaster and journalist, Laura Shin, put it so succinctly and masterfully, North Korea is essentially a prison masquerading as a country. And she noted a lot of the Twitter activity coming to the fence for Virgil, noting that there is a difference between helping the people of Korea and helping the government, the argument being, \"Well, possibly he was going out there to spread information about blockchain that could then, in turn, help the people.\" But as Laura notes, the only way to help North Korean people is in secret. Any public activity between North Korea and a foreigner is with the dictatorship, not the everyday people. And I think that's a fact about the North Korean government that a lot of people, a lot of regular people without deep knowledge of the history, might miss.","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Yeah. So like there are journalists, tourists, food tourism, there's different kinds of junkets, different kinds of investor- and entrepreneurial-related junkets, all kinds of Western and foreign groups coming into Pyongyang, the capital of North Korea. Every movement they make inside, every conversation they have, is monitored. Everything they do is watched. Everything is highly choreographed and orchestrated. Official groups have to go and tour memorials to the grandfather of the current dictator, the father of the current dictator. They have to lay flowers at the feet of these monsters who murdered millions. This is like part and parcel with the experience. So I would argue that that's probably not the best way to effect change in North Korea. If you actually want to help the North Korean people, you could explore doing things more along the lines of what we've determined is effective at the Human Rights Foundation, which is helping South Korean NGOs, which are led by North Korean refugees and defectors, send outside information back into North Korea and bring information from within North Korea out. So this is like a very, very effective thing. So I'll give you two examples. One is an organization named North Korea Strategy Center, led by a guy who wrote Aquariums of Pyongyang, which is like the Gulag Archipelago of North Korea. It's like the first account of surviving one of these concentration camps. And this man started a nonprofit when he got to South Korea to try and send outside information back to the people he left behind. He felt like that was a moral imperative. So HRF has been supporting NKSC for years and years and years and their good work. And what they do is they basically interview North Koreans who make it to South Korea, which is a very long, perilous journey. You have to do it once you escape North Korea into China and then make it down to a non-communist country like Thailand, perhaps, then you get flown to South Korea, interrogated and trained about how to live a modern life, and then you're sort of released as a South Korean citizen. And he takes these like sort of fresh arrivals and he and his colleagues interview them about what would be most effective to send in: what content, what movies, what, you know, k pop, what foreign films, what news would be most effective to send in right now? And then they load those things up on flash drives and SD cards and through a human network, they send it back into China. And then these things are bought and sold throughout the markets of North Korea, and people learn about what's happening in the outside world, and it's causing a dramatic, dramatic cultural shift. Now, that's how you can be like cypherpunk in this case, right? Like, that's how you can actually undermine authority and the state and help the individual, not by a flight flying on a jet to Pyongyang and delivering a lecture to the operators of a massive gulag system.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>So what do you say to folks like Vitalik or what would you say to folks like Vitalik who are of the opinion that he didn't give any real help in doing anything bad? And this is quoting Vitalik: \"He delivered a presentation based on publicly available info about open-source software. There was no weird hackery, advanced tutoring.\" Is this just akin to being an apologist for a regime that's obviously doing evil things? Not to ask a pointed question, but..","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Yeah, well, he made a statement and then I actually responded to him and I said sort of like something like, \"Regardless of what you think about the punishment, can you please just unequivocally condemn what's happening in North Korea? Just to clarify the situation. And he issued kind of a statement along those lines, which I was happy he did. But yeah, I mean, this is like such a basic, bare minimum situation here of, I mean, literally, the United Nations has compared what's happening within North Korea today to what was happening within Nazi Germany at the end of the 1930s. So could you imagine someone going to Berlin in 1938 or 39 and delivering a technical, you know, talk to the Nazis, one that they they may very well use in their social engineering experiments? This is, to me, a total travesty and a betrayal of all of the, like, values that went into the creation of things like Bitcoin and Ethereum. So I can only chalk it up to ignorance, which isn't really a defense. But I can't imagine that all these people are happy and excited about supporting the North Korean government. I mean, it just doesn't make any sense.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>It's interesting. From my perspective, being a reporter and a journalist, I see the stories that are coming out from the mainstream press and there are only a few instances in which you have companies like The Washington Post or The Wall Street--not so much The Wall Street Journal necessarily, but CBS or ABC--putting out Bitcoin stories, whether it's a hack, a big hack or something related to criminal activity. And now with this instance of Virgil's visit to North Korea, everyone is putting out reports on this. And so from my perspective, it seems like a horrible PR event, not for Ethereum, obviously, but most people associate all of the cryptocurrencies as being the same, as being the same as Bitcoin. In your seat, it's interesting because your organization is serving as an advocate to an extent for Bitcoin in a way that many others aren't. Do you view this as a few steps backwards for the space? How can we get over this hump?","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Well, I've written about this before. I think that people, whether they're in the blockchain industry more generally, working on cryptocurrencies, working on Ethereum, working on Bitcoin, I think they need to consider the world that they are trying to build and what they want to see in 5, 10 years. And they should take some moral stances. So, you know, don't go build blockchain tech for the Saudis. Don't go build blockchain tech for Putin. Don't go build blockchain tech or teach about blockchain tech to the North Koreans or the Chinese or, you know, I mean, depending on your perspective, any government, right? You know, maybe don't go do that for companies involved in the U.S. prison system. I mean, there's a lot of different ways to take this, but you should be able to stand up and use your abilities and whether you run a company or you run an organization, you should be able to take some stances publicly that reflect the values that you're trying to push through with your technology. So if you actually care about privacy, user privacy, you care about anonymity, perhaps, on the Web, you care about being able to browse the Internet safely and freely, you want to care about censorship-resistance on the Internet and, you know, maybe perhaps having that kind of parallel economy, whatever your values are that drew you to this space, here's an opportunity if you're a CEO or you run an exchange, et cetera, to make a statement about that and to not help, like, people who are human rights violators. This to me is pretty straightforward.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>This is part of an ongoing history. It's not just this one example of a Virgil flying out to North Korea. We've seen tweets from various crypto advocates when it was announced that the Venezuelan government was launching a cryptocurrency tied to oil, that that was a bullish event for the market, which is just a jaw-dropping conclusion to come to. You had mentioned before we turn on the mics that you had friends coming to you over a year ago about whether or not it would make sense for them or be morally right for them to visit North Korea and the same type of capacity as Virgil, and you kind of had to walk them through that history. But let's go through that. This notion of the Bitcoin market's connection to thinking that anything related to blockchain or Bitcoin is good, even if it's tied to an authoritarian regime.","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Well, we just went through this and I wrote a piece for Bitcoin magazine trying to separate these two issues. But at the end of the day, Bitcoin separates money from state and it's not gonna be good for any government. I have the opinion that it will be much worse for dictatorships and authoritarian regimes than for democracies, which are more flexible. But generally speaking, no government is gonna want to see that popularization and spread of Bitcoin because it reduces their power to control the population. Even benign governments are not going to want to see it. In fact, some of the most, I would say, aggressive anti-Bitcoin governments are in northern Europe, where countries are relatively free and open. This is very, very different from governments and their excitement around blockchain technology or whatever they call blockchain technology, so these kind of like centralized databases that governments are gonna be loading I.D. systems and new currencies onto, which are gonna be eminently trackable, confiscate-able freeze-able, etc.. And you're seeing this happen in China, where, you know, you've seen three or four years go by where the Chinese government is obviously working on like this DCEP Digital Yuan project where they're trying to replace the M0, the base money in China, the paper money that's outside of the reserve with a digitally trackable version. They want to do that because they want to strengthen their control over the population. They don't want anyone to have paper or metal money because that's anonymous. They want to have total surveillance and sort of they want to have this financial panopticon in China. And that's what they're doing. And we have to be able to like intellectually separate that from what's happening with Bitcoin, where they will eventually crack down on Bitcoin and make it more difficult to obtain, I would imagine, if they're smart. And you should think of this the same way on the same spectrum as Signal. If you're talking about, let's say, messaging, Signal would be like a very useful, very private, encrypted, you know, very open-source messaging system that I would encourage activists and journalists to use. You can go all the way to WeChat on the other side, right? They're all digital messenger services, but we have to understand that they're radically different technologies. So, like, I would put Bitcoin at the same end as like Signal and then say you could go all the way over to like what the Chinese are building with DCEP. It's going to be a digital currency, whether you consider it on a blockchain or not. It's probably irrelevant. It may even be a cryptocurrency. But we have to think about like what will it do to people and what will it enable people to do, right? So I think it's important to like really start to separate these things out and to talk about like, you know, what will be the effects of Bitcoin, how Bitcoin react, and then separate that from like what's going to happen with blockchain technology more generally. So I think more needs to be discussed to separate these two phenomena.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Do you think that something like what the Chinese are working on gives them more or less power than they do now when you think about their control over people's pocketbooks and wallets?","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Whether they can technically implement it the right way is to be seen, but clearly they want more power. I mean, that's the direction they're moving in. They finally have the algorithms and they're sort of like, quote unquote, A.I. ability to start to sift through all this big data, right? So what I guess from what I've seen, from what the central bank, the PBOC of China has verbalized, one of the main annoyances with the current system in China, as is, is that if Frank uses WeChat and they want to get your data, they have to go to Tencent and get your data. And like Tencent may put up a fight about that. Tencent is certainly going to end up complying with what the Chinese government wants, but they've certainly tried to fight back on certain things, right? Like at the end of the day, they are a company. They're not like a straight-up arm of the government, and this just like gets all that messiness out of the way for the Chinese government. This allows them to just have like a--if this DCEP thing works, it would allow them to have real-time surveillance of all the transactions without having to go through a company, so it'd be really great for them and a total disaster for civil liberties.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>What do you view as being, as it pertains to blockchain, the greatest existential threat to human liberties? Is it that mass surveillance over how folks spend their money, how they're transacting? Or is it something else?","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Yeah, I mean, look, we're the default trend of the world, again, is that we're moving from like our daily use of money being with a bearer asset that gives us privacy and freedom to a world where all of our little interactions, whether they're on Visa or the latest touchless card or with, you know, in China, WeChat, we are being surveilled and at times even controlled. So that's like the direction we're going. And all of this like blockchain digital currency stuff is just going to push us further in that direction. These are like surveillance stable coin projects. Bitcoin would be a very different beast, and it's like, it's why I'm a big Bitcoin advocate from the human rights perspective because I think it gives us a different way of doing things. And, look, I mean, over time, I don't know if you can say that the Chinese government developing a digital Yuan is bullish or bearish for Bitcoin and its price. I tend to think these things are going to over time be orthogonal. There may be times when it appears to correlate. There may be times when it appears not to. I think Bitcoin's price will be driven by other factors. But clearly, like, we're going to be living in a time where in the next five to 10 years, many, if not all governments will attempt to solidify their control over the currency in their country through some sort of digital currency project.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>So one thing that you guys worked on was the Open Money Initiative, which was part of your broader look at the cryptocurrency landscape as it pertains to different human rights issues, going to Venezuela to gain insights into how the people there interact when it comes to their money transacting. What were some of the insights you--well, first, let's speak a little bit about that initiative. What were some of the insights you gleaned from it and how might that help different companies or organizations further tool people, equip people with what they need to be free from a money perspective?","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Sure. Yeah. So the Human Rights Foundation helped sponsor a project called the Open Money Initiative earlier this year where a team of researchers went down to Colombia and interviewed Venezuelan refugees to learn more about how they sent and received money with their families, how they earned money. What did they treat as their savings account? As their checking account? How did they denominate money? What unit of account did they use? How did they get money from Colombia, back to Venezuela, the United States, et cetera, et cetera, et cetera. We learned a lot of insights that I hope and I've seen that we'll have already had an impact. I think we'll continue to have an impact on the industry. I'll give you one specific example. In Venezuela, one of the big peer to peer marketplaces that people use for exchanging fiat money for Bitcoin and vise versa is local Bitcoins. And it's very popular down there, very dominant. You know, as far as a peer to peer exchange for cryptocurrency, it's head and shoulders above the rest, right? And it does a huge amount of volume, more volume daily denominated in dollars than the Caracas stock exchange. This is like a big, big deal down there. And what they realized is that, you know, most people, you know, earlier this year weren't really able to use phones to use local Bitcoins. They had to use computers. There's a lot of trouble with that. Not everybody has a computer. There's power outages, et cetera, et cetera. So what we were able to understand was that it would be like a really important, I think, both market and human impact opportunity for companies like local Bitcoins to work on their products for mobile phones in Venezuela that people would have. So not like an iPhone 10, but like an earlier Android edition, et cetera. So that kind of understanding has led to some very productive dialogues with companies like local Bitcoins to help develop mobile tools. So that would be like a really clear and obvious example of the kind of impact we want to make with this kind of research. Also, just more generally, I think we want to have an impact on people's thinking when it comes to aid and helping people under difficult economic circumstances. For example, today, like the World Bank won't like help--the World Bank can't get money inside Venezuela until there's a new government. They just, they can't because the majority government doesn't want that money coming in to the people, right? So the World Bank today could use Bitcoin, privately. They won't because they don't rock the boat, but they could be like literally saving lots of people by funding Venezuelan NGOs--","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>But they'd have to understand how those on-ramps work or rather those on-ramps would have to be tailored to it?","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>They wouldn't have to do anything. All they'd have to do is convert fiat money in whatever country they're in into Bitcoin and send it to the addresses of the people running these soup kitchens. People like Randy Brito would like BTC. Then they'll receive your Bitcoin and then they'll use local marketplaces in Venezuela to turn it into Bolívars, buy the food for the people and feed them. I mean, this is something you could do right now. You can go support BTCVen. And they have different projects, not just sustenance and food, but they have, they're working on like a mesh networking project and a few other really interesting, important things. But I think the establishment in the world won't get involved because they don't want to anger the Venezuelan government. And meanwhile, people suffer. It's just unfortunate. I'm not saying that this would make like a massive, massive, massive difference, but it certainly would help some people. And I think every human life matters, you know? So we could meaningfully get a lot more resources into Venezuela today if major aid organizations would consider Bitcoin and sending it in Bitcoin and they won't. And that will only be broken. That mindset will only be broken and changed through continuous education and engagement, which is why things like the Open Money Initiative are really important.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>To what degree has the Open Money Initiative broken that concept for organizations like the World Bank or larger entities that want to get money into Venezuela?","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>It's a good question. I mean, some of the things that they've done are still private, but I can tell you that even just getting like an organization like Ideo, like this design firm, to get on board with sheltering and incubating their work was huge. I mean, and now like Ideo has shared that with many people involved in the design space. And we've had presentations recently and organizations I mean, I've personally spoken at, you know, some of the major exchanges like Coinbase about this work and gotten to talk to a lot of Coinbase employees, et cetera, et cetera.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I heard through the rumor mill that they were considering doing an airdrop to Venezuela, or something like that, but I think that could be a good example of--","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Yeah so, about a year ago, Alejandro and I were interviewed. You can find it on YouTube. We were interviewed by Brian Armstrong about this particular initiative, which was great, and we got an opportunity to talk to a lot of the employees there and there's been some follow-up. But generally speaking, we've seen this project tapped into the non-crypto--let's say like the when you talk about companies like Ideo and some of the other like V.C.s that were involved in the process, they were not like the cryptocurrency industry. So I think it's really important to show that things like Bitcoin are making an impact and can be useful tools to help people and to get out of the bubble of the cryptocurrency industry and to show like the mainstream that this can make a difference. That's like an imperative. Doing a piece in the next few, days or weeks about looking ahead to 2020. And I think that there's like this kind of like this long, slow slog, to like global Bitcoin understanding, where like today a very tiny fraction of humans understand the potential. And it's just like watching the adoption is like slow motion, you know, even in places that could really benefit from it because it's not very usable. The liquidity is not good. It's a difficult user experience like the apps kind of suck, et cetera, et cetera, right? There's not a lot of education in different languages around the world. So the adoption is happening super slowly. But over time, I think we can say like one of the most important things we can do right now is reach out and engage and educate people, especially in the mainstream. I mean, if you look at like the skepticism that emanates from like--and forget governments, let's assume that they'll never support Bitcoin--but like mainstream media organizations, like financial firms, et cetera. And you're starting to see some changes. But like I mean, their skepticism will only become less and they'll only become more openminded with more engagement and more interaction. So I think that like trying to tell the story of Bitcoin to other audiences, it's got to be like a top priority for people in this space.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I think the Open Money Initiative provides a great example of how you guys are trying to promote education, trying to showcase how we can get money into difficult places through new mechanisms, through Bitcoin and cryptocurrency on-ramps. There are other aspects of what you guys are doing when it comes to Bitcoin. Focusing on operational security, empowering people, using Bitcoin to have the proper security in place, and also working on diversifying the network of Bitcoin core contributors. Those are two other prongs to the fork.","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>The operational security one is actually happening. The diversification of core contributors is something we'd like to do. Maybe we'll get to it. It may also be best served by other organizations. But just to dive in on the--I think it's very important, obviously--but just to dive in on the operational security bit, at the Human Rights Foundation, we've been doing digital security training for activists for a long time. And look, I mean, there's no such thing as perfect privacy. People are always gonna be vulnerable to like these vast states with all their resources. However, there are things you can do, there are steps you can take to be lower--not the lowest hanging fruit--you can kind of like make yourself just a little bit safer. And it's a lifestyle choice with regard to digital communications, for example, or the way that you use the Internet. There are certain steps you can take to be just a little safer. And we want to make sure activists know those things. When it comes to money, I think you're going to see the same sort of narrative where there's no such thing as perfect privacy. Even if you're using like one of these privacy coins, like the moment you turn it into fiat money, you're going to betray certain things about you, etc.. So if you're in a situation where your bank account just got closed or you're having trouble raising money or getting money to a particular geography, or maybe you're living behind sanctions that are that are unfair or there's like some sort of bank controls or the government has restricted your ability to withdraw your money from your bank account, which is happening in Lebanon recently and in many other places, or whether you're just dealing with hyperinflation or general instability. There are a lot of reasons that you might want to use Bitcoin. Now, how can you do it in the safest way possible? That's something we'd like to try and help with. We'd like to try and design a course of sorts, or at least some tips to help people if they have to, to do it as safely as possible. And there's no guarantees here, of course, just like with encrypted messaging, there's still vulnerabilities, whether it's on your phone itself or elsewhere. But there has to be some sort of like educational resource people can consume to help them be a little safer. So that's certainly a goal alongside of the research in difficult political environments and the public education pieces. I think those are the things that we want to focus on in 2020.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>It's interesting how you keep drawing that comparison between what digital assets can do, either for folks living in oppressive regimes or activists trying to change the status quo in oppressive regimes. Drawing the comparison between Bitcoin and encrypted messaging or cryptocurrencies in encrypted messaging. What other technologies aside from those two, can activists, folks living in authoritarian regimes, leverage to change their situation or the situation that many, many folks are in? Aside from those two, what other technologies are you guys looking at? And how would you enumate that?","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Sure. Encrypted messaging is obviously the first one. So something like Signal, very, very important. VPN is obviously vital for people who live behind firewalls, so that would be like a second bucket. And you can even go, depending on the, let's say, passion of the person involved in time into something like Tor, which would be a really useful tool as well. So those would be like the first two buckets. I would put Bitcoin and other projects that focus on financial freedom and privacy in a third bucket, ways that you can pay and do transactions and receive wires outside of the existing system or in some way that isn't connected meaningfully to your I.D. stack. So that would be like a very important third bucket for these folks. Fourth area would be access to the Internet. So right now, generally speaking, you know, most people in the world don't have very many choices when it comes to how can they access the Internet, and that leads them to be victims of, for example, some governments like turn off the Internet because they have total control over like national telecoms that can just comply with their dictate, right? I think in the future we're going to move in this direction of like many different organizations and companies having satellite networks. We're seeing this right now, right, whether it's the ambitions of Virgin, or Facebook, or SpaceX etc., right? I think clearly most people would agree that probably in 10, 15 years there's gonna be many different options for you to connect to the Internet. And I think that's gonna be a wonderful thing. And I think we're also seeing on the user side like the piece of technology that receives and transmits satellite data getting smaller and smaller and smaller. I mean, people have these like awesome little raspberry pi's now that can send or receive Bitcoin from anywhere on earth using the blockstream satellite without any regard to whether there's Internet around, right? This is amazingly cypherpunk, right? So I think that's pretty neat. And that would be like a fourth area for sure. So I think those are four areas that are feasible, reasonable areas to start. And I think they can be both like areas for activists and journalists to learn up on and buff up on. They are also investment opportunities. So these are areas where like you may see, hopefully, people realize they can make a lot of money in these areas moving forward if they invest properly. I'll just mention two other areas. I mean, that could conceivably fit into this area of what I would call democracy technology or maybe dem tech or something like that. But we're not quite there yet, clearly, with the tech, but more sophisticated, encryption of data, of different kinds of data, could be really cool. So, for example, I know you've seen the dreams of people and there's actually implementation of this was zcash, but like zero knowledge proves disguising like different kinds of data and being able to prove certain things about what you have without showing the full thing could be really neat for users, for example, like if you wanted to participate and use Google Maps but not like reveal to Google where you know your exact whereabouts all the time. Maybe you only want to reveal what you're doing on a daily basis or whatever, or you only want to reveal certain aspects of your medical profile, and you want to keep the rest of it sovereign. I think that is something Microsoft's been looking at, right? The Ion project, that's something that a lot of startups are looking at now. I think it's very early. But I mean, if we're just going to call that like, you know, encryption of personal data, that to me is very exciting. And then I think a final area would just be the continuation of free expression on the Internet in terms of storytelling platforms and I know social media platforms get a lot of heat. But looking just specifically at Twitter. I mean, without Twitter, a lot of the human rights activists I know it wouldn't have a career. I mean, it really made them who they are in many ways, it gave them a voice, right? And I know we can argue about, well, how do they moderate content or how do they verify people, but I would say Twitter's done a really great job in terms of being a platform where people can express themselves in difficult areas. Yes, could they improve? Definitely. Are they doing some things wrong? Sure. But generally speaking, you've got I mean you've got--short of North Korea. I mean, and arguably a few other places--you've got activists giving us really vital information from places in Iran right now. It's an amazing time if you have Twitter to be able to see what's happening inside. Same thing with Venezuela, Egypt, Turkey, many other places, Russia. So I think that kind of storytelling platform--and it remains to be seen if like that stuff can be decentralized and if that's a good thing, I'm not sure--but I would certainly want to like pay attention to that area, too.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Well, there is a double-edged sword--","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>I've just given you a bunch of different areas and I think people can dive in, but that's the kind of stuff that we'd like to A.) engage activists and journalists with and in difficult environments and B.) see if we can get investors to consider supporting companies and projects in this area, both from a profit-minded point of view and from maybe an educational or academic grant point of view, research point of view.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Sure. I think now you did a great job enumerating the various technologies or technological forces that could aid in addressing some of these conflicts or difficult--","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Preventing the global surveillance state.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>If you want to put it more succinctly, yes. When we think about the broader problems faced, isn't--","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>I just thought this was relevant. I just gave a speech in Australia recently. You know they have a lot of sheep down there. And I basically said, don't be a sheep. Australia already has one hundred million sheep. They don't they don't need any more. And I was like, here are four steps to not be a sheep. Use Bitcoin, use Signal, don't use WeChat, and be very skeptical of these like new smart cities, okay? What's the difference between a smart city and a surveillance city? Not a lot until we can meaningfully make smart cities where we can like touchlessly, move and go and do things without freaking revealing and betraying everything about us--","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Revealing that identity stack.","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Yeah, exactly. I think you can build a smart city in a way where I can beep into a subway line without revealing my address and eye color or whatever. But we're not there yet because both like public officials and companies have no incentive to protect user privacy. Very little. Trends, what we're seeing with Apple is really interesting because even though I think there's some hypocrisy there, especially with regard to their operations in China, but it's amazing to watch them do these advertisements where they're like promoting privacy. It's very riveting. You know, clearly the most highly invested in the produced ad ever about like why privacy is, you know, this little one that you see on TV now where it's your little heartbeats and these are your things. It's very effective. So I'm happy to see them doing that. And arguably, maybe they could be a privacy company given that most of the revenue comes from hardware. Sure. So we'll have to see.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>No, I think it's a great point. And it speaks to the question I was going to ask. Giving me that great analogy, I can now ask it. If we have these technologies that we can use to not be a sheep, so to speak--we have Bitcoin, we have VPNs, we have these other things that we can leverage--where then, Alex, are the wolves in sheep's clothing and may not be necessarily revealed to us at this time, maybe are just coming on the radar for folks like you at the HRF but are nevertheless there?","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Yeah, I mean. Again, we're gonna repeat a lot of the same debates and narratives that we had with encrypted communications, with encrypted money. Like there's gonna be a lot of repetition of a lot that went down and has and continues to go down in this area. So there are gonna be governments, democratic and authoritarian alike, that try and outlaw encryption. They're gonna also try and outlaw encrypted money, right? There are gonna be companies that governments hire to try and break encryption and to try and spy on you. This is obviously happening with chain analysis, right? There are going to be efforts made to force whether it was e-mail servers or now cryptocurrency exchanges to do KYC AML and become surveillance tools. So this is what we need to guard against. I mean, if we want to avoid the mistakes that the original Internet fell victim to and now has largely, for most people who interact with it, become a way to track what you're doing, then you need to make sure that like the exchange points where most people--","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>But a lot of it's out of their own hands, right?","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Right. That's what I'm saying.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>If you think of things like FATF, right?","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Right. But like, there's different things we can do about that. I mean, look, here's the thing. You're always going to have your like very intense, pro-freedom person who's very technical and can figure out a way to, like, safeguard their own stuff, right? If you think of PDP and Tor, et cetera, but like such a micro-fraction of society actually uses that stuff, right? So the goal would be to get like the major exchange things, endpoints and services that the average person uses to not compromise too much of their data. And I will admit that that is probably only possible in a democracy. I don't think that's going down in China, let's put it that way. But it could happen in America. I mean, we could fight for our rights in a way, and, you know, maybe Coincenter can can be helpful here, certainly, in convincing politicians and companies that they don't need to know everything about us and that, hey, just you know, 20 years ago, everybody used or whatever, 30 years ago, everybody used cash for everything. And that was fine. They didn't have to know everything about us. Can we keep that alive as an American value? And can we convince politicians and companies that it's okay for people to use digital cash? That's incumbent upon us and we have to do it in different ways. We have to do it by building the thing so that they can't, you know, practically really fight it. We also have to like, do we do it from a policy perspective. I think both are important. It has to be pushed, lobbied for, protested for, et cetera. We've seen enormous changes in surveillance policy here in the States due to someone like Edward Snowden. I mean, I just listened to his interview on Joe Rogan, which was pretty interesting. But I mean--and certainly nothing's perfect now--but the amount of more knowledge that the average American has about the government's programs like before and after Snowden is crazy, you know? So like now it's like a thing that we talk about. So it's not just building the tech. I think building the tech is probably the most important part, and like, we need to do more in terms of contributing to core research. I think what Square's doing with Square crypto is very interesting. And clearly, like we'd like to see more mathematicians and scientists working on Bitcoin, making it more decentralized, private, scalable, etc.. But we also need to like do the heavy lifting in popular culture, which is I think something HRF can help with. And then also in D.C., which is something that, you know, Coincenter is doing. I mean, I think we need to find the politicians that are most openminded about this. There was a point right in the 90s where like we maybe, you know, some of these technologies we take for granted today could have been made illegal. Like, you know, there was that moment where maybe we thought encryption would be illegal forever, right? And now it's like fine that I use Signal. I don't go to prison for that. How can we make sure that happens with Bitcoin? That's really important. So I think there's like three areas we can work in. And if you're listening, you might be in any one of those areas. You might be in the technical area and you can build stuff, right? You can make it more private and more decentralized and more accessible, more usable. You can be in the public education space. You can be someone like yourself, a journalist. You can spread the word about it and get it into more people's hands. And then maybe you're a lawyer or in regulation or in BD or whatever, and you can help make sure that our politicians understand this stuff is not too much of a threat.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Do you think there is enough? Do you think there's enough political will to engage with the issue of the surveillance state? When we look at, on the campaign trail, we talked about automation a little bit. We certainly don't engage with some of these other topics.","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Look, I don't think we're there yet, but I think privacy is gonna become a huge issue for Americans.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Well, we look at the vitriol around Facebook on Capitol Hill during the Lieber testimony. The reason why they were upset was privacy.","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Yeah, we're just scratching the surface here. I think it's gonna get--and especially, unfortunately, it's gonna be like kind of a classist thing in a way where I think wealthy people are going to really care about privacy. They've always wanted a Swiss bank, right? So I think wealthy people are actually going to lead the charge here in certain ways because they're gonna want financial privacy, um, much like they always did with Swiss banks or whatever. And maybe I'm even talking about the ultra-wealthy here. But I think they're going to want communications privacy. they're gonna want financial privacy. And you know what? There could be a dystopic realm where it costs a huge amount of money to be private in the future and where lower- and middle-class people can afford it. That would be terrible. So we need to prevent that from happening, which is why it's really neat to see projects like Bitcoin and Signal and Lightning that are like open-source and accessible and usable by anybody. I think that's essential to keep pushing forward. So we need to prevent that dystopia for sure. I mean, there's that New York Times piece by Jameson Lawport where he gets interviewed and it's like it cost him thirty thousand dollars to disappear from the American kind of surveillance system. And look, that's not ideal. Like it should cost three dollars or whatever. Or not cost anything. But there's so much work that's got to go into that for the average person to have those kind of protections.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>It's interesting. Well, Alex, we appreciate you so much for coming down and sharing your story and engaging in some of these topics related to privacy, security, cryptocurrency, human rights, based on your work at the Human Rights Foundation. Chief Strategy Officer there, Alex Gladstein. Thank you for joining us.","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Thanks, this has been a blast. Thanks for having me on. Would love to see you at one of our events in the future. We do this event series called the Oslo Freedom Forum, where we are increasingly getting some activists to meet people in the Bitcoin and cryptocurrency space.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Before you sign off, tell us a little bit about what that's all about.","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Thumbnail sketch is that more than a decade ago, we looked at the conference scene around the world and there was the Clinton Global Initiative for Development and TED for Technology and Davos for finance, but there wasn't really like a similarly kind of prestigious, attractive event for human rights and freedom and civil liberties. So we wanted to create one, and we launched it in Norway in 2009, and it's been running ever since on an annual basis as a summit there, a three day summit where we hear from people telling amazing stories around the world and then engage in a variety of workshops and training classes and evening events to kind of like really get to know each other and form bonds. The audience is like technologists, philanthropists, media creatives, just the average do-gooder. And then we've spun that off into one-day events around the world, which we've had in Johannesburg, South Africa, Taipei in Taiwan, Mexico City in Mexico. We've done events in New York here for a few years. So our goal is really to create like places where you can go to get out of the house, go to an event, meet some people and kind of get a chance to directly engage with some of these larger than life heroes. So it's been fun, and I hope your listeners a lot of check it out.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>A lot of Bitcoin people need excuses to get out of the house, that's for sure. Thanks.","<strong data-v-f87c67ca=\"\">Alex Gladstein <\/strong>Thanks for having me on.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"I.D.","content":"LOCATION"},{"type":"North Korea","content":"LOCATION"},{"type":"PBOC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Nazi Germany","content":"LOCATION"},{"type":"South Africa","content":"LOCATION"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"Joe Rogan","content":"PERSON"},{"type":"Human Rights Foundation","content":"ORGANIZATION"},{"type":"Google Maps","content":"ORGANIZATION"},{"type":"Taiwan","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"thirty thousand dollars","content":"MONEY"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Open Money Initiative","content":"ORGANIZATION"},{"type":"Frank Chaparro <\/strong>Well","content":"PERSON"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"15, 20 years","content":"DATE"},{"type":"Virgil Griffith","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"ABC","content":"ORGANIZATION"},{"type":"Square crypto","content":"ORGANIZATION"},{"type":"Ideo","content":"ORGANIZATION"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"ACLU","content":"ORGANIZATION"},{"type":"Alex","content":"PERSON"},{"type":"SpaceX","content":"ORGANIZATION"},{"type":"Lieber","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"Iran","content":"LOCATION"},{"type":"D.C.","content":"LOCATION"},{"type":"Berlin","content":"LOCATION"},{"type":"Twitter","content":"DATE"},{"type":"North Koreans","content":"LOCATION"},{"type":"South Korean NGOs","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Gulag Archipelago","content":"LOCATION"},{"type":"United Nations","content":"ORGANIZATION"},{"type":"Egypt","content":"LOCATION"},{"type":"Taipei","content":"LOCATION"},{"type":"Davos","content":"LOCATION"},{"type":"Norway","content":"LOCATION"},{"type":"Virgin","content":"LOCATION"},{"type":"Mexico","content":"LOCATION"},{"type":"Vitalik","content":"PERSON"},{"type":"2007","content":"DATE"},{"type":"FATF","content":"ORGANIZATION"},{"type":"America","content":"LOCATION"},{"type":"Virgil","content":"PERSON"},{"type":"2009","content":"DATE"},{"type":"Alex Gladstein <\/strong>Yeah","content":"PERSON"},{"type":"Pyongyang","content":"LOCATION"},{"type":"HRF","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Chaparro <\/strong>Well","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"New York City","content":"LOCATION"},{"type":"South Korea","content":"LOCATION"},{"type":"Jameson Lawport","content":"PERSON"},{"type":"Alex Gladstein <\/strong>Well","content":"PERSON"},{"type":"Johannesburg","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Spotify","content":"LOCATION"},{"type":"1938","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Putin","content":"PERSON"},{"type":"AML","content":"ORGANIZATION"},{"type":"northern Europe","content":"LOCATION"},{"type":"World Bank","content":"ORGANIZATION"},{"type":"Snowden","content":"PERSON"},{"type":"Alex Gladstein <\/strong>Look","content":"PERSON"},{"type":"Griffith","content":"PERSON"},{"type":"A.I.","content":"LOCATION"},{"type":"Alex Gladstein <\/strong>Thanks","content":"PERSON"},{"type":"Bolívars","content":"PERSON"},{"type":"last several decades","content":"DATE"},{"type":"Oslo Freedom Forum","content":"ORGANIZATION"},{"type":"Colombia","content":"LOCATION"},{"type":"Laura Shin","content":"PERSON"},{"type":"Turkey","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"1930s","content":"DATE"},{"type":"Alejandro","content":"PERSON"},{"type":"Caracas","content":"LOCATION"},{"type":"Nazis","content":"ORGANIZATION"},{"type":"PDP","content":"ORGANIZATION"},{"type":"Clinton","content":"PERSON"},{"type":"Australia","content":"LOCATION"},{"type":"VPN","content":"ORGANIZATION"},{"type":"Alex Gladstein","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Venezuela","content":"LOCATION"},{"type":"Edward Snowden","content":"PERSON"},{"type":"Lebanon","content":"LOCATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Randy Brito","content":"PERSON"},{"type":"Mexico City","content":"LOCATION"},{"type":"Greenpeace","content":"ORGANIZATION"},{"type":"Thailand","content":"LOCATION"},{"type":"morning","content":"TIME"},{"type":"the Human Rights Foundation","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"TED","content":"ORGANIZATION"}],"hashtag":[],"authors":["Andreas Nicolos","The Block"]}