{"summary":"Infinity, a new NFT marketplace, says it wants to be an anti-establishment rival to the OpenSea and is calling itself the &quot;FTX of NFTs.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119887\/new-nft-marketplace-takes-direct-aim-at-opensea-with-a-token","publishDate":"2021-10-08T09:38:53","id":9274,"type":null,"title":"New NFT marketplace takes direct aim at OpenSea — with a token","category":["NFTS"],"content":["The latest entrant to the red-hot market for non-fungible token trading has a plan to compete directly with market-leading Opensea for users. The team behind the project, called Infinity is also hoping that a token and some well-followed backers will help it take on its larger rival.&nbsp;","<a href=\"https:\/\/medium.com\/@infinitydotxyz\/announcing-infinity-the-ftx-of-nfts-e0c2930b5f48\" data-v-f87c67ca=\"\">Infinity<\/a> — which officially launched today — is branding itself as the \"FTX of NFTs,\" alluding to its desire to serve as a community-driven, anti-establishment alternative to more mainstream NFT platforms.&nbsp;&nbsp;","Already, some large NFT influencers, including NFT whale 0x_b1, have backed the project.&nbsp;","Competing with OpenSea won't be easy, as users have flocked to the a16z-backed platform. The marketplace clocked in more than $2.72 billion in monthly trading volumes in September, according to data compiled by The Block. It also has a $100 million war chest from its recent fundraise and recently launched a mobile application. It also has a wide range of prominent investors including Naval Ravikant, Mark Cuban, and Alexis Ohanian.","But OpenSea has also faced its fair share of setbacks, including <a href=\"https:\/\/www.theblockcrypto.com\/post\/116924\/opensea-bug-destroys-100000-worth-of-nfts-including-historical-ens-name\" data-v-f87c67ca=\"\">bugs<\/a> and the exit of a longtime executive who traded NFTs using insider knowledge.&nbsp;","","","Infinity has aspirations to eat into some of those volumes by airdropping its tokens to users of OpenSea.&nbsp;\"10% of the governance token supply ($NFT) will be distributed to existing OpenSea users who transacted before October 4th, 2021 11:59PM UTC,\" according to press materials shared with The Block.&nbsp;","\"The airdrop amount is based on tiers derived from OpenSea transaction volumes. The airdrop becomes claimable after transaction activity on the Infinity marketplace within a 30 day period. The token is transferable once the 30 day period has completed.\"","In a sense, the project is taking a page out of the playbook of SushiSwap, the automated market maker SushiSwap. SushiSwap — which is a clone fork of Uniswap — <a href=\"https:\/\/www.theblockcrypto.com\/post\/77324\/sushiswap-initiates-migration-of-over-800m-in-liquidity-funds-from-uniswap\" data-v-f87c67ca=\"\">launched a so-called vampire attack<\/a> to woo more than $1 billion worth of liquidity from its much-larger rival. To use SushiSwap, users had to deposits Uniswap LP tokens, which quickly siphoned off a large portion of Uniswap liquidity.","Similar to Sushi, Infinity is modeling itself off of OpenSea, reusing some of its smart contracts.","\"Overall, we expect to be at feature parity with OpenSea on the marketplace,\" the project's co-founder Garrett Allen said. \"However, we plan to build a platform that incorporates more integrations and tools for evaluating, providing liquidity, and adding more utility to NFTs.\"","Still, reusing OpenSea's smart contracts didn't make sense to one market insider who said that they were built on old Solidity. It could possibly open the door to OpenSea targeting the project.&nbsp;","\"The contracts are audited\/verified, which means there's more trust in using them and OpenSea users don't need to re-initialize their wallets or tokens if they've already listed, which means they don't have to pay gas fees to list and can keep their NFTs listed on OpenSea as our platform grows,\" Allen said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2.72 billion","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Alexis Ohanian","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Uniswap LP","content":"ORGANIZATION"},{"type":"Garrett Allen","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Allen","content":"PERSON"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Mark Cuban","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"OpenSea","content":"ORGANIZATION"},{"type":"Sushi","content":"LOCATION"},{"type":"OpenSea","content":"LOCATION"},{"type":"October 4th, 2021","content":"DATE"}],"hashtag":["OPENSEA"],"authors":["Frank Chaparro","The Block"]}