{"summary":"The revenue opportunity for the new business stands in the hundreds of millions over the next two years, noted JMP.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/245893\/coinbase-derivatives-staying-power-usa","publishDate":"2023-08-17T08:27:05","id":9277,"type":null,"title":"Coinbase derivatives approval shows &#x27;staying power of crypto&#x27; in US: JMP","category":["EXCHANGES"],"content":["Coinbase's approval to offer futures trading directly to its userbase opens up new revenue opportunities for the crypto exchange and illustrates \"the staying power of crypto markets in the US,\" according to a group of analysts.","The crypto exchange, which is currently involved in a legal battle with the U.S. Securities and Exchange Commission over the <a href=\"https:\/\/www.theblock.co\/post\/233286\/sec-lawsuit-against-coinbase-raises-questions-about-cryptos-market-structure\" data-v-f87c67ca=\"\">tokens listed on its platform<\/a>, received a regulatory win on Wednesday — securing <a href=\"https:\/\/www.coinbase.com\/blog\/coinbase-financial-markets-inc-secures-fcm-approval-to-bring-regulated\" data-v-f87c67ca=\"\">approval<\/a> from the National Futures Association to operate as a futures commission merchant. The designation allows subsidiary Coinbase Financial Markets to offer users access to futures trading directly.&nbsp;","\"We believe this is a watershed moment to be able to bring regulated crypto products to U.S. customers,\" <a href=\"https:\/\/www.coinbase.com\/blog\/coinbase-financial-markets-inc-secures-fcm-approval-to-bring-regulated\" data-v-f87c67ca=\"\">wrote<\/a> Coinbase product executive Greg Tusar. \"Where regulations are clear and sensible, we will work with regulators to receive the authorizations needed to offer products that align with our purpose of using crypto to update the financial system to advance economic freedom and opportunity.\"","In a note to clients, JMP analysts led by Devin Ryan noted that the approval \"adds validation\" to crypto's presence in the U.S. despite recent regulatory headwinds, adding that the news is a counterpoint to \"building fears in the market that U.S. crypto activity will be increasingly pushed outside the U.S.\"&nbsp;","Indeed, a number of crypto companies have scaled back their presence in the U.S. and are expanding into new jurisdictions. For its part, Coinbase <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/coinbase-international-daily-volume\" data-v-f87c67ca=\"\">launched<\/a> an offshore trading venue for perpetual swaps.","Still, Ryan argues that regulatory overhang might ultimately benefit Coinbase by providing it with a regulatory moat compared to less capitalized competitors. Here's JMP:&nbsp;","This development also appears to provide another good example of the regulatory moat that we believe Coinbase is forming, which we think will become even more apparent as the industry eventually moves to the other side of the uncertainty of the moment — which is our expectation.","JMP maintains an overweight rating for COIN and a price target of $107. Coinbase shares have been trading just shy of $80.&nbsp;","JMP added that the expansion of Coinbase's main platform into derivatives adds to its upside case in the long term given the derivatives market represents the vast majority of trading activity.","JMP said that revenues derived from the business could ultimately scale \"well into the hundreds of millions of dollars over the first two years, and closing the gap toward spot contribution over a longer period.\"","\"Futures trading can come with higher risks, and thus, our base case is that it will take time for the company to properly educate customers, and in turn, scale activity across the broader retail platform,\" the firm added.&nbsp;","Coinbase's journey into derivatives began in earnest with the acquisition of FairX, which it <a href=\"https:\/\/www.coinbase.com\/blog\/coinbases-path-to-creating-a-robust-and-regulated-crypto-derivatives-market\" data-v-f87c67ca=\"\">acquired<\/a> in 2022 and later rebranded to Coinbase Derivatives Exchange. Thus far, traders could only access the market via third party brokers. Coinbase expects to roll out derivatives directly to select users in the coming weeks.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"National Futures Association","content":"ORGANIZATION"},{"type":"Greg Tusar","content":"PERSON"},{"type":"$107","content":"MONEY"},{"type":"Ryan","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"earnest","content":"LOCATION"},{"type":"JMP","content":"ORGANIZATION"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"Coinbase Derivatives Exchange","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Devin Ryan","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Coinbase Financial Markets","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$80","content":"MONEY"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["ANALYST REPORTS","COINBASE"],"authors":["Frank Chaparro","The Block"]}