{"summary":"Forta Network and Blockfence say the “sleepdropping” scam has affected thousands and caused losses over $11.5 million since December 2022.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251218\/nft-sleepdrops-have-drained-11-5-million-from-ethereum-users","publishDate":"2023-09-15T13:48:27","id":9278,"type":null,"title":"NFT &#x27;sleepdrops&#x27; have drained $11.5 million from Ethereum users","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">A research report by web3 security specialists Forta Network and Blockfence detailed how a scam operation targeting <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.65%\n    <\/span><\/a> <!----><\/span><\/span> users known as \"sleepdropping\" has resulted in losses totaling $11.5 million since it was first spotted in December 2022.<\/span>","The scam operates by dispatching seemingly authentic ERC-1155 tokens, often NFTs, to unaware users. This tactic lures users to deceptive websites where they're tricked into authorizing transactions, inadvertently funneling their assets into the scammer’s possession. The culprits behind the operation remain unidentified.","According to Forta Network and Blockfence, over half a million addresses have been recipients of these misleading token airdrops. Currently, more than 20,000 users have been confirmed to have fallen victim.","In one documented instance, users received a sham Lido NFT token, presenting itself as a \"badge\" to claim an airdrop.","<span data-v-f87c67ca=\"\">An example of an NFT \"sleepdrop\" scam. Source: Forta<\/span>","On its own, the NFT doesn't compromise a user’s wallet. However, if users perceive the airdrop as legitimate, their curiosity might lead them to interact with the token, possibly claiming malicious tokens on a deceptive site.","The distribution appeared to originate from an authentic smart contract that, back in 2021, had issued an airdrop to early Lido stakers. The intricate technical aspects of ERC token contracts allow it to be manipulated, even when genuine.","\"A savvy user might review the transfer in more detail and see that the token is being transferred from the legitimate Lido: Early Stakers Airdrop account,\" Forta said in the report. \"This is a deception the scammer executes by taking advantage of the implementation of ERC token contracts.\"","The research from Forta and Blockfence identified over 100 distinct smart contracts associated with the scam operation that exhibit similar deployment patterns. The research also outlined the scam’s three primary stages: the deceptive airdrop operations sending NFTs that appear to come from trustworthy sources, websites designed to mislead users, and the malicious contracts that ultimately trick users into transferring their funds.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Forta","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"December 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"1155","content":"DATE"},{"type":"Blockfence","content":"PERSON"},{"type":"-0.65%","content":"PERCENT"},{"type":"Forta","content":"LOCATION"},{"type":"$11.5 million","content":"MONEY"},{"type":"Forta Network","content":"ORGANIZATION"}],"hashtag":["HACKS"],"authors":["Vishal Chawla","The Block"]}