{"summary":"Navigate, a web3 startup that will let its users share data and earn crypto rewards, has raised $7.625 million in a seed funding round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150448\/navigate-raises-seed-funding-crypto-alan-howard-polygon","publishDate":"2022-06-07T07:00:37","id":9282,"type":null,"title":"Alan Howard invests in Polygon-based web3 data startup Navigate","category":["WEB3"],"content":["Navigate, a Singapore-based web3 startup that will let its users share data and earn crypto rewards, has raised $7.6 million in a seed funding round.","Crypto-focused investment firm Distributed Global led the round, with Kraken Ventures, Outlier Ventures, British hedge fund billionaire <a href=\"https:\/\/www-theblockcrypto-com.cdn.ampproject.org\/c\/s\/www.theblockcrypto.com\/amp\/post\/146212\/alan-howard-crypto-interview\" data-v-f87c67ca=\"\">Alan Howard<\/a> and others participating, Navigate announced today.","Navigate is founded by a group of five people: Rumi Morales, director of investments at Digital Currency Group; Amir Husain, founder and CEO of artificial intelligence company SparkCognition; Ali Husain, director at SparkCognition; Amanda Center, manager at SparkCognition; and Moeez Hassan Qadri, a former project manager at SparkCognition.","Morales and Amir Husain are also the founding board directors of Navigate.","Navigate has raised the seed round via a simple agreement for future tokens (SAFT) sale, Center told The Block. That means investors will receive Navigate's native NVG8 token in exchange for their capital at a future date.","Navigate closed its round in the first quarter of this year, said Center. She acknowledged that the market environment has now become challenging for raising funds, but investor capital remains available \"for great ideas and good teams.\"","Navigate's business idea is to let users share data on its platform and, in return, offer crypto rewards in its NVG8 token.","But what kind of data is Navigate looking for? Center said users can upload&nbsp;data points captured by the Internet of Things (IoT) devices tracking air pollution, carbon emissions, water pressure, noise levels, utility efficiency, airspace activity, or even network signal strength.","\"While the goal of the Navigate Platform is to be the ultimate destination for contributing and sourcing several different types of critical data, initially, the marketplace will offer data vaults for predefined data types,\" Center said. \"These will include drone imagery, dashcam and street-view footage, mobility data, and weather monitoring data, among others.\"","The Navigate platform will consist of Navigate Marketplace and Navigate Dapps. The marketplace will allow users to share data and Navigate Dapps will allow developers to use that data and build decentralized applications on Navigate.","Navigate said its first application will be Navigate Maps — a map of major cities. Unlike traditional satellite-based map offerings, Navigate claims that Maps will be a community-owned app that is constantly updated using data uploaded by users.","Navigate's platform will be rolled out in phases, said Center. A beta version of its marketplace is planned to launch later this month and mainnet later this year. As for Navigate Maps, its first version is expected to launch in the third quarter of this year, said Center.","Navigate plans to launch more such applications that could be used by various types of clients, Center said. These include software companies searching for annotated images to improve machine learning algorithms, auto manufacturers willing to pay for dashcam images, climate change researchers looking for live carbon dioxide emissions or air quality index statistics and advertising firms searching for consumer feedback on products or services.","As for Navigate’s business model, if the Navigate ecosystem grows, it will increase the demand for its native NVG8 token and that could increase its price.","There are currently 12 people working for Navigate and the startup plans to stay lean for the time being, said Center.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Amir Husain","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$7.6 million","content":"MONEY"},{"type":"Ali Husain","content":"PERSON"},{"type":"Navigate Dapps","content":"ORGANIZATION"},{"type":"Navigate Marketplace and Navigate Dapps","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Moeez Hassan Qadri","content":"PERSON"},{"type":"Navigate Platform","content":"ORGANIZATION"},{"type":"SparkCognition","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Rumi Morales","content":"PERSON"},{"type":"Alan Howard","content":"PERSON"},{"type":"Kraken Ventures","content":"ORGANIZATION"},{"type":"Outlier Ventures","content":"ORGANIZATION"},{"type":"the first quarter of this year","content":"DATE"},{"type":"Navigate","content":"ORGANIZATION"},{"type":"SparkCognition; Amanda Center","content":"ORGANIZATION"},{"type":"third quarter of this year","content":"DATE"},{"type":"Navigate Maps","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}