{"summary":"Nym Technologies has partnered with the NEAR Foundation to bring privacy and encryption advancements to the NEAR ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260369\/nym-privacy-protections-near-ecosystem","publishDate":"2023-11-01T08:31:16","id":9288,"type":null,"title":"Nym to bring mixnet privacy to NEAR blockchain ecosystem","category":["LAYER 1S"],"content":["Nym Technologies has collaborated with the NEAR Foundation to incorporate end-to-end encryption and metadata privacy safeguards into the Layer 1 blockchain ecosystem.","The collaboration integrates Nym’s chain-agnostic mixnet privacy infrastructure into the NEAR ecosystem to obscure user traffic and enhance privacy for users and validators, as per an official statement. The integration will enable users to interact with NFTs, DeFi protocols, and dApps in a private manner, thereby helping to shield user activity from malicious entities.","By encrypting and concealing traffic across the NEAR ecosystem, the Nym mixnet aims to secure transactional data and personal information. It accomplishes this by segmenting data into encrypted packets and dispersing them via a global network of nodes. This method effectively obfuscates users’ online activities, making it more challenging to de-anonymize individuals through metadata pattern tracking.","Despite the advantages of public blockchains, their open nature poses privacy risks, leaving transaction data visible and personal information like IP addresses potentially exposed to surveillance and cyber attacks.","“Blockchain technology is a large change in digital communications but it’s an open secret that by their very nature, blockchains are not private,” Nym Technologies co-founder and CEO Harry Halpin said. “Nym is highly modular and the mixnet can be plugged into any blockchain, giving users and builders the confidence that they’re not being tracked and followed across the internet or painting targets on themselves for cyber criminals.”","The NEAR Foundation said it shared Nym’s vision for web3 privacy, adding that the future of the internet can only take shape successfully provided that it is private.","“Privacy is a fundamental human right and a cornerstone of the web3 vision to create a more secure, user-centric and user-empowered web,” NEAR Foundation CEO Chris Donovan added. “We are proud to support Nym and its innovative technology, which will help developers and users across the NEAR ecosystem maintain their privacy.\"&nbsp;&nbsp;&nbsp;","The NEAR ecosystem supported Nym’s early development in 2021 via the Open Web Collective — a web3 incubator sponsored by the NEAR Foundation. NEAR joins crypto projects like Monero and Aztec in now integrating with the Nym mixnet.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"” Nym Technologies","content":"ORGANIZATION"},{"type":"Monero","content":"PERSON"},{"type":"Nym Technologies","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Chris Donovan","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Nym mixnet","content":"ORGANIZATION"},{"type":"NEAR Foundation","content":"ORGANIZATION"},{"type":"Harry Halpin","content":"PERSON"}],"hashtag":[],"authors":["James Hunt","The Block"]}