{"summary":"As hype swarms in on the approval of a spot bitcoin ETF, another lingering component remains — Coinbase&#x27;s legal battle with the SEC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270979\/what-the-secs-lawsuit-with-coinbase-means-for-the-exchanges-pivotal-role-in-spot-bitcoin-etfs","publishDate":"2024-01-08T15:11:34","id":9292,"type":null,"title":"What the SEC&#x27;s lawsuit with Coinbase means for the exchange&#x27;s pivotal role in spot bitcoin ETFs","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">As hype swarms in on the potential approval of the first U.S. spot bitcoin exchange-traded fund in the coming days, another lingering, tangential component remains — Coinbase's legal battle with the Securities and Exchange Commission.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">If the SEC decides to approve a spot bitcoin ETF, as some<a href=\"https:\/\/www.theblock.co\/post\/267827\/bloomberg-analyst-explains-plan-forward-for-spot-bitcoin-etf-the-sec-has-been-backed-into-a-corner\" data-v-f87c67ca=\"\"> <span class=\"s3\" data-v-f87c67ca=\"\">analysts<\/span><\/a> expect, Coinbase would have a substantial role by providing trading and custody services for major financial firms such as BlackRock, Franklin Templeton and Grayscale Investments. It recently hired a new <a href=\"https:\/\/www.theblock.co\/post\/269714\/coinbase-changes-head-of-custody-amid-rush-for-spot-bitcoin-etf-approval\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">executive<\/span><\/a> to head its custody department.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The developments would come as the exchange has been embroiled in the separate legal battle with the SEC over the past year after the agency accused it of operating as an unregistered exchange, broker and clearing agency. Coinbase has pushed back on those claims, arguing for the case to be <a href=\"https:\/\/www.theblock.co\/post\/243128\/coinbase-plans-friday-filing-to-seek-dismissal-of-secs-case-in-its-entirety\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">dismissed<\/span><\/a> and accusing the regulator of taking a \"regulation by enforcement approach.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">SEC Chair Gary Gensler has said repeatedly that crypto exchanges need to register with his agency and said investors should be protected in the same way as they are with traditional regulated exchanges. Coinbase has called for new digital asset regulation.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Coinbase's ongoing legal battle with the SEC does not prevent it from taking on a custodial or market surveillance function, said Ashley Ebersole, general counsel at 0x Labs and a former SEC lawyer.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"If the SEC prevailed in the legal battle, and a court order concluded that Coinbase violated the law, that could complicate things, particularly for the custodial role,\" Ebersole said. \"But SEC v. Coinbase’s outcome still remains a very open question.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Nate Geraci, president of investment advisor The ETF Store, said Coinbase is in a unique position given its ongoing lawsuit with the SEC and how <\/span><span class=\"s1\" data-v-f87c67ca=\"\">&nbsp;\"heavily intertwined the company will be with spot bitcoin ETFs.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">However, Coinbase's role as a custodian and their willingness to enter into surveillance sharing agreements with major stock exchanges is something the SEC could view as a positive, Geraci said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The SEC’s ultimate desire is to have regulatory oversight of crypto exchanges. Coinbase’s integral role in spot bitcoin ETFs brings the SEC a step closer to satiating that desire,\" Geraci said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC named Coinbase, Inc. and Coinbase Global, Inc.. in the lawsuit it brought in June. The latter is the parent company of Coinbase Custody Trust Company, LLC., the custodian named for many of the spot bitcoin ETF applications, which is not itself named in the lawsuit.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A person familiar with the situation said the service provided by CCTC is at not at issue in the case with the SEC. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">The lawsuit won't have an effect on Coinbase’s custody role in spot bitcoin ETFs, the person familiar continued, while noting that the SEC has said bitcoin is not a security.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Ahead of a potential approval for a spot bitcoin ETF, SEC Chair Gensler <a href=\"https:\/\/www.theblock.co\/post\/270925\/gary-gensler-warns-of-volatile-risky-crypto-assets-as-industry-waits-for-potential-spot-bitcoin-etf-approval\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">warned<\/span><\/a> investors in a post on X on Monday morning about the risks involved with investing in crypto.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Investments in crypto assets also can be exceptionally risky &amp; are often volatile,\" he<a href=\"https:\/\/twitter.com\/GaryGensler\/status\/1744383655999385967\" data-v-f87c67ca=\"\"> <span class=\"s3\" data-v-f87c67ca=\"\">wrote<\/span><\/a>. \"A number of major platforms &amp; crypto assets have become insolvent and\/or lost value. Investments in crypto assets continue to be subject to significant risk.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Public Citizen, a consumer advocacy group, which has been critical of crypto, pushed back against Grayscale Investment's application for a spot bitcoin ETF in a December letter to the SEC.&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Corrected at 5:05 p.m. ET to more accurately reflect Coinbase's role in potential future spot bitcoin ETFs and added a missing word&nbsp;<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase, Inc.","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Coinbase Custody Trust Company","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"CCTC","content":"ORGANIZATION"},{"type":"Ebersole","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Nate Geraci","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Geraci","content":"PERSON"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Coinbase Global, Inc.","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Ashley Ebersole","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Grayscale Investment","content":"ORGANIZATION"},{"type":"5:05 p.m.","content":"TIME"},{"type":"December","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"morning","content":"TIME"}],"hashtag":["COINBASE","SPOT BITCOIN ETF"],"authors":["Sarah Wynn","The Block"]}