{"summary":"Alameda Research is suing Voyager Digital for $445.8 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206907\/ftx-linked-alameda-research-sues-voyager-digital-for-over-445m","publishDate":"2023-01-30T18:39:37","id":9294,"type":null,"title":"FTX-linked Alameda Research sues Voyager Digital for over $445M ","category":["COMPANIES"],"content":["Troubled crypto trading firm Alameda Research is suing failed crypto lender Voyager Digital for more than $445 million, seeking to recover loan repayments that it made after Voyager filed for bankruptcy protection.&nbsp;","The filing, made in a federal bankruptcy court in Delaware on Monday afternoon, noted that the total amount Alameda's lawyers want back — $445.8 million — could go higher, if evidence of more payments from Alameda to Voyager is found. They're also seeking the repayment of legal fees.&nbsp;&nbsp;","Alameda Research is one of the more than 100 FTX-linked entities that filed for bankruptcy protection in November, when the crypto behemoth collapsed after a run on its utility token. Voyager Digital had filed for bankruptcy protection several months earlier.","Alameda lawyers took aim at Voyager’s role in the collapse of FTX and Alameda in court documents, calling Voyager a “feeder fund” that did “little or no due diligence” before investing money from retail clients. Former Alameda Research CEO Caroline Ellison has pleaded guilty to criminal charges in a separate case.","Voyager Digital did not immediately respond to a request for comment.","Lawyers are seeking to recover funds that Alameda Research paid to Voyager after the crypto lender filed for bankruptcy protection in July and before Alameda Research filed for bankruptcy protection.","“Largely lost in the (justified) attention paid to the alleged misconduct of Alameda and its now-indicted former leadership has been the role played by Voyager and other cryptocurrency ‘lenders’ who funded Alameda and fueled that alleged misconduct, either knowingly or recklessly,” lawyers for FTX and Alameda wrote in the filing.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Voyager's outstanding loans to Alameda Research after Voyager's bankruptcy case began were “repaid in full,” the filing says. <span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<i data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i><span class=\"s2\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$445.8 million","content":"MONEY"},{"type":"Delaware","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"several months earlier","content":"DATE"},{"type":"Voyager","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"$445 million","content":"MONEY"},{"type":"Alameda","content":"ORGANIZATION"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"afternoon","content":"TIME"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}