{"summary":"Layer 2 blockchain Manta Pacific, part of the modular Manta Network, is transitioning from using a modified version of Optimism’s OP Stack by Caldera to become a zkEVM validium using Polygon’s Chain Development Kit.\nManta Network developer p0x labs said the “Polygon CDK sets standards in Layer 2 design and execution that, long-term, OP Stack cannot meet.”","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256348\/manta-pacific-migration-optimism-polygon-zkevm-ethereum-layer-2","publishDate":"2023-10-16T12:31:04","id":930,"type":null,"title":"Manta Pacific to migrate from Optimism to Polygon tech as a zkEVM Layer 2","category":["Layer 2s and Scaling"],"content":["Manta Pacific, a Layer 2 blockchain for zero-knowledge-enabled apps within the modular Manta Network, is transitioning from using a modified version of Optimism’s OP Stack by Caldera to Polygon’s Chain Development Kit.","The Manta Pacific <a href=\"https:\/\/www.theblock.co\/post\/250538\/manta-pacific-mainnet\" data-v-f87c67ca=\"\">mainnet alpha launch<\/a> was only announced last month, but the Layer 2 is already migrating to become a zkEVM validium. \"Polygon's CDK sets standards in Layer 2 design and execution that, longterm, OP Stack cannot meet,\" Manta Network developer p0x labs said in a statement.","\"The transition to zkEVM is a necessity for Manta Pacific to continue providing the best-in-class experience for developers and users,\" Manta Network co-founder Victor Ji added. \"Polygon's CDK enables us to transition quickly and smoothly using a proven, robust system for deploying zkEVMs.\"","The decision to migrate to using the Polygon CDK is designed to enable faster finality, enhanced security and broader interoperability with Ethereum, according to p0x labs.","ZK proofs ensure transaction finality in mere seconds or minutes, rather than the days-long wait with other systems, and that's achieved without compromising security by relying on mathematical proofs over socio-economic incentives.","Manta Pacific's ZK dapp ecosystem also requires a modular and sovereign framework, something the Polygon CDK's configurability and adaptability align with.","Finally, Manta Pacific is interoperable with other chains built with Polygon’s CDK through a trustless ZK bridge to Ethereum, making atomic Layer 2-to-Layer 2 transactions possible and expanding the liquidity options for dapps on Manta Pacific, the team stated.","\"ZK knows ZK,\" Polygon co-founder Sandeep Nailwal said. \"Manta Pacific is a unique hub of ZK-centered dapps and well-positioned to join an expanding Polygon ZK-powered Layer 2 ecosystem. The network effects are undeniable, meaning expanded access to unified blockspace.\"","Manta Pacific aims to simplify ZK dapp development, eliminating the need for developers to grapple with complex cryptography. With its Universal Circuits library, Ethereum Solidity developers can enable ZK features in their privacy-centric DeFi and web3 applications with just a few lines of code.","Manta Pacific already hosts zero knowledge-circuit-enabled applications, including the on-chain game zkHoldEm, verified credential protocol zkMe and data verification protocol zkPass.","\"As core devs building ZK tech, it is important to align Manta Pacific’s best-in-class ZK ecosystem with all the upsides of ZK infrastructure — and to do so in the EVM-equivalent environment of the Polygon CDK, which means existing dev tooling works out-of-the-box,\" p0x labs added.","Manta Pacific's transition to becoming a zkEVM validium is the first step toward its full mainnet, with an integration with Celestia's data availability layer to reduce transaction fees and information on the mainnet launch specification expected over the coming weeks.","Layer 2s already being developed using the Polygon CDK include <a href=\"https:\/\/www.theblock.co\/post\/221420\/polygon-to-help-develop-immutable-zkevm-secured-by-matic-stakers)\" data-v-f87c67ca=\"\">Immutable zkEVM<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/238140\/idex-unveils-a-zkevm-layer-2-chain-based-on-polygon-supernets\" data-v-f87c67ca=\"\">IDEX<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/241693\/palm-network-polygon\" data-v-f87c67ca=\"\">Palm Network<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/250505\/astar-network-zkevm-ethereum-layer-2-polygon\" data-v-f87c67ca=\"\">Astar zkEVM<\/a>.","Polygon Labs proposed <a href=\"https:\/\/www.theblock.co\/post\/235698\/polygon-labs-proposes-to-upgrade-flagship-sidechain-to-zkevm-validium-layer-2\" data-v-f87c67ca=\"\">upgrading<\/a> its own flagship Polygon PoS sidechain to become a zkEVM validium in June.","Clarifying the distinction between the validium and existing zkEVM technologies at the time, Nailwal told The Block that “this is an upgrade of the Polygon PoS chain to a zkEVM 'Validium'. That means the data availability [for apps] will be with the validators, whereas the existing zkEVM rollups have data availability directly on Ethereum.\"","In July p0x labs <a href=\"https:\/\/www.theblock.co\/post\/240481\/manta-network-p0x-labs-raises-25-million-layer-2-zk-apps\" data-v-f87c67ca=\"\">raised $25 million<\/a> in a Series A funding round led by Polychain Capital.","Last week, Polygon Labs co-founder Sandeep Nailwal also <a href=\"https:\/\/www.theblock.co\/post\/255841\/polygon-labs-nailwal-proposes-zk-apecoin-ethereum-layer-2\" data-v-f87c67ca=\"\">proposed<\/a> that the ApeCoin DAO develop and maintain its own Ethereum Layer 2, dubbed \"ApeChain\" using its CDK."],"hashtag":["ETHEREUM","OPTIMISM","POLYGON","ZKEVM"]}