{"summary":"Asset manager 21Shares has launched two new product lines aimed specifically at the bear market to give investors more options during the downturn.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171638\/21shares-launches-ethereum-exchange-traded-product-tailored-to-the-bear-market-exclusive","publishDate":"2022-09-21T06:00:02","id":9306,"type":null,"title":"21Shares launches Ethereum exchange-traded product tailored to the bear market: Exclusive","category":["MARKETS"],"content":["Crypto asset manager 21Shares is launching its latest products for investors navigating the downturn in crypto markets.","21Shares Short Ethereum ETP (SHETH) and the Ethereum Core ETP (CETH) are part of the company’s “Crypto Winter Suite.” The asset manager launched these products in light of the potential for a prolonged period of market decline.","The SHETH ETP will provide a ­-1x return on the performance of ether over a single day. The short exposure is obtained through borrowing ether and simultaneously selling it. This mirrors the firm's 21Shares Short Bitcoin ETP <a href=\"https:\/\/21shares.com\/product\/sbtc\/\" data-v-f87c67ca=\"\">SBTC product,<\/a> launched in July.","Meanwhile, the CETH product will look to provide investment exposure to ether at low cost. The product's total expense ratio of 21 basis points, or 0.21%, is 44 basis points lower than other<span id=\"m_5955837314595307163m_1985899864687932134gmail-docs-internal-guid-d7e2a79f-7fff-4dbd-a2bf-5a87dcfaaf66\" data-v-f87c67ca=\"\"> physically-backed ether ETPs on the market.<\/span>","The CETH product can participate in collateralized lending in order to offer one of the lowest cost Ethereum ETPs available. Any of the lending agreements are executed through institutional-grade lending partners, with all loans being overcollateralized and regularly monitored to protect the interest of shareholders, per the firm's press release.&nbsp;","Arthur Krause, director of ETP product at 21Shares said the firm wanted to offer investors more options to enter the asset class with different products, “especially given the level of interest in Ethereum today,” he said.","Krause was alluding to last week's <a href=\"https:\/\/www.theblock.co\/post\/169299\/ethereum-activates-the-merge-as-it-shifts-to-proof-of-stake\" data-v-f87c67ca=\"\">Merge<\/a> – a technical upgrade which saw Ethereum change its consensus mechanism to proof 0f stake. While the event passed without a hitch, some commentators told The Block it was case of \"buy the rumour, sell the news\" as <a href=\"https:\/\/www.theblock.co\/post\/170527\/bitcoin-slips-below-20000-ether-teeters-on-the-edge-of-1500-after-the-merge\" data-v-f87c67ca=\"\">prices have plunged<\/a> in the aftermath.&nbsp;","Ether was down a little over 17% over the past week, at the time of writing per <a href=\"https:\/\/www.coinbase.com\/price\/ethereum\" data-v-f87c67ca=\"\">data<\/a> via Coinbase. Crypto markets were trending lower on Wednesday ahead of the U.S. Federal Reserve's latest decision on interest rates, expected at 4:15pm ET.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"0.21%","content":"PERCENT"},{"type":"Arthur Krause","content":"PERSON"},{"type":"4:15","content":"TIME"},{"type":"2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"17%","content":"PERCENT"},{"type":"Krause","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"SHETH ETP","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"ETP","content":"ORGANIZATION"},{"type":"Crypto Winter Suite","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Adam Morgan McCarthy","The Block"]}