{"summary":"Crypto exchange Gemini has reportedly undertaken another round of layoffs after laying off 10% of its staff in early June.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158288\/crypto-exchange-gemini-undertakes-second-round-of-layoffs-techcrunch","publishDate":"2022-07-18T17:01:08","id":9311,"type":null,"title":"Crypto exchange Gemini undertakes second round of layoffs: TechCrunch","category":["COMPANIES"],"content":["Crypto exchange startup Gemini has laid off more staff, according to a report from TechCrunch.","Gemini reportedly moved to trim its staff further due to \"extreme cost cutting.\"","\"The company had not widely communicated the extent of Monday’s layoffs internally, leaving employees to speculate on the exact number of co-workers laid off in this most recent downsizing,\" the publication said. \"A source close to the company noted that there was a reduction of 7%, or 68 members, in Gemini’s companywide Slack channel Monday morning.\"","In June, the exchange laid off 10% of its workforce, <a href=\"https:\/\/www.theblock.co\/post\/149813\/crypto-exchange-gemini-slashes-about-10-of-its-work-force\" data-v-f87c67ca=\"\">reportedly<\/a> for the first time since its inception in 2014. Gemini founders cited a \"crypto winter\" for the first round of layoffs.&nbsp;","According to a post on July 14 on the anonymous professional network Blind, the company planned to cut down headcount from 950 employees to 800, which is around 15% of its workforce.","The news comes after a slew of recent layoffs within the industry. Last week, OpenSea, a popular NFT marketplace,<a href=\"https:\/\/www.theblock.co\/post\/157645\/nft-marketplace-opensea-lays-off-about-20-of-its-team\" data-v-f87c67ca=\"\"> reduced<\/a> its employee headcount by about 20%. Crypto.com, BlockFi, and Coinbase are just a few other firms that have moved to <a href=\"https:\/\/www.theblock.co\/post\/152059\/crypto-firms-have-laid-off-more-than-1500-people-in-the-last-two-months-as-downturn-fears-persist\" data-v-f87c67ca=\"\">reduce<\/a> staff recently.&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"2014","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"July 14","content":"DATE"},{"type":"morning","content":"TIME"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"15%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"20%","content":"PERCENT"}],"hashtag":["GEMINI","LAYOFFS"],"authors":["Anushree Dave","The Block"]}