{"summary":"The SEC acted in bad faith in its conduct in a case it brought against crypto startup DEBT Box, a federal judge ruled on Monday. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283229\/utah-judge-denies-secs-motion-to-dismiss-debt-box-case-imposes-sanctions","publishDate":"2024-03-18T18:45:59","id":9312,"type":null,"title":"Utah judge denies SEC&#x27;s motion to dismiss DEBT Box case, imposes sanctions","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A federal judge ruled on Monday that the Securities and Exchange Commission acted in bad faith and must pay sanctions, including attorneys' fees and costs, stemming from a case it brought against crypto startup DEBT Box.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Utah U.S. District Court Judge Robert Shelby said the SEC would have to pay legal costs arising from a temporary restraining order imposed on Digital Licensing Inc., doing business as DEBT Box, <a href=\"https:\/\/www.theblock.co\/post\/243043\/sec-gets-restraining-order-against-firm-accused-of-crypto-scheme\" data-v-f87c67ca=\"\">last year<\/a>. According to the court order, the judge also denied the SEC's move to dismiss the case without prejudice. The case involved the judge criticizing the SEC's misleading statements and the agency admitting that it had fallen short of expectations.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Throughout the 80-page <a href=\"https:\/\/ecf.utd.uscourts.gov\/doc1\/183a16423366\" data-v-f87c67ca=\"\">order<\/a>, Judge Shelby criticized the SEC's conduct in getting the temporary restraining order (TRO), which included an asset freeze and a court-appointed receiver to assume control of the company.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It expressly traded on its special standing as a federal agency—reminding the court it had been granted this relief several times in the past ten years—to demonstrate it could be trusted when asking for this tremendous exercise of judicial authority,\" Shelby said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The court granted the TRO, which caused assets to be frozen and \"lives were upended,\" Shelby said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"In the end, once Defendants had notice and an opportunity to respond, each purportedly factual pillar the Commission constructed to make the required showing of irreparable harm crumbled under scrutiny,\" Shelby said. \"It was not just a single imprecise statement or inadvertent misstatement. Each piece of support the Commission offered in seeking the TRO—and then later reiterated in defending the TRO—proved to be some combination of false, mischaracterized, and misleading.\"&nbsp;<\/span>","An SEC spokesperson said the agency was reviewing the decision, in an emailed statement to The Block.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC filed a motion to <a href=\"https:\/\/www.theblock.co\/post\/275276\/sec-plans-to-dismiss-case-against-debt-box-after-admitting-inaccurate-statements-were-made\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">dismiss<\/span><\/a> the lawsuit without prejudice in January, meaning the regulator could have refiled its case. Judge Shelby denied that on Monday.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The SEC <a href=\"https:\/\/www.theblock.co\/post\/269087\/sec-admits-it-made-inaccurate-statements-in-utah-crypto-case\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">admitted<\/span><\/a> in late December that it made inaccurate statements and said it \"fell short\" of the expectations to be accurate and candid in court. Judge Shelby had criticized the agency's lawyers and ordered the SEC to explain \"false or misleading\" statements after it claimed the company was trying to move assets overseas to escape the regulator's jurisdiction.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The SEC's suit against DEBT Box alleged it defrauded thousands of investors of at least $49 million by offering customers so-called \"node licenses\" to receive revenue from mining 11 tokens, though they were never mined.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Digital Licensing Inc.","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"$49 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"TRO","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Robert Shelby","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Utah U.S. District Court","content":"ORGANIZATION"},{"type":"Shelby","content":"PERSON"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}