{"summary":"Launched in June by crypto market maker Wintermute, DeFi aggregator Bebop will support the Polygon blockchain network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184010\/wintermute-incubated-defi-aggregator-bebop-expands-to-polygon","publishDate":"2022-11-08T08:00:53","id":9315,"type":null,"title":"Wintermute-incubated DeFi aggregator Bebop expands to Polygon","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Bebop, Wintermute’s decentralized finance (DeFi) aggregator, will extend platform support to the Polygon blockchain network.<\/span>","<span data-v-f87c67ca=\"\">Bebop, a decentralized finance (DeFi) aggregator, is set to launch services on the Polygon blockchain network.<\/span>","<span data-v-f87c67ca=\"\">Launched in June and i<\/span><span data-v-f87c67ca=\"\">ncubated by leading crypto market maker Wintermute, Bebop currently<\/span>&nbsp;boasts a 30,000 member strong Ethereum based token-trading platform.","With its new Polygon-based services, Bebop hopes to take advantage of lower transaction fees, greater scalability, and a sustainable proof-of-stake model, the company said in a press release shared with The Block.","<span data-v-f87c67ca=\"\">“We believe that affordability on Polygon is essential for reaching a wider group of users who find Ethereum gas fees excessive,” the Bebop team told The Block in an email.<\/span>","<span data-v-f87c67ca=\"\">Initially, Bebop will only extend isolated support for Ethereum and Polygon, but the team said the platform’s “long-term vision is to enable transfers of value across the multi-chain world” and to “offer a seamless experience by abstracting blockchain complexities from the user and creating a product that is easy and fun to use.”<\/span>","<span data-v-f87c67ca=\"\">Swapping tools on Bebop’s trading platform allow users to avoid slippage and reduce the number of transactions needed to rebalance portfolios, consolidate funds, or exit positions — features which, according to Bebop head of product Katia Banina, will be enhanced by relatively low Polygon network fees.<\/span>","<span data-v-f87c67ca=\"\">“By DeFi standards, Polygon fees are negligible, which is paramount for delivering this efficiency to all users, for any transaction size,” Banina noted in the release.<\/span>","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/post\/150978\/crypto-trading-firm-wintermute-has-been-incubating-a-new-decentralized-exchange-aggregator\" data-v-f87c67ca=\"\">Unveiled<\/a> by Wintermute<\/span><span data-v-f87c67ca=\"\">&nbsp;after a relatively stealthy incubation, Bebop launched with the goal of offering institutional trading tools to retail traders in crypto. Ultimately, Bebop will expand to become a cross chain DeFi trading&nbsp;platform, said Wintermute founder Evgeny Gaevoy, when the project first launched.<\/span>","<span data-v-f87c67ca=\"\">In order to realize Gaevoy's&nbsp;ambitions, Bebop is first focused on integrating cross-chain swaps between Ethereum and Polygon.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Evgeny Gaevoy","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Bebop","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Katia Banina","content":"PERSON"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"Gaevoy","content":"PERSON"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}