{"summary":"Vault, a music platform that offers &quot;digital music collectibles&quot; raised a $4 million Series A led by Placeholder VC. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210052\/web3-music-platform-vault-series-a","publishDate":"2023-02-09T09:00:22","id":9319,"type":null,"title":"Web3 music platform Vault raises $4 million Series A led by Placeholder VC","category":["DEALS"],"content":["Vault, a music platform built with web3 technology, raised a $4 million Series A led by Placeholder VC.&nbsp;","The equity round closed in the third quarter of last year at a $42 million pre-money valuation, said founder and CEO Nigel Eccles in an interview with The Block. It also featured participation from consumer technology-focused investors such as Alleycorp and Bullpen Capital, which backed Eccles' and co-founder Rob Jones' previous endeavor FanDuel, a sports betting platform.&nbsp;","Having previously raised seed funding as a \"mobile Discord platform\" called Flick, the founders pivoted the startup in the summer of 2021. Now, Vault enables artists to release so-called digital music collectibles (DMCs) that rely on NFTs on the Solana blockchain to allow fans to access extra content and open up an extra revenue stream for artists.&nbsp;","\"One artist dropped in stems (a type of audio file that breaks down a complete track into individual mixes) of drums, vocals, etc so you could listen to those separately or you could even remix [the track] yourself,\" said Eccles. \"A lot of artists have tons of voice recordings — a melody or a lyric that they test out — and a lot of them want to share that with their fans.\"&nbsp;","But don't call Vault NFT-gated. Eccles eschewed the term, saying that — unlike other solutions — users usually aren't aware of the underlying technology unless they opt-in for self-custody.&nbsp;","\"I would say that probably 95% of our users aren't aware of anything that's going on underneath,\" he said. \"So what happens is that someone will purchase with a credit card, PayPal or in-app and we'll mint an NFT, create a wallet and put that NFT in the wallet.\"","Eccles admitted that the current perception of NFTs in the music industry isn't exactly stellar and said he initially avoids talking about crypto when convincing artists to list a project on Vault.&nbsp;","\"I would say that a year ago when we talked a lot about crypto it was very hard to get into these conversations [with artists] — we got mislabeled as this music NFT platform,\" he explained. \"Now we go to them and say think of this as a digital boxset... where fans can download and listen to it on their phone immediately and they could see video and all this other content.\"&nbsp;","It's only later on that Vault talks crypto with artists, Eccles said, noting that Fletcher, an upcoming pop singer that recently listed a project on Vault, is aware of the underlying technology. During her most recent tour, the singer released digital collectibles of some of her tracks — the highest selling of which dictated which would be performed.&nbsp;","Part of the funding will be used to scale up its own proprietary protocol, which will be opened up to allow third parties to support the Vault format.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Vault","content":"ORGANIZATION"},{"type":"$4 million","content":"MONEY"},{"type":"Rob Jones","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Bullpen Capital","content":"ORGANIZATION"},{"type":"Fletcher","content":"PERSON"},{"type":"third quarter of last year","content":"DATE"},{"type":"95%","content":"PERCENT"},{"type":"summer of 2021","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Nigel Eccles","content":"PERSON"},{"type":"Vault","content":"LOCATION"},{"type":"Eccles","content":"PERSON"},{"type":"$42 million","content":"MONEY"},{"type":"Solana","content":"PERSON"}],"hashtag":["SERIES A"],"authors":["Tom Matsuda","The Block"]}