{"summary":"BitDAO’s community will decide whether to invest part of its treasury to earn a yield on the Ichi platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183073\/bitdao-voting-on-proposal-to-earn-yield-from-part-of-its-2-1-billion-treasury","publishDate":"2022-11-04T10:24:10","id":9323,"type":null,"title":"BitDAO voting on proposal to earn yield from part of its $2.1 billion treasury","category":["GOVERNANCE"],"content":["The BitDAO community is currently voting on a governance proposal that would seek&nbsp;to generate a yield from a portion of the organization’s $2.1 billion treasury.","The goal of the proposal is to create yields for holders of BitDAO’s native token, called bit, while also expanding its liquidity on Uniswap.","BitDAO holds the second-largest DAO treasury behind Uniswap. Unlike other DAOs built to administer DeFi projects, <a href=\"https:\/\/www.theblock.co\/post\/162698\/bitdao-to-fund-africadao-with-20-million-for-web3-adoption-in-africa\" data-v-f87c67ca=\"\">BitDAO is an investment DAO<\/a>. The organization says its goal is to promote crypto adoption on a global scale by issuing grants to projects.","The plan would involve depositing a portion of its <a href=\"https:\/\/deepdao.io\/organization\/30d12da9-5fd5-411a-8ca8-1422a4ce1373\/brainstorm\" data-v-f87c67ca=\"\">$2.1 billion<\/a> treasury into its token vault on the Ichi platform. Ichi is a DeFi protocol that enables DAOs to mint their own stablecoins, called “oneTokens,” in exchange for their deposited collateral. Each oneToken created in this process is pegged to the U.S. dollar. Projects that mint their own white-label stablecoins from Ichi do so under a specific minting ratio determined by the protocol. Ichi offers these projects an internal rate of return (IRR) that allows projects to earn yields on their deposits.","According to the proposal, BitDAO community members have four deposit options to consider, ranging from 1 million to 20 million bit tokens. This would put the deposit outlay from $425,000 to $8.5 million at the current bit token spot price. The community can also decide to vote no, in which case, the DAO would not go through with the plan.","The vote succeeding is not the only requirement for the deposit plan to happen. According to the proposal, the Ichi DAO would have to commit to a 15% IRR on the BitDAO treasury deposit for the first year. Ichi’s IRR for bit token deposits is <a href=\"https:\/\/app.ichi.org\/\" data-v-f87c67ca=\"\">currently<\/a> at 12%.","The vote is scheduled to end on Nov. 10. Early voting <a href=\"https:\/\/snapshot.org\/#\/bitdao.eth\/proposal\/0xfd69ce71186ed20b9b500e9dd607fd584fa13fefa4ef76c3cb8671f6a4414eaf\" data-v-f87c67ca=\"\">figures<\/a> show only three wallets participating, with two voting for a 20 million bit token deposit, while one favors depositing 10 million bit tokens.","BitDAO’s vote is the latest example of DAOs looking to put their treasuries to work. Inadequate treasury management has seen <a href=\"https:\/\/www.theblockcrypto.com\/news+\/163745\/daos-wrestle-with-how-to-winterize-their-war-chests\" data-v-f87c67ca=\"\">DAO treasuries decline<\/a> amid the current bear market, falling as low as $8 billion in the summer from a high of $13 billion last November.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"IRR","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"1 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$8.5 million","content":"MONEY"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Nov. 10","content":"DATE"},{"type":"$425,000","content":"MONEY"},{"type":"summer","content":"DATE"},{"type":"$2.1 billion","content":"MONEY"},{"type":"$8 billion","content":"MONEY"},{"type":"$13 billion","content":"MONEY"},{"type":"Ichi DAO","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}