{"summary":"Adobe is introducing a Photoshop feature that allows users to prepare images as non-fungible tokens (NFTs), which will include content credentials that marketplaces like OpenSea can display on their websites for each asset. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/122118\/adobe-partners-with-opensea-and-other-nft-marketplaces-to-display-content-credentials","publishDate":"2021-10-26T18:57:55","id":9325,"type":null,"title":"Adobe partners with OpenSea and other NFT marketplaces to display content credentials","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">Adobe is introducing a Photoshop feature that allows users to prepare images as non-fungible tokens (NFTs), which will include content credentials that marketplaces like OpenSea can display on their websites for each asset.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Adobe chief product officer Scott Belsky revealed the so-called “prepare as NFT” option<\/span><a href=\"https:\/\/www.theverge.com\/22740442\/adobe-scott-belsky-interview-nft-photoshop-blockchain-creator-economy\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> during a conversation<\/span><\/a><span data-v-f87c67ca=\"\"> with The Verge’s Nilay Patel, via the Decoder podcast. The tool will allow people to see attribution for the creator of the NFT, in addition to who minted it, Belsky told Patel. Adobe will use an open-source method of cryptographically signing the image with the creator's identity, he added.<\/span>","The new feature is available today in the Photoshop desktop app as a public beta, Andy Parsons, the director of the Content Authenticity Initiative at Adobe, told The Block in an email.&nbsp;","\"Our goals with NFTs at this stage are simple: How do we help creatives get credit for their work, and how do we help folks who are already creating NFTs showcase their work, no matter where they mint it?\" Parsons said. \"This gives collectors and marketplaces valuable information about the true creator of a work of art.\"","<span data-v-f87c67ca=\"\">The new NFT option in Photoshop will allow creators to link their social media and wallet information to the image. <\/span>","<span data-v-f87c67ca=\"\">“By adding your social media and wallet addresses to your content credentials you can further assure consumers that you are indeed the creator of your content,” Adobe said in its press release. “A crypto address is also useful if someone wishes to mint their work as crypto art.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">OpenSea confirmed to The Block that it will be <a href=\"https:\/\/opensea.io\/blog\/announcements\/strengthening-digital-provenance-with-opensea-and-adobe\/\" data-v-f87c67ca=\"\">displaying this new content credential<\/a> on its platform. It shows a screenshot of how those content credentials look in a blog post, which includes a link to the crypto wallet associated with whoever created the image. A blue \"match\" button will appear if that wallet address matches the one that minted the image.<\/span>","<span data-v-f87c67ca=\"\">\"This is going to be amazing for creators, collectors and buyers to have an additional layer of features that increase the transparency even further,\" Ryan Foutty, <\/span><span data-v-f87c67ca=\"\">OpenSea's vice president of business development, told The Block in an interview.<\/span>","<span data-v-f87c67ca=\"\">Adobe confirmed in a <a href=\"https:\/\/blog.adobe.com\/en\/publish\/2021\/10\/26\/adobe-unleashes-content-attribution-features-photoshop-beyond-max-2021.html\" data-v-f87c67ca=\"\">press release<\/a> that it is also partnering with the marketplaces KnownOrigin, Rarible and SuperRare so that potential buyers can see whether the creator and minter of the NFT match.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“While using Adobe Photoshop, creators can use content credentials to capture edits and identity information as well as attach attribution rights directly to an image, which can be exported as an NFT,” OpenSea told The Block in an email. This information will serve as metadata attached to the NFT, the startup said.<\/span>","<span data-v-f87c67ca=\"\">Potential NFT buyers can verify these credentials by <\/span><a href=\"https:\/\/verify.contentauthenticity.org\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">uploading the image<\/span><\/a><span data-v-f87c67ca=\"\"> using a dedicated tool from the Content Authenticity Initiative (CAI), a project originally launched by Adobe, Twitter and The New York Times. Those content credentials will also show up when viewing NFTs through artists’ Behance portfolios, with links to the marketplace for potential buyers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Adobe is rolling out this feature in response to demand for identifying the <a href=\"https:\/\/www.theverge.com\/2021\/3\/20\/22334527\/nft-scams-artists-opensea-rarible-marble-cards-fraud-art\" data-v-f87c67ca=\"\">original creator of the content<\/a> displayed with an NFT, since it’s so easy to copy any image and then mint it on the blockchain.<\/span>","<span data-v-f87c67ca=\"\">Belsky told Patel that the cryptographic signature “points to an IPFS (InterPlanetary File System)-powered system that shows you the attribution data,\" and that the tool also uses decentralized storage.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nilay Patel","content":"PERSON"},{"type":"Adobe","content":"ORGANIZATION"},{"type":"Patel","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"minter","content":"PERSON"},{"type":"Andy Parsons","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"The New York Times","content":"ORGANIZATION"},{"type":"Scott Belsky","content":"PERSON"},{"type":"Content Authenticity Initiative","content":"ORGANIZATION"},{"type":"Ryan Foutty","content":"PERSON"},{"type":"Belsky","content":"PERSON"},{"type":"Rarible","content":"PERSON"},{"type":"Adobe Photoshop","content":"ORGANIZATION"},{"type":"Parsons","content":"PERSON"}],"hashtag":["OPENSEA"],"authors":["Kristin Majcher","The Block"]}