{"summary":"DeFiLlama’s new DEX aggregator beta launched on Jan. 2, and has seen a surge in volume since it launched, ranking ahead of platforms such as Metamask and Coinbase.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199268\/defillamas-new-dex-aggregator-passes-metamask-and-coinbase-volume-over-past-24-hours","publishDate":"2023-01-04T17:00:45","id":9327,"type":null,"title":"DeFiLlama&#x27;s new DEX Aggregator is showing early signs of adoption","category":["DEFI"],"content":["Data analytics platform DeFiLlama’s new decentralized exchange aggregator, an application that optimizes transaction costs for swaps, saw the second highest volume across all DEX aggregators that use 0x in the past 24 hours, <a href=\"https:\/\/explorer.0x.org\/apps?period=day\" data-v-f87c67ca=\"\">according to the 0x platform<\/a> that aggregates liquidity across the majority of the top DEXs.","DeFiLlama has slowly become one of the most popular data platforms in crypto and is now making a push into decentralized finance. The DEX aggregator is still in beta but has shown promising signs since its launch earlier this week, bouncing between the number one and number two 24-hour volume spots on the 0x explorer.","“Impressive launch,” Eliézer Ndinga, director of research at 21.co, <a href=\"https:\/\/twitter.com\/elindinga\/status\/1610624536105439232\" data-v-f87c67ca=\"\">wrote<\/a> on Twitter, noting that the aggregator had been launched without incentives including a liquidity mining program. “One thing is clear — users want a platform with data analytics, form their own opinions, and act on them with a click of a button.”","DeFiLlama says it allows users to obtain the best price on swaps across eight other aggregators that include 1inch and Matcha. The aggregator doesn’t charge users fees, and it has integrations with the majority of EVM-compatible chains. The aggregator also allows users to transact privately by routing transactions through its own server, which doesn’t store IP data.","Many DEXs have turned to liquidity mining programs over the past two years to try and attract users. That model, however, hasn’t been conducive to long-term growth and sustainability, as Sushiswap noted in its latest <a href=\"https:\/\/www.theblock.co\/post\/198569\/sushiswap-tries-to-breathe-life-back-into-protocol-with-new-tokenomics-proposal\" data-v-f87c67ca=\"\">tokenomics revamp proposal<\/a>. DeFiLlama took a different approach, first growing its free-to-use data platform and then launching DeFi applications once it had a strong user base.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nDeFiLlama’s DEX aggregator is currently ranking ahead of Coinbase’s decentralized exchange service, which utilizes Uniswap behind the scenes and represents just a small portion of the total volume the centralized exchange sees per day.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">Update: Clarified DeFiLlama's DEX aggregator is ranking ahead of Coinbase's decentralized exchange service, not the total exchange volume.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Matcha","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Eliézer Ndinga","content":"PERSON"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}