{"summary":"On this episode of The Scoop Jay Biancamano speaks about his time in the US equity market structure, explained why the firm isn&#x27;t in the bitcoin custody business yet, and how blockchain can make multi-asset trading finally a reality.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/44203\/jay-biancamano-state-street","publishDate":"2019-10-24T10:45:41","id":9328,"type":null,"title":"A conversation with Jay Biancamano, Managing Director at State Street","category":["PODCASTS"],"content":["<em data-v-f87c67ca=\"\">The following transcript is taken from episode twenty five of The Scoop, The Block’s flagship podcast. Listen below, and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>,&nbsp;<a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>,&nbsp;<a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>,&nbsp;<a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback and revision requests to&nbsp;<a href=\"\/cdn-cgi\/l\/email-protection#1c6c73787f7d6f685c6874797e70737f777f6e656c6873327f7371\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"c2b2ada6a1a3b1b682b6aaa7a0aeada1a9a1b0bbb2b6adeca1adaf\">[email&nbsp;protected]<\/span><\/a>.<\/em>","<em data-v-f87c67ca=\"\"> State Street, one of the largest custody banks in the world is yet to launch a service to store crypto assets but that doesn't mean the Boston based firm isn't making waves when it comes to digital assets. On this episode of The Scoop we spoke to <a href=\"https:\/\/www.linkedin.com\/in\/jay-biancamano-7a96401\" data-v-f87c67ca=\"\">Jay Biancamano <\/a>, managing director of digital product development and innovation at the firm about the opportunity State Street sees in the market. The 25 year plus financial services veteran also shared stories about his time in the US equity market structure, explained why the firm isn't in the bitcoin custody business yet and how block chain can make multi-asset trading finally a reality. I hope you enjoy the episode.<\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK1281034409\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>Ladies and gentlemen thank you so much for joining us on what is a very special episode of The Scoop. I am joined of course by Ryan Todd researcher at The Block and all the way from Hillsboro New Jersey, James Biancamano. He's part of State Street's Global Technology Services business leading a lot of the folks at the company at State Street, one of the largest custodial banks in the world leading folks on digital assets, blockchain and some of the people who are thinking and kicking the tires on Bitcoin but as we talked about before we turned the mics on, Jay is interested more so in what blockchain and tokenization can do for a myriad of assets as opposed to just the bitcoin and why is that?","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>We're not talking long or short or pro or con Bitcoin here we are we're talking digital assets and Bitcoin is the first iteration of a global digital asset. So if you think about how the way Bitcoin trades our thesis is that all assets will eventually trade on a blockchain right. They'll all be digital assets. So if you think about that and you think about a global custodian like State Street or you think about a large exchange like NASDAQ or New York Stock Exchange it changes the way institutions individuals and pretty much the global economy trades going forward. So for us it's more of a future play to look at you know how this market is going to evolve and if you if we went back two years ago obviously the conversation was all Bitcoin. Bitcoin was going from you know fifteen hundred to fifteen thousand dollars and we had to focus refocus people say no it's not about bitcoin because bitcoins are single assets like saying you know everyone trades apple right but there is 5000 other issues. And in theory that's just equities. There's bonds there is is there there's loans and there's also these emerging assets right of democratization of assets. So we're we're thinking of this in a broader scope we're thinking about this as a way the market is going to shift is going to shift overnight. No but there's a stark precedent. We could talk about that and that's how we're looking at it.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>And when we think about I think when I talk to people in the context of cryptocurrency and State Street they're one of the firms that is mentioned when talking about what what is holding institutional investors back from diving into cryptocurrency markets. They're not going to custody with some firm with bit in their name or that's registered in South Dakota not to pick on our good friends at BitGo but it's a reality. I think they want State Street to be to be that brand name behind whatever custodian solution there is. With that being said I guess my question is that doesn't seem to be the focus casting you know cryptocurrency specifically Mike is it or is it not a focus for states right.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>It's a piece of it. It's a piece of it. I mean obviously when you look at certain types of tokens utility tokens are out of scope but crypto currencies could be in scope digital assets securitized assets are in scope so those are the things we're looking at. You know we're intensely led by our clients and our clients right now the ones we deal with are not investing in crypto currencies and for a number of reasons obviously regulation has to do with it and custody is one piece of it. We know that the S.E.C. had come out and said you know a traditional custodian gets into the game. You know we have to look more closely at that. But for somebody like State Street we're led by our client. So you know the way we do custody and I tell people you know there's nothing sexy or really original about custody it's what we do for our clients assets the way we service them the way we provide funding that's really what we do. So we think about bitcoin the way it's custody right now. I mean we're not going to have somebody with a gun and a you know a laptop that's not connected electronically to anything for cryptocurrency. That's not how we do things. What we want to do is make sure our clients are seamlessly able to invest in any asset traditional digital. And we're able to provide those services like we do everything else so people when they ask you know what is this going to mean to me especially asset managers what is this going to mean to me you know going you know in the future if everything's digitized and I kind of say hopefully nothing. Hopefully you know the nuts and bolts that you're used to. We're in the background we're taking care of that. And you know we want to make your experience as seamless as possible. So we will if and when digital that's a more of if than a when. But we know when digital assets are in vogue and our clients are moving in that direction we want to be prepared to move in that direction as well.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>So what exactly right now are you doing for clients in this space at this moment.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>Great question. We are actually partnered with our clients. We are doing a number of proof of concept. We're looking at several areas we're looking at trading. We're looking at fund administration which is what we do. We're looking at custody so we're investigating all those areas and many of the clients are taking that point of view where OK. I want to see where this market plays out but there are some very strong clients you know Chatham Crossers that are out there and they're saying you know we want to partner with you to look at custody. We want to partner with you to look at issuance we want to partner with you look at trading and where we're embracing these and we're you know we're looking at these proof of concepts these test cases where we can say OK what can we do and what can we learn and we're really in that learning phase. We're not you know we've been very quiet about what we're doing because we want to be able to move correctly. We want to be able to move in a way that our clients are comfortable with. And like I said we want to move with our clients and there are some clients that are really well ahead of the curve and there's some institutions that are really ahead of the curve and all that and.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>You said in 2018 in December at a conference here in New York that there was no sense of urgency to move into digital assets. That was 2018 noting however a high level of interest. What's changed since then. Anything.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>But no really nothing says the interest is still out there. The regulatory landscape has not really moved that quickly and the interest in digital assets has shifted. And it's interesting. So when we had that conversation where we're talking about that back then the interest was really about crypto currencies. What has changed is the interest around the liquid assets. The conversation has moved from crypto currencies and the bitcoins and the like to real estate to intellectual property to you know digital assets for non-traditional investments like art. And we're seeing a number of issuers and proof of concepts around that. So that conversation has shifted and that has really resulted in more inbound calls from these issuers from people looking to provide these assets to our clients but our clients are still a little I would say skeptical about you know how to proceed in this market because there's all of these assets that are coming alive are resulting in disparate pools of liquidity and the quality is really not what they're used to and I think that's one of the things not people are not talking about. There are tokens being issued there are digital assets being at issue quality right now is not really where there is a lot of institutional interest or it's a little clunky or cumbersome to invest in them trade them and you know it's not as seamless as what they're used to.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>That's interesting.","<b data-v-f87c67ca=\"\">Ryan Todd: <\/b>I'm curious to learn more about just kind of the profile of these clients that you're saying are approaching State Street and even the chatroom chasers are closers. What type of problems are they looking to solve.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>It's interesting I mean a lot of clients are investing in a lot of these blockchain solutions. We've seen that they're actually wondering how certain assets will trade ETF mutual fund shares limited partnership share. So you know they have a lot of holdings and they feel that you know there is more efficiencies that could be derived out of a you know a peer to peer market kind of a peer to peer market that's kind of supervised. So they're talking to us about that. You know what. What role can we play. Could we play the role of a custodian in this or what new roles come out of this. And what I'm doing is saying you know it's kind of and I mentioned a historic precedent earlier. The precedent is in the late 90s. We moved from materialization to deep materialization. One of the technologies that came out that was fixed technology right. So you guys are well aware of fixed technology and know what happened with fixed technology. It's it's very interesting fixed technology allow for data to be captured in orders and then on the equity side that data was used to create dark pools created algorithms created TCI created analysis whole new industries and companies came out of that. We're looking at the same thing. We're talking to our clients about that you know what does the digital landscape provide. Because we know you know in a in a deep materialization phase process has got faster and scalable. So we're doing billions but we're still doing the same processes in a digital world. A lot of those processes go away right. If you think about transfer agency for example transfer agency on a blockchain is pretty much immediate right. You know you know who the owner is upon a transaction. So what's transfer agency what role is up like going forward you know hypothecated of securities right. Know if you're a global custodian How do you hypothecated a token. Right. So these are these are the things that were these are the challenges but also what other products could come out of that. And you know one of the things that really people have to understand is the asset intelligence that's built into a digital token can be used any number of ways small contracts. Right. So there's a lot of opportunity that we're looking at right now and that's what our clients are talking about. What else can we do out there what does this market mean for us. This is mean we have to invest in blockchain type of technology or is there something that we're going to be able to use from you State Street or other third parties.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>What do you think the first product is.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>That's a great question. I you know I've thought about this. I'm not gonna talk about product that'll go away because you know there's there's people that are still doing them but I think the I think the asset intelligence I think the ability to understand the supply and demand curve built into an asset will enhance the ability to do pricing immediately especially for illiquid securities. So if you think about the way some of these Ma let's use our for an example a painting right is priced once every time at auctions. Right. But if you digitize that painting you could sell thousands of pieces of it rights in Bitcoin's called Satoshi is I don't know we'll call them in the in the in the liquid asset world but you could sell pieces and so she then go she's there. So how do you how do you know that asset intelligence built into that so you can see that some supply and demand curve real time and you can actually get better pricing based on that. And that's just for illiquid securities if we think about traditional securities some of the less liquid ones certainly swaps and other derivatives that asset intelligence is going to allow for more pricing more increase in you know seeing how it's priced seeing how it's traded and having people understand it and you know eventually you'll see the convergence of A.I. incorporated into you know digital assets. So you know I think you know is there a product that will come out of this. You know if I had one I probably wouldn't tell you guys because obviously we have people listening but I think there will be some interesting ones less friendly. But when we came up with trade cost analysis and T.J. we said wow this is great right. We could actually benchmark pricing and then people said well if you could benchmark pricing could you write a program that trades that benchmark. And that became algorithms right. No one thought of algorithms in a middle 90s. Now nobody trades without algorithms. We trade for 5 6 billion shares a day and most of it is on algorithms and then keep using algorithms said Oh can I use that to jump in front of something then you had high frequency trading right. So this market is going to and I'm not saying they're all gonna have these you know these surreptitious type of advantages like high frequency trading people believe they have but I think there's going to be advantages to the buy side there's gonna be advantages to people that are using these trading these assets because of the asset intelligence built into it.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>What do you think of the acquisition by virtue of T.J. that a lot of friends at ICOs T.J. I was there for a number of years. You don't have those firewalls in place that will keep the HFT side of the business from peeking into what IPG is doing on behalf of asset managers.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>That's a great question. But you know I'm not going to give an opinion.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>I figured I might as well. I actually asked Doug CFO that question in an interview when I was at Business Insider and they did what they did was their planning I what the update is but at the time they were saying how they're going to build a global commission of overseers to keep them in check which kind of. Reminds me of lever and how of the Facebook. Yeah and how that will sort of be kept at bay or at least keep Facebook at arm's length from totally controlling this thing. But anyway that's a tangent.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>Know it's an interesting parallel. I could talk about what that is you know. Financial services is a data plane now. Right. It's a. We talked about before we turn the mikes. Yeah. So you know it. If there is you know not just that acquisition but if you look at other acquisitions that have occurred recently it's you know it's a data play you know I know. So we're a data provider right. We have you know an immense amount of data that we can provide to the buy side and work with. You know we've got that last mile through Charles River.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>Just a little context I guess for the listener right. Because they might. A lot of people most even casual observers of financial markets might have missed this acquisition which was over a year ago but it was a big deal at the time at least when I was at my seat at Business Insider. Lot of people were skeptical of the move. The stock I think was down in the first couple days of trading. But it was a pretty meaningful move. So what do you think that acquisition has meant for the side of the business that you touch and how has it changed that.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>So you know when you think about where State Street was we were the custodian for the largest global asset managers but we didn't have a desktop presence right. So this is a desktop presence so it's a front to back play for us and able to be that front to back provider. When we talk about digital assets when we talk about A.I. moving it's a great position to have and we're kind of excited some of the ideas where we're kicking around around that especially with digital assets.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>And it brings you from that sleepy corner of Wall Street that a lot of people don't necessarily care about too or not. Care is not the right word but get excited about maybe two throughout the throughout the entire lifecycle. Probably not the right word but back middle front office.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>Yeah. And we believe that you know there is going to be a that that there's gonna be a shift. You know what does the front office look like in five years. Certainly if you think about digital assets right now there's not many providers for institutional order management systems right. And there's even less Charles River Charles. There's less intellectual property around portfolio management would asset with digital assets. So imagine being the pioneer in that or be able to offer something there when institutions start trading and I mean there's no modeling your portfolio five years from now. Right now people model their portfolio and I say give me thirty five equity give me 50 bonds give me 15 cash so I don't have 100. I hope it does portfolio five years and it's going to be you know give me 10 percent real estate give me you know 5 percent Art give me 3 percent intellectual property Give me 35 percent. So how do you model all that into it. If you're at the forefront of that you could figure out ways to provide new products new services around that. And that's really the exciting thing I think certainly from my point of view and I believe that state should.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>More opportunity to innovate or to build businesses in digital assets from the Charles River side the order management systems side versus the custody side.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>I don't see it as disparate. I see that as a single a single platform and that's what we're moving towards. You know we announced the Alpha platform which is our front to back strategy and we're an integral part of that. So if you think about it you're providing data and ideation around equities. We're going to do the same thing around you know perhaps cryptocurrency is or some other digital assets as well. So from us we should be agnostic to what the asset is and look more to how we provide that data to our front end.","<b data-v-f87c67ca=\"\">Ryan Todd: <\/b>Let's talk about the competitive landscape I guess other peers uh in your line of of your work. Um. And what they're looking to exploit. How does that differ from your digital asset strategy.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>We haven't been that public about what we're looking at. You know we've. You've heard me talk about where we're looking right now. I know Bones announced a number of initiatives Northern Trust Santander is actually just issued a front end bond. We're kind of we I think we're you know I like to think we're a little head technology was because we had such good guidance and we know we have a pretty robust blockchain group at State Street. So I don't think anyone is actually leading the way. I think there's a lot of very interesting industry. So yeah I think so I think Wells Fargo I think announced today that they're going to be going to be an internal coin of J.P. Morgan coin. So I think everybody is kind of putting the feelers out about what's going on out there. I like to think that we're eventually going to have to work together. And you know one of the articles I published a long time ago is you know the answer to blockchain is going to be a interoperability it's going to be co-opetition as opposed to somebody winning this. So you know I look very closely at what our competitors are doing. We talk to them. I mean we have a very good dialogue going with you know all our competitors because you know we're kind of these little digital asset blockchain people and all these little you know firms that we kind of you know we see each other at conferences is pretty smart.","<b data-v-f87c67ca=\"\">Ryan Todd: <\/b>I see everyone at conferences got a blockchain specific conferences. Enterprise blockchain Kristie.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>What do you what do you think of what do you think of some of these developments.","<b data-v-f87c67ca=\"\">Ryan Todd: <\/b>You mentioned the banks. I think that's something that's pretty interesting something that you guys could probably be involved with in some capacity area. And at J.P. Morgan.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>Yeah I mean we're part of finality which is a utility settlement coin. So we're part of that initiative. There's there's other initiatives people are kicking around. You know I think like I said a lot of people are learning and you know there's been a lot of investment.","<b data-v-f87c67ca=\"\"><\/b>From a lot of people. Now people want to see you know what's what does this mean. You know how how how is going to play out. And I think you know the incumbents have a good beachhead. But I think a lot of these startups are you know they have some pretty interesting proposals pretty interesting businesses. You know I could call out Fidelity for example you know fidelity digital assets Coinbase Kingdom trust they're all out there looking at institutional markets as well so you know you really have to think about you know it's not just going to be you know us and seven other banks you have 30 others that are out there looking to get into the space as well.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>But if you did the custody play a year ago two years ago the opportunity was so ripe I mean the fees on that business were over 100 basis points could have made money hand over fist saying hey we State Street will custody your assets. We'll do 50 basis points and you know we all kind of come out as winners why. Didn't you do that.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>None of our clients wanted none of our clients are in it so I'm sure I could have some new clients. Well you know we have a quote here. If a new client come in and you know there is a they may not meet our qualifications I mean weren't you. Well we don't have a front door.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>It's not to interrupt but I think your point is 100 percent right and it's what Tom Lee actually brought up yesterday on the podcast which was there's two things keeping this market out unnecessarily custody but the fact that the market is just too small. So the Ryan other assets. Yes. Who would get face time with you. You know. Yeah relative to other assets. Bitcoin crypto currencies are just too small to. Engage in the reputational risk. Or or waste the time and resources to create some sort of view on where where it's heading. Yeah. What do you think will be the first thing. So I think it's fair to say reading between the lines at State Street is not going to cost steep Bitcoin anytime soon.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>I would say I. I would agree with that statement.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>So but you're very interested in blockchain and we've had a whole conversation about certain different assets that could be tokenized. What then is what would then be the first. Asset that would be.","<b data-v-f87c67ca=\"\">Ryan Todd: <\/b>You talked about quality. Like what would what actually drives better quality on these on these deals and desires to tokenized your assets.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>I mean we're seeing some better quality assets coming out certainly in a real estate market. It's less about individual type of assets and more about real estate managers getting into the business which is really where institutional investors are looking right now. So the larger you know the top 50 investment management firms tokenization under a number of them are public about that so. So in the alternative space that's really where you'll probably see it in the traditional space. It's probably gonna be syndicated loans right. I think that's an area where people have tested. We know that Overstock just announced the dividend.","<b data-v-f87c67ca=\"\">Ryan Todd: <\/b>Right. I think the most fascinating story is yell at me all day for not writing about it.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>I dont understand it.","<b data-v-f87c67ca=\"\">Ryan Todd: <\/b>They're doing a digital asset a dividend and if you are I love this thing like going back to the whole cycle ending stuff the issues that they had a couple of years ago to me people tried to borrow the shares that didn't exist yet. But yeah the Overstock stuff is really interesting.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>Yeah. You know we're looking that closely too because you know we do custody you know equities for a number of asset managers. So what does that mean for us. So that say well you know we we have some internal conversations going around that how we go to service those assets you know quality is going to come out to you know when the market is figures out how it's more efficient because really it's your digital assets are not a an efficiency play but it's a lower cost way of going public you know. So I joked with people that you know maybe this is a joke you know if if Uber went public is a digital asset I'm sure that would have moved a lot of people to figure out how to move into this market but that didn't happen. But now you have you know dividends and if it's more efficient to do a dividend or corporate action with a digital asset which I think it does that's going to you know that might move things more quickly. But again it's really good to move as quickly as our clients want us to move. Right. So but I do like the syndicated loan markets it's going to move like from liquid illiquid interesting alternative investments to more illiquid investments. There's going to be trickle trickle flood. You know if you remember we talked about the age of you materialization the regulators came out and said OK as of this point everything has to be put on an electronic ledger no more coupon clipping no more no more bare Bonds. Do I see that happening and digital assets. Probably. And I will say this probably because the the ability to for a regulator to tap into the digital asset ecosystem is far more efficient than the way they do it now. You I'm sure you've written stories about and that. You know and trying to figure out.","<b data-v-f87c67ca=\"\">Ryan Todd: <\/b>What's going on on also to the ETF that didn't get passed yesterday.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>No shared market surveillance.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>Exactly so you know being able to do market surveillance you think that lock chamber happens. So you so I'm out of that world but it was it was and you know I think it's a proverbial nightmare. I mean I was not a big fan of the the tech pilot. I you know I personally felt it was you know the reason for it was completely wrong because it had nothing to do with issuances. And this is just my personal opinion had nothing to do with it with issuances in public. But you know what people found a correlation there and figured oh let's see. Test it out so. So do I think the cap will ever happen. I don't know I haven't actually read about it recently since I may know the digital world. It's great. So I love about this new asset world and it's funny. A lot of people who have equities backgrounds I run into next they're in this world.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>Oh 1000 percent. I mean I think of people like you know Greg tostar former global head.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>Yeah Greg is a partner reminded liquid net.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>Yeah yeah. It's insane. Dave Weisberg You know who like Bill credit card Citigroup. How do you know a mass type of crypto coin around the corner that's coin rats that are scattered all around the entire market. You know I don't know if it's a plug and play what happened in equities into crypto market structure which you can argue about whether or not that's effective or whether or not more closely resembles FX or commodities or whatever have you.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>But we know what we did wrong in the equity markets and I think that's why I'm trying to correct. What's the learning that we can get into. I think that really you know I think it really came down to you know what were the other 10 unintended consequences. Right. You know how does the market become more efficient. So you have to you kind of in the in the in the red ATX days you know regulators regulation was reactive regard and Hamas was reactive and I think the way you know the regulators now at least the ones you know we've been talking to are proactive. They want to know how this market works too and they've been doing a really good job people. People say you know they've been regulating by enforcement. I'm you know. Yes they're regulated by enforcement for you know a lot of bad actors obviously all the ICOs. But as far as really efficiency. Looking at the market efficiently looking at the market they're well ahead of the game and I'm I'm very happy with the approach they've been taking. And certainly you know globally you know there's a lot of cooperation between regulators now because if you think about bitcoin it's the first 24\/7 asset that's traded right. So it's the same asset you trade in you know Abu Dhabi is the same asset you trade in the U.K. is the same message trading to us. So it's a lot of you know interaction between the regulators so I think less than one is get ahead of what's going on. Don't inhibit any innovation but also cooperate. Don't don't you know don't wait for something to happen. Don't wait for it to be too late.","<b data-v-f87c67ca=\"\">Ryan Todd: <\/b>To that point what's the biggest roadblock from U.S. regulatory standpoint that's preventing and that's preventing any of this new development from coming to be.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>I think a lot of it comes down to definitions. All right. What what does it mean to custody. What does it mean. We saw the Internet you know back in June. Yeah yeah yeah. And you know it's really comes down to these assets right.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>What we like what is a stable coin for instance. Is it a currency. Is it a you know if you look at something like Leo or b and b it's hard to put into one but a one year category.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>Libra especially you think about Lieber it's Lieber an ETF because you think about it. Yeah it's kind of like an ETF. So it's really comes down to definition and I think the guidance that we've been kind of understanding and the guidance that we're giving I think is it's refreshing to to me to be cooperating with regulators around this. So we're very happy about that.","<b data-v-f87c67ca=\"\">Ryan Todd: <\/b>You are in conversation with regulators just as always.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>I mean we're banks on digital assets digital assets yes. So we've we've we've engaged a number of regulators around the world.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>Well which ones.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>The ones that you know regulators.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>Well we always talk to all the best regulators only the best of the best. And yesterday I was talking to a regulator a smart man.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>You know it's funny. I'm not one to go to a lot of times but I teach blockchain for business at the College of New Jersey and like Jay DC NJ. Yeah I put the Trump quote up on the board. It was about Libra. Oh yeah.","<b data-v-f87c67ca=\"\">Ryan Todd: <\/b>And which he definitely did not right now. Oh yeah. I didn't write that tweet.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>I put it up on the board that the lever deliberately because you know Facebook is not going to happen and I've got to go regulated like a bank. And I put up on a board and I have you know 24 students in the class and no one knew who wrote that tweet. And I was like but we started digesting they're like you. And so it came to understand it but I thought it was funny that they didn't know who wrote that tweet. But they knew what Libra was.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>What do you think we'll become Of Libra.","<b data-v-f87c67ca=\"\"><\/b>What I really liked about Libra was it started the conversation again right. It got the attention of the right people. Most of the right people and I think it started the conversation again about really what a cryptocurrency is and the power of it right. What what what can this mean to you know the global infrastructure. I love to tell people you know you've heard this story before it's like you have one point seven billion people have access to Facebook through their phone but they don't have access to a bank so it accumulate wealth. And that's the eureka moment that people understand. So but I I personally really like the way how Labor was structured because it took what was maybe concerning is the right word about bitcoin and addressed it. It really said OK Bitcoin decentralization said we're going to we're going to kind of centralize that. And so I think it came down to looking at an opportunity they exploited it. We'll see how it goes. I think you know I'd hate to see it quashed because of you know regulatory or governmental concerns. But I also think there's probably you know a lot of good to come out of it.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>How could State Street get involved in Libra.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>You know there's any number of ways we can get involved in any you know initiative like that. So you know we're you know we looked at that. We We digested it we understood what it was and you know if the market's gonna move in that direction then we should be prepared and move in that direction.","<b data-v-f87c67ca=\"\">Ryan Todd: <\/b>What do you think about the reaction from different central banks now. Almost it seems like in reaction to Libra China being the most loud and vocal about it but coming out with their own central bank digital currency.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>It was inevitable I think was inevitable. I mean you have a lot of island nations have already done it so and there's a lot of countries out that are looking to digitize it. I'm wondering if they understand scaling it right. I wonder if they understand that. So it'll be interesting to see how that plays out. But yeah I would venture to guess that every you know every country not even emerging countries or established countries are looking it's it's a more efficient way of providing capital and moving payments through the through the through the system.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>Let's take a moment to talk a little bit about you and your 20 years of financial services industry history.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>It's more than 20 years but I appreciate that over 20 years certainly over time your age you you don't look a day over thirty nine. Thank you. Glad this is applies. This is a podcast.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>Well I always tell people I have the perfect face for a podcast and we're joined by Ryan who also has the perfect face for a podcast. Just kidding. No.","<b data-v-f87c67ca=\"\">Ryan Todd: <\/b>No comment. Apparently we're related. I don't know.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>People think we look alike one way they post photos on the Twitter.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>Well I mean losses in the life profile you've got the same hair the same glasses the same scruff.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>I mean you know it's he's copying me. I am younger. That's for sure. Talk to us. We're going to cut all that out.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>That's the best part.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>So you kind of alluded to it you know whether it's ticker or cab there's all these things that are kind of in flux and inequity and in and in many other markets feels like crypto blockchain digital assets kind of get treated almost unfairly as the redheaded stepchild but they every market has their issue. Looking back over the past 20 years and more what can you sort of hearken on that draws an interesting comparison. That's relevant.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>So and you think folks should maybe keep in mind keep him. I mean for the last 20 years people have been talking about. Traders going to be moving multi asset everything's gonna be multi asset trading. And that really hasn't happened. Specialization still exists. So if you think about equities in the early you know the late 80s early 90s you had your RTC guys you had two New York guys right then get your Pinks. That kind of converged. But you know you still have your bond portfolio manager bond traders so multi asset has never really fulfilled its promise. Everyone says they're multi asset but it's still disparate digital assets. All right. If digital assets are all traded in a blockchain that means it's all democratized everything trades the same way everything's model the same way the intelligence is out there. So if one of the reasons I'm in this is it fulfills the promise of multi asset trading but it opens up the world of all these new assets. Right. So you know how people source capital changes. Right. Being able you know the true crowdfunding the true sourcing of capital via a vehicle that could be on anyone's desktop as opposed to going through traditional investment banks and private equity can be realized on a digital as a digital asset. So I think asset democratization is the true. You know that the true fulfillment of the idea of multi asset trading and the ability once you're able to multitask asset trade than people's portfolio models move from being dictated by asset managers. All right I wanted to ask two individuals so you know we talk about this in our class. It's the opportunity for decentralization and democratization that puts the power back into the individual's hand because if you think about and I'm probably going way off on a tangent now but if you think about what's happened over the last 30 years of the Internet economy we've lost that individuality we've lost control of our own data. Right. Decentralizing that right is a way to bring a lot of that back and giving the power back to the individual and allowing individuals to get more control of their assets and what they can do with those assets. You know sometimes we talk about you know 20 years from now I'll be able to buy a cup of Starbucks by you know selling a couple of shares of Apple. Hopefully it's not that much but you know just liquidating no assets. Right. So that's really what you know. That's the thing that Jazz is me and it gets me up in the morning is like you know watching that happen because you know watching what happen to capital markets you know over the last 30 years. It's been exciting but now it's time for that next transition.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>If we actually see that transition happen. And you have multi asset trading kind of become the norm. Power are driven in part by blockchain technology. What does that mean for State Street's business specifically.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>You know first State Street it's an opportunity right so you know being the the custodian and the be able to service those assets is really the opportunity and that's what we've done for you know 200 some odd years. You know we want to service assets we want to serve as the assets of the largest global asset managers and do so in a way that's seamless to them.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>What are some of your most interesting stories from ITV.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>Well you can read all about that in my book Tales from the dark pools. So you know I mean if you look we're going way off on a tangent you really is that is it. Is that a book. That's an idea I've had. Yeah it's an idea. Well I was at I.T.. All right. Tell us what a daunting task is now.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>What make it 40 percent of the U.S. equity trading.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>I mean there have been some really good interesting stories I mean you know ITG to liquid the pipeline which I took over subsequent to their SCC I would say and I guess he knows about the one year pipeline probably would fill about half the book great people that are great great. But very interesting stories and you know it's like anything else on Wall Street you know people have some great you know stories of the days they were on the floor of the exchange and you know I probably wouldn't you know I definitely wouldn't do it on a podcast but I think there's some good ideas out there but yeah that's my idea tells me.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>What would be one of the chapters. You can take your time to collect your thoughts.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>If you look at me I probably would say the most interesting time was transitioning you know from ITG.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>What about emergence of dark pools.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>Certainly the word dark pool. Right. The Web were dark pool came out and you know people have actually claimed you know who came up with that term and when it came out I was. I thought it was like the worst thing they could do was call it dark pool. It was like being branded dark pool so you think of Voldemort. Know it's like you know it was it was horrible. And I said I remember we're working. I was working with Seth at the time. Like who. You know who came up this summer actually research and I answered it on Quora who actually came up with it. I can't remember who it was but it was I was the guy who was at bats. He was at bats receptions. No no no. If I get to pause this but who was a fan of dance. No it wasn't founded about who took over the bats Options Exchange. He left when they sold over he was at tab at the time. It came out I remember Tabb Group and put it in their original LA. If you look up my name on Quora you'll see it. You're not recording this right.","<b data-v-f87c67ca=\"\">Ryan Todd: <\/b>OK. I like Voldemort.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>Oh my God. William O'Brien. Remember that guy.","<b data-v-f87c67ca=\"\"><\/b> Bill O'Brien. But who actually took over electronic file. But I can get back to like some of the stories. I mean I would say some of the best stories I would have was when liquid net decided to bring in the sell side with H2O which I grew out of which I built. Just the internal conflict around that was just off the charts. I mean you know we're selling ourselves out to the buy side. You know if you look at H2O numbers now at liquid net there they're very compelling. So when you start changing the paradigm inside a firm like that it could lead to some really good dialogue and debate but it was fun. I enjoyed the time there and that's what I enjoyed about states right now it's like we're changing things but we're changing it internally you know. So you know people talking about bitcoin obviously changing that vernacular internally has been a has been a bit of a challenge. But the way they've embraced it it's been just great and I think you know I actually honestly think the way the market evolved in the dark pool space that he's a space is going to evolve just as quickly in the digital space how past that. All right span of 2 3 years or if you look at you know I so posit was live and know incident was live in the early 90s PASOK came by out and like 90 mid 90s liquid net 2003 by 2007 or 40 some are dark pools. So in between 2005 and 2007 I think 40 came out and you had the biggest incumbents building them right. Yes. Has the biggest UBS Morgan Stanley Sigma exec Goldman Sachs so it's gonna be like a trickle trickle and flood. You know when I was doing posit we were doing you know we did 20 million shares a day. That was great. Yeah. You know it's nature it was a big customer of us was when I first knew about and then we went to liquid then we're like oh if we could just do 20 million shares a day and we do 100 million shares a day. And people were looking at that. So I think that's really where this market will evolved kind of the same way. It's like it's everyone has the attention on it. Everyone knows where it's going. But you know what. Make it compelling and make it cost effective because you know don't invest in something that you know is still two or three years away. You know I mean like you said we could have been you know in the digital space early on any firm could have. Right. We could've been in it but. But that wasn't a client base we're looking for. We want to maintain our identity. And we also want to provide a seamless transition into digital assets for our clients when that occurs.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>You recently had your. I'd be remiss if I didn't ask about the exit of your former global chief technology architect. Do you think that for the blockchain team Yeah for the blockchain team that they treat. You talk about this sort of. Cultural question at the firm of bitcoin versus digital assets and moving away from Bitcoin being at the center at least at the center of what people are talking about. What was that transition. Not to connect it to to this exit but it just raises the question of whether or not. There were disagreements over that.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>No actually that was never really part of any of the conversation. There was nothing around that you're talking about Moyes. Yeah. Moyes How are you. Yeah now that was accidental.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>Yeah. So there's no like you know Bitcoin versus no absolutely not.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>So Moyes was distributed ledger technology team which was a separate work stream from the digital assets team. So.","<b data-v-f87c67ca=\"\">Ryan Todd: <\/b>How does that differ working on similar stuff or?","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>They're pure blockchain so look at the inner workings of state tree building around that we're looking externally to digital assets and building around that. So it'd be kind of like talking about you know the fixed group at you know IDG versus the people that are designing TCI.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>Hundred percent. That's that's important to know. And there are two different North Stars I guess for those two groups North Stars. In terms of like what the end goal is.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>No I mean the one thing you know how do we see the market evolving. And I'll regurgitate back some of the.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>You know what we talked about how you know what you're telling us would kill you like pull the kimono back a little bit on your plans for the rest of the year OK. What are you excited about.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>You know what we like. Yeah. OK. So what are we excited about. You know what talking to a number of our clients and our clients are very interested in this technology and we're looking at a number of areas of opportunity. So you know I think that we have a couple of proof of concepts that are very interesting to us.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>Are any of them going to move into the main mainstream production anytime soon.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>That's the idea. I mean one of the things we stress now at our proof of concept we don't want to do one offs. We want to do something that's scalable to all the parts of the bank right. So a lot of proof of concepts you've seen on the street aren't scalable. Can you do this on a blockchain. Can you do that on blockchain. We really want to say OK if we're going to do this can we do it for a majority of our clients or what does it mean for the bank. Are there efficiencies. Are there opportunities attached. And putting even thinking about revenue around that. Is this an area that the bank is in or is it a new area for the bank. And that's the new areas for the bank the opportunities there are really amazing. And I think that's kind of you know if you think about the way you do fund administration right you know real time pricing is an area that's kind of an enigma even in traditional. You know securities but what you know with blockchain Securities Real Time Pricing is something that's a complete you know completely tangible and doable. So I think that's an area that we would look to move into servicing. You know cryptocurrency is like I said it's not something we're doing now but you know what does it mean. If and when institutions do move into it and providing the data around them and providing portfolio models around them it's just that you know the CRB acquisition around cryptocurrency assets writing date about pretty much any asset. Right. So but you have that desktop now into the portfolio manager and you're going to be looking for guidance around. That's why I use the term digit caps right. We have we have you know small mid large cap but you know when these securities become what they're digit caps they're totally different variety of of of assets. So you know what we do around the digit caps in the data you provide around that and incorporating that into models is just an exciting you know just landscape for. It's absolutely an influence. It's a whole new ecosystem. And then once that occurs traditional assets moving that way as well. So you know like I said it's is all moving in a direction it's trickle trickle but you know that flood I think is going to happen eventually.","<b data-v-f87c67ca=\"\">Frank Chaparro: <\/b>I talked to Lou. I mean that's exactly what he said about data being the next frontier for State Street. Yep. Incredibly fascinating. I'm glad we had this conversation because I think it's valuable to put for our readers the content context of what's going on. And when you think about State Street it is often solely associated with well wanting exactly to your point when do you get a custody bitcoin when go into custody. Some of these other assets. But there's so many other things going on underneath the hood. We tried to examine some of them and I just think it's fantastic. Jay thanks so much for coming on the show appreciate. Thanks for having to have you again sometime soon.","<b data-v-f87c67ca=\"\">Jay Biancamano: <\/b>Great.","&nbsp;"," 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Trump","content":"ORGANIZATION"},{"type":"Dave Weisberg","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Charles River Charles","content":"LOCATION"},{"type":"South Dakota","content":"LOCATION"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"J.P. Morgan","content":"ORGANIZATION"},{"type":"last 30 years","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Securities Real Time Pricing","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"1000 percent","content":"PERCENT"},{"type":"Jay Biancamano","content":"PERSON"},{"type":"5 percent","content":"PERCENT"},{"type":"Jay Biancamano: <\/b>Yeah Greg","content":"PERSON"},{"type":"Libra","content":"LOCATION"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Ryan Todd","content":"PERSON"},{"type":"UBS Morgan Stanley Sigma exec Goldman Sachs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Satoshi","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Hamas","content":"ORGANIZATION"},{"type":"OK Bitcoin decentralization","content":"ORGANIZATION"},{"type":"TCI","content":"ORGANIZATION"},{"type":"Lieber","content":"PERSON"},{"type":"Options Exchange","content":"ORGANIZATION"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"Abu Dhabi","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"I.T.","content":"ORGANIZATION"},{"type":"Jay DC NJ","content":"ORGANIZATION"},{"type":"Boston","content":"LOCATION"},{"type":"RTC","content":"ORGANIZATION"},{"type":"10 percent","content":"PERCENT"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Moyes","content":"PERSON"},{"type":"past 20 years","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"State Street's Global Technology Services","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"T.J.","content":"LOCATION"},{"type":"40 percent","content":"PERCENT"},{"type":"Chatham","content":"LOCATION"},{"type":"U.K.","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"Greg tostar","content":"PERSON"},{"type":"William O'Brien","content":"PERSON"},{"type":"PASOK","content":"ORGANIZATION"},{"type":"Jay","content":"PERSON"},{"type":"Doug CFO","content":"PERSON"},{"type":"Tabb Group","content":"ORGANIZATION"},{"type":"Libra","content":"PERSON"},{"type":"Bill O'Brien","content":"PERSON"},{"type":"Hillsboro New Jersey","content":"LOCATION"},{"type":"S.E.C.","content":"ORGANIZATION"},{"type":"Charles River","content":"LOCATION"},{"type":"Mike","content":"PERSON"},{"type":"College of New Jersey","content":"ORGANIZATION"},{"type":"State Street","content":"ORGANIZATION"},{"type":"Leo","content":"PERSON"},{"type":"Voldemort","content":"LOCATION"},{"type":"2003","content":"DATE"},{"type":"fifteen thousand dollars","content":"MONEY"},{"type":"Ryan","content":"PERSON"},{"type":"2005","content":"DATE"},{"type":"Lou","content":"LOCATION"},{"type":"Libra China","content":"LOCATION"},{"type":"35 percent","content":"PERCENT"},{"type":"Voldemort","content":"PERSON"},{"type":"James Biancamano","content":"PERSON"},{"type":"Citigroup","content":"ORGANIZATION"},{"type":"Tom Lee","content":"PERSON"},{"type":"2007","content":"DATE"},{"type":"IDG","content":"ORGANIZATION"},{"type":"3 percent","content":"PERCENT"},{"type":"Seth","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Overstock","content":"ORGANIZATION"},{"type":"IPG","content":"ORGANIZATION"},{"type":"SCC","content":"ORGANIZATION"},{"type":"ITG","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","Ryan Todd","The Block"]}