{"summary":"Unciphered claims to have gained the ability to extract the seed phrase of a Trezor T model hardware crypto wallet in possession.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232085\/cybersecurity-firm-claims-it-hacked-private-key-from-a-trezor-t-hardware-wallet","publishDate":"2023-05-24T14:13:21","id":9331,"type":null,"title":"Unciphered claims it hacked seed phrase from a Trezor T hardware wallet in possession","category":["COMPANIES"],"content":["Cybersecurity startup Unciphered claims it was able to hack into the popular Trezor T model hardware crypto wallet manufactured by Satoshi Labs.","In a YouTube <a href=\"https:\/\/www.youtube.com\/watch?v=50eiA-75NMY\" data-v-f87c67ca=\"\">demonstration<\/a>, Unciphered showcased the apparent extraction of the wallet’s mnemonic seed phrase, or private key, exploiting a hardware vulnerability that relies on physical possession of the device.","This is not the first time Unciphered has seemingly managed to retrieve seed phrases from hardware wallets. In February, the company <a href=\"https:\/\/www.theblock.co\/post\/210665\/security-firm-unciphered-hacked-into-popular-hardware-wallet-onekey\" data-v-f87c67ca=\"\">demonstrated<\/a> a similar hack on a wallet manufactured by Hong Kong-based OneKey.","Hardware wallets, which store private keys offline and are designed to protect crypto assets, are generally considered highly secure. Unciphered said, however, that the hardware security mechanisms of the Trezor T model can be theoretically bypassed if a hacker had a T wallet in possession.","The type of exploit depicted by Unciphered would only be feasible if the attacker had physical access to the hardware wallet.","In the video, the Unciphered team said it developed an “in-house exploit” that allowed them to extract the wallet’s firmware. Eric Michaud, co-founder of Unciphered, claimed that by leveraging specialized GPU chips, they were eventually able to crack the device’s pin seed phrase.","“We uploaded the firmware we extracted onto our high-performance computing cracking clusters,\" Michaud explained in the video. \"We have about 10 GPUs, and after some time, we extracted the keys.”","Michaud further claimed that fixing this exploit for Trezor T would require a recall of all their products.","Trezor acknowledged that Unciphered’s demonstration had similarities with the <a href=\"https:\/\/blog.trezor.io\/our-response-to-the-read-protection-downgrade-attack-28d23f8949c6\" data-v-f87c67ca=\"\">Read Protection Downgrade (RDP) vulnerability<\/a> discovered by Kraken Security Labs researchers that affected both the Trezor One and Trezor Model T. This implies that the vulnerability is not new.","\"This appears to be a vulnerability called an RDP downgrade attack and as communicated on our<a href=\"https:\/\/blog.trezor.io\/our-response-to-the-read-protection-downgrade-attack-28d23f8949c6\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/blog.trezor.io\/our-response-to-the-read-protection-downgrade-attack-28d23f8949c6&amp;source=gmail&amp;ust=1685051319957000&amp;usg=AOvVaw1unhzwgosl_jQDi2GQc2T3\" data-v-f87c67ca=\"\"> blog<\/a> in early 2020, RDP downgrade attacks require physical theft of a device and extremely sophisticated technological knowledge and advanced equipment,\" Trezor's chief technology officer Tomáš Sušánka said. \"Even with the above, Trezors can be protected by a strong passphrase, which adds another layer of security that renders a RDP downgrade useless.”","Trezor added that it has taken significant steps to resolve the issue in future by <a href=\"https:\/\/tropicsquare.com\/press-releases\/tropic-squares-initial-testing-of-their-first-batch-of-prototype-chips-moves-them-one-step-closer-to-production\" data-v-f87c67ca=\"\">developing<\/a> a new secure element for hardware wallets with its sister firm, Tropic Square.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">This story has been updated with a comment from Trezor.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Trezor","content":"ORGANIZATION"},{"type":"Eric Michaud","content":"PERSON"},{"type":"Satoshi Labs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tropic Square","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Tomáš Sušánka","content":"ORGANIZATION"},{"type":"Michaud","content":"PERSON"},{"type":"RDP","content":"ORGANIZATION"},{"type":"Read Protection Downgrade (RDP","content":"ORGANIZATION"},{"type":"Trezor Model T","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Kraken Security Labs","content":"ORGANIZATION"}],"hashtag":["EXPLOITS","HACKS","HARDWARE","WALLETS"],"authors":["Vishal Chawla","The Block"]}