{"summary":"An International Monetary Fund (IMF) paper has proposed a framework for &quot;tracking systemic risks stemming from crypto assets.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253971\/imf-paper-proposes-framework-to-assess-systemic-risk-from-crypto-assets","publishDate":"2023-10-02T11:57:14","id":9332,"type":null,"title":"IMF paper proposes framework to assess systemic risk from crypto assets","category":["POLICY"],"content":["An International Monetary Fund (IMF) paper has proposed a framework for \"understanding and tracking systemic risks stemming from crypto assets.\"","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The framework sets out tools to assist policymakers and regulatory authorities in containing potential risks from the crypto sector. The IMF&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.imf.org\/en\/Publications\/WP\/Issues\/2023\/09\/30\/Assessing-Macrofinancial-Risks-from-Crypto-Assets-539473\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">paper<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">, called Assessing Macrofinancial Risks from Crypto Assets, emphasized the importance of integrating these tools into existing&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/251719\/hong-kong-looks-to-release-stablecoin-regulations-by-mid-2024-lawmaker-says\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">regulatory<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;and systemic risk assessment processes.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"Our aim is to highlight the channels through which crypto assets could amplify any turmoil in the crypto world into systemic risk,\" the paper said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The paper proposed a crypto risk assessment matrix (C-RAM), that would assess global risks. \"The global C-RAM identifies global risks that would be exogenous to countries and have implications for macro-financial stability,\" the paper added.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The second purpose of the framework is to serve as a tool for identifying areas of prudential&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/linked\/146583\/yellen-says-the-stablecoin-market-is-still-too-small-to-pose-systemic-risk\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">risk<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;associated with crypto assets within jurisdictions. \"The country-level analysis highlights vulnerabilities and risks, analyzes potential triggers leading to systemic risk, and proposes potential policy tools,\" the paper said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The framework takes a three-step approach. The first step involves a decision tree that assesses how critically important the crypto sector is to a national economy. The second step involves examining indicators, similar to those used in traditional finance, that indicate the potential for&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/167673\/fed-research-papers-warn-about-future-risks-from-crypto-cefi-and-defi\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">systemic risk<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">. The third step covers the global macro-financial risk from crypto assets that could have implications for a country’s systemic risk assessment.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The paper added that crypto assets now represent an important component of the international financial sector. \"Linkages of crypto assets with the rest of the economy are still limited but are being established rapidly as crypto assets become more widely used,\" the paper said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Various advantages of crypto assets were outlined in the study: more efficient payment systems, faster cross-border transactions, reduced transaction costs, and increased financial inclusion. However, it stressed there is a risk of \"dire consequences\" if the crypto sector lacks thorough regulatory and policy frameworks.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The paper highlighted specific vulnerabilities that could pose systemic risks to the broader financial sector and the economy. These risks include leveraged exposure within crypto markets that could introduce additional vulnerabilities spilling over to the rest of the economy.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The paper highlighted corporate exposure to crypto assets due to their integration into payment systems and supply chains, which could potentially create a risk channel. The paper also added that this integration would make exposed corporations more vulnerable in terms of profitability, asset-to-liability mismatches, and cash flows.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The IMF paper added that many of the empirical tools currently used for systemic risk analysis in traditional finance, \"do not incorporate crypto-related indicators or are not well suited for crypto-related risks.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"International Monetary Fund (IMF","content":"ORGANIZATION"},{"type":"Assessing Macrofinancial Risks","content":"ORGANIZATION"},{"type":"RAM","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"IMF","content":"ORGANIZATION"},{"type":"Crypto Assets","content":"ORGANIZATION"}],"hashtag":["CFTC","EUROZONE REGULATION","FCA","SEC"],"authors":["Brian McGleenon","The Block"]}