{"summary":"The Bahamas&#x27; proposed new rules say a crypto exchange&#x27;s controls must be &quot;adequate and appropriate for the scale and nature of its business.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228350\/bahama-crypto-regulations-ftx","publishDate":"2023-04-26T08:22:44","id":9334,"type":null,"title":"The Bahamas proposes stricter crypto regulations after FTX&#x27;s collapse","category":["COMPANIES"],"content":["Five months after the collapse of crypto exchange giant FTX drew the world's attention to the Bahamas, the island nation is proposing tougher regulations to govern digital asset firms.&nbsp;","The Securities Commission of the Bahamas, the country's financial regulator, <a href=\"https:\/\/www.scb.gov.bs\/wp-content\/uploads\/2023\/04\/SCB-Opens-Consultation-Period-for-DARE-Bill-2023-PR.pdf\" data-v-f87c67ca=\"\">opened<\/a> a consultation on the proposed new rules, according to a statement released Tuesday. The rules — packaged in the Digital Assets and Registered Exchanges (DARE) Bill — include expanding the definition of digital assets businesses, disclosure requirements for crypto staking activities and tighter requirements for stablecoin issuers.&nbsp;&nbsp;","Following FTX's <a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">collapse<\/a> last year, Bahamian authorities <a href=\"https:\/\/www.theblock.co\/post\/198785\/bahamas-regulator-fires-back-in-ongoing-feud-with-new-ftx-leadership\" data-v-f87c67ca=\"\">came under repeated attack<\/a> from John Ray III, the man appointed to run the exchange after the resignation and subsequent arrest of founder Sam Bankman-Fried.&nbsp;In legal filings, FTX's new management <a href=\"https:\/\/www.theblock.co\/post\/189688\/bahamas-regulator-defends-ftx-actions\" data-v-f87c67ca=\"\">said<\/a> it had evidence the Bahamian government directed unauthorized access to the exchange’s systems \"for the purpose of obtaining digital assets\" that should be controlled by FTX. The SCB later <a href=\"https:\/\/www.theblock.co\/post\/198785\/bahamas-regulator-fires-back-in-ongoing-feud-with-new-ftx-leadership\" data-v-f87c67ca=\"\">hit back<\/a> at Ray's \"material misstatements.\"","FTX, under Bankman-Fried, was reportedly <a href=\"https:\/\/www.ft.com\/content\/913ff750-d1f4-486a-9801-e05be20041c1\" data-v-f87c67ca=\"\">rife<\/a> with chaotic risk management and sketchy record keeping.&nbsp;For anyone thinking of following in his footsteps and running a crypto exchange from the Bahamas, the DARE Bill includes a specific clause that \"operators of a digital asset exchange must ensure the systems and controls used in its activities are adequate and appropriate for the scale and nature of its business.\"","Another clause bans the issuance of algorithmic stablecoins following last May's <a href=\"https:\/\/www.theblock.co\/post\/147269\/south-korean-politician-calls-for-hearing-terra-do-kwon\" data-v-f87c67ca=\"\">implosion<\/a> of TerraUSD.&nbsp; &nbsp;","\"The amendments strengthen the protection mechanisms such as new disclosure and reporting requirements, specific registration obligations, and enhanced ongoing supervision for operators in the digital asset space,\" the SCB said in its statement. \"The proposed enhancements to the DARE legal framework allow room for digital asset businesses to innovate as the space continues to evolve and provides the flexibility for the Commission to prescribe additional rules applicable to digital asset exchanges and bespoke requirements for different categories of registrants.\"","The consultation runs until May 31, and the authorities hope the bill will become law by the end of the second quarter.&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ray","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"John Ray III","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"Securities Commission","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"end of the second quarter","content":"DATE"},{"type":"SCB","content":"ORGANIZATION"},{"type":"May 31","content":"DATE"}],"hashtag":["FTX"],"authors":["Andrew Rummer","The Block"]}