{"summary":"Bitcoin&#x27;s current lower volatility compared to Nasdaq, S&amp;P 500 and gold suggests that a potential eruption in volatility is imminent.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242617\/bitcoin-volatility-nasdaq-sp-500-gold","publishDate":"2023-08-01T11:42:26","id":9335,"type":null,"title":"Bitcoin now less volatile than Nasdaq, S&amp;P 500 and gold; &#x27;eruption is near&#x27;","category":["MARKET UPDATES"],"content":["Bitcoin has displayed a rare feat of stability, with its 5-day volatility falling below that of major traditional assets like Nasdaq, S&amp;P 500 and gold, according to crypto research firm K33 (formerly Arcane Research).","Meanwhile, bitcoin's 30-day volatility currently sits near five-year lows — at levels only experienced for eight days since January 2019, K33 said in a research report published today. But when bitcoin's volatility becomes less intense, it has historically been followed by periods of high volatility, said the firm. This suggests that the current period of low volatility may soon come to an end, and we could see more significant price swings in the future.","\"My short-term thesis is that the market's volatility pressure is about to climax and that an eruption is near,\" Vetle Lunde, senior analyst at K33, said in the report. \"The tricky job is to build an informed view of when the pressure gets too strong.\"","Some known catalysts could \"ignite the vol bomb,\" he said, \"but often, purely structural squeezes tend to be the force moving the needle.\"","","","Several upcoming events or known catalysts, including responses from the United States Securities and Exchange Commission (SEC) around bitcoin exchange-traded fund (ETF) filings from Ark 21Shares, BlackRock and others, could lead to bitcoin volatility, according to Lunde, over the coming weeks and months.","\"I expect postponements of all active filings, at least until the ongoing <a href=\"https:\/\/www.theblock.co\/post\/241839\/grayscale-pours-cold-water-on-wave-of-new-spot-bitcoin-etf-applications\" data-v-f87c67ca=\"\">Grayscale vs. SEC lawsuit<\/a> reach its conclusion,\" Lunde said. \"Thus, I expect the volatility impact of these events to be less potent for the market. Nonetheless, I favor holding significant exposure in BTC and accumulating more aggressively throughout the summer in case of an earlier-than expected verdict.\"","Unknown catalysts that could increase bitcoin volatility include the troubled decentralized exchange Curve Finance that is facing liquidation risk. \"These liquidations could have dramatic negative spill-over effects on the market, pushing volatility higher,\" Lunde said. \"These events are hard to predict in advance. Similarly, the Grayscale vs. SEC hearing verdict could occur any time in the coming months, representing a further potential volatility catalyst for the market.\"","Overall, Lunde remains bullish on crypto for 2024, ahead of and after the <a href=\"https:\/\/www.theblock.co\/post\/239581\/jpmorgan-bitcoin-halving-stress-test-miners\" data-v-f87c67ca=\"\">Bitcoin halving<\/a>, along with ETF developments and reduced macro constraints.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"January 2019","content":"DATE"},{"type":"Arcane Research)","content":"ORGANIZATION"},{"type":"Vetle Lunde","content":"PERSON"},{"type":"Lunde","content":"PERSON"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Grayscale vs. SEC","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["Yogita Khatri","The Block"]}