{"summary":"Dogecoin network’s daily transactions hit a record high, peaking at over 719,000 with users minting meme tokens via an Ordinals-like system.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231128\/tokens-built-on-dogecoin-results-in-all-time-high-in-daily-transactions","publishDate":"2023-05-17T05:06:03","id":9342,"type":null,"title":"Tokens built on Dogecoin result in all-time high in daily transactions","category":["CRYPTO ECOSYSTEMS"],"content":["The Dogecoin network saw a major uptick in daily transactions, reaching a new high of <a href=\"https:\/\/bitinfocharts.com\/comparison\/transactions-btc-doge.html#3m\" data-v-f87c67ca=\"\">over 719,000<\/a> on Tuesday.","This represents a record in Dogecoin’s daily transaction volume, even surpassing that of the Bitcoin network, according to data from BitInfoCharts. The surge is largely credited to users creating meme tokens using frameworks that are influenced by the Ordinals protocol on Bitcoin, also called \"Doginals.\"","Dogecoin-based meme tokens are based on what’s called the DRC-20 token standard, emulating the functionalities of the <a href=\"https:\/\/www.theblock.co\/post\/229757\/bitcoin-based-brc-20-tokens-combined-market-value-eclipses-900-million\" data-v-f87c67ca=\"\">BRC-20 token standard on Bitcoin<\/a> used for minting fungible tokens. This system allows users to embed data into shibes, the smallest unit of dogecoin, thereby enabling the tracking of both fungible and non-fungible tokens within the network. The system is open to anyone and and there’s an apparent rush among Dogecoin users and developers to mint such tokens.","The development has sparked a considerable increase in user activity which started last week, as <a href=\"https:\/\/twitter.com\/mishaboar\/status\/1657923671371948034\" data-v-f87c67ca=\"\">observed<\/a> by members of the Dogecoin community. Despite this, the near-term future of meme tokens remains clouded in uncertainty. Unlike their BRC-20 equivalents on Bitcoin Ordinals, which boast a market capitalization exceeding $400 million, meme tokens on the Dogecoin network currently lack a liquid market and a well-defined value proposition.","<span data-v-f87c67ca=\"\">Dogecoin and Bitcoin daily transactions | Source: <a href=\"https:\/\/bitinfocharts.com\/comparison\/transactions-btc-doge.html#3m\" data-v-f87c67ca=\"\">BitInfoCharts<\/a><\/span>","Several methods exist for minting such tokens. One popular strategy involves <a href=\"https:\/\/dpalwallet.io\/\" data-v-f87c67ca=\"\">DPal<\/a>, a browser extension wallet for Dogecoin. Numerous users seem to be utilizing this wallet for token minting. But this projects does not offer an \"indexer\" solution, making it challenging for users determine the number of issued tokens and complicating trading markets that can be built around these tokens.","Adding competition to the mix is the token minting service <a href=\"https:\/\/drc-20.org\/\" data-v-f87c67ca=\"\">drc-20.org<\/a>, a website by a project named <a href=\"https:\/\/twitter.com\/verydogelabs\/status\/1658125458595037184\" data-v-f87c67ca=\"\">Doge Labs<\/a> that lets users mint tokens on Dogecoin as well. Unlike DPal, Doge Labs purports to be the first inscription service capable of indexing DRC-20 tokens. This feature claims to provide a network-wide database and registry of such tokens needed to allow the trading of these meme tokens.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tuesday","content":"DATE"},{"type":"DRC","content":"ORGANIZATION"},{"type":"BRC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"20","content":"DATE"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}