{"summary":"Y Combinator, which previously backed OpenSea and Coinbase, has the highest number of crypto startups ever in its latest cohort.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168859\/latest-y-combinator-batch-focuses-on-web3-infrastructure-amid-bear-market","publishDate":"2022-09-12T15:00:02","id":9345,"type":null,"title":"Latest Y Combinator batch focuses on web3 infrastructure amid bear market","category":["STARTUPS"],"content":["The number of crypto startups in the latest batch at Y Combinator, the San Francisco-based accelerator that gave rise to companies like Coinbase and Opensea, has hit a record number despite the global downturn.","A record 30 crypto and web3 companies were invited to take part — beating the last batch's total of 24 — with a strong showing from crypto infrastructure startups.","\"Some of our best companies were funded during a downturn,\" noted Y Combinator managing director Michael Seibel during the first day of Demo Day last Wednesday, a two-day event where startups present their companies to investors over Zoom.&nbsp;","The accelerator is likely betting that these kinds of startups will weather the storm better than previous investments in platforms such as Blocknom and Stablegains, which promised high-yield DeFi \"accounts\" to retail customers.","Blocknom aimed to be the Coinbase Earn of Southeast Asia offering what they called a \"stable\" high-yield interest rate of up to 13% APY on DeFi rails, yet <a href=\"https:\/\/blocknom.medium.com\/we-are-discontinuing-our-services-please-withdraw-your-assets-8aa5ecc080ed\" data-v-f87c67ca=\"\">halted its services July 1<\/a>. Its website is currently <a href=\"https:\/\/www.blocknom.com\/\" data-v-f87c67ca=\"\">inactive<\/a>.","Stablegains offered 15% annual returns on its stablecoin investments yet collapsed as the Terra ecosystem buckled in May. Customers reportedly were not aware of the accounts' exposure to Terra <a href=\"https:\/\/www.businessinsider.com\/terra-luna-cryptocurrency-crash-stablegains-2022-6\" data-v-f87c67ca=\"\">per an Insider report<\/a>.&nbsp;","\"It really was the backing of Y Combinator that sealed the deal,\" a retail investor who used the platform told Insider. \"It seemed suspicious, but it's backed by Y Combinator, so I feel like we can trust what they're claiming.\"","When The Block interviewed <a href=\"https:\/\/www.theblockcrypto.com\/news+\/139564\/funded-coinbase-says-yc-new-crypto-lead-harj-taggar\" data-v-f87c67ca=\"\">Y Combinator crypto lead Harj Taggar<\/a> in March, he spoke about how he was excited about some of the startups that ease access to high-yielding DeFi products for everyday investors. He cited Finnt at the time, a company that was trying to give families more straightforward access to DeFi products. Finnt is yet to launch at the time of publication, encouraging users to sign up for its <a href=\"https:\/\/www.finnt.com\/\" data-v-f87c67ca=\"\">waiting list<\/a>.&nbsp;","From custody and risk solutions (Derisk, Immuna and Terrace) to developer tools (Metafi, OpenPod, Zoltar Labs, Mintplex) and on-chain data tools (Blockscope, Probably Nothing Labs) — close to a third of the startups that took part in the winter batch this year could be classified as web3 infrastructure companies.","According to a July funding report by The Block Research, although the number of infrastructure deals decreased by roughly 22% in July compared to the previous month, the funding, in dollar amount, <a href=\"https:\/\/www.theblockresearch.com\/july-blockchain-funding-recap-162196\" data-v-f87c67ca=\"\">grew 178% from $297 million to nearly $827 million<\/a>.","","","That's not to say that there aren't companies that claim to offer high yields. Sylva, for instance, says it offers an 18% yield through a cross-chain staking strategy which is integrated with its wallet product.","\"We connect users Ethereum to Polkadot staking on Lido,\" said founder Prosser Cathey during his Demo Day presentation. \"In other words, we connect users to 18% APY without making them sacrifice their original ETH exposure. This is over four times the standard staking rate.\"","Y Combinator refused to comment on whether the collapse of Blocknom and Stablegains influenced the type of startups that were accepted in this batch. Yet it did note that quite a few of the web3 startups in its winter batch pivoted into the safer option of providing crypto infrastructure services while taking part.&nbsp;","\"A number of these companies pivoted into these ideas after we accepted them,\" said a Y Combinator spokesperson over email, declining to share names. \"The best founders realize consumers are less excited about trying new crypto applications in the downturn and they've pivoted to building applications for institutions and business.\"&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"22%","content":"PERCENT"},{"type":"Prosser Cathey","content":"PERSON"},{"type":"$297 million","content":"MONEY"},{"type":"Zoltar Labs","content":"ORGANIZATION"},{"type":"178%","content":"PERCENT"},{"type":"Michael Seibel","content":"PERSON"},{"type":"13%","content":"PERCENT"},{"type":"15%","content":"PERCENT"},{"type":"Stablegains","content":"PERSON"},{"type":"July 1","content":"DATE"},{"type":"Southeast Asia","content":"LOCATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$827 million","content":"MONEY"},{"type":"18%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Lido","content":"LOCATION"},{"type":"the first day of Demo Day last Wednesday","content":"DATE"},{"type":"Zoom","content":"LOCATION"},{"type":"Sylva","content":"PERSON"},{"type":"Opensea","content":"LOCATION"}],"hashtag":["CRYPTO"],"authors":["Tom Matsuda","The Block"]}