{"summary":"Ethereum liquid staking derivatives are getting closer to their notional value about a month ahead of withdrawals opening up.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210141\/discounts-premiums-narrow-for-ethereum-liquid-staking-derivatives-ahead-of-shanghai","publishDate":"2023-02-09T10:04:11","id":9350,"type":null,"title":"Discounts, premiums narrow for Ethereum liquid staking derivatives ahead of Shanghai","category":["CRYPTO ECOSYSTEMS"],"content":["Discounts and premiums on Ethereum liquid staking derivative (LSD) tokens have fallen ahead of the upcoming Shanghai-Capella upgrades.","The top five biggest LSDs have narrowed toward their notional value by 0.17% to 1.42% since the start of the year.","LSDs are tokens issued to match ether that has been staked on the network. They are used to free up liquidity since the underlying ether is locked and can’t be withdrawn until the upcoming upgrades. Typically each LSD is backed by one ether, although LSDs from Rocketpool and Coinbase work slightly differently as they are non-rebasing tokens, so their value increases in line with staking rewards.","Four of the top LSDs, run by Lido, Coinbase, Frax and StakeWise, have typically traded below their notional values. Yet these negative premiums have declined in the last few weeks ahead of Shanghai. Coinbase’s LSD saw the biggest reduction in its negative premium by 1.42% — although it remains 2.7% below its notional value. Frax, while the least changed, saw its discount eliminated entirely and is now trading at par with ether.","As for Rocketpool’s LSD, it still trades at a premium to its notional value of 1.05 ether, though that's declined to 1.3% from 2.3% at the start of the year.","It’s unsurprising that such discounts and premiums have narrowed as Shanghai approaches because traders will soon be able to redeem the underlying assets.","\"The reduction in discount shows market participants are expecting that the Shanghai upgrade will likely be successfully implemented without delay which will enable the withdrawal of staked ether,\" said Eden Au, research director at The Block Research.","That said, when withdrawals are enabled, the tokens won’t necessarily trade 1:1 with their underlying assets. This is because withdrawals will still take up to a week to be carried out, meaning there will likely be a slight premium for those who want to cash out immediately on the open market.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Rocketpool’s LSD","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"1.42%","content":"PERCENT"},{"type":"Lido","content":"LOCATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Rocketpool","content":"ORGANIZATION"},{"type":"2.7%","content":"PERCENT"},{"type":"0.17%","content":"PERCENT"},{"type":"1.3%","content":"PERCENT"},{"type":"2.3%","content":"PERCENT"},{"type":"Shanghai","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}