{"summary":"Coinbase CEO Brian Armstrong sought to differentiate the company from rival crypto exchange Binance after the U.S. Securities and Exchange Commission sued both companies.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233542\/coinbase-ceo-seeks-to-differentiate-company-from-binance-in-wake-of-sec-lawsuits","publishDate":"2023-06-07T11:41:31","id":9356,"type":null,"title":"Coinbase CEO seeks to differentiate company from Binance after SEC suit","category":["COMPANIES"],"content":["Coinbase CEO Brian Armstrong sought to differentiate the company from rival crypto exchange Binance after the U.S. Securities and Exchange Commission filed <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">separate lawsuits<\/a> against both firms this week.","\"The companies could really not be more different, and the suits could not be more different,\" Armstrong <a href=\"https:\/\/twitter.com\/SquawkCNBC\/status\/1666431832684986368\" data-v-f87c67ca=\"\">said on CNBC<\/a> on Wednesday, according to an emailed transcript.","Armstrong noted that there had been no allegation of misappropriation of customer funds and said he had not been named personally in the suit.&nbsp;","\"The complaint in the Coinbase situation is really a technical matter about do you classify these as commodities or securities,\" he continued. \"We’re based here in the U.S. We’ve never operated a hedge fund or something that trades against our customers. We, all our financial statements are audited.\"","Coinbase was sued by the SEC on Tuesday, just one day after the regulator sued Binance. While the lawsuits are distinct, Moses Singer partner Howard Fischer told The Block that there were <a href=\"https:\/\/www.theblock.co\/post\/233488\/sec-lawsuits-against-coinbase-and-binance-could-result-in-massive-payday-for-lawyers\" data-v-f87c67ca=\"\">some similarities<\/a>, particularly in how the agency called out the market structure that underpins both venues.","Armstrong also told CNBC that he did not regret taking the company public.&nbsp;","\"I’m glad we became a public company,\" he said. \"It’s not easy to go first. You’re going to take a few arrows, you know, we have to educate the public market, investors. We have to deal with the SEC but that’s what being the leader in the space means and so, we’re happy to do that.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Howard Fischer","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Moses Singer","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}