{"summary":"Non-custodial crypto exchange Synthetix, which is built on the Ethereum blockchain, is planning to add several new features to its platform, including derivatives trading.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58241\/non-custodial-crypto-exchange-synthetix-is-preparing-to-offer-derivatives-trading-on-ethereum","publishDate":"2020-03-10T05:10:14","id":9357,"type":null,"title":"Non-custodial crypto exchange Synthetix is preparing to offer derivatives trading on Ethereum","category":["DEX"],"content":["Non-custodial crypto exchange Synthetix, which is built on the Ethereum blockchain, is planning to add several new features to its platform, including derivatives trading.","Announcing the news on Tuesday, Synthetix <a href=\"https:\/\/blog.synthetix.io\/product-roadmap-update\/\" data-v-f87c67ca=\"\">said<\/a> it is planning to launch trading in binary options, as well as futures in Q3 of this year. <a href=\"https:\/\/www.theblockcrypto.com\/post\/41457\/sequoia-backed-startup-band-protocol-releases-its-first-dapp-bitswing-that-allows-users-to-trade-bitcoin-binary-options\" data-v-f87c67ca=\"\">Binary options<\/a> are a type of derivative product in which a trader either receives a payout or loses their investment.","“Synthetic binary options will likely generate significant trading volume as they will be able to leverage the liquidity of the debt pool, allowing a trader to take a large position almost immediately without needing to find a counterparty,” said Synthetix.","While for futures trading, the exchange said it would support any asset class, including crypto, equities, and commodities. “We expect leverage will initially be capped at 10-20x,” said Synthetix.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIt added that one of the advantages of synthetic futures over perpetual bitcoin futures would be “a position being liquidated will not require liquidation of the underlying asset,” which eliminates the need for margin calls.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Traditional assets and other features&nbsp;<\/strong><\/span>","Interestingly, Synthetix is also planning to support “a huge number of new assets” in Q2, including equities and exchange-traded funds (ETFs). “Being able to trade from an ETF to Gold and then into an inverse crypto index product with a few clicks will provide an unparalleled user experience,” said the exchange.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"We are in the process of migrating the price feeds to Chainlink so the addition of any specific asset will be controlled via community consensus, with a request for a new price feed from Chainlink,\" Synthetix founder and CEO Kain Warwick told The Block.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Once that oracle is available then a SIP (Synthetix improvement proposal) can be raised to integrate it into the protocol. So the community will need to weight up the regulatory risk associated with including each asset before upgrading the protocol,\" he added.","Further, to capture additional trading volume, Synthetix said it is preparing to offer leveraged trading in Q2. The exchange would initially test leveraged tokens using fiat currencies like the euro and the Australian dollar. “We expect to support 5x and 10x BTC tokens both long and short soon after we launch fiat leverage tokens,” said Synthetix, adding that other \"large cap crypto tokens\" could also be supported in the future.","Other features planned for later this year include advanced order types, trading incentives, ether\/DAI\/BTC collateral and optimistic rollup, among others. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nOptimistic rollup is a layer-2 technology that scales Ethereum smart contracts and decentralized apps. Synthetix said it is “getting closer to a demo” of optimistic rollup with the Optimism team. Based on the feedback from this demo, the exchange could roll out a version of Synthetix that runs entirely on optimistic rollup later this year.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSynthetix is backed by Framework Ventures, having <a href=\"https:\/\/www.theblockcrypto.com\/linked\/44994\/defi-project-synthetix-raises-3-8m-from-framework-ventures\" data-v-f87c67ca=\"\">raised<\/a> $3.8 million from the venture firm in October 2019.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Third-largest DeFi project&nbsp;<\/strong><\/span>","Founded in 2017, Synthetix is currently the third-largest decentralized finance (DeFi) project in the space, having nearly $94 million in total locked value, according to <a href=\"https:\/\/defipulse.com\/\" data-v-f87c67ca=\"\">DeFi Pulse<\/a>.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn comparison, DeFi giants, MakerDAO and Compound, have ~$525 million and ~$128 million in total locked value, respectively.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhile the total value locked provides an idea of the DeFi growth, it falls short in accurately reflecting DeFi activity, as The Block’s research analyst Matteo Leibowitz <a href=\"https:\/\/www.theblockresearch.com\/introducing-the-blocks-open-finance-index-ofi-49568\" data-v-f87c67ca=\"\">noted<\/a> recently. For instance, the value locked fails to account for non-custodial exchange volumes.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn an attempt to more accurately measure DeFi activity, Leibowitz developed an alternative metric -&nbsp;<a href=\"https:\/\/www.theblockresearch.com\/introducing-the-blocks-open-finance-index-ofi-49568\" data-v-f87c67ca=\"\">The Block’s Open Finance Index (OFI)<\/a>.&nbsp; OFI departs from total value locked and aggregates vertical-specific metrics, including outstanding debt for lending, transaction volume for payments and volume for exchanges.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">UPDATE -<\/strong>&nbsp;5:30 am EST: This story has been updated to include comments from Synthetix founder and CEO Kain Warwick.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Leibowitz","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"Synthetix","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"October 2019","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$94 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Chainlink","content":"LOCATION"},{"type":"Framework Ventures","content":"ORGANIZATION"},{"type":"$3.8 million","content":"MONEY"},{"type":"Matteo Leibowitz","content":"PERSON"},{"type":"$128 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Kain Warwick","content":"PERSON"},{"type":"oracle","content":"ORGANIZATION"},{"type":"DeFi Pulse","content":"ORGANIZATION"},{"type":"$525 million","content":"MONEY"},{"type":"euro","content":"ORGANIZATION"}],"hashtag":["DERIVATIVES"],"authors":["Yogita Khatri","The Block"]}