{"summary":"Decentralized app Modclub will help OpenChat with content moderation while also launching a facial recognition trial.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263579\/proving-youre-human-internet-computer-app-openchat-to-test-facial-recognition","publishDate":"2023-11-18T08:01:07","id":9358,"type":null,"title":"Proving you’re human: Internet Computer app OpenChat to test facial recognition","category":["SOCIAL PLATFORMS"],"content":["<span data-v-f87c67ca=\"\">Decentralized chat app OpenChat, which is <\/span><span data-v-f87c67ca=\"\">based on the <\/span><a href=\"https:\/\/www.theblock.co\/linked\/104146\/dfinity-launches-internet-computer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Internet Computer<\/span><\/a><span data-v-f87c67ca=\"\"> blockchain, wants to foster more virtuous discourse on social media and believes that requiring users to both prove they are human and possess only one account may be the way forward.<\/span>","<span data-v-f87c67ca=\"\">To do so the on-chain messaging app, likened to Discord and Slack, plans on testing facial recognition.<\/span>","<span data-v-f87c67ca=\"\">\"Proof of humanity is one thing, and that’s relatively easy to do. What’s harder is proof of unique humanity. I can solve all sorts of proof of humanity tests but I could do it a hundred times over and get a hundred accounts,\" OpenChat co-founder <\/span><span data-v-f87c67ca=\"\">Matt Grogan<\/span><span data-v-f87c67ca=\"\"> told The Block. \"This is massive for this space, proof of unique humanity,\" he added, mentioning how eliminating people from piloting multiple online accounts could limit how much some users take advantage of token farming or airdrops by using more than one account.<\/span>","<span data-v-f87c67ca=\"\">OpenChat, which has more than 100,000 users, <\/span><a href=\"https:\/\/twitter.com\/OpenChat\/status\/1725156479135617396\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">recently partnered<\/span><\/a><span data-v-f87c67ca=\"\"> with Modclub, a platform focused primarily on decentralized content moderation. But the platform, which also runs on Internet Computer, will also be testing facial recognition for OpenChat as part of the push to implement a “proof of unique humanity” system, said Grogan.<\/span>","<span data-v-f87c67ca=\"\">\"They’ve got facial recognition … we’re going to trial it and see how it runs,\" he said. “It’s not going to be 100% perfect, but it should limit how easy it is to have multiple identities.”<\/span>","<span data-v-f87c67ca=\"\">Grogan said the company is still working out details regarding the trial and, at least for now, OpenChat isn't going to require all users to verify they are human and only possess one account. But proving unique humanity through facial recognition might be something OpenChat uses in the future when determining who is eligible for future airdrops, he added. Lastly, Grogan said he can envision users eventually taking advantage of the facial recognition in order to strengthen their reputation on the platform.<\/span>","<span data-v-f87c67ca=\"\">Up until now, unlike traditional social media platforms, which use email IDs and a unique usernames, <a href=\"https:\/\/www.theblock.co\/post\/217854\/openchat-to-transfer-control-to-community-after-5-5-million-decentralization-sale\" data-v-f87c67ca=\"\">OpenChat has utilized<\/a> crypto addresses and NFTs for authentication and monetization purposes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Users anonymously using multiple accounts and bots has long been considered an issue that not only contributes to the amount of illicit behavior conducted online, but also underpins the level of toxic discourse prevalent on traditional social networking platforms like Facebook and X (formerly Twitter).<\/span>","<span data-v-f87c67ca=\"\">Modclub is hoping to help prevent similar behavior on OpenChat. Earlier this week, the platform announced its partnership with OpenChat. <\/span><span data-v-f87c67ca=\"\">\"Users on the OpenChat platform will have the ability to report content that violates the rules established by the OpenChat DAO. These reports will be sent to Modclub’s pool of moderators for careful review,\" the platform <\/span><a href=\"https:\/\/medium.com\/@modclub\/openchat-partners-with-modclub-for-decentralized-content-moderation-856548fd6f92\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said in its post<\/span><\/a><span data-v-f87c67ca=\"\">. \"Decisions will be made, and content will either be removed or allowed to remain based on the results.\"<\/span>","<span data-v-f87c67ca=\"\">In the past it has generally been the responsibility of the leaders running specific groups and communities that exist within OpenChat to moderate discourse, according to Grogan. The moderation tactics are meant to be guided, at least in part, by OpenChat’s high-level platform rules, he also said.<\/span>","<span data-v-f87c67ca=\"\">With the new partnership, however, OpenChat will be “offloading” that responsibility to Modclub, which incentivizes its moderators by paying them in crypto.<\/span>","Besides hoping to foster a reputation system which incentivizes virtuous discourse, OpenChat also currently rewards users with tokens in an effort spur growth and engagement.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Modclub","content":"PERSON"},{"type":"Grogan","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Modclub","content":"LOCATION"},{"type":"Matt Grogan","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Modclub","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}