{"summary":"The People&#x27;s Bank of China has published a whitepaper for the digital yuan, marking yet another step towards its official rollout.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/111648\/china-digital-yuan-whitepaper-smart-contract-programmability","publishDate":"2021-07-16T04:39:47","id":9359,"type":null,"title":"China’s first e-CNY whitepaper confirms smart contract programmability","category":["CHINA"],"content":["The People's Bank of China (PBoC) has published a whitepaper for the country's central bank digital currency for the first time, marking yet another step toward its official rollout.","The PBoC issued a whitepaper on Friday for its digital yuan project, also dubbed the e-CNY, which notably confirms that the digital fiat currency is designed to be programmable with smart contract features. The PBoC said during recent pilots, smart contracts were already \"used to make the e-CNY programmable, more expandable, and better integrated into various scenarios.\"","But the central bank has not set any concrete roadmap or timeline for an official launch.","The whitepaper at a high level explains the background, features and the progress of the e-CNY initiative that started in 2014. According to the <a href=\"http:\/\/www.pbc.gov.cn\/en\/3688110\/3688172\/4157443\/4293696\/2021071614584691871.pdf\" data-v-f87c67ca=\"\">paper<\/a>, part of the bigger context that pushed China into the research and development of the e-CNY was the emergence of cryptocurrencies and the risks and challenges they brought to the existing financial system.","\"Adopting blockchain and encryption technology, cryptocurrencies such as Bitcoin are claimed to be decentralized and entirely anonymous. However, given their lack of intrinsic value, acute price fluctuations, low trading efficiencies and huge energy consumption, they can hardly serve as currencies used in daily economic activities. In addition, cryptocurrencies are mostly speculative instruments, and therefore pose potential risks to financial security and social stability,\" the PBoC wrote.","\"To tackle the relatively big price fluctuation concern of cryptocurrencies, some commercial institutions launched so-called 'stablecoins,' and tried to stabilize their values by pegging them to sovereign currencies or related assets,\" the central bank continued. \"Some commercial institutions even plan to launch global stablecoins, which will bring risks and challenges to the international monetary system, payment and clearing system, monetary policies, cross-border capital flow management and etc.\"","Under the section about the e-CNY's design characteristics, the PBoC confirmed that one of its seven major features is programmability. This is also the first time that the Chinese central bank has officially clarified there will be programmability built into the e-CNY.&nbsp;","\"E-CNY obtains programmability from deploying smart contracts that don’t impair its monetary functions. Under the premise of security and compliance, this feature enables self-executing payments according to predefined conditions or terms agreed between two sides, so as to facilitate business model innovation,\" the PBoC wrote in the whitepaper.&nbsp;","The description to some extent comes at odds with what PBoC's officials said in remarks in <a href=\"http:\/\/www.xinhuanet.com\/fortune\/2018-01\/26\/c_129799751.htm\" data-v-f87c67ca=\"\">2018<\/a> and <a href=\"https:\/\/www.yicai.com\/news\/100291222.html\" data-v-f87c67ca=\"\">2019<\/a>.","Mu Changchun, the head of the PBoC's digital currency research lab and Fan Yifei, a vice governor of the PBoC, expressed contrary opinions on the \"programmability\" front of the e-CNY. They said the e-CNY could add on smart contracts that would help it better perform its role as a currency. But for smart contracts beyond the role as a currency, they could be \"undermining the Renminbi by adding extra social or administrative functions,\" they said.","In fact, the latest e-CNY test in the Chinese city of Chengdu is already experimenting the <a href=\"https:\/\/www.theblockcrypto.com\/post\/110377\/china-digital-yuan-test-programmable-chengdu\" data-v-f87c67ca=\"\">confined usage<\/a> of the e-CNY for specified purposes only. In this test, the e-CNY is programmed to only be spent on subway and bus tickets, along with shared bike services.","The dozens of patents that the PBoC have been <a href=\"https:\/\/www.theblockcrypto.com\/daily\/81710\/china-digital-currency-patents\" data-v-f87c67ca=\"\">authorized<\/a> also shows the technology capabilities of the e-CNY for tracing transactions to ensure funds are being spent on intended goals.","The PBoC also added in the whitepaper that as of June 30, various tests of the e-CNY in multiple Chinese cities have seen 70 million transactions totaling to 34.5 billion yuan, or $5.3 billion, through 20 million retail e-CNY wallets and 3.5 million business e-CNY wallets.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"People's Bank of China (PBoC","content":"ORGANIZATION"},{"type":"2014","content":"DATE"},{"type":"June 30","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"PBoC","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Chengdu","content":"LOCATION"},{"type":"Changchun","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"Fan Yifei","content":"PERSON"},{"type":"34.5 billion yuan","content":"MONEY"},{"type":"$5.3 billion","content":"MONEY"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}