{"summary":"Swyftx has announced 90 job cuts in its second round of layoffs. The Australian crypto exchange fired 74 employees in August.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192060\/australia-crypto-exchange-swyftx-layoffs","publishDate":"2022-12-05T06:16:38","id":9371,"type":null,"title":"Australian crypto exchange Swyftx cuts 90 jobs in second round of layoffs","category":["EXCHANGES"],"content":["Australian crypto exchange Swyftx has fired 90 employees in its second round of layoffs in four months.","\"Swyftx has no direct exposure to FTX, but we are not immune to the fallout it has caused in the crypto markets,\" co-founder and CEO Alex Harper <a href=\"https:\/\/swyftx.com\/au\/media\/press-releases\/swyftx-announces-further-team-changes\/\" data-v-f87c67ca=\"\">said<\/a> in a note to employees on Monday.","The laid-off staff <a href=\"https:\/\/www.afr.com\/technology\/brisbane-crypto-exchange-fires-90-staff-as-ftx-collapse-carnage-spreads-20221205-p5c3px\" data-v-f87c67ca=\"\">reportedly<\/a> translates to around 35% of the company's workforce.","The second round of redundancies <a href=\"https:\/\/swyftx.com\/au\/media\/press-releases\/changes-to-the-team-2022\/\" data-v-f87c67ca=\"\">comes<\/a> four months after Swyftx let go of 74 employees in August. Commenting on the latest cuts, Harper said that Swyftx has to \"prepare in advance for a worst-case scenario of further significant drops in global trade volumes during H1 next year and the potential for more black swan-type events.\"","Founded in 2018, Swyftx claims to have more than 630,000 customers. In June, Swyftx <a href=\"https:\/\/swyftx.com\/news\/swyftx-merges-with-superhero\/\" data-v-f87c67ca=\"\">agreed<\/a> to merge with local investing platform Superhero to create a $1.5 billion player with 800,000 customers. Swyftx is now open to raising funds in the currently challenging market conditions.","\"I know some of you have asked about our plans to raise funds. I do need to say that we'd be taking this action irrespective of any potential growth equity raise,\" said Harper. \"Every tech business in the world right now is scrutinizing their costs and Swyftx is no different.\"","The job cuts come amid the so-called crypto winter. Last week, Singapore-based crypto exchange Bybit <a href=\"https:\/\/www.theblock.co\/post\/191969\/bybit-reducing-workforce-bear-market?utm_source=basicrss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">announced<\/a> the second round of layoffs. In recent weeks and months, several exchanges have announced job cuts, including Coinbase, Kraken and Bitso.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Swyftx","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"$1.5 billion","content":"MONEY"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Alex Harper","content":"PERSON"},{"type":"Harper","content":"PERSON"},{"type":"35%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"August","content":"DATE"}],"hashtag":["LAYOFFS"],"authors":["Yogita Khatri","The Block"]}