{"summary":"FTX CEO Sam Bankman-Fried sold equity in the firm at a 50% discount to employees in the spring, sources tell The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185655\/bankman-fried-sold-ftx-equity-to-employees-at-50-discount-in-spring-sources","publishDate":"2022-11-10T18:34:36","id":9376,"type":null,"title":"Bankman-Fried sold FTX equity to employees at 50% discount in spring: Sources","category":["EXCHANGES"],"content":["FTX CEO Sam Bankman-Fried sold equity in the firm at a 50% discount to employees in the spring, a person familiar with the matter told The Block.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn June, about 20 people were fired off across the organization due to performance, the person said. Separately, the head of institutional sales, Zane Tackett, <a href=\"https:\/\/twitter.com\/tackettzane\/status\/1590836780731109377?s=46&amp;t=JfoLiPoNHBzGrZru49Rsyw\" data-v-f87c67ca=\"\">appears<\/a> to have been terminated on Nov. 10, according to a posting on his Twitter account. The firm declined to comment.","Adding to the chaos is news that current FTX employees are scrambling to sell assets, Bloomberg first <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-11-10\/inside-ftx-us-employees-are-trying-to-sell-assets-with-sbf-away?srnd=premium\" data-v-f87c67ca=\"\">reported<\/a>.","FTX is looking for liquidity amid an ongoing crisis. Binance bailed out of a plan to buy FTX.com a day after making the deal, leaving FTX to fend for itself.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBankman-Fried gave a lengthy mea culpa on Twitter on Thursday, in which he apologized again and said he is doing everything he can to make users whole.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Zane Tackett","content":"PERSON"},{"type":"Nov. 10","content":"DATE"},{"type":"spring","content":"DATE"}],"hashtag":["FTX"],"authors":["Frank Chaparro","Christiana Loureiro","The Block"]}