{"summary":"Gaming segment sales were $1.6 billion, a decline of 51% year-over-year and 23% from the previous quarter. Analysts expected $1.4 billion.  ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187698\/nvidia-revenue-beats-estimates-gaming-segment-also-tops-expectations","publishDate":"2022-11-16T16:42:31","id":9379,"type":null,"title":"Nvidia revenue beats estimates, gaming segment also tops expectations","category":["COMPANIES"],"content":["Nvidia's fiscal third quarter revenue beat analyst estimates while sales from its gaming segment, which includes crypto-related revenue, also topped expectations.","The chipmaker posted quarterly revenue of $5.93 billion after forecasting last quarter that sales would be between about $5.8 billion and $6 billion. Analysts surveyed by FactSet expected $5.78 billion.","Gaming segment sales were $1.6 billion. That's a decline of 51% year-over-year and 23% from the previous quarter. Analysts expected $1.4 billion.&nbsp;&nbsp;","\"We believe the recent transition in verifying Ethereum cryptocurrency transactions from proof-of-work to proof-of-stake has reduced the utility of GPUs for cryptocurrency mining,\" the company said in a statement. \"This may have contributed to increased aftermarket sales of our GPUs in certain markets, potentially impacting demand for some of our products, particularly in the low-end.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNvidia has been<span data-v-f87c67ca=\"\"> saying since the first quarter of this year that it “expected cryptocurrency mining to make a diminishing contribution to Gaming demand,” though it couldn't quantify the extent of the decline.<\/span>","Adjusted earnings per share of 58 cents missed the estimate of 71 cents.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe company forecast revenue of $6 billion, plus or minus 2%, in the current quarter, matching estimates.&nbsp;","Shares of Nvidia have dropped by some 50% over the past year amid supply chain problems and the cloudy global economic outlook.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.4 billion","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"$5.8 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$5.78 billion","content":"MONEY"},{"type":"$1.6 billion","content":"MONEY"},{"type":"Nvidia","content":"ORGANIZATION"},{"type":"23%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"51%","content":"PERCENT"},{"type":"$6 billion","content":"MONEY"},{"type":"58 cents","content":"MONEY"},{"type":"71 cents","content":"MONEY"},{"type":"last quarter","content":"DATE"},{"type":"third quarter","content":"DATE"},{"type":"$5.93 billion","content":"MONEY"},{"type":"the first quarter of this year","content":"DATE"},{"type":"FactSet","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}