{"summary":"Crypto yields have fallen consistently since peaking last year as stablecoin yields begin to follow suit.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/148146\/waning-institutional-demand-is-forcing-high-yield-crypto-accounts-to-slash-rates","publishDate":"2022-05-21T06:27:38","id":938,"type":null,"title":"Waning institutional demand is forcing high-yield crypto accounts to slash rates","category":["MARKETS"],"content":["<span data-v-f87c67ca=\"\">The returns available on crypto holdings have fallen to their lowest levels in more than a year<\/span> <span data-v-f87c67ca=\"\">on some platforms as institutional demand to borrow recedes, diminishing one of the market’s most attractive selling points for smaller investors.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Crypto lending platforms such as BlockFi and Celsius have experienced staggering growth since 2020, attracting millions of customers by providing yields to individual investors that have ranged from a few percent to as high as 17%.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">These platforms take deposited funds and lend them to institutional investors, returning most of the yield to their customers. Through this business, BlockFi saw assets under management increase by 1,711% in 2020 alone, according to the <\/span><a href=\"https:\/\/twitter.com\/BlockFi\/status\/1363940678414270464?s=20&amp;t=mc6q6XDV_2rPN1TLqxTX1A\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">company<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Rivals Nexo and Celsius have also seen big growth, with the latter increasing its assets under management by more than 1,900% in less than a year, according to a news release from the <\/span><a href=\"https:\/\/www.prnewswire.com\/news-releases\/celsius-network-assets-are-officially-over-20-billion-301361803.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">company<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As of March 2021, BlockFi held $14.7 billion in assets through its BlockFi Interest Account, while competitors Nexo and Celsius advertise present holdings in excess of&nbsp; $12 billion and $20 billion respectively.<\/span>","<span data-v-f87c67ca=\"\">Now, many of these companies are cutting the returns they pay to clients as borrowing demand from institutions wanes in the face of stagnating crypto prices.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">BlockFi, for example, used to offer 6.25% to those holding more than one bitcoin. Now, it offers between 1% and 3% on up to 0.35 bitcoin, and 0.1% additionally on greater amounts. Similarly, Celsius has gone from offering 6.2% to 3.05%.<\/span>","<span data-v-f87c67ca=\"\">The slide is also affecting returns on investments in stablecoins, crypto tokens that are meant to track the value of fiat currencies such as the US dollar.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Crypto lending platforms BlockFi and Ledn both dropped stablecoin rates at the start of this month, as they fell to 7% from 7.25% and to 7.5% from 8% respectively (for all stablecoins they both offer, except for USDT for BlockFi). In March, Celsius lowered its savings rates on all stablecoins, except DAI, to 7.1% from 8.5%.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In Ledn’s <\/span><a href=\"https:\/\/blog.ledn.io\/en\/05\/03\/2022?utm_campaign=New%20BEC&amp;utm_medium=email&amp;_hsmi=211954087&amp;_hsenc=p2ANqtz-_CBNb9Zi05Uj9WWw5xaSCpzCNiwcpQkzCcTOFCagdpYXNh7inlCUhQmsHlQAXnkl7EVDq51Hxph28V6P6NUVFGA6utz8pItdHXH_FoG36IX1xXkOY&amp;utm_content=211954087&amp;utm_source=hs_email\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">update<\/span><\/a><span data-v-f87c67ca=\"\"> on its rate cut at the beginning of May, it provided a few reasons why institutional demand to borrow crypto — the driver of consumer yields — is decreasing.<\/span>","<span data-v-f87c67ca=\"\">For a start, institutional traders find it easier to profit from a crypto market that’s in a state of contango, when the price of futures contracts is higher than the current spot price.<\/span>","<span data-v-f87c67ca=\"\">A contango allows traders to profit from buying spot bitcoin while simultaneously taking a short position through options or futures. A fading contango equals decreasing demand to borrow to fund such trades.<\/span>","<span data-v-f87c67ca=\"\">Ledn also said it’s seeing fewer arbitrage opportunities across crypto exchanges, affecting demand from market makers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Market makers borrow digital assets to exploit price arbitrages across exchanges. For example, bitcoin purchase prices may vary from one exchange to another, creating an opportunity for institutions to exploit the price difference for profits.<\/span>","<span data-v-f87c67ca=\"\">Ledn’s rates update notes that the average spread on a $1 million dollar buy order for bitcoin on Coinbase and FTX has halved over the last 3 months. It has gone from around 0.16% in February to 0.08% at present. This affects the return institutions can make from arbitrage trading and in turn lowers the propensity to pay higher borrowing costs.<\/span>","<span data-v-f87c67ca=\"\">Joe Hickey, head of trading at BlockFi, echoed these points and told The Block that while there is still a lot of demand for crypto loans, key indicators including the implied rate and open interest, the total number of open futures contracts, are substantially lower than last year. Those are bearish signals.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/average-daily-volume-of-cme-bitcoin-futures-monthly\/embed\" title=\"Volume and OI of CME Bitcoin futures\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">Despite rates dropping, Hickey predicted that yields will bounce back. “People are continuing to invest and I think it's kind of a short-term phenomena and that we're going to see yields in the second half of the year going higher again.”<\/span>","<span data-v-f87c67ca=\"\">For now, however, rates have begun to fall for stablecoins and other major crypto assets. Ledn’s rates for all USDC balances fell to 7.5% from the beginning of May from highs of 9.25% in March. Meanwhile, BlockFi also dropped stablecoin rates, excluding USDT, to 7% from 7.25% for the same period. On March 4, Celsius had lowered its savings rates on all stablecoins, except DAI, to 7.1% from 8.5%.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ledn’s rates on bitcoin balances up to 0.1 bitcoin fell to 5.25%, and to 2% for all balances greater than that from May, while BlockFi also dropped rates for bitcoin and ether to 3% from 4%, in line with a cut Celsius implemented in March.<\/span>","<span data-v-f87c67ca=\"\">Elsewhere, Crypto.com has announced changes to the allocations and tier structure of its rewards feature from June 1. Currently, it splits its earn feature into two tiers: the first offers full rewards rates on allocations less than or equal to $30,000, while the second tier offers 50% rewards above that threshold.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">From the first of June, the threshold for the first tier will drop 90%, with full rewards rates offered only on allocations up to and including $3,000 for tier one, while tier two will receive the remaining $27,000 worth of allocations at 50% of the tier one rate. Once both of these tiers are full any subsequent allocations will fall under tier three and receive 30% the tier two rate.<\/span>","<span data-v-f87c67ca=\"\">Still, yields had remained high on decentralized lending platforms including Anchor — which was supposed to pay out 19.5% to lenders of Terra USD (UST). However, after <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/146444\/terra-luna-and-ust-how-we-got-here\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">last week's collapse<\/span><\/a><span data-v-f87c67ca=\"\"> of UST,&nbsp; a stablecoin at the heart of the Terra network, investors hunting for yields may have to resign themselves to lower returns from both centralized lenders and decentralized platforms. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"$3,000","content":"MONEY"},{"type":"7.25%","content":"PERCENT"},{"type":"June 1","content":"DATE"},{"type":"8%","content":"PERCENT"},{"type":"$1 million dollar","content":"MONEY"},{"type":"8.5%","content":"PERCENT"},{"type":"4%","content":"PERCENT"},{"type":"1,711%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"0.1%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"7%","content":"PERCENT"},{"type":"7.5%","content":"PERCENT"},{"type":"USDT","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"7.1%","content":"PERCENT"},{"type":"$30,000","content":"MONEY"},{"type":"19.5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"9.25%","content":"PERCENT"},{"type":"March 2021","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"second half of the year","content":"DATE"},{"type":"March","content":"DATE"},{"type":"June","content":"DATE"},{"type":"$14.7 billion","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"$27,000","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"3.05%","content":"PERCENT"},{"type":"17%","content":"PERCENT"},{"type":"Celsius","content":"ORGANIZATION"},{"type":"$20 billion","content":"MONEY"},{"type":"March 4","content":"DATE"},{"type":"6.2%","content":"PERCENT"},{"type":"Hickey","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"1,900%","content":"PERCENT"},{"type":"5.25%","content":"PERCENT"},{"type":"Terra USD","content":"ORGANIZATION"},{"type":"$12 billion","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"last week","content":"DATE"},{"type":"1%","content":"PERCENT"},{"type":"0.16%","content":"PERCENT"},{"type":"Joe Hickey","content":"PERSON"},{"type":"UST","content":"ORGANIZATION"},{"type":"6.25%","content":"PERCENT"},{"type":"0.08%","content":"PERCENT"}],"hashtag":["BITCOIN","ETHEREUM","USDC"],"authors":["Adam Morgan McCarthy","The Block"]}