{"summary":"India&#x27;s junior finance minister Anurag Thakur has said that the country&#x27;s government will &quot;soon&quot; bring a bill on cryptocurrencies.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/94290\/india-crypto-bill-finance-ministry-thakur-sitharaman-comments","publishDate":"2021-02-09T07:30:12","id":9384,"type":null,"title":"India will &#x27;soon&#x27; bring a crypto bill, says the country&#x27;s junior finance minister","category":["ASIA"],"content":["India's minister of state for finance and corporate affairs Anurag Thakur has said that the country's government will \"soon\" put forward a bill on cryptocurrencies.","\"The bill is being finalized and would be sent to the cabinet soon, so we'll be bringing the bill soon,\" Thakur <a href=\"https:\/\/twitter.com\/Anurag_Office\/status\/1359036348028522498?s=20\" data-v-f87c67ca=\"\">said<\/a> on Tuesday while replying to a question in the Rajya Sabha, the upper house of the Indian Parliament.","Thakur said existing laws in India are \"inadequate\" to regulate cryptocurrencies. Thus, an inter-ministerial committee (IMC) was formed on the subject, and that committee submitted its report, said Thakur.","Post that, there was also a meeting of the empowered technology group, said Thakur, adding that the committee of secretaries chaired by the cabinet secretary has also given its report.","\"Now the government has prepared the bill, and it will be coming to the Parliament soon, and we can have a detailed discussion on that,\" said Thakur.","Meanwhile, responding to the same question, India's finance minister Nirmala Sitharaman <a href=\"https:\/\/pqars.nic.in\/annex\/253\/AS79.pdf\" data-v-f87c67ca=\"\">said<\/a> Tuesday in her written response that the \"Government would take a decision on the recommendations of the IMC and the legislative proposal, if any, would be introduced in the Parliament following the due process.\"","By the IMC, both Thakur and Sitharaman <a href=\"https:\/\/www.theblockcrypto.com\/linked\/26349\/indias-draft-bill-proposes-a-10-year-jail-sentence-for-using-cryptocurrencies\" data-v-f87c67ca=\"\">were referring to<\/a> the 2019 recommendations drafted by former finance and economic affairs secretary Subhash Chandra Garg, who suggested banning \"private cryptocurrencies.\"","The definition of private cryptocurrencies is not yet known, but Sitharaman appears to be suggesting that private cryptocurrencies include all crypto assets apart from those issued by a central bank. As she today noted, the IMC recommended in its report that \"all private cryptocurrencies, except any cryptocurrency issued by the State, be prohibited in India.\"","The final text of the bill is unknown. It is expected to be made public within the current Parliament session, which concludes on April 8. A recess will be held between February 15 and March 8.","As The Block previously reported, if the crypto ban discussions happen, the <a href=\"https:\/\/www.theblockcrypto.com\/daily\/68133\/india-crypto-ban-revived-report\" data-v-f87c67ca=\"\">process would be long and take time<\/a>. “It is a long journey from draft cabinet note to law, and it is up to citizens and industry to make their voices heard if they feel that this is a drastic step,\" Jaideep Reddy, a partner at law firm Nishith Desai Associates, told The Block at the time.","But if the Cabinet wants a specific bill to pass, it can opt for an ordinance, an approach that enables the Indian government to take immediate legislative action. Last week, there were <a href=\"https:\/\/www.cnbctv18.com\/videos\/economy\/govt-likely-to-pass-new-cryptocurrency-bill-via-ordinance-route-8222981.htm\" data-v-f87c67ca=\"\">reports<\/a> that the government is likely to pass a cryptocurrency bill via ordinance.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"February 15","content":"DATE"},{"type":"State","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Sitharaman","content":"PERSON"},{"type":"Indian Parliament","content":"ORGANIZATION"},{"type":"Subhash Chandra Garg","content":"PERSON"},{"type":"Anurag Thakur","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Rajya Sabha","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Jaideep Reddy","content":"PERSON"},{"type":"India","content":"LOCATION"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"April 8","content":"DATE"},{"type":"March 8","content":"DATE"},{"type":"IMC","content":"ORGANIZATION"},{"type":"Nirmala Sitharaman","content":"PERSON"},{"type":"Nishith Desai Associates","content":"ORGANIZATION"},{"type":"Thakur","content":"PERSON"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}