{"summary":"A trader who goes by the moniker &quot;Tree of Alpha&quot; made over $1 million from Dogecoin trades after Twitter changed its logo to the dog.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225076\/dogecoin-profits-tree-of-alpha","publishDate":"2023-04-05T13:08:34","id":9397,"type":null,"title":"Twitter&#x27;s Dogecoin rally: One trader made $1.1 million in 30 minutes","category":["MARKETS"],"content":["A crypto trader who goes by \"Tree of Alpha\" on Twitter made a profit of over $1 million on Monday from the recent Elon Musk-induced Dogecoin rally.","\"I made $1.1 million in 30 minutes on an $8 million total position size,\" Tree of Alpha told The Block.","It started when Tree of Alpha, who declined to share an actual name, noticed someone in the Tree News Discord messaging platform posted that they saw the Dogecoin icon as the Twitter logo. A minute later, the popular crypto news Twitter account DB also tweeted the new Twitter logo, prompting Tree of Alpha to start buying Dogecoin. He <a href=\"https:\/\/twitter.com\/Tree_of_Alpha\/status\/1643180933233745924\" data-v-f87c67ca=\"\">bought<\/a> $3 million worth of Dogecoin, followed by $2 million and a final buy worth $3 million.","His average buying price was around $0.0815 and he exited around $0.095, resulting in over a million worth of profit, he said.","\"This is actually my biggest trade of the year by far,\" Tree of Alpha said. \"Trading takes a lot of patience, but eventually, you will come across a handful of trades that you need to absolutely nail like this Doge one. Everything else is preparation for those.\"","Dogecoin <a href=\"https:\/\/www.theblock.co\/post\/224621\/dogecoin-skyrockets\" data-v-f87c67ca=\"\">shot up<\/a> more than 27% on Monday after Twitter's blue bird logo was changed on the website to the famed meme of a Shiba Inu dog. It's currently trading at around $0.093140, per <a href=\"https:\/\/www.coingecko.com\/en\/coins\/dogecoin\" data-v-f87c67ca=\"\">CoinGecko<\/a>.","Tree of Alpha exited his doge trades within 30 minutes as he suspected there might be a chance of a late April Fool's joke by Elon Musk, the owner of Twitter.","\"Elon could have tweeted something debunking the whole thing like he has done before,\" said Tree of Alpha.","Tree of Alpha said he could \"re-enter if Elon, or Twitter official accounts, come out and says something quite positive about it (possible implementations).\"","The trader believes Twitter could integrate doge as an acceptable payment method. \"It is a possibility, especially given how unpredictable Musk is,\" he said. \"It would definitely be wise for everyone to keep notifications on relevant accounts for more developments on the subject.\"","Tree of Alpha, who lives in Western Europe, started trading crypto in 2017, he said, adding that he only started becoming profitable after March 2019, once he began trading events and \"stopped drawing lines on charts.\"","\"My advice to a lot of people would be to try to achieve profit asymmetry one way or another: entering trades that have either a much higher chance of going up, or trades that have way more upside than downside,\" he said. \"I do that through trading of news and events.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$0.095","content":"MONEY"},{"type":"Western Europe","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"$0.0815","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"$3 million","content":"MONEY"},{"type":"$8 million","content":"MONEY"},{"type":"\"Tree of Alpha\"","content":"ORGANIZATION"},{"type":"Elon","content":"LOCATION"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Alpha","content":"ORGANIZATION"},{"type":"Twitter","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"$1.1 million","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"March 2019","content":"DATE"},{"type":"27%","content":"PERCENT"},{"type":"Tree of Alpha","content":"ORGANIZATION"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"Tree News Discord","content":"ORGANIZATION"},{"type":"$0.093140","content":"MONEY"},{"type":"April","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}