{"summary":"Two Stanford University academics co-signed Sam Bankman-Fried’s bond with his parents, according to new court filings. \nThe names of co-signers Larry Kramer and Andreas Paepcke were previously redacted from court documents.  ","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212223\/stanford-universitys-larry-kramer-and-andreas-paepcke-co-signed-sam-bankman-frieds-bond","publishDate":"2023-02-15T14:34:14","id":94,"type":null,"title":"Stanford University’s Larry Kramer and Andreas Paepcke co-signed Sam Bankman-Fried’s bond","category":["Companies"],"content":["A pair of Stanford University academics co-signed FTX founder Sam Bankman-Fried’s bond, according to court documents unsealed on Wednesday.&nbsp;","Larry Kramer, dean emeritus of Stanford Law School, signed a $500,000 bond, while Stanford University senior research scientist Andreas Paepcke signed for $200,000. Bankman-Fried is facing a litany of criminal charges for his alleged mishandling of customer funds at FTX, among other misdeeds. &nbsp;","The former billionaire’s parents, Stanford University professors Joe Bankman and Barbara Fried, co-signed his $250 million bond with Kramer and Paepcke, whose names were previously redacted from court documents. &nbsp;","Kramer’s decision to co-sign Bankman-Fried’s bond was in his “personal capacity,” he said in an emailed statement, noting he does not have a business interest in the case. &nbsp;","“Joe Bankman and Barbara Fried have been close friends of my wife and I since the mid-1990s,\" Kramer said in a statement to The Block. \"During the past two years, while my family faced a harrowing battle with cancer, they have been the truest of friends – bringing food, providing moral support, and frequently stepping in at moment’s notice to help. In turn, we have sought to support them as they face their own crisis.\"","\"My actions are in my personal capacity, and I have no business dealings or interest in this matter other than to help our loyal and steadfast friends,\" Kramer continued. \"Nor do I have any comment or position regarding the substance of the legal matter itself, which is what the trial will be for,”","Lawyers for Bankman-Fried had argued that Kramer and Paepcke would face privacy and security concerns if their names were made public. Bankman-Fried initially appealed the judge’s decision to unseal the names, but Kaplan ordered the names be made public on Wednesday, siding with news organizations that filed a motion on the issue.&nbsp;","<em data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/em>&nbsp;"],"hashtag":[]}