{"summary":"The motion to dismiss also gives a glimpse into how Alex Mashinsky sees the downfall of Celsius. External events, and a short-selling attack by FTX, were to blame, he says.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229211\/alex-mashinsky-celsius-nys-lawsuit-defense","publishDate":"2023-05-03T06:28:57","id":9406,"type":null,"title":"Celsius&#x27; Alex Mashinsky responds to NY securities fraud lawsuit","category":["COMPANIES"],"content":["Celsius Network co-founder and former CEO Alex Mashinsky has moved to dismiss the New York State complaint against him that seeks to compensate everyone who lost money in the collapse of his crypto lender, which once held $30 billion in assets.","The complaint alleges that Mashinsky committed securities fraud by making false and misleading statements to consumers about the safety of assets deposited on Celsius, and that he failed to register as a dealer of securities or commodities.","In response filed yesterday, <a href=\"https:\/\/iapps.courts.state.ny.us\/nyscef\/ViewDocument?docIndex=\/mPuBL5LQ5Z2OEWZ70pvhw==\" data-v-f87c67ca=\"\">Mashinsky argues that the crypto products offered by Celsius<\/a> were neither securities nor commodities, and that New York State Attorney General Letitia James has cherry-picked Mashinsky’s statements from hundreds of hours of YouTube broadcasts, “falsely depicting Celsius’s exceptional transparencies with its users as a deceptive tactic.”","“The complaint, which parrots misinformation on-line about Mashinsky and Celsius Network and borrows others’ baseless conclusions, demonstrates a fundamental misunderstanding of Celsius’s business, and Mashinsky’s role therein,” Mashinsky argues.","The motion to dismiss also gives a glimpse into how Mashinsky sees the <a href=\"https:\/\/www.theblock.co\/post\/157491\/crypto-lender-celsius-declares-chapter-11-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">downfall of Celsius<\/a>.","Celsius ran into trouble after last year's collapse of the TerraUSD stablecoin, which was pegged to the value of the U.S. dollar via an algorithmic relationship with another token, luna. Luna was directly exchangeable for TerraUSD and was burned or minted in order to increase supply and demand for TerraUSD, with the intent of forcing TerraUSD’s value to stay at $1 per coin. However, neither coin was actually backed by US.. dollar reserves and, eventually, investors heavily sold both luna and TerraUSD, wiping out more than $40 billion in value.","That started a chain of events in which crypto prices declined broadly and investors began exiting their crypto positions across the entire market.","“In May 2022, the prices of Terra and luna crashed by more than 99% and caused cryptocurrency to plunge, wiping out billions in value, and the industry to suffer significant losses, including for many of Celsius’s institutional counterparties. One particularly impactful event for Celsius was the unexpected and extremely rapid mass withdrawals of assets from Celsius’s platform, during which it lost over $672 million in assets over the course of several days,” Mashinsky says in his motion.","<a href=\"https:\/\/www.theblock.co\/post\/153013\/celsius-says-its-determined-to-find-a-resolution-a-week-after-halting-withdrawals\" data-v-f87c67ca=\"\">Celsius paused all withdrawals<\/a> on June 12, 2022, and then filed for bankruptcy, <a href=\"https:\/\/www.dlnews.com\/articles\/fintech\/best-regards-and-hodl-on-celsius-customers-fury-as-100000-in-bitcoin-trapped-in-collapsed-crypto-lender\/\" data-v-f87c67ca=\"\">leaving investors frozen out of their crypto accounts and savings<\/a>.","A source close to Mashinsky also pointed The Block to <a href=\"https:\/\/celsiusnetwork.se\/why-did-celsius-collapse-the-true-story\/\" data-v-f87c67ca=\"\">a blog post attributing the downfall of Celsius<\/a> to an attack by competing firms, particularly FTX (which itself went bankrupt a few months later). That blog, written by pseudonymous Twitter user called Celhodl, argues that as customers began withdrawing their money from Celsius, the exchange realized its declining assets were now worth “$1.2 billion less than what users had deposited.” (<a href=\"https:\/\/ag.ny.gov\/sites\/default\/files\/mashinsky_complaint.pdf\" data-v-f87c67ca=\"\">New York State’s complaint<\/a> claims that even though there were $20 billion in deposits before its collapse, Celsius nonetheless struggled to generate enough revenue to cover the “yield” it owed customers who had deposited their crypto in interest-bearing accounts).","At the same time, FTX’s sister hedge fund, Alameda Research, began shorting CEL, Celsius’s native token, using its now-infamous ability to <a href=\"https:\/\/www.coindesk.com\/business\/2022\/11\/17\/alameda-had-secret-exemption-from-ftx-liquidation-protocols-new-ceo-says\/\" data-v-f87c67ca=\"\">borrow unlimited amounts of from the FTX platform without risk of liquidation<\/a>, the blog says. “Alameda et al. had the ability to borrow millions of synthetic CELs and dump them on the market so that the price was pushed down,” the blog claims.","None of this was Mashinsky’s fault, his motion says. “Ultimately, however, circumstances outside of Mashinsky’s (and Celsius’s) control led to a liquidity squeeze that resulted in Celsius pausing withdrawals and filing for bankruptcy. Instead of acknowledging that Celsius’s eventual downfall was caused by a series of calamitous, external events, the NYAG pins all resulting losses on the alleged misstatements on Mashinsky alone.”","Mashinsky also makes a novel argument that its yield-paying \"Earn\" accounts were not securities precisely because they promised a guaranteed rate of interest to customers. One definition of a “security” in U.S. law is any financial instrument that promises a return based on a “common enterprise,” usually meaning the efforts of others, such as a company or cartel. Usually, interest-bearing products — like bonds — are classed as securities because they pay interest, and the interest is generated by the “common enterprise” of whoever borrowed the money on which the interest is being paid.","Mashinsky, however, argues that Celsius gave earn account holders a guaranteed rate of interest regardless of how well Celsius’ revenues performed, and thus were not related to a common enterprise. “Under the agreement, Celsius paid the Earn account holder a predetermined, published weekly interest rate based on the type and amount of digital assets the user loaned. (rates “were ‘subject to change on a weekly basis as they are calculated by the weekly demand for each coin . . . .’”). Thus … the Earn account holders’ fortunes were based on a predetermined rate, and were not dependent on Celsius’s revenue generation.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Letitia James","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"May 2022","content":"DATE"},{"type":"$672 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"99%","content":"PERCENT"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"$1","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"New York State","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Celsius","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"$20 billion","content":"MONEY"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Mashinsky","content":"PERSON"},{"type":"$1.2 billion","content":"MONEY"},{"type":"June 12, 2022","content":"DATE"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["CRYPTO BANKS AND LENDERS","LAWSUITS"],"authors":["Jim Edwards","The Block"]}