{"summary":"In theory, a stablecoin is pegged 1:1 to a reserve asset such as the US Dollar and therefore backed by one US Dollar’s worth of stable and liquid collateral assets. But in the spirit of crypto, many centralized issuers and decentralized stablecoin protocols have tested the boundaries of said theory, in the process of experimenting with different forms of so-called stablecoins.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/149808\/the-stablecoin-trifecta-flexusd-setting-the-new-gold-standard","publishDate":"2022-06-02T09:00:14","id":9408,"type":null,"title":"The Stablecoin Trifecta: flexUSD Setting the New Gold Standard","category":["SPONSORED"],"content":["<b data-v-f87c67ca=\"\">Key Questions<\/b><b data-v-f87c67ca=\"\"><\/b>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">All stablecoins are stable.<\/span><\/i>","<span data-v-f87c67ca=\"\">You might have assumed this about stablecoins at one point, given the taxonomy of the asset class.<\/span>","<span data-v-f87c67ca=\"\">Instead, what the latest TerraUSD (UST) fallout has revealed is that not all stablecoins are created equal.<\/span>","<span data-v-f87c67ca=\"\">In theory, a stablecoin is pegged 1:1 to a reserve asset such as the US Dollar and therefore backed by one US Dollar’s worth of stable and liquid collateral assets. But in the spirit of crypto, many centralized issuers and decentralized stablecoin protocols have tested the boundaries of said theory, in the process of experimenting with different forms of so-called stablecoins.<\/span>","<span data-v-f87c67ca=\"\">Stablecoins were born from utility – the need for a reliable and low-cost instrument used as a medium of exchange for global, peer-to-peer trade. First-generation stablecoins such as USDT (Tether) and USDC have largely filled this role. But along the way, we have seen several creative spins on stablecoin utility – extending beyond payments to trading and earning yield.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Unfortunately, some of the recent issues surrounding the adoption of stablecoins such as UST have led to distrust around the future viability of stablecoins.<\/span>","<span data-v-f87c67ca=\"\">But UST’s downfall does not mean that stablecoins should not exist for the purpose of earning yield. In fact, second-generation stablecoins are expected to maintain stability while providing additional value, such as earning interest. In light of this reality, the question remains: how does a stablecoin achieve greater adoption without utilizing unsustainable growth mechanisms? CoinFLEX has designed the flexUSD stablecoin with this in mind, by capitalizing on the growth of crypto derivatives.<\/span>","<b data-v-f87c67ca=\"\">What do sustainable stablecoin yields have to do with crypto derivatives?<\/b>","<span data-v-f87c67ca=\"\">CoinFLEX is the first crypto exchange to create a peer-to-peer repo (borrowing and lending) market, connecting dollar lenders (repo buyers) with crypto-collateralized borrowers (repo sellers). Repo sellers receive USDC in exchange for their coins, and retain their crypto exposure via the deliverable long perpetual futures leg. Repo market participants include basis traders (arbitraging or speculating on the price difference between a perpetual future and spot), lenders, borrowers, and cross-exchange arbitrageurs.<\/span>","<span data-v-f87c67ca=\"\">Understanding that many of these crypto activities are challenging to manage manually, CoinFLEX created flexUSD to tokenize these market opportunities. flexUSD takes advantage of the large demand for institutional levels of leverage and scarcity of dollars in the crypto markets, by earning funding rates from traders on the CoinFLEX exchange. flexUSD pays this interest to holders on-chain every 8 hours. It’s important to note that because flexUSD sources this yield directly from the CoinFLEX futures markets rather than third-party intermediaries, <\/span><b data-v-f87c67ca=\"\">the stablecoin earns transparent and sustainable yields for holders.<\/b>","","","<span data-v-f87c67ca=\"\">With this in mind, let’s take a step back and understand how flexUSD maintains its promise of stability.<\/span>","<b data-v-f87c67ca=\"\">The Stablecoin Trifecta<\/b>","<span data-v-f87c67ca=\"\">It’s helpful to have a framework for assessing the resiliency of stablecoins, namely focusing on the following properties:<\/span>","<b data-v-f87c67ca=\"\">Stability<\/b><span data-v-f87c67ca=\"\"> – What is the stablecoin’s depegging risk?<\/span>","<span data-v-f87c67ca=\"\">flexUSD is backed by USDC and coin assets in CoinFLEX’s repo markets. As a repo trade involves a coin position and an opposing futures position, flexUSD’s balance sheet is always fully hedged and indifferent to the underlying crypto market price movements.<\/span>","<b data-v-f87c67ca=\"\">Transparency<\/b><span data-v-f87c67ca=\"\"> – How are you able to verify the collateral reserves backing the stablecoin?<\/span>","<span data-v-f87c67ca=\"\">&nbsp;<\/span><span data-v-f87c67ca=\"\">flexUSD’s collateral reserves are hoping to be verified and publicly attested to by a leading US auditing firm daily, every 8 hours. Holders have full transparency on how flexUSD is generating yield: on CoinFLEX, an orderbook-based publicly viewable marketplace that any qualified customer can view and trade. With other yield products, you typically have to take the borrower’s word for what the funds are being used for and have zero visibility as to what is actually being bought and invested in with your funds.<\/span>","<b data-v-f87c67ca=\"\">Redeemability <\/b><span data-v-f87c67ca=\"\">– What is the liquidity risk of the stablecoin, especially during market stress?<\/span>","<span data-v-f87c67ca=\"\">In flexUSD’s history, CoinFLEX has been able to successfully process $1 worth of the underlying asset (USDC) for every flexUSD redemption.<\/span>","<span data-v-f87c67ca=\"\">With flexUSD, CoinFLEX is pioneering the gold standard for stablecoins.<\/span><b data-v-f87c67ca=\"\">&nbsp;<\/b>","<b data-v-f87c67ca=\"\">What is a promising utility for stablecoins?<\/b>","<span data-v-f87c67ca=\"\">flexUSD serves to benefit a range of holders - from average investors to institutional funds and corporate treasurers. Corporate treasurers are tasked with a number of responsibilities, one of which is cash and liquidity management. In this regard, they face a number of challenges:<\/span>","<span data-v-f87c67ca=\"\">With flexUSD, corporates can:<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Indeed, not all stablecoins are created equal.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by CoinFLEX <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDC","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Stablecoin Trifecta","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"US Dollar","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}