{"summary":"A set of high-level recommendations around crypto assets, and warnings about stablecoins and other digital currencies, will carry weight with policymakers and financial institutions across the globe.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176025\/g20-central-bankers-warn-stablecoins-arent-stable-recommend-action-around-crypto-assets","publishDate":"2022-10-11T04:00:50","id":941,"type":null,"title":"G20 central bankers warn stablecoins aren&#x27;t &#x27;stable&#x27;, recommend action around crypto assets","category":["POLICY"],"content":["No stablecoin currently meets the standards set for the digital asset category by central bankers of the world’s largest economies, and many stablecoins “do not have credible mechanisms to support their promise of price stability,\" a report issued by the Financial Stability Board concluded today.","The board also cast doubt as to how “stable” stablecoins actually are.","The financial research and policy organization, which is led by senior central bankers and regulators from various large economies, does not make binding rules. But a set of <a href=\"https:\/\/www.fsb.org\/2022\/10\/international-regulation-of-crypto-asset-activities-a-proposed-framework-for-consultation\/\" data-v-f87c67ca=\"\">high-level recommendations<\/a> around crypto assets, and <a href=\"https:\/\/www.fsb.org\/wp-content\/uploads\/P111022-4.pdf\" data-v-f87c67ca=\"\">warnings about stablecoins<\/a> and other digital currencies, will carry weight with policymakers and financial institutions across the globe.","The organization released two reports Tuesday. One centers around high-level recommendations for crypto assets, which the regulatory body plans to finalize next year after a public comment period. The other is an assessment of how broadly stablecoin issuers would meet the “High-Standard” criteria set by the group in 2020.","According to the FSB: None.","Citing limits on redemptions, including the ability to delay or deny them, the FSB found that most users have to sell stablecoins on exchanges in order to liquidate them, and the price could drop below the value of the currency that the coin is pegged to.","The FSB also cast doubt on how most stablecoins would be able to maintain their pricing under market stress, concluding that, “most stablecoins enable arbitrage activities of market participants and to a considerable extent rely on them,” and that it’s unclear how that would hold up under adverse financial conditions, “raising questions about the effectiveness of the stabilization mechanisms in supporting a stable price at all times.”","The research on stablecoins comes in the context of the European Central Bank, U.S. Federal Reserve and other central banks weighing whether or not to issue their own digital currencies, as well as the collapse of the algorithmic stablecoin Terra, which the FSB cites as indicative of, \"t<span id=\"page567R_mcid2\" class=\"markedContent\" data-v-f87c67ca=\"\"><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">he inherent difficulty of designing a robust stabilization mechanism based on <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">an algorithm and arbitrage strategy involving assets with no inherent value.\"<\/span><\/span>","The board recommends applying similar rules to stablecoins as what banks must currently follow, an approach the U.S. Congress has also <a href=\"https:\/\/www.theblock.co\/post\/171565\/draft-stablecoin-bill-in-congress-to-require-fed-state-regulator-approval\" data-v-f87c67ca=\"\">discussed<\/a>. A report on crypto asset regulations, shorter in length than the stablecoins findings, also prescribes a “same activity, same risk, same regulation,” approach to digital assets, also similar to the approach taken by U.S. regulators, including the Securities and Exchange Commission and Commodity Futures Trading Commission.","The comment period for the FSB’s crypto asset regulations will be open until Dec. 15, and the organization plans to issue comprehensive final recommendations in mid-2023.","<em data-v-f87c67ca=\"\">With additional reporting by Inbar Preiss.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"European Central Bank","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"FSB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Terra","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Dec. 15","content":"DATE"},{"type":"Financial Stability Board","content":"ORGANIZATION"},{"type":"Inbar Preiss","content":"PERSON"},{"type":"Securities and Exchange Commission and Commodity Futures Trading Commission","content":"ORGANIZATION"}],"hashtag":["CONGRESS","CRYPTO","FEDERAL RESERVE"],"authors":["Colin Wilhelm","The Block"]}