{"summary":"Ethereum scaling protocol StarkWare revealed $550,000 in funds were locked up due to an upgrade but has since re-enabled access.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248175\/starkware-re-enables-access-to-funds-locked-after-upgrade","publishDate":"2023-08-30T15:16:50","id":9414,"type":null,"title":"StarkWare re-enables access to funds locked after upgrade","category":["CRYPTO ECOSYSTEMS"],"content":["A number of users were locked out of accounts with StarkWare after an upgrade siloed some funds.&nbsp;","The Ethereum scaling protocol <a href=\"https:\/\/twitter.com\/StarkWareLtd\/status\/1696933272800915647\" data-v-f87c67ca=\"\">explained<\/a> that the blockage was due to the 0.12.1 version upgrade last week. Users were advised to perform an \"essential\" account <a href=\"https:\/\/www.theblock.co\/post\/237841\/ethereum-layer-2-starknet\" data-v-f87c67ca=\"\">upgrade<\/a> months ago, and those who had not upgraded could not access their accounts.","Affected accounts contained a total of $550,000.&nbsp;","\"As of today, the <a href=\"https:\/\/www.theblock.co\/post\/237841\/ethereum-layer-2-starknet\" data-v-f87c67ca=\"\">upgrade<\/a> is reenabled, allowing users to immediately regain access to their accounts,\" StarkWare said. \"For technical reasons, it may take until tomorrow for users of Argent and Braavos to regain access.\"","StarkWare users had been concerned about the inaccessible funds after the upgrade, with one person <a href=\"https:\/\/twitter.com\/0xSisyphus\/status\/1696868511941816762\" data-v-f87c67ca=\"\">saying<\/a> on social media that it equated to \"having the money in your bank account disappear if you don't get the latest software package.\"","Others noted that the lock out chafed against the promises of decentralization and immutability that web3 offers.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$550,000","content":"MONEY"},{"type":"2023","content":"DATE"}],"hashtag":["STARKNET"],"authors":["MK Manoylov","The Block"]}