{"summary":"Decentralized social graph Lens has transitioned to a permissionless phase, allowing anyone to join the platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279335\/blockchain-based-social-graph-lens-enters-permissionless-phase","publishDate":"2024-02-27T15:16:07","id":9418,"type":null,"title":"Social media platform Lens enters ‘permissionless&#x27; phase","category":["CRYPTO ECOSYSTEMS"],"content":["Social graph Lens Protocol has moved to a \"permissionless\" phase, now enabling all users to participate in the network by creating an on-chain NFT for their profile.","This change allows anyone to create their profiles for a fee of 10 matic tokens (currently valued at $10.30) or to pay a similar amount with a credit card, facilitating their entry into the platform. Lens <a href=\"https:\/\/www.theblock.co\/post\/262819\/aave-companies-launches-lens-v2-on-polygon\" data-v-f87c67ca=\"\">debuted<\/a> in May 2022 on the Polygon blockchain.","Lens is described as a social graph, which refers to a decentralized and user-owned map of connections and relationships between individuals and entities. NFTs that serve as user profiles allow users to interact with decentralized applications (dapps) within its ecosystem.&nbsp;","Now, any user can mint a Lens profile and access the protocol, whereas previously, profile creation was restricted to selected users.","This comes amid an increasingly competitive landscape of decentralized social media, where multiple platforms are vying for user engagement. Lens, in particular, faces heated competition with <a href=\"https:\/\/www.theblock.co\/post\/278797\/farcaster-solana\" data-v-f87c67ca=\"\">Farcaster<\/a>, another key player in the decentralized social media space.&nbsp;","Despite Farcaster's shift to a permissionless model in October 2023 after its introduction on Optimism, Lens's move towards a similar approach has been more gradual, especially given its initial launch in 2022.","“In our first few years, we chose to remain in beta while we enhanced security and scalability and nurtured a vibrant developer ecosystem,” noted Lens founder Stani Kulechov — highlighting the platform’s approach to development.","Lens is currently in <a href=\"https:\/\/www.theblock.co\/post\/239858\/lens-protocol-version-2-open-actions-erc-6551\" data-v-f87c67ca=\"\">version 2<\/a>, which focuses on Open Actions, a feature that enables the execution of any external smart contract action directly from Lens’ content posts.","Open Actions provide a way for developers to build custom operations that can be executed via posts. For example, with this feature, users can mint non-fungible tokens (NFTs) on an OpenSea contract directly from Lens’ published content.","Lens also operates a data scaling solution called <a href=\"https:\/\/www.theblock.co\/post\/228787\/lens-protocol-renames-scaling-solution-bonsai\" data-v-f87c67ca=\"\">Momoka<\/a>, aimed at storing social media transaction data off-chain for efficiency while ensuring on-chain verification for security. The project closed a <a href=\"https:\/\/www.theblock.co\/post\/233746\/lens-protocol-raise-decentralized-social-media\" data-v-f87c67ca=\"\">$15 million funding round<\/a> led by IDEO CoLab Ventures last year.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"$10.30","content":"MONEY"},{"type":"May 2022","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"$15 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"IDEO","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"October 2023","content":"DATE"},{"type":"Stani Kulechov","content":"PERSON"}],"hashtag":["LENS","SOCIAL MEDIA"],"authors":["Vishal Chawla","The Block"]}