{"summary":"Uniswap has announced that the protocol&#x27;s second version is set to launch in the second quarter of this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59630\/uniswap-announces-its-next-iteration-set-for-launch-in-q2","publishDate":"2020-03-23T18:20:01","id":9420,"type":null,"title":"Uniswap announces its next iteration, set for launch in Q2","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Uniswap has announced that the protocol's second version –which will include new features including ERC20 pairs, more decentralized price oracles, flash swaps and a protocol charge mechanism – is set to launch in Q2.&nbsp;&nbsp;<\/span>","The platform's volume has experienced significant growth recently, reporting a surge of 192% from the start of 2020. Uniswap has facilitated a total of over $380m in trading volumes in that period.","","","According to a Monday <a href=\"https:\/\/uniswap.io\/blog\/uniswap-v2\/\" data-v-f87c67ca=\"\">announcement<\/a>&nbsp;post, the team expects Uniswap v2 to be available for deployment in the second quarter of this year. At the same time, the factory and an initial smart contract are now running on the Ropsten, Rinkeby, Kovan and Görli testnets for developer experimentation.","\"Uniswap V1 will continue to work for as long as Ethereum exists,\" the announcement noted.","<span data-v-f87c67ca=\"\">One key addition of Uniswap v2 is the ability to pool any two ERC20 tokens together. <\/span>","<span data-v-f87c67ca=\"\">With v1, users can only swap an ERC20 token with ETH. The new feature will allow users to \"maintain more diverse ERC20 token denominated positions, without mandatory exposure to ETH,\" according to the team's post. <\/span>","<span data-v-f87c67ca=\"\">The DAI\/USDC pair, for example, is a relatively stable pair that could be useful for trading purposes. Enabling such pairs will also lower trading fees, the announcement highlighted, since users hoping to swap between two ERC20 tokens will no longer need to route through ETH.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"If two ERC20 tokens are not paired directly, and do not have a common pair between them, they can still be swapped as long as a path between them exists,\" the team added. \"Router contracts can be used to optimize between direct and multi-step swaps.\"<\/span>","<span data-v-f87c67ca=\"\">Secondly, Uniswap v2 will introduce several improvements to its price feed model. The team acknowledged that \"Uniswap V1 cannot be used safely as a price oracle because the price can move significantly in a short period of time.\"<\/span>","<span data-v-f87c67ca=\"\">To address this vulnerability, the new version will determine the market price for pairs at the start of every block. This will make it more costly for potential attackers to compromise the price feed since they would have to make a bad trade at the end of the previous block and could lose their arbitrage if they can't mine two consecutive blocks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On top of this, the updated price feed design will weigh the end-of-block price by the amount of time that this particular price has existed, making sure that the potential profit gained from an attack will not be greater than the cost.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The third feature that Uniswap v2 will enable is flash swaps. <\/span>","<span data-v-f87c67ca=\"\">This feature will let users take out any amount of ERC20 tokens and execute arbitrage codes as they wish. The only condition is that users either pay for the withdrawn tokens or return them. Users can conduct flash swaps at no upfront cost except for the 0.3% liquidity provider fees. <\/span>","<span data-v-f87c67ca=\"\">This feature, the team's post explained, could have interesting use cases, including arbitrage with no upfront capital and more efficient margin trading protocols.<\/span>","<span data-v-f87c67ca=\"\">Notably, Uniswap v2 will also feature a small protocol charge mechanism to make its ecosystem more self-sustainable. <\/span>","<span data-v-f87c67ca=\"\">The default charge at launch will be 0, and the liquidity provider fee will be 0.3%. When the protocol charge mechanism is turned on, the charge will be 0.05% and the liquidity provider fee will be reduced to 0.25%.<\/span>","<span data-v-f87c67ca=\"\">\"Without any additional growth, [Uniswap] will generate more than $5M in liquidity provider fees this year,\" the announcement explained. \"If the protocol charge was on, ~$830,000 of this would instead go to a decentralized funding mechanism used to support contributions to Uniswap and its ecosystem.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"second quarter of this year","content":"DATE"},{"type":"Uniswap V1","content":"ORGANIZATION"},{"type":"Uniswap v2","content":"ORGANIZATION"},{"type":"0.25%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"0.3%","content":"PERCENT"},{"type":"$380m","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"192%","content":"PERCENT"},{"type":"Görli","content":"PERSON"},{"type":"0.05%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"Kovan","content":"PERSON"},{"type":"Rinkeby","content":"LOCATION"},{"type":"$830,000","content":"MONEY"},{"type":"$5M","content":"MONEY"}],"hashtag":["UNISWAP"],"authors":["Yilun Cheng","The Block"]}