{"summary":"After testing on Goerli, the developers plan to deploy it on the Ethereum mainnet next month, assuming a successful test.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219793\/ethereum-to-begin-final-dress-rehearsal-today-for-shapella-upgrade","publishDate":"2023-03-14T13:58:12","id":9422,"type":null,"title":"Ethereum to begin final dress rehearsal today for Shapella upgrade","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Ethereum developers are gearing up for the launch of the highly-anticipated Shanghai-Capella, or Shapella, upgrade on the Goerli test network later today in a final dress rehearsal before the mainnet launch scheduled for April.<\/span>","<span data-v-f87c67ca=\"\">The upgrade will be triggered at epoch 162304 on Goerli, estimated to take place around 6:25 pm EST, developers said in a blog post from the Ethereum Foundation. After testing the upgrade on Goerli, they plan to deploy it on the mainnet next month if the test goes smoothly.<\/span>","<span data-v-f87c67ca=\"\">The main feature of the upgrade, <a href=\"https:\/\/eips.ethereum.org\/EIPS\/eip-4895\" data-v-f87c67ca=\"\">Ethereum Improvement Proposal (EIP) 4895<\/a>, aims to enable validator staking withdrawals on the main network. The feature was turned off during Ethereum's switch to a proof-of-stake consensus in September 2022 to ensure a safe transition.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Goerli will be the third and final testnet used by developers to test the Shapella upgrade. Prior to Goerli, the developers carried out multiple phases of public testing for it on the Sepolia and Zhejiang public testnets since February.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Besides the withdrawals, developers have also <\/span><a href=\"https:\/\/github.com\/ethereum\/execution-specs\/blob\/master\/network-upgrades\/mainnet-upgrades\/shanghai.md\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">planned<\/span><\/a><span data-v-f87c67ca=\"\"> three additional improvements aimed at optimizing gas costs for certain activities with the Shapella upgrade.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum","content":"ORGANIZATION"},{"type":"4895","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Capella","content":"LOCATION"},{"type":"September 2022","content":"DATE"},{"type":"February","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Shanghai","content":"LOCATION"},{"type":"later today","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Goerli","content":"LOCATION"},{"type":"Zhejiang","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}