{"summary":"The Group of 7 (G7) has reiterated past comments about stablecoins and its opposition to those that don&#x27;t align with &quot;relevant legal, regulatory, and oversight requirements.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107367\/g7-stablecoins-cbdc-statement-june-2021","publishDate":"2021-06-05T08:40:27","id":943,"type":null,"title":"G7 central bankers, finance ministers discuss stablecoins, central bank digital currencies at latest meeting","category":["THE BLOCK"],"content":["The Group of 7 (G7) has reiterated past comments about stablecoins and its opposition to those that don't align with \"relevant legal, regulatory, and oversight requirements.\"","The comments were included in a <a href=\"https:\/\/www.gov.uk\/government\/publications\/g7-finance-ministers-meeting-june-2021-communique\/g7-finance-ministers-and-central-bank-governors-communique\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">June 5 communique<\/a> published after a G7 meeting of finance ministers and central bank officials in London.&nbsp;","Stablecoins and digital assets more broadly have been in the G7's sights for several years. In late 2019, the G7 published a report on stablecoins, declaring that stablecoins present both potential benefits as well as regulatory, legal and cybersecurity risks. At a global scale, stablecoins could pose monetary policy and financial stability risks, per the G7.","\"These risks, which are of a systemic nature, merit careful monitoring and further study,\" the group's report stated at the time. Observers of the G7's movements have broadly interpreted them to refer to projects such as Diem, formerly known as Libra, which was bootstrapped by social media giant Facebook and debuted to widespread criticism by the world's regulatory bodies.","The June 5 communique indicates that the G7's position on the matter hasn't shifted much over time.&nbsp;","As the G7 noted:","\"We reiterate that no global stablecoin project should begin operation until it adequately addresses relevant legal, regulatory, and oversight requirements through appropriate design and by adhering to applicable standards. We are committed to international cooperation to ensure common standards, including by supporting international standard setting bodies in reviewing existing regulatory standards, and emphasise the importance of addressing any identified gaps. We support the FSB’s ongoing work in reviewing regulatory, supervisory and oversight challenges to the implementation of its High Level Recommendations for global stablecoin arrangements.\"","<a href=\"https:\/\/home.treasury.gov\/news\/press-releases\/sm1152\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Similar language<\/a> was included in the G7's October 2020 statement.&nbsp;","The communique also made note of the G7's collective interest in central bank digital currencies (CBDCs), which are being explored for potential implementation by a number of the world's central banks. Foremost of those is China, which has conducted a series of public tests in an array of the country's cities. While proponents of CBDCs say they can serve as beneficial complements to cash, critics contend that CBDCs open the door to broader financial surveillance.&nbsp;","Per the communique, the G7 central banks \"have been exploring the opportunities, challenges as well as the monetary and financial stability implications of Central Bank Digital Currencies (CBDCs) and we commit to work together, as Finance Ministries and Central Banks, within our respective mandates, on their wider public policy implications.\"","Unlike past G7 statements on the matter, the communique notably expresses a series of design preferences for such digital currencies. A more formal expression of these will be released later this year, per the group.","\"CBDCs should be resilient and energy-efficient; support innovation, competition, inclusion, and could enhance cross-border payments; they should operate within appropriate privacy frameworks and minimise spillovers. We will work towards common principles and publish conclusions later in the year,\" the group said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"October 2020","content":"DATE"},{"type":"Central Bank Digital Currencies","content":"ORGANIZATION"},{"type":"FSB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Group of 7 (G7","content":"ORGANIZATION"},{"type":"G7","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"Finance Ministries","content":"ORGANIZATION"},{"type":"Libra","content":"LOCATION"},{"type":"June 5","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}