{"summary":"Digital asset company BitGo it will become the first qualified custodian to support the NEAR Foundation protocol and its assets, the company said in a statement on Tuesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157814\/near-partners-bigo-custodial","publishDate":"2022-07-19T08:00:26","id":9432,"type":null,"title":"NEAR partners with BitGo as it enters world of institutional investments","category":["COMPANIES"],"content":["Digital asset company BitGo will support the NEAR Foundation protocol and its assets with qualified custody services, the company said in a statement on Tuesday.","Institutions holding NEAR tokens will be able to custody and stake them via hot and qualified custody wallets on BitGo. The NEAR Foundation, a Switzerland-based non-profit that oversees sustainable development on the protocol, will also custody its own treasury with BitGo, and stake part of this treasury using BitGo wallets.","Speaking with The Block, BitGo’s vice president of product Nuri Chang said the new partnership means that developers working on projects such as exchanges and protocols would be able to launch support for NEAR using BitGo’s programmatic wallets.","“We’re also building BitGo staking support for NEAR in and of itself. What that means is clients can stake NEAR directly from a BitGo wallet with literally a few clicks,” he said.","Founded in 2018 by Alexander Skidanov and Illia Polosukhin, NEAR Protocol is an open-source platform for decentralized applications.&nbsp;<a href=\"https:\/\/www.theblockresearch.com\/mapping-out-near-protocols-ecosystem-2-131515\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Research<\/a> by The Block in January this year identified 213 projects and companies across 14 verticals in the NEAR Ecosystem.","In a statement, Marieke Flament, CEO of the NEAR Foundation, said the partnership with BitGo was proof of NEAR’s commitment to widening its ecosystem.&nbsp;“This is a significant step for NEAR and its foray into the world of institutional investments,” she said.","Over the last year, NEAR has rolled out a series of projects, particularly around cross-chain interoperability. In April 2021, it launched Rainbow Bridge to allow users to transfer ERC-20 tokens between the Ethereum and NEAR blockchains. That June, it joined ICON Blockchain Transmission Protocol (BTP), allowing native tokens, contract calls, and data to be sent to BTP partners, such as Polkadot. It also established cross-chain compatibility with Cardano's stablecoin Aradana, and launched Ethereum layer-2 scaling protocol Aurora.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aurora","content":"LOCATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Cardano","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"Alexander Skidanov","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"Marieke Flament","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"Nuri Chang","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Illia Polosukhin","content":"PERSON"},{"type":"BTP","content":"ORGANIZATION"},{"type":"NEAR Foundation","content":"ORGANIZATION"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}