{"summary":"Crypto pundits are less confident that an Ethereum ETF will go live this year given the SEC&#x27;s cautious stance — but some remain hopeful.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274312\/crypto-experts-predict-whether-a-spot-ethereum-etf-will-get-approved-in-2024","publishDate":"2024-01-24T11:53:21","id":9435,"type":null,"title":"Crypto experts predict whether a spot Ethereum ETF will get approved in 2024","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">With 11 spot bitcoin ETFs approved and trading underway, the broader crypto market is now pondering whether a spot <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.59%\n    <\/span><\/a> <!----><\/span><\/span> ETF will follow — and when.<\/span>","There is certainly demand for one. Brett Tejpaul, head of Coinbase Institutional, told The Block in a <a href=\"https:\/\/www.theblock.co\/post\/274257\/coinbase-institutional-execs-say-crypto-can-go-mainstream-with-spot-bitcoin-etfs-now-live\" data-v-f87c67ca=\"\">recent interview<\/a> that there's interest and enthusiasm for a spot Ethereum ETF from its clients and noted that a number of leaders have said they would see value in that kind of a product coming to market.","Yet the issue is not particularly straightforward. The SEC <a href=\"https:\/\/www.theblock.co\/post\/226974\/gary-gensler-ether-security-crypto-clarity-congress-sec\" data-v-f87c67ca=\"\">has remained shtum<\/a> on whether ether is a security, something that would prevent an ETF. It also only begrudgingly approved a spot bitcoin ETF, with two Commissioners objecting. The approval only passed by one vote, including SEC Chair Gary Gensler's — who made it clear the SEC does not endorse bitcoin and that approval \"should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities.\"","These issues, and others, have caused doubts for some observers as to whether an approval for a spot Ethereum ETF is likely in the near term. In general, banks have made it clear they think such an approval is unlikely, while crypto pundits have expressed cautious optimism.","Those who anticipate a spot Ethereum ETF approval this year point to similarities with the way the spot bitcoin ETFs were pushed through.","\"We anticipate a spot Ethereum ETF approval in May with an estimated 75% likelihood. This optimistic outlook is grounded in Grayscale's Court of Appeals victory and the subsequent approval of Ethereum Futures ETF, collectively suggesting that the approval of a spot Ethereum ETF is only a matter of time,\" said Matt Kunke, research analyst at crypto market making firm GSR.","Kunke added that if the SEC were to deny the current applications for spot Ethereum ETFs in May, there would be an inevitable appeal. If this happens, he reckons the SEC will opt for the path of least resistance by approving the products, while maintaining its skeptical stance against other cryptocurrencies.","The sentiment was also echoed by Philippe Bekhazi, founder and CEO of institutional crypto trading platform XBTO.","\"I strongly believe that we’ll see the approval of a spot Ethereum ETF this year,\" he said. \"Bitcoin and Ethereum are both listed and regulated futures on CME, and are likely considered pretty equal in the eyes of the SEC. Additionally, if market conditions remain strong, further pressure will be applied to make the asset accessible to institutions. Approval is definitely a question of when, not a question of if.\"","Bloomberg Intelligence Senior ETF analyst Eric Balchunas <a href=\"https:\/\/www.theblock.co\/post\/271874\/ethereum-etf-approval-may-ether-price-surge\" data-v-f87c67ca=\"\">previously gave<\/a> a 70% chance for an Ethereum ETF to be approved this year. When reached for comment, his colleague James Seyffart gave a slightly more cautious estimate.","\"I will just say there are two very clear bear and bull cases for Ethereum ETF approval odds. We believe the odds of approval are over 50% but not nearly as confident as we were about the Bitcoin ETFs. I would say our odds are probably around 60-65%,\" said Seyffart.","Bitwise is one of the current spot bitcoin ETF issuers and currently offers an Ethereum Strategy ETF, providing exposure to companies building on Ethereum, and an ETF that provides access to bitcoin and ether futures.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/ether-futures-etf-volumes\/embed\" title=\"Ether Futures ETF Volumes\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","\"We think there is a clear line of sight to an Ethereum ETF. All the ingredients are there in our view, including the existence of a large and robust regulated futures market and the existence of Ethereum futures ETFs. Ethereum is more complex than bitcoin, however, so the timing is uncertain. I'd say there's a good chance of seeing one approved in 2024 but that it is not a lock,” said Bitwise CIO Matt Hougan.","Hougan added that he is optimistic about Ethereum in 2024. \"It's been caught in a narrative squeeze between the excitement around bitcoin ETFs and the Phoenix-like rebirth of Solana. But you have the potential for an ETF, rising transaction activity across L2s, and the Dencun upgrade, which we think will unlock a million mainstream use cases.\"","CF Benchmarks is an indices provider used by six of the spot bitcoin ETFs. CF Benchmarks CEO Sui Chung said “With the launch of the bitcoin ETF, prospective issuers of ether ETFs now know the bar they need to meet. Indeed, ether has already met most of the key milestones: it has liquid CFTC-regulated futures trading on the CME with ETFs that invest in those futures launching in the U.S. about two years after the first bitcoin futures ETF did. It’s therefore probable that a spot ether ETF could be trading by the end of the year.\"","On the flip side, some analysts are skeptical that a spot Ethereum ETF is coming any time soon, given the SEC's general stance on crypto ETFs.","\"We are less optimistic about a potential Ether ETF approval in 2024,\" said Anthony Scaramucci, Founder and Managing Partner of SkyBridge Capital. \"The SEC made it clear in its spot Bitcoin ETF approval that it deems the vast majority of crypto assets as investment contracts subject to securities laws, thus precluding them from an ETP structure for single non-security commodities.\"","This view was matched by analysts at JPMorgan, an authorized participant for three of the spot bitcoin ETFs.","\"In our opinion, for the SEC to approve spot Ethereum ETFs in May, it would need to classify Ethereum as a commodity (similar to bitcoin) rather than a security,\" <a href=\"https:\/\/www.theblock.co\/post\/272417\/spot-ethereum-etf-approval-chance-jpmorgan\" data-v-f87c67ca=\"\">JPMorgan's Nikolaos Panigirtzoglou<\/a> said earlier this month. \"This is far from given, and I wouldn't put more than a 50% chance to the SEC classifying Ethereum as a commodity before May.\"","Investment bank TD Cowen noted that the SEC might want to observe the spot bitcoin ETFs for a period of time before introducing any further crypto ETFs.","\"Our expectation is that the agency will not be approving ETPs for other crypto tokens any time soon as we believe the SEC will want to gain experience from Bitcoin ETPs before it approves an Ethereum or other crypto token ETP,\" wrote TD Cowen Washington Research Group, led by Jaret Seiberg, <a href=\"https:\/\/www.theblock.co\/post\/272514\/sec-spot-ethereum-etf-td-cowen\" data-v-f87c67ca=\"\">The Block reported<\/a>. \"The wait might not be as long as 26 months, but it likely would be after the election.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"Grayscale's Court of Appeals","content":"ORGANIZATION"},{"type":"GSR","content":"ORGANIZATION"},{"type":"Sui Chung","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Anthony Scaramucci","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"Gary Gensler","content":"PERSON"},{"type":"two years after the first","content":"DATE"},{"type":"-0.59%","content":"PERCENT"},{"type":"Ethereum ETF","content":"ORGANIZATION"},{"type":"Philippe Bekhazi","content":"PERSON"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"James Seyffart","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"SkyBridge Capital","content":"ORGANIZATION"},{"type":"earlier this month","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"75%","content":"PERCENT"},{"type":"Phoenix","content":"LOCATION"},{"type":"TD Cowen Washington Research Group","content":"ORGANIZATION"},{"type":"Matt Kunke","content":"PERSON"},{"type":"Seyffart","content":"PERSON"},{"type":"TD Cowen","content":"ORGANIZATION"},{"type":"Brett Tejpaul","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Bitwise CIO Matt Hougan","content":"PERSON"},{"type":"Bloomberg Intelligence Senior ETF","content":"ORGANIZATION"},{"type":"Nikolaos Panigirtzoglou","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Jaret Seiberg","content":"PERSON"}],"hashtag":["ETHEREUM","SPOT BITCOIN ETF"],"authors":["Tim Copeland","The Block"]}