{"summary":"InterPlanetary File System (IPFS), the peer-to-peer distributed file system developed by Protocol Labs, has received a network upgrade aimed at speeding up the content routing process. IPFS offers a decentralized alternative to existing file-sharing protocols like the Hypertext Transfer Protocol (HTTP).","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63189\/ipfs-network-upgrade-data-fetching","publishDate":"2020-04-28T09:09:24","id":9436,"type":null,"title":"InterPlanetary File System gets a network upgrade: Faster data fetching","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">InterPlanetary File System (IPFS), the peer-to-peer distributed file system developed by Protocol Labs, has received a network upgrade aimed at speeding up the content routing process.<\/span>","<span data-v-f87c67ca=\"\">As The Block previously <a href=\"https:\/\/www.theblockresearch.com\/ipfs-the-interplanetary-file-system-12053\" data-v-f87c67ca=\"\">explained<\/a>, IPFS offers a decentralized alternative to existing file-sharing protocols like the Hypertext Transfer Protocol (HTTP). Compared to HTTP, for example, which follows a traditional client-server model, IPFS incorporates multiple web elements and makes use of distributed nodes.<\/span>","<span data-v-f87c67ca=\"\">On Tuesday, Protocol Labs released the system's new iteration, IPFS 0.5, which makes it faster to add, find, provide, and fetch data. In doing so, developers made several improvements to its distributed hash table (DHT) implementation – a catalog-like mechanism that helps the network find content.&nbsp;<\/span>","According to information shared with The Block, the upgraded network would allow users to fetch content two to five times faster than the current one.&nbsp;","In order to improve the overall developer experience, IPFS 0.5 also added support for popular tools including blockchain-based .eth links, Linux's service manager Systemd, and .car files.","\"Our collaboration with Protocol Labs and the latest go-ipfs v0.5 release are essential to our upcoming premium IPFS product release later this year,\" said Michae<span data-v-f87c67ca=\"\">l Godsey, product manager at Infura, a hosted Ethereum node cluster that provides an IPFS node to developers. <\/span>\"The improvements to the DHT and stability of peering allow us to provide an even more reliable product and continue to get IPFS into the hands of decentralized application developers.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Michae<span data-v-f87c67ca=\"\">l Godsey","content":"PERSON"},{"type":"Infura","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Systemd","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Protocol Labs","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}