{"summary":"Google search interest for &quot;Solana&quot; increased 250% in the past two months, coinciding with the asset&#x27;s performance and surge of memecoins. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268230\/solana-search-volume-on-google-increases-250-over-the-past-two-months","publishDate":"2023-12-18T17:09:33","id":9439,"type":null,"title":"Solana search volume on Google increases 250% over the past two months","category":["CRYPTO ECOSYSTEMS"],"content":["Google search volume for the term \"solana\" has increased 250% from early October to early December, according to data tracked by The Block.&nbsp;","Ranked on a scale of 0 to 100, with 100 representing a peak seen back in 2020, search volume for \"solana\" increased to 49 in early December from 14 just two months earlier.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/alternative-crypto-metrics\/web-traffic\/google-search-volume-solana\/embed\" title=\"Google Search Volume - Solana\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","\"Its price performance has been a lot stronger than other assets which has likely been pulling in more interest, and more recently memecoins on the network have also been taking off,\" The Block research analyst Rebecca Stevens said.&nbsp;","Solana's price rallied 224% between Oct. 11 and Dec. 18, according to The Block data.","Major players in the crypto industry have also highlighted solana's strong performance, such as ARK Invest CEO Cathie Wood <a href=\"https:\/\/www.theblock.co\/post\/263195\/solanas-price-spikes-18-day-after-cathie-wood-sings-networks-praises\" data-v-f87c67ca=\"\">saying<\/a> Solana is faster and cheaper than Ethereum and \"doing a really good job.\"&nbsp;","<span data-v-f87c67ca=\"\">Price performance for Solana since October 11 to December 18. Image: The Block Price Page<\/span>","Google search volume for \"bitcoin\" and \"ethereum\" have increased between October and December as well, although at a more tepid pace.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Rebecca Stevens","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Dec. 18","content":"DATE"},{"type":"December from 14 just two months earlier","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"October 11","content":"DATE"},{"type":"December","content":"DATE"},{"type":"224%","content":"PERCENT"},{"type":"Cathie Wood","content":"PERSON"},{"type":"Oct. 11","content":"DATE"},{"type":"250%","content":"PERCENT"},{"type":"Ethereum","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"December 18","content":"DATE"}],"hashtag":["SOLANA"],"authors":["MK Manoylov","The Block"]}