{"summary":"Avail, a modular blockchain project that spun out of Polygon last year, has raised $27 million from Founders Fund, Dragonfly and others.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279095\/peter-thiel-founders-fund-avail-funding","publishDate":"2024-02-26T08:48:50","id":9440,"type":null,"title":"Peter Thiel&#x27;s Founders Fund co-leads $27 million seed round for modular blockchain project Avail","category":["VENTURE CAPITAL"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Avail, a modular blockchain project that spun out of Polygon last year, has raised $27 million in a seed funding round co-led by Peter Thiel's Founders Fund and Dragonfly.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Other investors in the round included SevenX Ventures, Figment Capital, Nomad Capital, and several unidentified angel investors, Avail said Monday. <\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Anurag Arjun, co-founder of Avail, declined to comment on the structure of the round and valuation, but a source with knowledge of the matter said the round was structured as a simple agreement for future tokens and gave Avail a fully diluted valuation of several hundred million dollars.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Arjun said Avail is currently raising another round of funding, so \"we are unable to disclose the valuation until completion\" and cannot comment on \"structure and FDV at this point of time.\"&nbsp;<\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/post\/220454\/polygon-avail-anurag-arjun\" data-v-f87c67ca=\"\">Avail<\/a> commenced operations within Polygon in late 2020 and was funded from Polygon's treasury until March 2023, when it became an independent entity separate from Polygon. As it approaches its mainnet launch, Avail has raised external funding.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Avail is a modular blockchain project aiming to streamline the rollup experience since it believes numerous rollups, including app-specific ones, will power blockchain scalability. <\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"Rollups scale execution by taking compute off-chain, but the growth of rollups places substantial demands on Ethereum for data availability,\" Arjun told The Block. \"It will take a few years for Danksharding to be fully implemented, which means that the Ethereum blobspace needs to be scaled using a validity-proof enabled, responsive, scalable data availability layer. This is what Avail DA solves for,\" he said.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">DA is the first of Avail's \"Trinity\" offerings. The other two are Nexus and Fusion Security. Nexus enables a permissionless verification hub that will unify rollups, leveraging Avail DA as the root of trust, Arjun said. Fusion Security, on the other hand, will take the native assets of the most mature ecosystems, including Bitcoin and Ethereum, and allow them to contribute additional security to the Avail ecosystem, Arjun added.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Fusion Security sounds similar to restaking. Arjun said it has indeed taken inspiration from <a href=\"https:\/\/www.theblock.co\/post\/267603\/eigenlayer-modular\" data-v-f87c67ca=\"\">EigenLayer<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/266518\/bitcoin-staking-babylon-series-a\" data-v-f87c67ca=\"\">Babylon<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/215662\/babylon-to-bring-bitcoin-security-to-chains-in-the-cosmos-ecosystem\" data-v-f87c67ca=\"\">Osmosis<\/a>. However, Avail Fusion Security differs from these projects as \"it borrows economic security from other assets but penalizes both safety and liveness failures in the Avail consensus,\" he said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Modular blockchain projects are rising in popularity, especially after Celestia's launch late last year. Earlier this month, modular projects <a href=\"https:\/\/www.theblock.co\/post\/277605\/crypto-lava-network-funding-reward-points-magma\" data-v-f87c67ca=\"\">Lava<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/278316\/inco-raise-testnet\" data-v-f87c67ca=\"\">Inco<\/a> raised funds, too. <\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">When asked how Avail is different from other modular projects, Arjun said besides technical differences, other projects focus on only one component of modularity, such as data availability or data access. \"Avail's products focus on a much broader scope and exist to mitigate the user experience fragmentation that comes with rollup proliferation,\" he said.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Avail's tech stack enables \"a more modular design space\" for projects to build on its infrastructure, <a href=\"https:\/\/www.theblock.co\/post\/226680\/founders-fund-pantera-executive\" data-v-f87c67ca=\"\">Joey Krug<\/a>, partner at Founders Fund, said in a statement. \"By decoupling the different layers of the blockchain, Avail unlocks orders of magnitude scalability improvements and helps solve the current fragmentation issues in the space, Krug added.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Avail DA is currently in testnet, and mainnet is expected to launch around April, Arjun said. Meanwhile, the first iteration of Nexus will launch later this year, and Fusion Security is expected to go live next year, he added.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">There are currently 43 people working for Avail, with its core team based in Dubai, and Arjun is looking to hire more people across functions, including engineering and business development.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$27 million","content":"MONEY"},{"type":"Peter Thiel","content":"PERSON"},{"type":"Polygon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Anurag Arjun","content":"PERSON"},{"type":"Fusion Security","content":"ORGANIZATION"},{"type":"Dubai","content":"LOCATION"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"Krug","content":"PERSON"},{"type":"Avail","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Arjun","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Figment Capital","content":"ORGANIZATION"},{"type":"Nomad Capital","content":"ORGANIZATION"},{"type":"several hundred million dollars","content":"MONEY"},{"type":"Inco","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 2023","content":"DATE"},{"type":"Avail Fusion Security","content":"ORGANIZATION"},{"type":"Joey Krug","content":"PERSON"},{"type":"Celestia","content":"LOCATION"},{"type":"Arjun","content":"PERSON"},{"type":"Babylon","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Avail DA","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["MODULAR","POLYGON","SEED &AMP; PRE-SEED"],"authors":["Yogita Khatri","The Block"]}