{"summary":"After immense backlash from musicians and fans, the music NFT marketplace HitPiece removed the beta version of its platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/132866\/music-nft-marketplace-hitpiece-slammed-for-selling-music-assets-without-artist-permission","publishDate":"2022-02-02T17:27:59","id":9442,"type":null,"title":"HitPiece slammed for selling music assets without artist permission","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">HitPiece had a simple business model: sell non-fungible tokens (NFT) of music. <\/span><span data-v-f87c67ca=\"\">The problem? Musical artists didn’t know that their work was being sold on HitPiece. <\/span>","<span data-v-f87c67ca=\"\">This caused a huge outcry of artists and music fans alike. While the music NFT platform appears to have started out with the intention to help artists perpetually earn revenue from their sales, it has now been denigrated so hard that it pulled its marketplace off its site. This begs the question: how did we get here?&nbsp;<\/span>","<span data-v-f87c67ca=\"\">HitPiece was originally launched in 2020 by Rory Felton, a music producer who co-founded the indie record label The Militia Group which was later acquired by Sony Music, along with Jeff Birmingham, an early investor in Spotify. In January, Felton announced that the startup raised $5 million in seed funding on the podcast <i data-v-f87c67ca=\"\">Business Builders<\/i>.<\/span>","<span data-v-f87c67ca=\"\">The two intended for HitPiece to be “the place for music NFTs online,” Felton said on the podcast<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">. <\/span><\/i><span data-v-f87c67ca=\"\">In the beta version of HitPiece, users could collect 1\/1 edition NFTs for every song in the world that was built on top of Spotify’s API.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The idea is that you show off to your friends or people around the world that you own the greatest HitList you can create of all your favorite songs,” Felton explained on the podcast. “The artist gets royalties from not only the initial auction but also every time it’s traded, so it becomes a perpetual revenue stream for artists and rights holders.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, it seems that HitPiece did not notify artists that NFTs of their work were being sold on the platform, nor did they confirm that these artists wanted NFTs of their music in the first place — which appears to be at the core of most user's backlash.&nbsp;<\/span>","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Yo <\/span><span class=\"r-18u37iz\" data-v-f87c67ca=\"\"><a class=\"css-4rbku5 css-18t94o4 css-901oao css-16my406 r-1cvl2hr r-1loqt21 r-poiln3 r-bcqeeo r-qvutc0\" dir=\"ltr\" role=\"link\" href=\"https:\/\/twitter.com\/joinhitpiece\" data-v-f87c67ca=\"\">@joinhitpiece.<\/a> <\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Someone has minted my work as NFTs on your website without my approval.<\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\"> Please remove these immediately. I did not mint these, I would never mint my work as an NFT, and this was done without my permission,\" <a href=\"https:\/\/twitter.com\/jjbbllkk\/status\/1488629198017089537\" data-v-f87c67ca=\"\">wrote<\/a> a Twitter user named Jeremy Blake.&nbsp;<\/span>","Users also <a href=\"https:\/\/www.youtube.com\/watch?v=J3Rn0sL2K6Q\" data-v-f87c67ca=\"\">claimed<\/a> that, since HitPiece only accepted debit or credit cards as opposed to cryptocurrency for NFT payments, there would be no transaction on the blockchain stating that buyers owned a HitPiece NFT.&nbsp;","<span data-v-f87c67ca=\"\">After immense backlash, HitPiece apologized to its users on February 2 and promised to regroup. “Clearly we have struck a nerve and are very eager to create the ideal experience for music fans,” HitPiece wrote on Twitter. “To be clear, artists get paid when digital goods are sold on HitPiece. Like all beta products, we are continuing to listen to all user feedback and are committed to evolving the product to fit the needs of the artists, labels and fans alike.”&nbsp;<\/span>","HitPiece did not respond in time to clarify how artists would be compensated for their work.&nbsp;","<span data-v-f87c67ca=\"\">It’s unclear where the platform will go from here. But users hope that, with the controversy surrounding HitPiece’s business model, more focus will be put on the artists affected by the platform.<\/span>","\"i hope the h*tpiece discourse can pivot away from giving the site attention and a platform, and move towards giving an example to the masses to why directly supporting artists is so important, and that shit like this isn't uncommon at all cuz we're all constantly being exploited,\" a Twitter user <a href=\"https:\/\/twitter.com\/5ubaruu\/status\/1488972197611937797\" data-v-f87c67ca=\"\">wrote<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"HitPiece NFT","content":"ORGANIZATION"},{"type":"Felton","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Militia Group","content":"ORGANIZATION"},{"type":"HitPiece","content":"ORGANIZATION"},{"type":"Sony Music","content":"ORGANIZATION"},{"type":"HitPiece","content":"PERSON"},{"type":"Jeff Birmingham","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Jeremy Blake","content":"PERSON"},{"type":"Spotify","content":"LOCATION"},{"type":"Rory Felton","content":"PERSON"},{"type":"February 2","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"$5 million","content":"MONEY"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}