{"summary":"Decentralized lending protocols’ total value locked has exceeded $30 billion for the first time since mid-2022.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279775\/decentralized-lending-tvl-30b-usd","publishDate":"2024-03-01T06:10:44","id":9444,"type":null,"title":"Decentralized lending TVL tops $30 billion for the first since mid-2022","category":["CRYPTO ECOSYSTEMS"],"content":["The total value locked in decentralized lending protocols has exceeded $30 billion, a milestone not reached since the cryptocurrency market downturn mid-2022.","According to <a href=\"https:\/\/defillama.com\/protocols\/Lending\" data-v-f87c67ca=\"\">data<\/a> from DeFiLlama, lending TVL currently stands at more than $31 billion. The growth from a low of $10.5 billion in TVL in January 2023 to the present level signifies a substantial rebound, effectively tripling the value locked in lending protocols. Meanwhile, it has seen a 36% increase since the beginning of this year.","This is attributable to multiple factors, including the broader cryptocurrency market’s recovery and heightened interest from institutional investors in DeFi offerings. This figure does not include centralized lenders such as Celsius and BlockFi.","“The recent recovery of the crypto market has helped fuel the demand for leverage, leading to an increasing demand for lending protocols,” Eden Au, a research director at The Block, noted.","Decentralized lending protocols, which enable cryptocurrency borrowing and lending without traditional financial intermediaries, have played a significant role in the sector since the notable “DeFi Summer” of 2019.","Aave leads this lending category with a TVL of $9.9 billion, including $8.4 billion on the Ethereum network and the rest spread across various chains. Other significant protocols include JustLend with $6.8 billion, Spark with $3.7 billion, Compound with $2.8 billion, and Morpho approaching the $1 billion threshold.","The overall TVL in DeFi has surged 50% since the year’s start, moving from $60 billion to over $95 billion, based on The Block's <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/total-value-locked-tvl\" data-v-f87c67ca=\"\">data dashboard<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/total-value-locked-tvl\/total-value-locked-by-category\/embed\" title=\"Value Locked by Category\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Despite the growing trend, the DeFi sector, of which lending is a major part, still faces regulatory uncertainties and security challenges. Au noted that such protocols also face regulatory uncertainties, as some institutional investors may be unwilling to engage with permissionless systems where their counterparties are unknown.","“Lending protocols need to constantly fine-tune a wide range of parameters to strike a balance between improving capital efficiency and preventing defaults and bad debt,” he added.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$31 billion","content":"MONEY"},{"type":"$10.5 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$95 billion","content":"MONEY"},{"type":"January 2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$8.4 billion","content":"MONEY"},{"type":"Summer” of 2019","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"$9.9 billion","content":"MONEY"},{"type":"36%","content":"PERCENT"},{"type":"$3.7 billion","content":"MONEY"},{"type":"$2.8 billion","content":"MONEY"},{"type":"Morpho","content":"ORGANIZATION"},{"type":"$60 billion","content":"MONEY"},{"type":"$6.8 billion","content":"MONEY"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["AAVE","ASSETS","LENDING"],"authors":["Vishal Chawla","The Block"]}