{"summary":"Cboe Global Markets sent a shockwave through the cryptocurrency world when it pulled the most-watched application for a cryptocurrency exchange-traded","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/9875\/vaneck-has-refiled-its-bitcoin-etf-proposal-but-there-are-some-changes","publishDate":"2019-01-31T16:57:41","id":9446,"type":null,"title":"VanEck has refiled its bitcoin ETF proposal, but there are some changes","category":["BITCOIN"],"content":["Cboe Global Markets sent a shockwave through the cryptocurrency world when it pulled the most-watched application for a cryptocurrency exchange-traded fund earlier this month.&nbsp;","[related id=\"1\"]The so-called&nbsp;SolidX Bitcoin Shares ETF, which is a collaborative effort by asset manager VanEck and SolidX, was filed to list on Cboe, a Chicago exchange operator, in 2018. The application was pulled during the partial U.S. federal government shutdown, a few weeks before it would have faced a verdict from the Securities and Exchange Commission on its listing. VanEck CEO Jan VanEck said <a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/23\/vaneck-withdraws-application-for-bitcoin-etf\/\" data-v-f87c67ca=\"\">in an interview with CNBC<\/a> the firm would refile once the SEC returned to work.","The firm made good on that promise, refiling the application — <a href=\"http:\/\/cdn.cboe.com\/resources\/regulation\/rule_filings\/pending\/2019\/SR-CboeBZX-2019-004.pdf\" data-v-f87c67ca=\"\">but not before making a few changes<\/a>. In total, the new application is about 40 pages longer.&nbsp;","The additions aim to counter the SEC's concerns about a bitcoin ETF, including that the underlying spot market is not properly regulated or monitored to catch nefarious activity.","In a new section on page 10, VanEck claims that the SEC has not provided sufficient insights into what it means when it says a bitcoin ETF would require a \"significant regulated market.\" VanEck then argues the SEC has previously approved ETFs without the fund issuer outlining how the respective underlying markets for their product met such a designation.","\"Of particular interest is the approval order for the Breakwave Dry Bulk Shipping ETF (the “Shipping Futures ETF”) which is designed to provide exposure to the daily change in the price of dry bulk freight futures: an ETP that provides exposure to a unique underlying instrument with no direct precedent for approval,\" VanEck wrote.&nbsp;","\"The Approval Order includes no additional analysis that specifically discusses whether the markets with which the listing exchange will be able to share surveillance information related to freight futures, which the Shipping Futures ETF will invest substantially all of its assets in,19 are significant regulated markets,\" the firm added.&nbsp;","The firm then compared the liquidity of bitcoin futures versus the freight futures. The SEC has cited the lack of liquidity in bitcoin markets as one of the reasons it is not ready for an ETF.","\"For instance, the notional average daily volume for Bitcoin Futures in the third quarter and fourth quarter of 2018 were more than $150 million and $121 million, respectively, as compared to the estimate of $50-100 million per day for freight futures,\" VanEck noted.&nbsp;","Elsewhere in the market, Gemini’s Winklevoss twins confirmed their commitment to getting a bitcoin ETF off the ground during an Ask Me Anything on Reddit. The twins, who tried to get a fund tracking bitcoin approved in 2017, said they “are committed as ever to making an ETF&nbsp;a reality,”&nbsp;<a href=\"https:\/\/cointelegraph.com\/news\/winklevoss-twins-confirm-commitment-to-bitcoin-etf-during-reddit-ama\" data-v-f87c67ca=\"\">according to a&nbsp;CoinTelegraph&nbsp;report<\/a>.&nbsp;","In Switzerland, traders went wild for a ETN product tracking cryptocurrency markets.&nbsp;The so-called Amun Crypto Basket ETP began trading on Switzerland’s Six Exchange at the end of 2018 and it quickly had the highest volumes of any exchange-traded product on the venue. Still, its turnover of $30,000 per day is a tiny fraction of the volumes the exchange's top ETFs see.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$50","content":"MONEY"},{"type":"Gemini’s Winklevoss twins","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Switzerland","content":"LOCATION"},{"type":"$30,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Cboe Global Markets","content":"ORGANIZATION"},{"type":"Jan VanEck","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"$121 million","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"Cboe","content":"ORGANIZATION"},{"type":"third quarter and fourth quarter of 2018","content":"DATE"},{"type":"Chicago","content":"LOCATION"},{"type":"Amun Crypto Basket ETP","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"}],"hashtag":["CRYPTO"],"authors":["Frank Chaparro","The Block"]}