{"summary":"Celsius was using a Ponzi-like scheme to pay yields, the Vermont Department of Financial regulation alleged in a filing supporting the Justice Department&#x27;s motion to appoint an examiner in its bankruptcy case.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168369\/celsius-ran-a-ponzi-like-scheme-states-allege","publishDate":"2022-09-07T16:12:04","id":9448,"type":null,"title":"Celsius may have run a Ponzi-like scheme, states allege","category":["LEGAL"],"content":["Celsius may have been using a Ponzi-like scheme to pay yields, the Vermont Department of Financial regulation alleged in a filing supporting the Justice Department's motion to appoint an examiner in its bankruptcy case.","Meanwhile, holders of Celsius Series B shares filed a limited objection to the motion, saying it had no position on whether an examiner should be appointed, but asked that the scope be narrowed and the budget to be tailored to avoid unnecessary costs.&nbsp;","The Vermont filing said Celsius made public statements saying all funds were safe and it was weathering market volatility when in fact internal financial records show it was actually insolvent, depositor funds were not safe and it lacked sufficient assets to repay its obligations. The state claims that Celsius obfuscated its insolvency at multiple points, using its CEL token to fill holes in its balance sheet, and the company may have used new investor funds to pay existing investors when its yield program failed to operate as planned, also known as a Ponzi scheme.","The Texas State Securities Board (SSB) filed a similar motion claiming that in addition to slow response time and incomplete submissions from Celsius on requested information and documentation, \"the representations of the Debtors regarding their financial status in the bankruptcy case have been inconsistent at best.\"&nbsp;","Together, some 40 state securities regulators are looking into Celsius over \"concerns about potential unregistered securities activity, mismanagement, securities fraud, and market manipulation by Celsius and its principals.\"","Those <a href=\"https:\/\/www.theblock.co\/post\/157252\/vermont-regulator-joins-multistate-investigation-into-celsius\" data-v-f87c67ca=\"\">investigations<\/a> have repeatedly come up during the lender's Chapter 11 bankruptcy proceedings, with the Justice Department's U.S. Trustee and the judge in the case asking for more information. Now regulators are sharing weighty findings in support of the U.S. Trustee's motion to appoint an examiner to Celsius.","\"At a minimum, Celsius has been operating its business in violation of state securities laws,\" according to the Vermont filing. \"That improper practice alone warrants investigation by a neutral party.\"","The Vermont securities regulator says \"it has become clear that Celsius, through its CEO Alex Mashinsky and otherwise, made false and misleading claims to investors\" about the firm's financial health. The filing uses multiple Mashinsky tweets to contrast the public claims the firm made about its financial position compared to balance sheets showing a different story.","Attorneys also found that Celsius' road to insolvency may have begun earlier than its initial claims in court proceedings that it derived from the wider fall of crypto markets in 2022. The filing highlighted a Mashinsky tweet from July 2021 claiming Celsius was profitable. At the time of the tweet, the filing said preliminary analysis of financial records shows Celsius took massive losses in 2021. During a creditor meeting last month, Celsius Chief Financial Officer Chris Ferraro also undercut the firm's initial narrative when he said the company’s insolvency started with financial losses in 2020 and through 2021.","The Texas filing concurred with the Vermont allegations, pointing to multiple situations in which it believes Celsius misled the public. Among other examples, it cited a June 7 blog post in which Celsius assured customers it had not had any issues meeting withdrawal requests just five days before it would halt withdrawals.&nbsp;","The Vermont filing also claims Mashinsky publicly misled investors in its regulatory dealings by claiming it had settled concerns from state securities regulators in December. At that time, the Vermont regulator says Celsius was still subject to \"several pending actions and investigations.\"&nbsp;","The Vermont filing says it has found merit in claims that Celsius manipulated the price of its native token. From May 2 to July 1, during which time the firm <a href=\"https:\/\/www.theblock.co\/linked\/151522\/crypto-lending-firm-celsius-pauses-withdrawals-and-transfers-citing-market-conditions\" data-v-f87c67ca=\"\">halted withdrawals<\/a>, Celsius increased its CEL position by more than 40 million tokens, with over half of the increase coming after the platform's halt. Celsius also did this during a period in 2021, according to the regulator. Without the CEL position, liabilities would have exceeded assets \"since at least\" Feb. 2019.","\"By increasing its Net Position in CEL by hundreds of millions of dollars, Celsius increased and propped up the market price of CEL, thereby artificially inflating the company’s CEL holdings on its balance sheet and financial statements,\" said the filing. \"This shows a high level of financial mismanagement and also suggests that at least at some points in time, yields to existing investors were probably being paid with the assets of new investors.\"","The U.S. Trustee moved to <a href=\"https:\/\/www.theblock.co\/post\/164417\/us-trustee-moves-to-appoint-examiner-in-celsius-bankruptcy-case\" data-v-f87c67ca=\"\">appoint<\/a> an examiner in the hopes of producing an unbiased public report with more transparency on the firm's business operations. The possibility is still being debated in court. At the most recent <a href=\"https:\/\/www.theblock.co\/post\/167331\/celsius-latest-bankruptcy-court-hearing-sets-stage-for-future-decisions?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">hearing<\/a>, the Committee of Creditors said it would be open to the possibility given it didn't incur significant costs through the process, and that it is conducting its own <a href=\"https:\/\/www.theblock.co\/post\/162309\/celsius-creditor-committee-says-it-will-investigate-conduct-of-mashinsky-and-other-insiders\" data-v-f87c67ca=\"\">investigation<\/a> into Celsius's operations.&nbsp;","Series B holders formally expressed those concerns in their limited objection today, asking to narrow the scope and budget for the possible examiner.","The SSB filing noted that though the cost is a factor for the court to consider, \"the Court may limit the examiner’s duties to those that compliment the work of the Unsecured Creditors Committee.\"&nbsp;","\"The SSB is appreciative of the work being done by the Committee to clear the murky waters that are the Debtors’ operations and assets, but believe a neutral third party will increase transparency in the present case,\" said the filing. \"Further, an examiner may be more efficiently able to coordinate information requests by and dissemination to various parties in the case, including the Committee, state and federal regulators, creditors, and other parties in interest.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"SSB","content":"ORGANIZATION"},{"type":"June 7","content":"DATE"},{"type":"Committee of Creditors","content":"ORGANIZATION"},{"type":"CEL","content":"ORGANIZATION"},{"type":"Vermont Department of Financial","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"July 1","content":"DATE"},{"type":"Ponzi","content":"LOCATION"},{"type":"Mashinsky","content":"PERSON"},{"type":"May 2","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Feb. 2019","content":"DATE"},{"type":"Texas State Securities Board (SSB","content":"ORGANIZATION"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Committee","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Vermont","content":"LOCATION"},{"type":"Celsius","content":"PERSON"},{"type":"Chris Ferraro","content":"PERSON"},{"type":"Unsecured Creditors Committee","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"July 2021","content":"DATE"},{"type":"U.S. Trustee","content":"ORGANIZATION"},{"type":"Mashinsky","content":"ORGANIZATION"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}