{"summary":"ZachXBT authored a 2022 Medium post alleging Jeffrey Huang embezzled 22,000 ETH. Huang is now suing for defamation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235220\/crypto-sleuth-zachxbt-sued-for-defamation","publishDate":"2023-06-16T16:44:37","id":9449,"type":null,"title":"Crypto sleuth ZachXBT sued for defamation","category":["POLICY"],"content":["A self-described \"on-chain sleuth\" who goes by the pseudonym ZachXBT has been sued in a Texas court for defamation.&nbsp;","The plaintiff is Jeffrey Huang, also known by his alias \"Machi Big Brother,\" and the suit claims that ZachXBT made defamatory remarks in a 2022 <a href=\"https:\/\/medium.com\/@investigationsbyzachxbt\/22-000-eth-embezzled-and-over-ten-projects-failed-the-story-of-machi-big-brother-jeff-huang-a1ad073fcfa8\" data-v-f87c67ca=\"\">post<\/a> that alleges Huang embezzled 22,000 ETH from the crypto management firm Formosa Financial.&nbsp;","The lawsuit argues that the article lacked evidence and states that the \"defendant’s claims about plaintiff’s supposed criminal conduct are categorically false.\" It says that ZachXBT sought to personally profit from the article by attracting clicks, encouraging retweets and \"attracting additional 'donations' to fund his lifestyle, all at the expense of plaintiff’s reputation.\"","The lawsuit says Huang was unsuccessful in his efforts to have the article taken down, and he's now seeking a jury trial and compensatory damages.","\"The lawsuit is baseless and an attempt to chill free speech. I intend to fight back &amp; defend free speech,\" ZachXBT wrote on <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1669783717236342785\" data-v-f87c67ca=\"\">Twitter<\/a>, adding that he had set up a donation address to \"assist with legal costs associated with the defense of this matter, which could easily exceed $1m USD.\"","He posted the wallet address to Twitter, and the balance is currently around 33 ETH, or about $57,000, according to Etherscan.","\"All EVM Chains are accepted and stablecoins are preferred,\" ZachXBT wrote, saying that any leftover funds would be returned to contributors on a pro rata basis.&nbsp;","\"This is a classic David &amp; Goliath story,\" he wrote. \"My understanding is that Machi is very wealthy. I am not. He is using his money to try silence me. I’m asking for your help so this doesn’t happen &amp; the truth survives.\"","ZachXBT blacked out his name in a Friday tweet about the lawsuit, but his legal name is visible in copies of the lawsuit available in public databases.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1m","content":"MONEY"},{"type":"$57,000","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Machi Big Brother","content":"ORGANIZATION"},{"type":"David &amp; Goliath","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Formosa Financial","content":"ORGANIZATION"},{"type":"Huang","content":"PERSON"},{"type":"EVM Chains","content":"ORGANIZATION"},{"type":"Jeffrey Huang","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Machi","content":"ORGANIZATION"}],"hashtag":["LAWSUITS"],"authors":["MK Manoylov","The Block"]}