{"summary":"Tesseract, the energy startup set up by former Revolut veterans Alan Chang and Charles Orr, has already raised $78 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168802\/former-revolut-exec-alan-chang-web3","publishDate":"2022-09-09T04:00:11","id":945,"type":null,"title":"Former Revolut exec Alan Chang thinks web3 can solve the energy crisis","category":["WEB3"],"content":["Tesseract, the startup co-founded by former Revolut chief revenue officer Alan Chang, plans to use crypto to help solve the UK's energy crisis.","The startup, which just raised a <a href=\"https:\/\/www.theblock.co\/post\/168248\/former-revolut-employees-raise-78-million-for-web3-energy-startup\" data-v-f87c67ca=\"\">$78 million round led<\/a> by Balderton Capital and Lakestar, was founded earlier this year by Chang and Charles Orr, a former strategy lead at Revolut. Chang was the third employee at Revolut and was considered founder and CEO Nik Storonsky’s right-hand man, <a href=\"https:\/\/www.businessinsider.com\/revolut-chief-revenue-officer-alan-chang-leaves-for-web3-startup-2022-3\" data-v-f87c67ca=\"\">per reports<\/a>.","Tesseract plans to buy and build renewable energy sources to sell directly to the customer, with crypto providing a novel way of paying. Much of the funding will be used to finance these purchases.","This funding model also means energy users can pay energy producers directly, rather than going via one of the huge brokers at the heart of the current set up.&nbsp;","“By going directly to customers, we bypass the brokers,” said Chang, who formally left Revolut last week.&nbsp;“We can not only improve margins by doing that, but also sell energy much more competitively than everyone else.”","Tesseract, now valued at $145 million, takes its name from the cube capable of storing unlimited energy in the Marvel movies — of which Chang is “a big fan.”","Across the world, energy prices have soared as the war in Ukraine and a disruptions from the pandemic took their toll. While upcoming legislation aims improve the situation in the UK, household energy bills have continued to rise, with some analysts forecasting that they will reach <a href=\"https:\/\/www.itv.com\/news\/2022-08-27\/energy-bills-forecast-to-hit-7700-next-year-in-worst-price-cap-warning-yet\" data-v-f87c67ca=\"\">£7,700 ($9,000) annually<\/a> without more government support.","Chang believes that an opportunity to offset sky-high energy bills may emerge through Tesseract’s use of blockchain technology. The startup will tokenize the sale of energy, meaning users can buy and hold a token that equates to certain amount of energy.&nbsp;","Chang describes it as a “virtual renewable power station” from which users can buy energy directly from solar panels and other renewable energy sources via tokens. This, he said, will create liquidity in a market that has historically lacked it.","Owning these tokens will allow users to reduce their energy bills, Chang explained.","\"Let’s say you use 100 kilowatt hours of energy every month and your tokens also generate the same amount — that means you’re offset, and your energy bill will be zero,” he said.","It’s an ambitious plan and one that will likely face pushback from a public that largely views blockchain technologies as confusing and, generally, bad for the environment.","Launching on mobile, with a closed beta likely by end of the year and a public launch next year, Tesseract users will be able to purchase its tokens in-app with the click of a button, while those who wish to hold the tokens in their own non-custodial wallet will be able to do so.","The token itself will likely be an ERC-20 built on top of the Ethereum blockchain, using a compatible Layer 2 solution, said Chang. &nbsp;","He wants to make the project as decentralized as possible, with the aim of listing it on both decentralized and centralized exchanges. But he said that doesn’t mean it’s an investment product.","“Initially we will be the only issuer of these renewable power tokens but eventually we want to invite more renewable energy companies in the world to participate in this network,” he says. “We want to create a truly decentralized renewable power network.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lakestar","content":"PERSON"},{"type":"Charles Orr","content":"PERSON"},{"type":"Alan Chang","content":"PERSON"},{"type":"$145 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"20","content":"DATE"},{"type":"Tesseract","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"$9,000","content":"MONEY"},{"type":"Balderton Capital","content":"ORGANIZATION"},{"type":"Nik Storonsky","content":"PERSON"},{"type":"$78 million","content":"MONEY"},{"type":"Chang","content":"PERSON"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}