{"summary":"At their core, carbon credits are financial tools driving capital towards direct, verifiable actions that mitigate climate change. Global demand for carbon credits is projected to grow by a factor of 100 by 2050, with the global voluntary carbon market (VCM) poised to reach $50bn by 2030.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227757\/how-blockchain-and-carbon-markets-can-unlock-capital-to-accelerate-climate-action","publishDate":"2023-04-25T09:00:28","id":9452,"type":null,"title":"How Blockchain and Carbon Markets Can Unlock Capital to Accelerate Climate Action","category":["SPONSORED"],"content":["At their core, <a href=\"https:\/\/ripple.com\/insights\/how-carbon-credits-can-finance-climate-action\/?utm_source=blog&amp;utm_medium=other_campaigns&amp;utm_campaign=&amp;utm_content=the_block_article_one\" data-v-f87c67ca=\"\">carbon credits are financial tools<\/a> driving capital towards direct, verifiable actions that mitigate climate change. Global demand for carbon credits is projected to <a href=\"https:\/\/www.mckinsey.com\/capabilities\/sustainability\/our-insights\/a-blueprint-for-scaling-voluntary-carbon-markets-to-meet-the-climate-challenge\" data-v-f87c67ca=\"\">grow by a factor of 100 by 2050<\/a>, with the global voluntary carbon market (VCM) poised to reach $50bn by 2030.","However, the VCM has recently come under heavy criticism for its lack of speed and transparency and issues regarding product quality, threatening investor confidence and the pace of growth.","So, how can we ensure carbon markets reach their full potential? And what role can blockchain play?","<strong data-v-f87c67ca=\"\">Reduce, Protect, Remove <\/strong>","The VCM allows corporations to complement their decarbonization efforts by buying carbon credits voluntarily, each usually representing one tonne of greenhouse gas emissions that has been avoided, reduced or removed (e.g. from reforestation to engineered carbon dioxide removal and sequestration). This flow of capital enables these climate positive activities to scale.","Corporations, asset managers and investors are starting to recognize carbon and ecological assets as a new, diverse and promising asset class.","The quality and price of a carbon credit are influenced by a number of criteria including project type, size, permanence and additional co-benefits. These attributes can be hard to evaluate and de-risk. Due diligence is often complex, time consuming and expensive.","Today's VCM lacks the infrastructure to deliver the necessary levels of transparency, trust, efficiency, liquidity, value and fair pricing for buyers and suppliers. The status quo is inhibiting the growth required to truly help meet climate goals.","<strong data-v-f87c67ca=\"\">How Can Blockchain Help?<\/strong>","Blockchain technology won’t solve all these issues but can offer a path forward. Blockchain’s built-in efficiency, immutability and decentralized operations naturally address some of the most persistent pain points in VCM.","The World Economic Forum recently issued a series of <a href=\"https:\/\/www.weforum.org\/whitepapers\/recommendations-for-the-digital-voluntary-and-regulated-carbon-markets\/\" data-v-f87c67ca=\"\">recommendations to scale digital voluntary carbon markets<\/a>, calling for:","<strong data-v-f87c67ca=\"\">Catalyzing a Carbon-Neutral Future <\/strong>","We are entering a new phase of financial innovation and climate action. Global stakeholders are collaborating across sectors to define a set of principles that govern climate-related blockchain initiatives, and a number of transformative solutions are emerging.","Ripple’s solutions are built on one of the world’s fastest, low-energy and carbon-neutral public blockchains—the <a href=\"https:\/\/xrpl.org\/impact.html?utm_source=blog&amp;utm_medium=other_campaigns&amp;utm_campaign=&amp;utm_content=the_block_article_one\" data-v-f87c67ca=\"\">XRP Ledger<\/a>. As a founding member of the Crypto Climate Accord, the World Economic Forum’s Crypto Sustainability Coalition and the Blockchain for Climate Leadership Network, <a href=\"https:\/\/ripple.com\/impact\/sustainability\/?utm_source=blog&amp;utm_medium=other_campaigns&amp;utm_campaign=&amp;utm_content=the_block_article_one\" data-v-f87c67ca=\"\">Ripple is actively advocating for a low-carbon future<\/a>. Helping to modernize and scale <a href=\"https:\/\/ripple.com\/ripple-press\/ripple-commits-100m-to-scale-and-strengthen-global-carbon-markets-addresses-quality-and-transparency-using-blockchain-and-crypto\/?utm_source=blog&amp;utm_medium=other_campaigns&amp;utm_campaign=&amp;utm_content=the_block_article_one\" data-v-f87c67ca=\"\">global carbon markets<\/a> is a critical component of our commitment.","Together, we can make a difference to win in the race against climate change and deliver on the promise of a more sustainable, inclusive and transparent future.","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Ripple <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"VCM","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2050","content":"DATE"},{"type":"the World Economic Forum’s Crypto Sustainability Coalition","content":"ORGANIZATION"},{"type":"Crypto Climate Accord","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"Neutral Future","content":"ORGANIZATION"},{"type":"$50bn","content":"MONEY"},{"type":"Climate Leadership Network","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}