{"summary":"Miami-based crypto startup VRRB Labs, which is developing a Layer 1 blockchain network, raised $1.4 million in a pre-seed funding round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209609\/vrrb-labs-raises-pre-seed-round-at-20-million-valuation-as-it-builds-its-own-layer-1","publishDate":"2023-02-08T08:00:37","id":9461,"type":null,"title":"VRRB Labs raises pre-seed round at $20 million valuation as it builds its own Layer 1","category":["DEALS"],"content":["VRRB (pronounced \"verb\") Labs, a Miami-based crypto startup that is developing a Layer 1 blockchain network, raised $1.4 million in a pre-seed funding round.","Investors in the round included Jump Crypto, Big Brain Holdings and Taureon. It was an equity plus token warrant round, giving VRRB Labs a valuation of $20 million, Andrew Smith, founder of VRRB Labs, told The Block in an interview.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Smith first had an idea of a Layer 1 blockchain in late 2017. He was an early ether (ETH) investor. His dollar cost averaging for ETH was $8, and he sold most of his holdings at $300. ETH is currently trading at around $1,670.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Smith said he wasn't a huge fan of Ethereum's plan to move to a proof-of-stake consensus mechanism due to its drawbacks, including centralization, and that he had thought of building a new Layer 1 blockchain then. But at the time, he was focused on his first startup OWL ESG — a tech-driven environmental, social and governance (ESG) data provider — which he founded in 2012. He still serves as OWL ESG's chief data scientist.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Smith formally established VRRB Labs in 2020 and has been working on the project since then. He first had some commitments for the pre-seed round in May 2022 and then formally closed the round last December amid widespread crypto collapses. \"It was a bit of a roller coaster ride. We kind of timed it perfectly wrong, but we ended up getting what we needed,\" he said.<\/span>","When asked what motivated him to launch a new Layer 1 blockchain project in an already crowded sector, Smith said existing Layer 1s aren't addressing the main problem, i.e., improving the developer experience. \"You're asking developers to learn a new language and that is a big problem,\" he said.","VRRB Labs is building a language-agnostic platform to help developers \"build, ship, run\" applications faster, similar to Docker, Smith said. \"We hear a lot about where the next billion users come from, but I think we are largely putting the cart before the horse there. What we need to be asking is, where do the first million developers come from,\" he said.","Smith went on to say that even though there are competitive blockchain projects, the overall number of web3 developers remains tiny compared to web2 developers. VRRB aims to attract web2 developers on its platform, Smith said. As for its go-to-market strategy, Smith said part of the plan is to raise money and have a bigger war chest to provide grants and bounties to bring developers on board.","\"We want to build infrastructure and platform so that we can be to web3 what Amazon Web Services is to web2,\" Smith said.","VRRB is developing a proprietary consensus mechanism called \"Proof of Claim,\" which it says will help solve the blockchain trilemma of scalability, security and decentralization.","The first beta testnet of VRRB is scheduled for next month, according to Smith. The mainnet is still far off on the roadmap, he added.","There are currently five people working for VRRB Labs and Smith has no immediate plans to expand the team.","<em data-v-f87c67ca=\"\">Updates date of first commitments for the pre-seed round.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"$300","content":"MONEY"},{"type":"May 2022","content":"DATE"},{"type":"Docker","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2012","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"Amazon Web Services","content":"ORGANIZATION"},{"type":"$1,670","content":"MONEY"},{"type":"Big Brain Holdings","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Smith","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"VRRB Labs","content":"ORGANIZATION"},{"type":"Jump Crypto","content":"LOCATION"},{"type":"$8","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"ESG","content":"LOCATION"},{"type":"$1.4 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Andrew Smith","content":"PERSON"},{"type":"\" Smith","content":"PERSON"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["Yogita Khatri","The Block"]}