{"summary":"Otherdeed #59906, the eighth rarest NFT from Yuga Labs’ Otherside metaverse project, sold for a record 625 ETH (over $1.5 million).","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/145818\/yuga-labs-otherdeed-virtual-land-nft-sells-for-record-1-5-million","publishDate":"2022-05-09T12:45:16","id":9463,"type":null,"title":"Yuga Labs’ Otherdeed NFT sells for record $1.5 million","category":["THE BLOCK"],"content":["Otherdeed #59906, the eighth rarest virtual land piece from Yuga Labs’ Otherside metaverse project, sold for a record 625 ETH ($1.5 million) on the NFT marketplace X2Y2 on Sunday.","The buyer of the piece was “n0b0dy.eth,” an avid NFT collector. The seller goes by “brickandmorty.eth,” who booked a profit of over $1.49 million, having minted the NFT a week ago for 305 apecoin (worth around $6,000 at the time).","Yuga Labs unveiled details of Otherside, its gaming metaverse project, in late April when it sold 55,000 “Otherdeeds” — “unique plots of land” required to claim space in Otherside.","Yuga raked in over $320 million selling these Otherdeeds — the highest gross for an NFT project to date.","Another 45,000 Otherdeeds were also unveiled, with 10,000 claimable by Bored Ape Yacht Club (BAYC) holders (1 BAYC = 1 Otherdeed); 20,000 by Mutant Ape Yacht Club (MAYC) holders (1 MAYC = 1 Otherdeed); and 15,000 reserved for Yuga and other project developers helping to create Otherside.","There will be a total of 200,000 Otherdeeds available. The remaining 100,000 will be rewarded to “Voyagers” who hold Otherdeeds and contribute to the development of Otherside.","Otherdeed NFTs are currently in the top 10 collections by sales volumes, according to data from CryptoSlam, clocking in around $833 million within days of launch. Its top 10 highest sales range between $700,000 and $1.5 million, according to The Block Research, citing data from Dune Analytics.","<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","The current floor price of Otherdeeds is 3 ETH ($7,200), according to <a href=\"https:\/\/opensea.io\/collection\/otherdeed\" data-v-f87c67ca=\"\">OpenSea<\/a>. That means n0b0dy.eth bought the Otherdeed #59906 NFT at a massive premium.","This could be because the NFT is <a href=\"https:\/\/raritysniper.com\/otherdeed?nftId=59906\" data-v-f87c67ca=\"\">ranked<\/a> 8th by rarity on Rarity Sniper and also contains a 1 of 1 artifact — mystery potion —which was also featured in the official trailer of Otherside, said The Block Research’s NFT analyst Thomas Bialek.","The high premium paid also suggests that n0b0dy.eth has a high conviction in the future of the Otherside project, added Bialek.","Details of Otherside remain scant, but Yuga Labs has said that it is working with gaming startups Improbable and Animoca Brands on the project.","“Otherside blends mechanics from massively multiplayer online role-playing games (MMORPGs) and Web3-enabled virtual worlds,” Improbable <a href=\"https:\/\/www.improbable.io\/blog\/otherside-metaverse-game-is-coming-normal-rules-do-not-apply\" data-v-f87c67ca=\"\">said<\/a> in its recent blog post. “In partnership with Improbable, the metaverse technology company, Yuga Labs aims to create a MetaRPG universe where the players own the world, where any NFT can become a playable character, and thousands of people can play together at the same time.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"The Block Research’s NFT","content":"ORGANIZATION"},{"type":"$1.5 million","content":"MONEY"},{"type":"$320 million","content":"MONEY"},{"type":"Thomas Bialek","content":"PERSON"},{"type":"$833 million","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"$6,000","content":"MONEY"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"$7,200","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"$1.49 million","content":"MONEY"},{"type":"$700,000","content":"MONEY"},{"type":"Rarity Sniper","content":"ORGANIZATION"}],"hashtag":["ANIMOCA BRANDS","OTHERSIDE","YUGA LABS"],"authors":["Yogita Khatri","The Block"]}