{"summary":"TL;DR In their paper “Is Bitcoin Really Un-Tethered?”, academics John Griffin and Amin Shams investigated whether tethers (USDT) are used to manipulate","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/7800\/was-bitcoin-really-manipulated","publishDate":"2019-01-18T10:56:40","id":9465,"type":null,"title":"Was Bitcoin Really Manipulated?","category":["TETHER"],"content":["Alex Kruger is a trader, economist and former banker, with expertise in global macro and cryptocurrencies. He holds an MBA from Columbia Business School. You can follow Alex on <a href=\"https:\/\/twitter.com\/Crypto_Macro\" data-v-f87c67ca=\"\">Twitter <\/a>and <a href=\"https:\/\/medium.com\/@alexkruger\" data-v-f87c67ca=\"\">Medium<\/a>.","In their paper “<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/r\/?url=https%3A%2F%2Fpapers.ssrn.com%2Fsol3%2Fpapers.cfm%3Fabstract_id%3D3195066\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-href=\"https:\/\/medium.com\/r\/?url=https%3A%2F%2Fpapers.ssrn.com%2Fsol3%2Fpapers.cfm%3Fabstract_id%3D3195066\" data-v-f87c67ca=\"\">Is Bitcoin Really Un-Tethered<\/a>?”, academics John Griffin and Amin Shams investigated whether tethers (USDT) are used to manipulate the prices of bitcoin. The paper concluded bitcoin purchases with USDT are often timed following market downturns, and that such patterns are most consistent with USDT used to manipulate prices.","However, observing bitcoin purchases with USDT following market downturns is not extraordinary and is no proof of market manipulation. Such purchases could be explained by demand from market participants, either for <em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">buying the dip<\/em> or for arbitraging spreads across exchanges. Some of the paper’s claims seem unwarranted.&nbsp;","In their paper “<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/r\/?url=https%3A%2F%2Fpapers.ssrn.com%2Fsol3%2Fpapers.cfm%3Fabstract_id%3D3195066\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-href=\"https:\/\/medium.com\/r\/?url=https%3A%2F%2Fpapers.ssrn.com%2Fsol3%2Fpapers.cfm%3Fabstract_id%3D3195066\" data-v-f87c67ca=\"\">Is Bitcoin Really Un-Tethered<\/a>?”, academics John Griffin and Amin Shams investigated whether tethers (USDT) are used to manipulate the prices of bitcoin.&nbsp;","The paper found that “<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">purchases with USDT are timed following market downturns and result in sizable increases in Bitcoin prices<\/em><\/strong>”. It also concluded that such patterns “<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">cannot be explained by investor demand proxies but are most consistent with the supply-based hypothesis where <\/em><strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">USDT is used to provide price support and manipulate cryptocurrency prices<\/em><\/strong>”.","I found that the paper jumped to unwarranted conclusions, showed a lack of understanding of financial markets, and made misleading statements. Common sense should always supersede what the data may be indicating — don’t blindly follow the data (see <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/r\/?url=https%3A%2F%2Fwww.bridgewater.com%2Fresources%2Fall-weather-story.pdf\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-href=\"https:\/\/medium.com\/r\/?url=https%3A%2F%2Fwww.bridgewater.com%2Fresources%2Fall-weather-story.pdf\" data-v-f87c67ca=\"\">here <\/a>and <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/r\/?url=http%3A%2F%2Fwww.stat.columbia.edu%2F~gelman%2Fresearch%2Fpublished%2FSIGN_15%285%29_09_InPractice_Gelman_EthicsAndComm.pdf\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-href=\"https:\/\/medium.com\/r\/?url=http%3A%2F%2Fwww.stat.columbia.edu%2F~gelman%2Fresearch%2Fpublished%2FSIGN_15(5)_09_InPractice_Gelman_EthicsAndComm.pdf\" data-v-f87c67ca=\"\">here<\/a>).","It is important to note that this paper is posted on the Social Science Research Network (SSRN), which allows researchers to \"get credit for their ideas before peer reviewed publication.\" Therefore, to my knowledge the posted version of this paper has not yet undergone peer review&nbsp;either.","The paper claims “<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">that Tether is used to purchase Bitcoin when returns are negative, but we do not find considerable Tether flows following price increases<\/em>”. However, such pattern does not indicate market manipulation, as the paper sustains.&nbsp;","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">There is nothing extraordinary in witnessing purchases of BTC with USDT following market downturns.<\/strong> Just as there is nothing extraordinary in witnessing purchases of Amazon stock with USD following a crash. Particularly more so during a bull market. This is basic common sense.","It is also not extraordinary to find that such purchases, when large, result in sizable increases in Bitcoin prices. The paper seems to confuse speculation with manipulation and ignores the validity of buying retracements as a trading strategy.&nbsp;","Furthermore, as I showed in <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/@alexkruger\/tether-bitfinex-saga-illustrated-timeline-2d128a703f9c\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/medium.com\/@alexkruger\/tether-bitfinex-saga-illustrated-timeline-2d128a703f9c\" data-v-f87c67ca=\"\">this article<\/a>, bitcoin price crashes are often followed by <strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">USDT trading at a premium to USD, which results in BTCUSD in spot exchanges trading higher than BTCUSDT in tether exchanges. <\/strong>This is likely caused by traders rushing out of bitcoin (and other cryptocurrencies) into USDT en masse.","When the price of USDTUSD deviates considerably from $1, arbitrageurs are incentivized to bring it back in-sync. I covered arbitrage mechanics in depth <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/@alexkruger\/tether-arbitrage-the-dollar-peg-7da405f13ffc\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/medium.com\/@alexkruger\/tether-arbitrage-the-dollar-peg-7da405f13ffc\" data-v-f87c67ca=\"\">in this article<\/a>. Therefore, <strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">it would not have been extraordinary to witness large USDT flows from Bitfinex to tether exchanges to purchase BTC<\/strong>. Note that the data discussed in the Griffin and Shams paper were obtained before Nov\/28\/2018, at which time <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/r\/?url=https%3A%2F%2Ftwitter.com%2FCrypto_Macro%2Fstatus%2F1067684162600095744%3Fs%3D19\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-href=\"https:\/\/medium.com\/r\/?url=https%3A%2F%2Ftwitter.com%2FCrypto_Macro%2Fstatus%2F1067684162600095744%3Fs%3D19\" data-v-f87c67ca=\"\">Bitfinex ceased to act as the de facto issuer of USDT<\/a>.&nbsp;","Arbitrage example (assuming pre Nov 2018 conditions): USDTUSDT increases to 1.03 across exchanges. Consequently the discount between BTCUSD in Bitfinex and BTCUSDT in Poloniex widens to 3% in favor of BTCUSD. A trader would sell BTC and buy USD in Bitfinex, withdraw the USD from Bitfinex as USDT (converted by Bitfinex at 1:1), transfer the USDT to Poloniex, purchase BTC with USDT, transfer the BTC to Bitfinex, sell BTC, and generate 3% in gross revenue.&nbsp;","It is true that the paper’s results are consistent with USDT <em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">issuers <\/em><strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">pushing out USDT to stabilize the price of bitcoin. <\/strong>However, results are also consistent with USDT <em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">users <\/em>buying USDT to transfer to other exchanges stabilize the price of bitcoin. <strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Large market participants providing price support happens in all markets, and does not necessarily mean there is market manipulation<\/strong>.","The paper does uncover one worrisome pattern. USDT flows should be strongly related to changes in the USDTUSD exchange rate, or to the spread across fiat and tether exchanges, which is similar. However, the paper results show USDT flows are “<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">highly sensitive to the BTCUSD pair but bears little relation to the USDTUSD pair<\/em><\/strong><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">. In fact, the flow is not sensitive to the first and second lags of USDTUSD. It does<\/em><strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\"> become marginally significant at higher lags, but the magnitude is considerably smaller than the BTCUSD pair<\/em><\/strong>”.","First, such statements are misleading. Specifically, classifying the relationship as “highly sensitive” is exaggerated and confuses the size of the effect with the significance of the effect. It would be more accurate to say <strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">bitcoin returns are related to USDT flows (or arbitrage spreads), in a small — yet statistically significant — way<\/strong>, as shown by the small beta and high t-value above. Given how the paper reports standardized coefficients, looking at the top left cell in Table A, we can infer that a 1 standard deviation unit decrease in lagged bitcoin returns corresponds to a minuscule 0.06 standard deviation increase in USDT flow.","Second, the adjusted-<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">R squared value is extremely small<\/strong>, suggesting that at most 0.4% to 1.5% of the total variance of the dependent variables is explained by the regression model, which may indicate results are not “<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/r\/?url=https%3A%2F%2Fsupport.minitab.com%2Fen-us%2Fminitab-express%2F1%2Fhelp-and-how-to%2Fbasic-statistics%2Finference%2Fsupporting-topics%2Fbasics%2Fstatistical-and-practical-significance%2F\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-href=\"https:\/\/medium.com\/r\/?url=https%3A%2F%2Fsupport.minitab.com%2Fen-us%2Fminitab-express%2F1%2Fhelp-and-how-to%2Fbasic-statistics%2Finference%2Fsupporting-topics%2Fbasics%2Fstatistical-and-practical-significance%2F\" data-v-f87c67ca=\"\">practically significant<\/a>”.","Third, the paper’s interpretation seems to rest on an important assumption. The paper claims that lagged bitcoin returns (LBR) are meaningful predictors of USDT flow, but that lagged USDT returns (LUR) are not. Such an assertion seemingly stems from the fact that the predictors corresponding to LBR are almost always statistically significant, while the predictors corresponding to LUR are mostly non-significant. However, just because some predictors are “significant” and others are “non-significant” <strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">does NOT mean that they are significantly different from <em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">each other<\/em><\/strong><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">. <\/em>Similarly, magnitudes may not be statistically different from each other, even if one estimate is lower than the other.","Fourth, as already covered, bitcoin price crashes are often followed by <strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">USDT trading at a premium to USD, resulting in BTCUSD in Bitfinex trading higher than BTCUSDT in tether exchanges. <\/strong>Therefore, the paper’s finding that USDT flow is “<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">sensitive to the BTCUSD pair” <\/em><\/strong>(even if not by much) is to be expected. The low sensitivity is likely explained by how this relationship is mostly present on extreme crashes.","Fifth, as just explained, evidence (as in the real world) indicates there is an <strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">interactive effect between LBR and LUR<\/strong>. The paper did not test this, but it is critical to know. The paper found that, holding LBR constant, there was no significant effect of LUR on USDT Flow. However, as covered above, the effect of LUR on USDT flows depend on LBR. When LBR are very low (when there is a crash), LUR are positively related to tether flows.","I cannot fully rule out the paper’s conclusions, but rather question the validity of some of them and present alternative explanations. My review of the paper’s analysis shows the paper jumped to unwarranted conclusions and made misleading statements.&nbsp;","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Bitcoin purchases with USDT have indeed often timed following market downturns. This is not extraordinary and could be explained by demand from market participants, either for <em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">buying the dip<\/em> or for arbitraging spreads across exchanges. It represents no proof of market manipulation.<\/strong>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"LUR","content":"ORGANIZATION"},{"type":"Alex Kruger","content":"PERSON"},{"type":"Amin Shams","content":"PERSON"},{"type":"Amazon","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"Columbia Business School","content":"ORGANIZATION"},{"type":"Griffin","content":"PERSON"},{"type":"USDT Flow","content":"ORGANIZATION"},{"type":"LBR","content":"ORGANIZATION"},{"type":"Table A","content":"LOCATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Bitfinex","content":"LOCATION"},{"type":"3%","content":"PERCENT"},{"type":"John Griffin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Social Science Research Network (SSRN","content":"ORGANIZATION"},{"type":"1.5%","content":"PERCENT"},{"type":"0.4%","content":"PERCENT"},{"type":"Alex","content":"PERSON"},{"type":"28\/2018","content":"DATE"},{"type":"Poloniex","content":"LOCATION"},{"type":"USDTUSD","content":"ORGANIZATION"}],"hashtag":[],"authors":["Contributor Network","The Block"]}