{"summary":"Facebook’s proposed Libra digital currency has alarmed policymakers around the world who say a global currency should be controlled by central banks. But such &quot;basket-backed&quot; stablecoins could improve consumer welfare in certain economic scenarios, according to a recent research paper from the U.S. Federal Reserve. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/69470\/libra-like-stablecoins-consumer-welfare-fed","publishDate":"2020-06-24T16:57:14","id":9475,"type":null,"title":"Libra-like stablecoins could improve consumer welfare in certain cases, Fed researchers find","category":["MARKETS"],"content":["<span data-v-f87c67ca=\"\">Facebook's proposed Libra digital currency has alarmed policymakers around the world who say central banks should control any global currency. <\/span>","<span data-v-f87c67ca=\"\">But such \"basket-backed\" stablecoins could improve consumer welfare in certain economic scenarios, according to <\/span><a href=\"https:\/\/www.federalreserve.gov\/econres\/feds\/files\/2020048pap.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a recent research paper<\/span><\/a><span data-v-f87c67ca=\"\"> from the U.S. Federal Reserve.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In March, former Bank of England governor Mark Carney <\/span><a href=\"https:\/\/qz.com\/1695707\/facebooks-libra-inspires-a-proposal-for-a-global-reserve-currency\/#:~:text=A%20single%20global%20currency%E2%80%94what,by%20a%20basket%20of%20government\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">proposed<\/span><\/a><span data-v-f87c67ca=\"\"> a central bank-run system that sounded a lot like Libra in that it would be backed by a basket of different currencies. He called it a \"synthetic hegemonic currency.\"<\/span>","<span data-v-f87c67ca=\"\">But the Fed's paper, written by economists Garth Baughman and Jean Flemming, puts the question of who should be in charge aside. Based on economic modeling, it concludes that, under certain circumstances, a hypothetical basket-backed stablecoin could contribute to a \"substantial increase\" in consumer well-being.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Baughman and Flemming created a model that included two countries, each with its own sovereign currency. They used it to test demand for a stablecoin backed by a basket containing each of those currencies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The model showed that trade shocks — changes in a country's opportunities to trade due to external events like a change in international prices or the volume of items being traded — could affect money demand that causes fluctuations in the value of the currencies in the basket. Baughman and Flemming found that these fluctuations were likely to push consumers towards more stable payment methods, thereby increasing demand for the stablecoin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Although the digital currency may not take over its component fiat currencies in popularity, if enough sellers accept it as payment, it would have a high level of \"spendability,\" the economists said. That would lead to increased trade and potentially improve consumer welfare, they conclude.<\/span>","<span data-v-f87c67ca=\"\">However, the model showed that overall demand for the stablecoin would be minimal. That's because the same trade shocks might make the demand of the stablecoin volatile enough to cause the demand of its component currencies to become volatile as well.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Baughman and Flemming say this would make it nearly impossible for the basket-backed stablecoin to become an internationally dominant currency, thus concluding that \"fears of a so-called global stablecoin replacing domestic sovereign currencies may be overstated.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"Garth Baughman","content":"PERSON"},{"type":"Jean Flemming","content":"PERSON"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Flemming","content":"PERSON"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"Mark Carney","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Baughman","content":"PERSON"}],"hashtag":["FEDERAL RESERVE"],"authors":["Saniya More","The Block"]}