{"summary":"In any kind of asset trading, risk management is crucial. To limit losses and lock in profits, traders and investors rely heavily on the most common order","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169588\/limiting-losses-and-locking-in-profits-in-defi-leverage-trading","publishDate":"2022-09-13T08:00:13","id":9478,"type":null,"title":"Limiting losses and locking in profits in DeFi leverage trading","category":["SPONSORED"],"content":["<span data-contrast=\"auto\" data-v-f87c67ca=\"\">In any kind of asset trading, risk management is crucial. To limit losses and lock in profits, traders and investors rely heavily on the most common order types used in trading, like the limit and stop orders. These types of orders are usually executed at a specific set asset price. They are the basis of any trading strategy, with a clear entry or exit point. Crypto traders rely on them and most centralized crypto exchanges offer them, like FTX, Coinbase, or Binance. In DeFi, however, one could hardly find these options for automated trades. <\/span> <span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">True DeFi risk management <\/span><\/b> <span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Until recently, there were not many risk management options for on-chain, leverage trading using DeFi lending and borrowing protocols. However the <\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\"><a href=\"https:\/\/defisaver.com\/?mtm_campaign=theblock_3rd\" data-v-f87c67ca=\"\">DeFi Saver<\/a> <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">team has started introducing these common order types, used in conventional trading, on top of DeFi lending and borrowing protocols. They were previously best known for their automated liquidation protection options for protocols such as MakerDAO, Aave and Compound, but more recently they started introducing these trading-oriented features such as stop loss, take profit and trailing stop options for decentralized finance protocols on Ethereum. <\/span> <span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">DeFi lending protocols have often been used for shorting and longing crypto assets, for example, basically as soon as it was released, MakerDAO became a very popular option for longing ETH, completely non-custodially and fully on-chain. This would be done by users depositing their initial ETH and then using borrowed DAI to buy more ETH and thus increase their exposure and leverage (with DeFi Saver, this can be done in a single transaction, with its unique Boost and Repay features). Having automated, clear stops or limits on trades is essential for such high-risk positions. <\/span> <span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The initial automated strategies were developed for MakerDAO and Liquity protocol. Each automated strategy consists of a combination of triggers and actions that get executed once the trigger condition is fulfilled. To provide an instantaneous reaction to market movements, triggers rely on Chainlink for price feeds and on-chain historical market data, and on 0x for liquidity necessary to make the automated swaps upon position closing. These strategies work as one would expect in traditional trading environment:&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Stop Loss <\/span><\/b><span data-contrast=\"auto\" data-v-f87c67ca=\"\">- Fully closes a position once the collateral asset reaches a configured minimum target price. <\/span><b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Take Profit <\/span><\/b><span data-contrast=\"auto\" data-v-f87c67ca=\"\">- Fully closes a position once the collateral asset reaches a configured maximum target price. <\/span><b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Trailing Stop <\/span><\/b><span data-contrast=\"auto\" data-v-f87c67ca=\"\">- Fully closes a position once the collateral asset price drops by the configured percentage from its previous peak.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Making use of the new automated strategies&nbsp;<\/span><\/b><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Setting up automated strategies is straightforward for all existing MakerDAO and Liquity users. Once users connect their non-custodial wallet in the <\/span><a href=\"https:\/\/app.defisaver.com\/?mtm_campaign=theblock_3rd\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">DeFi Saver app <\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\">and navigate to the Automate tab in the dedicated protocol dashboards, they'll find the respective available automated strategies. Once enabled, the system will continuously monitor a position and send out the transaction to close it as soon as the trigger condition is met, meaning as soon as the price is hit.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559685&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">For Stop Loss or Take Profit, one only needs to select the threshold price below (or above) which they want the position to be closed and the asset to which to be closed (e.g., collateral asset or debt asset). In the case of <\/span><a href=\"https:\/\/blog.defisaver.com\/the-holy-grail-of-automated-trading-trailing-stop-now-available-for-makerdao-and-liquity\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Trailing Stop<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\">, the configuration requires inputting the percentage one would want the stop <\/span> <span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559685&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">price to be below the market peak and the asset to which to close the position. While Stop Loss and Take Profit are static strategies, Trailing Stop is a dynamic and slightly more advanced strategy. A trailing stop follows any upward market movement and each new price peak moves the stop price higher, but as the direction changes, it will close the position at a percentage-based level from the market peak instead of a specific set price. Using it, one can take advantage of the favorable market direction while having a stop that would minimize losses, and gradually lock in more profits as long as market doesn't move against their position. <\/span> <span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Making use of more than one strategy is possible for the same position. For example, Stop Loss can be combined with Take Profit to minimize the loss and lock in profit. On the other hand, a Trailing Stop is an excellent method for both but can also be combined with a static Stop Loss so one can even further minimize the potential losses in case of a market downturn. <\/span> <span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">With <\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">DeFi Saver <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">devoted to DeFi principles of providing trustless and non-custodial features, users remain in full ownership of their assets at all times. By enabling any of the provided automated strategies, the user is granting the system the permission to execute the needed transaction if and only if the user's configured trigger condition is fulfilled, with verification done fully on-chain, powered by the system’s smart contracts. <\/span> <span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The team is also very keen on providing these features on L2s where transaction fees can be many times lower. The next step for the team is to launch these automated strategies for Aave v3 on Arbitrum and Optimism, which are two L2 networks that <a href=\"https:\/\/defisaver.com\/?mtm_campaign=theblock_3rd\" data-v-f87c67ca=\"\">DeFi Saver<\/a> is actually already live on, with Aave v3 support and some of the older automation options available. The goal of the project has always been to be available and accessible to any users regardless of position size and the team is looking forward to providing more and more features within these growing L2 ecosystems. <\/span> <span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<a href=\"https:\/\/defisaver.com\/?mtm_campaign=theblock_3rd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">DeFi Saver <\/span><\/i><\/a><i data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">is an all-in-one dashboard for creating, managing and tracking your DeFi positions with automatic liquidation protection and leverage management options. So far, the application has saved thousands of users from liquidation and helped users handle over 115,000 transactions and over $7 billion in trade volume.<\/span><\/i>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by DeFi Saver <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$7 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}