{"summary":"A SushiSwap team&#x27;s governance proposal has suggested shifting DAO treasury assets to a new Sushi Labs vault.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286661\/sushiswap-governance-proposal-suggests-shifting-dao-treasury-assets-to-new-sushi-labs-vault","publishDate":"2024-04-05T10:26:07","id":9481,"type":null,"title":"SushiSwap governance proposal suggests shifting DAO treasury assets to new Sushi Labs vault","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">A SushiSwap governance proposal suggests transferring assets from the DAO-controlled treasury to a new one controlled by <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Sushi <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/256952\/sushi-sushi-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/512x512_Logo_no_chop.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">SUSHI<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -7.75%\n    <\/span><\/a> <!----><\/span><\/span> Labs, while also ensuring that all future airdrops are directed to the Sushi Labs vault.<\/span>","\"We request that Sushi DAO award a grant of 25 million Sushi tokens to Sushi Labs, including assets from the Arbitrum airdrop, business development, and partner grants, Kanpai 2.0, Sushi 2.0, rewards, stablecoins, and 'Sushi House' funds,\" the proposal by SushiSwap developer Jiro <a href=\"https:\/\/mirror.xyz\/%F0%9F%8D%A3%F0%9F%91%A8%E2%80%8D%F0%9F%8D%B3.eth\/7lW1niphhpmwURtR2Q7vI6955UhO1Bdv7R2EnwOqDbA\" data-v-f87c67ca=\"\">said<\/a>.","The proposal also stipulated that the new Sushi Labs entity would be the sole beneficiary of future airdrops awarded to Sushi by protocols and partners.","According to Jiro, this proposal aims to evolve Sushi by adopting a labs model, \"thereby restructuring the current organization to enhance operational efficiency and accelerate protocol development.\"","The developer added that the move is necessary because the current SushiSwap governance procedures \"require more flexibility to accelerate our development pace.\" Furthermore, the proposal intends to “empower Sushi Labs with exhaustive and sole operational responsibility for core product development.”","In general, for crypto, a lab conducts research and development to promote the protocol, while a DAO is a decentralized governance organization, and its decisions are generally not centralized.","SushiSwap 'Head Chef' Jared Grey told The Block that the proposal is part of a necessary restructuring of the governance model for both the benefit of Sushi holders and the DAO. \"The goal of our proposal is to optimize the relationship between the operations element and the DAO,\" he said. He added that the proposal offers a path forward for shipping products faster and ensuring operational continuity and DAO autonomy.&nbsp;","However, the proposal has been criticized in the form of X.com <a href=\"https:\/\/twitter.com\/BrutalTrade\/status\/1775591083432350088\" data-v-f87c67ca=\"\">posts<\/a> from individuals formerly associated with SushiSwap, who have questioned the transfer size from the DAO-controlled treasury to the Sushi Labs vault.","Voting on the <a href=\"https:\/\/snapshot.org\/#\/sushigov.eth\/proposal\/0x21aa6c89fd5e4111e6046cfc12cc7280f2be13f8452e61a0025454678d1ff9d0\" data-v-f87c67ca=\"\">proposal<\/a> will conclude on April 10th, and the current snapshot shows 68.46% against it, and 31.54% in favor.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"68.46%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"31.54%","content":"PERCENT"},{"type":"Kanpai","content":"PERSON"},{"type":"April 10th","content":"DATE"},{"type":"-7.75%","content":"PERCENT"},{"type":"Sushi Labs","content":"ORGANIZATION"},{"type":"Jiro","content":"PERSON"},{"type":"SushiSwap","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Jared Grey","content":"PERSON"},{"type":"Sushi House","content":"ORGANIZATION"},{"type":"X.com","content":"LOCATION"},{"type":"Sushi DAO","content":"ORGANIZATION"}],"hashtag":["DAOS","DEXS","GOVERNANCE VOTES","TOKENS"],"authors":["Brian McGleenon","The Block"]}