{"summary":"Cryptocurrency wallet application Abra has inked a deal with fintech unicorn Plaid that&#x27;ll allow customers across 1,000 banks to connect to its platform. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/22894\/abra-inks-deal-with-fintech-unicorn-plaid-to-add-support-for-thousands-of-banks","publishDate":"2019-05-10T17:00:14","id":9482,"type":null,"title":"Abra inks deal with fintech unicorn Plaid to add support for thousands of banks","category":["BITCOIN"],"content":["<span data-v-f87c67ca=\"\">Cryptocurrency wallet application <\/span><a href=\"https:\/\/www.abra.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Abra<\/span><\/a> has inked a deal with fintech unicorn Plaid that'll allow customers across 1,000 banks to connect to its platform.&nbsp;","Prior to the partnership, only dozens of banks were connected to Abra's platform, according to a news release. <span data-v-f87c67ca=\"\">Abra founder and CEO Bill Barhydt called the move a step towards further democratizing access to financial services in an <\/span><a href=\"https:\/\/www.abra.com\/blog\/making-money-easier\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announcement post<\/span><\/a><span data-v-f87c67ca=\"\"> on the company’s site. Abra offers synthetic trading of stocks and alternative cryptocurrencies.<\/span>","&nbsp;“The addition of these new liquidity enhancements in our app gives users more ways to move between crypto and fiat,\" Barhydt said. \"We’re particularly excited about our partnership with <span class=\"il\" data-v-f87c67ca=\"\">Plaid<\/span>, which brings thousands of additional financial institutions into the&nbsp;<span class=\"il\" data-v-f87c67ca=\"\">Abra<\/span>&nbsp;ecosystem for US customers.”","<span data-v-f87c67ca=\"\">At its core, the update will bring more liquidity to the platform, helping users move more seamlessly between their crypto and fiat currencies. Those cryptocurrencies were once limited to Bitcoin, Bitcoin Cash (BCH), Litecoin (LTC) and Ethereum (ETH), but Plaid integration has expanded Abra’s offerings of native withdrawal support to all 30 cryptocurrencies supported by the app. <\/span>","<span data-v-f87c67ca=\"\">The investment app launched earlier this year as a way to self-custody crypto assets. Abra said its next move is to enable users to make deposits directly into an Abra wallet, according to the press release.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fiat","content":"ORGANIZATION"},{"type":"BCH","content":"ORGANIZATION"},{"type":"Barhydt","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Bill Barhydt","content":"PERSON"},{"type":"LTC","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}