{"summary":"Coinbase is fighting back against the Securities and Exchange Commission, citing a high profile case as a reason to dismiss the agency’s case. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243262\/coinbase-cites-ripple-case-in-motion-to-dismiss-sec-lawsuit","publishDate":"2023-08-04T10:01:25","id":9489,"type":null,"title":"Coinbase cites Ripple case in motion to dismiss SEC lawsuit","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Coinbase is <a href=\"https:\/\/www.theblock.co\/post\/243128\/coinbase-plans-friday-filing-to-seek-dismissal-of-secs-case-in-its-entirety\" data-v-f87c67ca=\"\">fighting back<\/a> against the Securities and Exchange Commission, citing a high profile case as a reason to dismiss the agency’s case.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The crypto exchange cited the recent <a href=\"https:\/\/www.theblock.co\/post\/242381\/judge-slams-ripple-decision-in-secs-case-against-terraform-labs\" data-v-f87c67ca=\"\">Ripple Labs case<\/a> throughout a brief on Friday filed in the U.S. District Court for the Southern District of New York. Coinbase said the SEC’s effort to classify “a simple asset sale as a security is an unprecedented stretch,” and that a judge’s recent decision with Ripple bolsters their argument.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The SEC and Ripple have been embroiled in a legal fight since 2020, when the agency <\/span><span class=\"s3\" data-v-f87c67ca=\"\">accused Ripple of raising $1.3 billion in 2020 through the sale of XRP, which it says is an unregistered security.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Last month, a judge ruled that some of Ripple’s sales of XRP did not violate securities laws because of a blind bid process in place for them, so buyers did not know the sales benefited Ripple. The judge ruled that other direct sales of the token to institutional investors were securities.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“In this case, by contrast, the SEC has charged Coinbase based solely on blind, bid-ask, spot exchange transactions—the very sort of transactions the Ripple court recently held as a matter of law were not investment contracts because the undisputed facts showed no relevant relationship between the parties to the sale,” Coinbase said in the brief.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The judge’s decision in Ripple was seen as a win for the crypto industry, but a different judge slammed that decision in a <a href=\"https:\/\/www.theblock.co\/post\/242381\/judge-slams-ripple-decision-in-secs-case-against-terraform-labs\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">separate<\/span><\/a> case involving the SEC and Terraform Labs on Monday.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Coinbase also argued that the major questions doctrine, which has been cited a few times in the crypto industry, applied to its case against the SEC. The doctrine says that if an agency wants to decide on an issue that has major national significance, it has to be supported by clear congressional authorization.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The major questions doctrine has two parts — one focused on whether the subject has a major impact on the nation’s economy or on the public, and the second is whether a federal agency has explicit authority to implement new regulations.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Terraform’s lawyers also <a href=\"https:\/\/www.theblock.co\/post\/242381\/judge-slams-ripple-decision-in-secs-case-against-terraform-labs\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">cited<\/span><\/a> the major questions doctrine, though the judge rejected that argument, saying that the crypto industry falls short of bearing “vast economic and political significance.”&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“The major questions principle applies directly here,” Coinbase said on Friday. “The wholesale regulation of secondary markets for trading digital assets qualifies as ‘extraordinary,’ and the digital asset industry, worth around $1 trillion, is a ‘significant portion of the American economy.’”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“The SEC’s authority is clear as mud,” Coinbase added.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"$1.3 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"$1 trillion","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["COINBASE","SEC"],"authors":["Sarah Wynn","The Block"]}