{"summary":"Denmark&#x27;s Saxo Bank has been ordered to dispose of its own crypto holdings by the country&#x27;s financial regulator.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237806\/saxo-bank-crypto-danish-regulator","publishDate":"2023-07-05T08:49:00","id":9492,"type":null,"title":"Saxo Bank ordered to liquidate its crypto holdings by Danish regulator","category":["COMPANIES"],"content":["Denmark's Saxo Bank, which was designated as a systemically important financial institution last month, has been ordered to dispose of its own crypto holdings by the country's financial regulator.","The order comes because proprietary trading of crypto by banks isn't currently legal, the Danish Financial Supervisory Authority (FSA) <a href=\"https:\/\/www.finanstilsynet.dk\/Tilsyn\/Tilsynsreaktioner\/Paabud\/2023\/Saxo_bank_050723\" data-v-f87c67ca=\"\">said<\/a> Wednesday. \"Saxo Bank's trading with crypto assets for its own account has been done to hedge risks associated with the offering of other financial products. However, this does not change the fact that the activity itself is not allowed for Danish financial institutions...,\" the regulator said.","It went on to say that European Union's crypto regulation, known as markets in cryptoassets (<a href=\"https:\/\/www.theblock.co\/post\/227309\/mica-european-union-crypto-regulation-passes\" data-v-f87c67ca=\"\">MiCA<\/a>) regulation, only comes into effect from Dec. 30, 2024, and therefore Saxo Bank's proprietary trading is unregulated for the time being.","“We have held a very limited portfolio of cryptocurrencies, solely to hedge a very marginal proportion of risk associated with the facilitation of crypto assets,” a Saxo Bank spokesperson told The Block. “The vast majority of this exposure is mitigated through exchange-traded and cleared products. Therefore, the FSA’s decision will have a very limited impact on our business, and our client will not experience any significant changes.”","<a href=\"https:\/\/www.theblock.co\/post\/224565\/openeden-gemini-execs-tokenized-t-bill-vault\" data-v-f87c67ca=\"\">Saxo Bank<\/a> offers crypto trading to clients and also provides them access to crypto exchange-traded products. Its crypto trading service is offered via fiat pairs, including the U.S. dollar, euro and Japanese yen. Saxo does not allow funding or withdrawal in cryptocurrencies, according to its <a href=\"https:\/\/www.home.saxo\/products\/crypto\" data-v-f87c67ca=\"\">website<\/a>.","<em data-v-f87c67ca=\"\">Updates with comment from Saxo Bank spokesperson<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Danish Financial Supervisory Authority (FSA)","content":"ORGANIZATION"},{"type":"Dec. 30, 2024","content":"DATE"},{"type":"Saxo Bank spokesperson","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Saxo Bank","content":"ORGANIZATION"},{"type":"FSA","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Denmark","content":"LOCATION"},{"type":"euro","content":"ORGANIZATION"},{"type":"European Union","content":"ORGANIZATION"}],"hashtag":["EUROZONE REGULATION","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}