{"summary":"BlockFi has struck a $680 million deal with FTX.US, the firm announced Friday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155516\/blockfi-strikes-680-million-credit-deal-with-ftx-us-outlines-acquisition-path","publishDate":"2022-07-01T14:17:57","id":9499,"type":null,"title":"BlockFi strikes credit deal with FTX US, outlines acquisition path","category":["LENDING"],"content":["BlockFi, the crypto lending firm, announced on Friday a deal with exchange operator FTX US that would provide the firm with a $400 million revolving credit line and outlines the path to an acquisition by the US-based firm.&nbsp;","The definitive agreement, signed Thursday, is subject to shareholder approvals and would provide FTX an option to acquire the firm at a price up to $240 million.","\"This, together with other potential consideration, represents a total value of up to $680M,\" the firm said in an emailed statement.&nbsp;","BlockFi, similarly to other market participants in the crypto space, has been hit hard by the fall out of the liquidation of Three Arrows Capital and the liquidity struggles of rival lending firm Celsius, which paused withdrawals on customers earlier this month. Three Arrows Capital's liquidation event resulted in an $80 million loss for BlockFi, which the company described as a small fraction of losses reported by other lending firms.","BlockFi said that the firm has \"no further exposure and the limited losses we did experience will be absorbed by BlockFi.\"","To weather the storm, BlockFi inked a $250 million credit deal with FTX to manage through the crisis on June 22. The firm has also been fielding interest for acquisition from FTX and other market participants.&nbsp;","BlockFi said that the current deal with FTX will allow it to protect customer assets on the platform.&nbsp;","BlockFi's Zac Prince said in a <a href=\"https:\/\/twitter.com\/BlockFiZac\/status\/1542934038469640192\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">statement<\/a>.","\"We were presented with various unattractive options where client funds would take a haircut or be behind a lender in the capital stack. These alternatives were completely unacceptable to me, @FounderFlori and our Board and conflict with our core value of “Clients not Customers” as well as the interests of BlockFi and our shareholders.\"","\"Ultimately, we found a great partner in @FTX_US, who shares our commitment to clients. This represents the best path forward for all @BlockFi stakeholders and the crypto ecosystem as a whole,\" Prince went on to write.","<em data-v-f87c67ca=\"\">The headline of this story has been updated for clarity.&nbsp;<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"$80 million","content":"MONEY"},{"type":"$250 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Zac Prince","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$240 million","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"$680M","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$400 million","content":"MONEY"},{"type":"Board","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"June 22","content":"DATE"}],"hashtag":["BLOCKFI","FTX"],"authors":["Frank Chaparro","The Block"]}