{"summary":"Coinbase and Google Cloud’s cloud divisions, along with several other firms, have joined EigenLayer as operators after its mainnet launch.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287499\/google-cloud-coinbase-join-eigenlayer-as-operators","publishDate":"2024-04-10T04:50:51","id":95,"type":null,"title":"Google Cloud, Coinbase join EigenLayer as operators","category":["CRYPTO ECOSYSTEMS"],"content":["The cloud divisions at Coinbase and Google, among several other firms, have joined EigenLayer as operators shortly after the mainnet went live.","\"Coinbase Cloud is proud to be among the protocol’s first Operators, ready to serve as a trusted partner for your restaked ETH or LSTs,\" the firm <a href=\"https:\/\/twitter.com\/CoinbaseDev\/status\/1777825119290745241\" data-v-f87c67ca=\"\">noted<\/a>.","Meanwhile, Sam Padilla, a product manager at Google Cloud, <a href=\"https:\/\/twitter.com\/theSamPadilla\/status\/1777906586687513063\" data-v-f87c67ca=\"\">stated<\/a> that his team had been involved in Eigen’s testnet since November and has now implemented an <a href=\"https:\/\/app.eigenlayer.xyz\/operator\/0x00107cfdeaddc0a3160ed2f6fedd627f313e7b1a\" data-v-f87c67ca=\"\">operator node<\/a> on the mainnet.","This is not the first time Google Cloud has participated in running a node for a blockchain project. It already provides web3 infrastructure services, such as node hosting and the management of validator operations, for various blockchains on its platform, notably Ethereum, Solana, and Aptos.","Other firms joining EigenLayer as operators include <a href=\"https:\/\/app.eigenlayer.xyz\/operator\/0x696dfe30ec3d6398b5d1b9779841aa9a14faeb47\" data-v-f87c67ca=\"\">Deutsche Telekom MMS<\/a>, HashKey Cloud, P2P, Nethermind, Figment, Everstake, Kiln and AltLayer.","This development follows the <a href=\"https:\/\/www.theblock.co\/post\/287435\/eigenlayer-restaking-platform-and-eigenda-data-availability-layer-debut-on-ethereum-mainnet\" data-v-f87c67ca=\"\">mainnet rollout<\/a> of EigenLayer and its data availability layer EigenDA yesterday. The launch enables restakers to delegate their stake to their preferred operator and allows operators to decide whether to run an actively validated service on EigenLayer.","By participating in the EigenLayer protocol, operators provide services to other applications and process their transactions in exchange for rewards. This additional security layer is derived from the already staked ETH on the Ethereum network. For example, operators of the <a href=\"https:\/\/www.theblock.co\/post\/263473\/eigenlayer-to-enable-staking-with-operators-of-data-availability-layer-in-h1-2024\" data-v-f87c67ca=\"\">data availability solution<\/a> will enable Layer 2 scaling solutions — to incorporate it for their scaling needs.","EigenLayer operators allow Ethereum stakers to delegate their staked assets, whether native ETH or derivative tokens, to establish a <a href=\"https:\/\/www.theblock.co\/post\/273732\/eigenlayer-plans-shared-security-model-for-dapps\" data-v-f87c67ca=\"\">shared security model<\/a>. This delegation also enables stakers to engage in multiple blockchain applications while their ETH remains staked on the Ethereum network.","However, operators are not currently validating any services. EigenLayer <a href=\"https:\/\/www.blog.eigenlayer.xyz\/mainnet-launch-eigenlayer-eigenda\/\" data-v-f87c67ca=\"\">stated<\/a> that it is allowing the operator and AVS marketplace to develop and stabilize before introducing in-protocol payments and slashing to the mainnet later this year.","The total value locked in EigenLayer now exceeds $15 billion, according to <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/restaking\" data-v-f87c67ca=\"\">The Block's data dashboard<\/a>.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/restaking\/eigenlayer-daily-total-value-locked\/embed\" title=\"EigenLayer Daily Total Value Locked\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Eigen","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Everstake","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Deutsche Telekom MMS","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Aptos","content":"LOCATION"},{"type":"HashKey Cloud","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$15 billion","content":"MONEY"},{"type":"Nethermind","content":"LOCATION"},{"type":"AVS","content":"ORGANIZATION"},{"type":"Coinbase Cloud","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Sam Padilla","content":"PERSON"}],"hashtag":["VALIDATORS"],"authors":["Vishal Chawla","The Block"]}