{"summary":"Crypto token wrapper Ren only has funding up to the end of December following the collapse of Alameda Research.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188584\/funding-for-defi-protocol-ren-in-limbo-after-alameda-collapse","publishDate":"2022-11-19T08:59:12","id":9501,"type":null,"title":"Funding for DeFi protocol Ren in limbo after Alameda collapse","category":["CRYPTO ECOSYSTEMS"],"content":["Ren is in danger of not having enough funds for its development following the collapse of Alameda Research.","Ren is an Ethereum-based DeFi protocol that uses the token wrapping process to issue tokenized versions of crypto assets. These wrapped crypto tokens can then be <a href=\"https:\/\/www.theblock.co\/linked\/66533\/rens-new-network-bridges-ethereum-with-bitcoin-bitcoin-cash-and-zcash\" data-v-f87c67ca=\"\">bridged to the Ethereum<\/a> and BNB Smart Chains. Bridging in crypto is when tokens are sent from one network to another. The Ren protocol has processed more than $13 billion in cross-chain volume since its founding.","Alameda was funding Ren’s development after <a href=\"https:\/\/www.theblock.co\/linked\/93581\/alameda-research-acquihires-defi-project-ren-renbtc\" data-v-f87c67ca=\"\">acquihiring the project<\/a> in early 2021. The trading firm reportedly provided funding of $700,000 per quarter for developing the crypto wrapper and bridge protocol. Now, this funding source no longer exists as Alameda is bankrupt. The crypto quant trading firm <a href=\"https:\/\/www.theblock.co\/post\/187982\/ftx-bankruptcy-filings-highlight-complete-failure-of-corporate-controls\" data-v-f87c67ca=\"\">collapsed<\/a> together with FTX earlier in November.","The Ren team issued a <a href=\"https:\/\/medium.com\/renproject\/moving-on-from-alameda-da62a823ce93\" data-v-f87c67ca=\"\">statement<\/a> on Friday revealing that it only has enough funding until the end of Q4. A community <a href=\"https:\/\/www.youtube.com\/watch?v=EjHtiIGN5rI\" data-v-f87c67ca=\"\">call<\/a> hosted earlier in the week showed that the project’s remaining funds amount to about $160,000. Now, Ren is looking to secure funding from other sources. The team revealed on Friday that it was exploring various opportunities with community members. These options will likely be to put to a vote for the RenDAO community to decide upon.","Apart from securing new funding, the Ren team is also looking to introduce the latest version of the protocol, Ren 2.0. This new version was announced in August as a planned pivot to a community-run, open-source project. With Alameda reportedly owning the IP rights to Ren 1.0, the team says it is important to accelerate the transition to Ren 2.0. The accelerated onset of Ren 2.0, the team added, should eliminate concerns about Alameda’s involvement with the Ren protocol.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BNB Smart Chains","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"$160,000","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$700,000","content":"MONEY"},{"type":"$13 billion","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":["BANKRUPTCY FILINGS","DERIVATIVES"],"authors":["Osato Avan-Nomayo","The Block"]}