{"summary":"The TRON dataset has been added to Google Cloud&#x27;s expanding roster of public blockchain datasets available in BigQuery. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255567\/tron-added-to-google-clouds-bigquery-public-blockchain-datasets","publishDate":"2023-10-10T09:01:02","id":9508,"type":null,"title":"TRON added to Google Cloud’s BigQuery Public Blockchain Datasets","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">The <\/span><a href=\"https:\/\/trondao.org\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">TRON<\/span><\/a><span data-v-f87c67ca=\"\"> dataset has been added to <\/span><a href=\"https:\/\/cloud.google.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Google Cloud's<\/span><\/a><span data-v-f87c67ca=\"\"> expanding roster of public blockchain datasets available in BigQuery.&nbsp;<\/span>","<a href=\"https:\/\/cloud.google.com\/bigquery\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Google Cloud’s BigQuery<\/span><\/a><span data-v-f87c67ca=\"\"> is a fully-managed, serverless data warehouse that enables fast SQL queries using the processing power of Google’s infrastructure. It allows users to analyze large datasets in real-time by leveraging the power of Google Cloud’s infrastructure and machine learning capabilities. As part of its extensive suite of tools, BigQuery provides seamless integration with various data visualization tools and easy data importing from multiple sources. Over the years, this endeavor has consistently adapted to cater to the dynamic needs of the burgeoning Web3 community.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With the vast amount of data TRON processes, the recent inclusion of TRON into Google Cloud's BigQuery public datasets enables users to analyze on-chain transaction histories seamlessly. This deep dive allows for the assessment of TRON's token flows, smart contract interactions, and overall user engagement, all without the need for individual nodes or indexers.<\/span>","<span data-v-f87c67ca=\"\">Beyond the dataset expansion, Google Cloud is continually refining its offerings to cater to the needs of its users. Feedback-driven enhancements, such as increased numerical precision and the integration of <\/span><a href=\"https:\/\/cloud.google.com\/blockchain-analytics\/docs\/uint256\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">User Defined Functions<\/span><\/a><span data-v-f87c67ca=\"\"> (UDF) for better UNIT256, are ensuring the datasets remain accurate and relevant.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by TRON<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"BigQuery","content":"ORGANIZATION"},{"type":"TRON","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Google Cloud’s BigQuery","content":"ORGANIZATION"},{"type":"UDF","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}