{"summary":"Investment bank Jefferies estimates recovery of as much as 40% for FTX creditors, though that rate will likely drop once fees are taken into account.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195264\/jefferies-recovery-rate-ftx-creditors","publishDate":"2022-12-16T06:06:44","id":9510,"type":null,"title":"Jefferies sees recovery rate of up to 40% for FTX creditors: Exclusive","category":["BANKRUPTCY"],"content":["New York-based investment bank Jefferies Financial Group estimates FTX creditors could get as much as 40% of their money. However, that recovery rate would likely be lower once bankruptcy administrators have taken their fees.","Total liabilities at FTX appear to be between $10 billion and $13 billion against assets of $2 billion to $4 billion, Joseph Femenia, global head of distressed and special situations at the bank, said in an interview. That indicates a recovery rate of between 20% and 40%, said Femenia, who has assigned a five-person team to work on FTX full-time.","Those rates could easily change as new information about the FTX balance sheet becomes known.&nbsp;","Another factor in the level of payouts to users of FTX who have assets stuck on the platform will be the fees paid to lawyers and other administrators involved in the likely years-long bankruptcy process. Femenia's team expects those costs to be between $500 million to $1 billion, or around 5 and 10 cents on the dollar. That means the potential net recovery rate for FTX creditors could range from 10% to as high as 35%, according to Jefferies estimates.&nbsp;","A close comparison would be the wind-up of Bernie Madoff's Ponzi scheme. That process recovered more than $14.5 billion to date and <a href=\"https:\/\/www.bloomberg.com\/graphics\/2018-recovering-madoff-money\/?leadSource=uverify%20wall\" data-v-f87c67ca=\"\">cost<\/a> upwards of $1.6 billion — though, in that instance, the Securities Investor Protection Corporation paid the administration fees.&nbsp;","Some creditors prefer to sell their claims now, swallowing steep losses, rather than wait years to discover how much they might recover from the bankruptcy process.","Already, there is an active market in the trading of such claims. Jefferies is among firms that say they have closed on several transactions or are near closing. Distressed credit investor 507 Capital has bought several claims, paying between 5 and 6 cents on the dollar, Founder Thomas Braziel <a href=\"https:\/\/www.theblock.co\/post\/193560\/ftx-distressed-asset-investors\" data-v-f87c67ca=\"\">told<\/a> The Block last week. Another player buying claims is Luxembourg-based NOIA Capital, according to Chief Investment Officer Muhammed Yesilhark.","Such buyers have the patience to wait for payouts to be made years down the line and are banking that they can get more back than they paid for the claim.&nbsp;Sellers tend to be crypto hedge funds and other institutions with external shareholders and investors who want to close positions and offset the hit against taxes.","Contagion from the implosion of FTX has spread far and wide in the crypto world. FTX filed for bankruptcy protection on Nov. 11, leaving about one million creditors in the lurch. The exchange owes its top 50 creditors alone $3.1 billion, according to court filings.","Singapore-based crypto trader QCP Capital has at least $97 million with FTX and is <a href=\"https:\/\/www.theblock.co\/post\/194878\/qcp-capital-ftx-exposure\" data-v-f87c67ca=\"\">trying<\/a> to sell its claim. Other firms known to have assets on FTX include <a href=\"https:\/\/www.theblock.co\/post\/184766\/multicoin-capital-hit-by-ftx-collapse-with-10-of-its-funds-aum-stuck-on-the-exchange\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Multicoin Capital<\/a>,&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/188335\/genesis-block-hk-has-more-than-50-million-stuck-on-ftx-source\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Genesis Block HK<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/186306\/crypto-hedge-fund-galois-capital-says-half-of-funds-stuck-on-ftx-ft\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Galois Capital.<\/a>&nbsp;The impact on Genesis Block HK was so significant that the firm shut down its over-the-counter trading business last week after nearly 10 years.","NOIA Capital's Yesilhark said verifying a claim is the most challenging part since FTX has scrubbed its public-facing data.","''You will be surprised; people say we have this and that, but only the smartest have a screenshot of the last day of trading where they can show their assets…most of the guys are claiming to have money but can’t prove it,'' Yesilhark said. A screenshot alone is not enough. Buyers want to see audited financials and will also try to cross-check a firm's stated assets with other traders.","''Normally, in a bankruptcy case, you have a register of claims so you can check the claim. The tricky thing about FTX is there is no proof of claim right now,'' said Jefferies' Femenia. He asks sellers to prepare a diligence package showing historical assets' movement on the FTX platform.","Another concern when estimating potential returns is the concept of preference. During the Madoff wind-up, former investors who had withdrawn money well before the fraudster's fund blew up faced legal demands from the estate's trustee to pay back the money on the argument they held ill-gotten gains.&nbsp;","The same could happen with FTX. Claim buyers are trying to negotiate carve-outs, so they don't take on hidden liabilities. For example, a buyer of claims from a hedge fund that, in the run-up to FTX's collapse, was a net seller of assets might face a clawback demand from the administrator for some of that money.&nbsp;&nbsp;","Exemptions to preference exist if a firm can argue that the flow of funds off the platform was done in the ordinary course of business, Femenia explained. However, if you knew FTX was in trouble and started yanking money, he said you could face a clawback. That would impact those who pulled cash out of FTX in the days after questions were raised about the firm's finances and Binance made a short-lived bid to invest in the firm.&nbsp;","<em data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions. <\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$4 billion","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"$14.5 billion","content":"MONEY"},{"type":"Securities Investor Protection Corporation","content":"ORGANIZATION"},{"type":"NOIA Capital","content":"ORGANIZATION"},{"type":"Madoff","content":"PERSON"},{"type":"10 cents","content":"MONEY"},{"type":"40%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"Yesilhark","content":"PERSON"},{"type":"Jefferies Financial Group","content":"ORGANIZATION"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Nov. 11","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"$2 billion","content":"MONEY"},{"type":"Femenia","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"$1.6 billion","content":"MONEY"},{"type":"Joseph Femenia","content":"PERSON"},{"type":"Bernie Madoff","content":"PERSON"},{"type":"$10 billion","content":"MONEY"},{"type":"last day","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"6 cents","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"December 2022","content":"DATE"},{"type":"$97 million","content":"MONEY"},{"type":"Thomas Braziel","content":"PERSON"},{"type":"Jefferies","content":"ORGANIZATION"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"Galois Capital","content":"ORGANIZATION"},{"type":"$13 billion","content":"MONEY"},{"type":"Luxembourg","content":"LOCATION"}],"hashtag":[],"authors":["Benjamin Robertson","The Block"]}