{"summary":"Sepolia will be the second public testnet to deploy the upgrade, following testing on the Zhejiang testnet earlier this month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213921\/ethereum-developers-schedule-shanghai-upgrade-on-sepolia-testnet-for-feb-28","publishDate":"2023-02-22T06:47:15","id":9511,"type":null,"title":"Ethereum developers schedule Shanghai upgrade on Sepolia testnet for Feb. 28","category":["CRYPTO ECOSYSTEMS"],"content":["The core developers of the Ethereum blockchain scheduled the launch of the Shanghai-Capella upgrade on the Sepolia test network for Feb. 28 at epoch 56832, per an official <a href=\"https:\/\/blog.ethereum.org\/2023\/02\/21\/sepolia-shapella-announcement\" data-v-f87c67ca=\"\">announcement<\/a>.","Shanghai-Capella, also known as Shapella, is an upgrade aimed at enabling ether (ETH) withdrawals from network validators — a feature that wasn't enabled during the network's transition to proof-of-stake consensus, called <a href=\"https:\/\/www.theblock.co\/post\/166708\/the-merge-everything-you-need-to-know-about-ethereums-big-upgrade\" data-v-f87c67ca=\"\">The Merge<\/a>.","The upgrade combines changes to the execution layer (Shanghai) and the consensus layer (Capella). Shanghai will upgrade the execution layer of Ethereum, while Capella will upgrade the consensus layer of the blockchain.","To reach the final upgrade in March, developers have planned multiple phases of public testing. The upcoming launch on Sepolia is the second public testnet to deploy the upgrade. Shapella has already been tested on the Zhejiang testnet earlier this month. As expected, the testing on Zhejiang <a href=\"https:\/\/www.theblock.co\/post\/212636\/latest-round-of-ethereum-shapella-testnet-development-reveals-a-few-bugs\" data-v-f87c67ca=\"\">revealed<\/a> some minor bugs that have been worked on.","After deploying Shapella on the Sepolia testnet, developers will move to the Goerli testnet for the final phase of dress rehearsal ahead of the mainnet launch — expected to happen in March.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"earlier this month","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Capella","content":"LOCATION"},{"type":"Shapella","content":"LOCATION"},{"type":"Feb. 28","content":"DATE"},{"type":"Shanghai","content":"LOCATION"},{"type":"Zhejiang","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}