{"summary":"Yuga Labs&#x27; bitcoin NFT auction, the startup&#x27;s first, has concluded.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217460\/yuga-labs-bitcoin-nft-ordinals-auction","publishDate":"2023-03-06T18:21:11","id":9512,"type":null,"title":"Yuga Labs bitcoin NFT auction concludes amid complaints about its method","category":["COMPANIES"],"content":["Yuga Labs' experiment with Bitcoin Ordinals drew 288 winning bids, with one reaching nearly $160,000 for a single NFT.","The 24-hour auction of the collection, named TwelveFold, ended at around 3 p.m. PT. It marks Yuga Labs' <a href=\"https:\/\/www.theblock.co\/post\/215504\/yuga-labs-drops-bitcoin-based-nft-collection-twelvefold\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">first dalliance<\/a> with Bitcoin NFTs, having so far dominated the market on Ethereum with blockbuster collections Bored Ape Yacht Club and CryptoPunks.&nbsp;","The top bid was worth 7.1159 BTC, equal to roughly $159,600. The lowest was 2.2501, or about $50,400.&nbsp;","\"The TwelveFold auction has ended. Congratulations to the top 288 bidders - you will receive your inscription within one week,\" Yuga Labs tweeted. \"Valid bids that did not rank in the top 288 will have their bid amount returned to their receiving address within 24 hours.\"","Through this minting method, Bitcoin NFTs are inscribed onto satoshis on the Bitcoin blockchain. Inscriptions, also known as digital artifacts, are created when a file, such as an art image like those created for TwelveFold, is written (or inscribed into) units of Bitcoin called satoshis, the smallest individually identifiable units of Bitcoin.","The process is made possible through the&nbsp;<a href=\"https:\/\/docs.ordinals.com\/overview.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Ordinal Theory protocol<\/a>, with such NFTs simply donning the name \"Ordinals.\"","<a href=\"https:\/\/www.theblock.co\/post\/207086\/what-are-bitcoin-nfts-ordinals-and-how-do-they-work\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Ordinals<\/a> have gained popularity, given past upgrades to the Bitcoin blockchain that made it cheaper to store data in single transactions.","While Yuga will be celebrating another NFT sellout, some market watchers were perplexed at the format of the auction, which saw the company take custody of bidders' bitcoin.&nbsp;","\"Yuga is establishing REALLY bad precedence running an auction like this,\" wrote one Ordinal <a href=\"https:\/\/twitter.com\/veryordinally\/status\/1632568942374912001\" data-v-f87c67ca=\"\">technical fellow<\/a> on Twitter. \"They are taking custody of bidders’ bitcoin with a promise to send back unsuccessful bids. Not doubting they’ll do that, but this model is a scammer’s dream, and credible players need to set better example.\"","<a href=\"https:\/\/twitter.com\/CryptoEdgar_\/status\/1632660172605730817\" data-v-f87c67ca=\"\">Others<\/a> called it a \"dangerous precedent\" for a larger company in the space to set.&nbsp;&nbsp;","Yuga responded to these criticisms, saying it is excited that Ordinals managed to crack a permissionless method for on-chain NFTs on Bitcoin.","\"This space is incredibly nascent and TwelveFold was always meant to be an experiment,\" Yuga Labs co-founder Greg Solano wrote in an emailed statement to The Block. \"Many things we take for granted on Ethereum - like smart contracts, and trustless transactions - don’t exist yet on ordinals, where inscriptions trade over-the-counter on discord with bids tracked on Google spreadsheets and the existing marketplaces appear to be governed by multi-sig escrows.\"","The company is excited to see new tools for trustless auctions and marketplaces, Solano added, concluding that the hope is TwelveFold can attract the builders to contribute to that.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitcoin Ordinals","content":"PERSON"},{"type":"Bitcoin NFTs","content":"PERSON"},{"type":"$50,400","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"$160,000","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Solano","content":"PERSON"},{"type":"$159,600","content":"MONEY"},{"type":"3 p.m.","content":"TIME"},{"type":"Greg Solano","content":"PERSON"}],"hashtag":["BAYC","YUGA LABS"],"authors":["Lucy Harley-McKeown","The Block"]}