{"summary":"Cross-chain exchange Thorchain says the treasury will be used to repay the $5 million in funds that were stolen in an exploit.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/111660\/thorchain-suffers-5-million-exploit-developers-have-put-out-a-fix","publishDate":"2021-07-16T06:40:11","id":9513,"type":null,"title":"Thorchain suffers $5 million exploit, developers have put out a fix","category":["DEX"],"content":["Cross-chain exchange Thorchain suffered a $5 million exploit on Friday. Since the attack, developers have put out an emergency release to fix the bug and have promised the treasury will be used to make the liquidity providers whole.","The exploit was announced around 10:23 UTC, with initial reports estimating the size of the hack at around 13,000 ETH ($24 million), before this was revised to around 4,000 ETH ($7.4 million), and then later to around $4.9 million. The funds taken were in ether and Ethereum-based tokens.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">This is a disappointing moment for all, but LPs and Nodes should be unaffected after all is recovered (the funds will be restored),\" <a href=\"https:\/\/twitter.com\/THORChain\/status\/1415846497304801280\" data-v-f87c67ca=\"\">tweeted<\/a> the official Thorchain account.<\/span>","Thorchain is a protocol for swapping native assets, such as bitcoin and ether, between different blockchains but without wrapping them as tokens on other chains. Its \"chaosnet\" is effectively a cross-chain decentralized exchange. Thorchain is used by exchanges such as ShapeShift, which is going <a href=\"https:\/\/erikvoorhees.medium.com\/shapeshift-is-decentralizing-639bb4c82fc8\" data-v-f87c67ca=\"\">fully decentralized<\/a>.","When the attack was noticed, nodes running the network halted it, preventing the attack from getting worse. The <a href=\"https:\/\/twitter.com\/THORChain\/status\/1415887741850570753\" data-v-f87c67ca=\"\">threshold<\/a> to halt the network is a third of the 38 nodes running it.","Since the bug was found, Thorchain's developers have already put out a fix and are encouraging node operators to update their software.","After the exploit occured, YFI's Andre Cronje <a href=\"https:\/\/twitter.com\/AndreCronjeTech\/status\/1415909394643132417\" data-v-f87c67ca=\"\">tweeted<\/a>, \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Innovation leads to exploitation. Its why hardened protocols often stop innovating, very little upside to increase risk by innovating. Its why we also see more exploits in new developing sectors.<\/span>\"","The price of Thorchain's native token RUNE has since dropped 18%, falling to its current price of $4.77.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"$4.77","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"18%","content":"PERCENT"},{"type":"$7.4 million","content":"MONEY"},{"type":"YFI","content":"ORGANIZATION"},{"type":"$4.9 million","content":"MONEY"},{"type":"Andre Cronje","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"$24 million","content":"MONEY"},{"type":"Thorchain","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}