{"summary":"Circle says the benefits of native USDC include new support to eliminate bridge withdrawal delays and the possibility for institutional on and off-ramps","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232867\/circle-says-its-launching-usdc-natively-on-arbitrum","publishDate":"2023-06-01T09:57:10","id":9535,"type":null,"title":"Circle says it&#x27;s launching USDC natively on Arbitrum","category":["THE BLOCK"],"content":["Stablecoin issuer Circle said Thursday that it is launching USDC natively on Arbitrum, which will make it the official version in the Layer 2 ecosystem and replace liquidity that had been previously bridged.&nbsp;","The benefits of native USDC include new support to eliminate bridge withdrawal delays and the possibility for institutional on and off-ramps, Circle said in a <a href=\"https:\/\/twitter.com\/circle\/status\/1664256935976132610\" data-v-f87c67ca=\"\">thread<\/a> on Twitter. The official launch will happen on June 8.&nbsp;","The Ethereum-bridged version of USDC on block explorers will be renamed as \"USDC.e,\" Circle said.","\"Arbitrum Foundation will be working with ecosystem apps to provide a smooth transition of liquidity from bridged USDC to native USDC over time,\" Circle said. \"There will be no immediate changes to the Arbitrum Bridge &amp; it will continue to operate normally for bridging USDC to-&amp;-from Ethereum.\"","Circle plans to bring Cross-Chain Transfer Protocol to the Layer 2 network after the launch of native USDC, the Arbitrum Foundation said in a separate <a href=\"https:\/\/arbitrumfoundation.medium.com\/usdc-to-come-natively-to-arbitrum-f751a30e3d83\" data-v-f87c67ca=\"\">blog post<\/a>.&nbsp;","\"Upon integration into the Arbitrum Bridge, this will enable USDC to move natively to-and-from Ethereum (and other supported chains) in minutes — no more withdrawal delays,\" the foundation said.&nbsp;","Circle <a href=\"https:\/\/www.theblock.co\/post\/232217\/circle-launches-euro-backed-stablecoin-on-avalanche\" data-v-f87c67ca=\"\">last month<\/a> rolled out its Euro Coin stablecoin on the Avalanche network, making it the second blockchain to support the asset following the initial launch on Ethereum last year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"June 8","content":"DATE"},{"type":"\" Circle","content":"ORGANIZATION"},{"type":"Euro","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}