{"summary":"Cosmology, a Cosmos tech suite provider, has raised $5 million in a seed funding round led by Galileo and Lemniscap.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281020\/cosmology-seed-funding","publishDate":"2024-03-07T09:00:02","id":9538,"type":null,"title":"Cosmos development platform Cosmology raises $5 million in seed funding","category":["DEALS"],"content":["Cosmology, a development platform focused on the Cosmos ecosystem, has raised $5 million in seed funding.","The funding round was led by venture firms Galileo and Lemniscap — and saw participation from Dispersion, HashKey, Tuesday Capital, the Osmosis Foundation, Chorus One, and Informal Systems. The firm didn't disclose the valuation.","Cosmology provides a full-stack development environment, including developer tools for Tendermint, the Cosmos SDK, and the i<span data-v-f87c67ca=\"\">nter blockchain communication (IBC)<\/span> protocol. These tools, like Telescope and Cosmos Kit, aim to simplify the development process for applications on <a href=\"https:\/\/www.theblock.co\/learn\/249525\/what-is-cosmos-and-how-does-it-work-a-beginners-guide-to-atom-cryptocurrency\" data-v-f87c67ca=\"\">Cosmos<\/a>.","<span data-v-f87c67ca=\"\">Cosmos is an interoperability network whose ecosystem contains several chains. These chains can interact with one another using the IBC protocol via the <a href=\"https:\/\/www.theblock.co\/post\/273899\/cosmos-hub-inflation-reduction-proposal-rejection\" data-v-f87c67ca=\"\">Cosmos Hub<\/a>.<\/span>","The firm said its goal is to make dapp development accessible to all kinds of developers interested in Cosmos, reducing the need for deep expertise.","It further noted that hundreds of developers leverage Cosmology’s software to build DEXs, wallets, governance tooling, NFT platforms, lending, derivative trading platforms, and liquid staking protocols. These include Osmosis, Cosmostation, Stride, Juno, Celestia, dYdX, DaoDao, Stargaze, Leap Wallet, Persistence, Mars Protocol, Quicksilver, and others.","“Our mission is to empower a broad range of developers, driving innovation and the shift from Web2 to Web3,” said Dan Lynch, founder of Cosmology. “We achieve this by enabling builders to swiftly turn their ideas into launched applications, focusing on big-picture concepts rather than the low-level technical details of blockchain.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Mars Protocol","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Juno","content":"LOCATION"},{"type":"Persistence","content":"LOCATION"},{"type":"Dan Lynch","content":"PERSON"},{"type":"Cosmos SDK","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Stargaze","content":"LOCATION"},{"type":"IBC","content":"ORGANIZATION"},{"type":"Celestia","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Stride","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"Galileo","content":"ORGANIZATION"},{"type":"Cosmostation","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"}],"hashtag":["COSMOS","DEVELOPER TOOLS","SEED &AMP; PRE-SEED"],"authors":["Vishal Chawla","The Block"]}