{"summary":"Relative newcomer venture capital firm Big Brain Capital recently deployed millions of dollars in funding for a range of blockchain startups.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180624\/web3-is-ripe-for-radical-disruption-says-big-brain-capitals-kasey","publishDate":"2022-10-27T18:30:17","id":9540,"type":null,"title":"Web3 is ripe for radical disruption, says Big Brain Capital&#x27;s Kasey","category":["INVESTMENTS"],"content":["<span data-v-f87c67ca=\"\">Big Brain Capital recently deployed millions of dollars in funding for a range of blockchain startups.<\/span>","<span data-v-f87c67ca=\"\">Big Brain’s Kasey and Sam Kim talked about the firm’s targeted verticals, the potential it sees in the blockchain ecosystem, and what it hopes to see from regulators in an exclusive interview with The Block.<\/span>","Big Brain is rapidly gaining traction as one of the more active investment firms in the blockchain space, with more than $60 million deployed in more than 200 projects. All of this since last year, when early-stage investors and SolBigBrain started providing backing for protocols such as NEAR and Solana.","The firm is among the few to grow during the third quarter's market tumult and has emerged as one of crypto's top 10 most active investors.","","","In quarterly figures among top crypto investment firms, Big Brain is one of several companies to show an upward trajectory of investment trends, joined by FTX, Kucoin Ventures, and Hashkey Capital.","","","In addition, The Block Research showed Big Brain as one of the top 10 most active investors this year measured by deals, tied with Spartan and trailing closely behind Jump and Polygon Studios. Coinbase led in overall deals closed.","Big Brain team members Kasey, who goes by one name, and Sam Kim provided insight into where the venture capital firm anticipates potential growth in the crypto industry and what they hope to see from regulators.","In terms of growth, the web3 space is still ripe for continuous and radical disruption, Kasey said.","“Many of the projects and technologies that were built in prior cycles have brought us to where we are today, but it’ll be new ideas and advancements in all layers of the technology stack that will lead the industry towards mass adoption,” Kasey said.","Acting on the foreseen potential in these industries, Crunchbase records <a href=\"https:\/\/www.crunchbase.com\/organization\/big-brain-holdings\/recent_investments\" data-v-f87c67ca=\"\">showed<\/a> that Big Brain deployed at least $31.9 million in seed and Series A funding rounds during September alone. The money went to startups focused on the NFT space, including Minteo, Sintra, Exchange Art, Dust Labs, B+J Studios, as well as the Algorand blockchain-facing DeFi platform Ultra. More recently, the firm also <a href=\"https:\/\/twitter.com\/bigbrainvc\/status\/1576952565123543040?s=20&amp;t=XNWAXKXQ49jOyFMtAt5OBA\" data-v-f87c67ca=\"\">invested<\/a> in the lifestyle exercise app SNKRZ, as well as Mysten Labs' proof-of-stake blockchain, <a href=\"https:\/\/twitter.com\/EvanWeb3\/status\/1567934646733918211?s=20&amp;t=Lqqd6pcY-WbTD7cHanLKDQ\" data-v-f87c67ca=\"\">SUI<\/a>.","“We anticipate that some of the most interesting and greatest upside potential exists in the application stack with gaming and social networks likely to be the first to reach 100 million active users within web3,” said Kim.","Among the most active investors in the space, Big Brain has a vested interest in the outcome of ongoing regulatory debates over crypto-asset definitions, jurisdictions, and general guidance.","“We’d like to see clarity from regulators and remove the risk that hangs over the heads of all the builders in the space as a result of ambiguity,” Kim said.","In terms of welcome regulatory progress, Kasey pointed to Wyoming where there has been some progress on the establishment of legal structures for DAOs.","“That progress will empower people to organize and financialize initiatives in completely new ways whilst having certainty about tax jurisdictions and enable them to confidently transact with real-world counterparts,” Kasey said.","As Big Brain led a seed round for Magpie Protocol, a cross-chain liquidity aggregation bridge, it may make sense that the firm is also focused on the outcome of stipulatory guidance for digital assets related to DeFi-based infrastructures.","“We need similar regulation that can empower founders in the areas of DeFi, tokens and NFTs. We hope that regulation is founded with a clear understanding of the basis for blockchain technology, and that it doesn’t restrict innovation using old frameworks and laws created with analog technologies in mind,” Kim said.","Although Big Brain predominately supports Solana-based early-stage projects, it has also deployed capital to startups in ecosystems including Cosmos, Polygon, Avalanche, ZK, Arweave, and StarkNet.","“We have been investing in teams that are pushing boundaries in a broad range of areas including web3 gaming, DeFi and solving imminent issues arising from Ethereum’s PoS transition,” said Kasey.","“We want to build on our deep network and experience to not only continue to invest in the best and most impactful founders, but to help push the space forward. We’re always open to meeting with and supporting founders, even if it doesn’t lead to an investment,” Kim said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Magpie Protocol","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Kim","content":"PERSON"},{"type":"Hashkey Capital","content":"ORGANIZATION"},{"type":"Wyoming","content":"LOCATION"},{"type":"Arweave","content":"LOCATION"},{"type":"Sam Kim","content":"PERSON"},{"type":"Sintra","content":"LOCATION"},{"type":"SUI","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Big Brain","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Kucoin Ventures","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$60 million","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"Kasey","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"third quarter","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"$31.9 million","content":"MONEY"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}