{"summary":"As 2023 draws to a close, top 5 cryptocurrency exchange Phemex stands triumphant, having fulfilled its promise to empower its community through the establishment of their groundbreaking Web 3.0 ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266986\/2023-year-of-phemex-and-their-growing-community","publishDate":"2023-12-12T09:01:15","id":9544,"type":null,"title":"2023, Year of Phemex and Their Growing Community","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">As 2023 draws to a close, top 5 cryptocurrency exchange <\/span><a href=\"https:\/\/phemex.com\/register?group=4469&amp;referralCode=FW6SF5\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Phemex <\/span><\/a><span data-v-f87c67ca=\"\">stands triumphant, having fulfilled its promise to empower its community through the establishment of their groundbreaking Web 3.0 ecosystem. In a transformative move from a centralized exchange (CEX) to a semi-centralized one, Phemex not only revamped its own structure but also set the stage for a paradigm shift within the broader landscape of cryptocurrency exchanges.<\/span>","<span data-v-f87c67ca=\"\">At the dawn of the year, Phemex unveiled its ambitious plan to launch its own Web 3.0 ecosystem of <\/span><a href=\"https:\/\/phemex.com\/web3\/phemexia?group=4469&amp;referralCode=FW6SF5\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Phemexia<\/span><\/a><span data-v-f87c67ca=\"\">, a venture aimed at seamlessly blending decentralized decision-making with the efficiency of centralized systems. This innovative approach sought to create a hybrid trading model, allowing users to enjoy increased autonomy without compromising on reliability and security.<\/span>","<span data-v-f87c67ca=\"\">Central to the Phemexia ecosystem was the introduction of the novel concept of a soulbound token called the<\/span><a href=\"https:\/\/phemex.com\/web3\/soulpass?group=4469&amp;referralCode=FW6SF5\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> Phemex Soul Pass<\/span><\/a><span data-v-f87c67ca=\"\"> (PSP). Users minted their PSP to establish their identity on the platform, and Phemex committed to rewarding them based on their activity, authentically recorded on the PSP. The community eagerly participated in the xPT pre-mining event, minting their PSPs and securing the upcoming Phemex Token early.<\/span>","<span data-v-f87c67ca=\"\">The Phemexia community flourished, boasting over 21,000 PSP holders within a short timeframe. To sustain this momentum, Phemex initiated campaigns such as <\/span><a href=\"https:\/\/phemex.com\/web3\/airdrops\/1000btc?group=4469&amp;referralCode=FW6SF5\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">1000BTC<\/span><\/a><span data-v-f87c67ca=\"\"> and 100ETH, ensuring that early adopters reaped the rewards of the platform's expansion.<\/span>","<span data-v-f87c67ca=\"\">Demonstrating their commitment to community growth, Phemex chose to burn the fifth stage of xPT pre-mining and channeled all generated funds into the treasury. This action underscored Phemex's dedication to the sustainable development of the Web 3.0 ecosystem and the establishment of a robust foundation for the future.<\/span>","<span data-v-f87c67ca=\"\">As the only cryptocurrency exchange among the top 15 without a platform token, Phemex garnered significant interest and excitement around<\/span><a href=\"https:\/\/phemex.com\/web3\/pt-benefits\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> Phemex Token.<\/span><\/a><span data-v-f87c67ca=\"\"> Functioning as an on-chain ERC-20 token, PT promised a myriad of benefits within the Phemexia ecosystem, including staking yields, trader bounty rewards, and governance within the Phemex DAO. On November 30th, the much-anticipated launch of Phemex Token took place, creating immense buzz as it became a trending topic and received overwhelming support from the crypto space.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Phemex further introduced <\/span><a href=\"https:\/\/phemex.com\/web3\/stake\/dashboard?group=4469&amp;referralCode=FW6SF5\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">PT staking<\/span><\/a><span data-v-f87c67ca=\"\">, which saw the platform sharing 0.01% of daily USDT contract revenue with its fervent community. Staking empowers community members to share in Phemex's revenue and receive benefits from the platform's overall growth. Currently over 40 million PT have been staked with an APR up to 2000%. This not only reflects the community’s strong support for PT, but also underscores Phemex’s dedication to giving back. The staking initiative further rewards token holders with vePT, to grant them governance authority through PhemexDAO over the platform's operations, growth, partnerships, and treasury in the coming months.<\/span>","","","<span data-v-f87c67ca=\"\">Additionally, Phemex has catered the unique needs of different traders throughout the year through its various programs such as<\/span><a href=\"https:\/\/phemex.com\/vip\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> VIP<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/phemex.com\/institutional-clients\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Institutional<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/phemex.com\/announcements\/phemex-market-maker-program-is-here-calling-all-liquidity-providers\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Market Maker<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/phemex.com\/broker\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Broker<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/phemex.com\/vi\/all-star-program\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Collaborator<\/span><\/a><span data-v-f87c67ca=\"\">. Winning in trading was truly a breeze with Phemex in 2023.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">After a transformative year, what can traders anticipate from Phemex in 2024? Notably, their Web 3.0 ecosystem will introduce new features to offer true decentralized management to its members.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the early months of 2024, Phemex is set to unveil its social trading feature, PhemexPulse. This innovative platform allows influencers to create groups, attracting followers with high-quality content and valuable trading insights. The prize pool for PhemexPulse stands at an impressive 50 million PT, with rewards accessible to both KOLs and their members through active interaction, group contributions, and trading activities. The beta version of this upcoming feature is already live, and eager users can contact Phemex to be among the first to experience it.<\/span>","<span data-v-f87c67ca=\"\">Recognizing the pivotal role of community in the crypto space, Phemex is committed to delivering a thriving platform that fosters a dynamic community, seamlessly integrated with its Web 3.0 ecosystem, ensuring ongoing empowerment through increased engagement and rewards.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Phemex<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Phemex","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"2000%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"PSP","content":"ORGANIZATION"},{"type":"early months of 2024","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"0.01%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Phemex DAO","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Phemex Token","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"November 30th","content":"DATE"},{"type":"Phemex Soul Pass<\/span><\/a><span data-v-f87c67ca=\"\"> (PSP","content":"ORGANIZATION"},{"type":"Phemexia","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}