{"summary":"The move comes just weeks after a punishing earnings report which showed losses for the year topping $9.4 billion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184675\/meta-to-cut-11000-jobs-metaverse-vision","publishDate":"2022-11-09T07:01:49","id":9546,"type":null,"title":"Meta to cut 11,000 jobs as Zuckerberg commits to &#x27;long-term&#x27; metaverse vision","category":["COMPANIES"],"content":["Meta CEO Mark Zuckerberg said the social media giant has decided to cut more than 11,000 jobs, or about 13% of the workforce, while maintaining its \"long-term vision for the metaverse.\"","The layoffs are part of a drive to cut losses, just weeks after a punishing earnings report which showed a deficit for the year for its metaverse division topping <a href=\"https:\/\/www.theblock.co\/post\/180126\/metas-metaverse-losses-top-9-4-billion-for-the-year\" data-v-f87c67ca=\"\">$9.4 billion<\/a>. In a <a href=\"https:\/\/about.fb.com\/news\/2022\/11\/mark-zuckerberg-layoff-message-to-employees\/\" data-v-f87c67ca=\"\">letter<\/a> to employees, Zuckerberg also said the social media company will cut spending and extend its hiring freeze into the next year.&nbsp;","Zuckerberg blamed a macroeconomic downturn and losses in e-commerce which \"caused our revenue to be much lower than I'd expected.\" He said that to mitigate this, the company has shifted resources to a smaller number of high priority growth areas including its AI discovery engine, its ads platform and its push into the metaverse.","Meta has already removed access to systems for employees that have been let go but will keep email addresses active throughout the day \"so everyone can say farewell.\"","\"I want to take accountability for these decisions and for how we got here,\" he wrote. \"I know this is tough for everyone, and I'm especially sorry to those impacted.\"","The reduction in headcount is perhaps the largest round of layoffs in Meta’s nearly two-decade existence.","","","Meta is not the only big tech firm to report broad layoffs in recent weeks. Twitter's new CEO Elon Musk announced that he would move to cut staff following his takeover. Other firms focused on the metaverse including&nbsp;Bitmex, Dapper Labs and Mythical Games have also<a href=\"https:\/\/www.theblock.co\/post\/183588\/meta-prepares-to-layoff-thousands-of-employees-this-week-wsj\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">&nbsp;laid off staff<\/a>&nbsp;this month.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"$9.4 billion","content":"MONEY"},{"type":"13%","content":"PERCENT"},{"type":"Zuckerberg","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Mark Zuckerberg","content":"PERSON"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}