{"summary":"Coinbase UK CEO Daniel Seifert says the upcoming crypto ETNs are a validation for the UK and its strategy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282938\/us-bitcoin-etfs-are-a-monumental-milestone-says-coinbase-uk-ceo-while-etns-in-the-uk-are-a-positive-step","publishDate":"2024-03-16T06:54:20","id":9548,"type":null,"title":"US Bitcoin ETFs are a ‘monumental milestone’ says Coinbase UK CEO, while ETNs in the UK are a ‘positive step’","category":["MARKETS"],"content":["The upcoming availability of crypto exchange-traded notes is a positive step forward for the UK, according to Coinbase UK CEO Daniel Seifert.","Seifert said that he discussed crypto ETNs with the UK’s Economic Secretary to the Treasury Bim Afolami, who spoke at a recent <a href=\"https:\/\/www.theblock.co\/post\/278116\/uk-seeks-new-stablecoin-rules\" data-v-f87c67ca=\"\">Coinbase event<\/a>. At the time, Seifert said how they would be helpful for the industry and for the UK as a crypto hub.&nbsp;","Now the UK's markets regulator, the Financial Conduct Authority, has said they can <a href=\"https:\/\/www.fca.org.uk\/news\/statements\/fca-updates-position-cryptoasset-exchange-traded-notes-professional-investors\" data-v-f87c67ca=\"\">go ahead<\/a>, but only for institutional investors.","“We think it's a validation for the United Kingdom, and for its strategy. And I think the future is bright,” Seifert told The Block in an interview.","As for the launch of bitcoin ETFs in the U.S., Seifert was even more enthusiastic.","&nbsp;“The fact that ETFs were launched in the United States and that that generated so much momentum and so much buzz globally, I think it's a monumental milestone for the cryptocurrency industry as a whole,” he said.","Seifert noted that the bitcoin ETFs have resulted in an injection of institutional capital as there is a new way for traditional investors to get into the crypto ecosystem. He said he anticipates this continuing as more products may be on the way and since asset managers like BlackRock and Fidelity are now speaking to their customer base about the bitcoin ETFs.","When asked whether he would want to see bitcoin ETFs available in the UK, Seifert replied, “I would say more choice for consumers is always good.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Daniel Seifert","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Bim Afolami","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Coinbase UK","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Seifert","content":"PERSON"},{"type":"UK’s Economic Secretary","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"United Kingdom","content":"LOCATION"}],"hashtag":["COINBASE","SPOT BITCOIN ETF"],"authors":["Tim Copeland","The Block"]}