{"summary":"Two committees will vote tomorrow on amendments that take aim at so-called unhosted wallets, potentially blocking EU-based crypto exchanges and service providers from interacting with those whose beneficial owners they cannot identify.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139913\/eu-parliament-aml-law-vote-crypto-wallets","publishDate":"2022-03-30T16:54:20","id":9551,"type":null,"title":"The European Parliament is rushing a vote on a new AML law. Here&#x27;s what they&#x27;ll be voting on","category":["POLICY"],"content":["The European Parliament will hold key votes on the new Transfer of Funds Regulation on March 31.","The final draft of the bill was completed late on March 28, only going out to the Members of European Parliament ion the ECON and LIBE committees the morning of March 29, according to sources familiar with the matter.","Those committees are scheduled to vote on final amendments and the final draft tomorrow, MEP Stefan Berger’s office confirmed to The Block. The regulation, if it passes, will either go to a plenary vote that includes the whole of Parliament or potentially move directly to trilogues, or debates including the European Commission and European Council.","The new bill just after the EU's proposed Markets in Crypto Assets regulatory framework left <a href=\"https:\/\/www.theblockcrypto.com\/post\/139404\/what-now-for-europes-landmark-crypto-regulatory-overhaul\" data-v-f87c67ca=\"\">Parliament for its own round of trilogues<\/a>.","See below for a version of the bill dated March 28, which the European Parliament has not yet made public.","Over the weekend, members of the crypto community caused a stir in advance of the coming vote as an earlier draft leaked. The offending provision has, largely unedited, survived to the present draft:","<em data-v-f87c67ca=\"\">Source: Draft shared with The Block<\/em>","The new rule would require that users of “providers of crypto-asset transfers” — typically, crypto exchanges — report the identity of the beneficial owner of unhosted wallets to crypto exchanges from which they are transferring funds.","More striking is that the rule would require those exchanges facilitating those transfers to verify that identifying information.","Berger, a member of the center-right European People’s Party, or EPP, took to <a href=\"https:\/\/twitter.com\/DrStefanBerger\/status\/1508843685294837766\" data-v-f87c67ca=\"\">Twitter<\/a> to criticize the opposition, saying: “The attack of Paul Tang, Aurore Lalucq and S&amp;D [Socialists and Democrats] on unhosted wallets is disproportionate and bad for the DeFi Sector.”","Tang, for his part, today criticized the crypto industry as irresponsible and noted its heightened campaigning:","The <a href=\"https:\/\/twitter.com\/hashtag\/crypto?src=hash&amp;ref_src=twsrc%5Etfw\" data-v-f87c67ca=\"\">#crypto<\/a> sector demands to be taken seriously yet they refuse to take seriously their role in the fight against criminal money. Their aggressive campaigning only shows that strong regulation is urgently needed<a href=\"https:\/\/twitter.com\/hashtag\/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\" data-v-f87c67ca=\"\">#Bitcoin<\/a> <a href=\"https:\/\/t.co\/9mef15aNP5\" data-v-f87c67ca=\"\">https:\/\/t.co\/9mef15aNP5<\/a>","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","In European Parliament, the EPP outnumbers the S&amp;P, the second-largest, but both depend on coalitions with other parties to achieve majority votes. So while the amendments in play face a vote tomorrow, it remains unsettled what will result.","While MiCA, for example, saw the EPP’s coalition <a href=\"https:\/\/www.theblockcrypto.com\/post\/135459\/european-parliament-delays-vote-on-crypto-assets-bill-over-proof-of-work-debate\" data-v-f87c67ca=\"\">break up the alliance<\/a> between the Greens and the S&amp;P, that took place over a longer time period.","As came up with MiCA, the version of this legislation that passes will only form the basis of further negotiations with other branches of Europe’s government, not become law itself. However, this law is facing a significantly truncated process. One source involved tells The Block that committee members did not even get versions of the bill translated into their native languages.","The process leaves many in the crypto industry discontent.&nbsp;","\"The preoccupation with self-hosted wallets in the TFR suggests Parliament is aiming at the wrong target, but there has been precious little time for the crypto community in Europe to explain why,\" Seth Hertlein, who leads policy for French crypto wallet maker Ledger, told The Block. \"The crypto community deserves more than one week to engage with policymakers on such an important topic.\"","The regulation defines an “unhosted wallet” as “a crypto-asset wallet address that is not held or managed by a provider of crypto-asset transfers.”","This is indeed the original means of transacting with cryptocurrencies. It is when a crypto user controls their own private keys. For this reason, the industry generally uses the term “self-hosted.” The term has emerged under increasing scrutiny of cryptocurrencies for anti-money laundering vulnerabilities, particularly by the Financial Action Task Force.","Given that anyone can generate a new wallet address within minutes, verification of every potential self-hosted wallet is impracticable. A system-wide application of this rule threatens to block EU-based exchanges and crypto services from interacting with self-hosted wallets writ large.","Transactions under 1,000 euros in value that meet certain other provisions are exempt from this reporting requirement if the EU state hosting the payment chose, but amendments that aimed to clarify crypto service providers as subject to those provisions did not make it into the final draft.","&nbsp;&nbsp; <a title=\"View 20220328 Final Compromises TFR Articles V6 on Scribd\" href=\"https:\/\/www.scribd.com\/document\/567308064\/20220328-Final-Compromises-TFR-Articles-V6#from_embed\" data-v-f87c67ca=\"\">20220328 Final Compromises TFR Articles V6<\/a> by <a title=\"View Mike McSweeney's profile on Scribd\" href=\"https:\/\/www.scribd.com\/user\/510415454\/Mike-McSweeney#from_embed\" data-v-f87c67ca=\"\">Mike McSweeney<\/a> on Scribd","<iframe frameborder=\"0\" height=\"600\" src=\"https:\/\/www.scribd.com\/embeds\/567308064\/content?start_page=1&amp;view_mode=scroll&amp;access_key=key-1vhQHJau4xCHuyOnHpFl\" title=\"20220328 Final Compromises TFR Articles V6\" width=\"100%\" data-auto-height=\"false\" data-aspect-ratio=\"0.75\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"weekend","content":"DATE"},{"type":"March 29","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"March 28","content":"DATE"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Members of European Parliament","content":"ORGANIZATION"},{"type":"the Financial Action Task Force","content":"ORGANIZATION"},{"type":"TFR","content":"ORGANIZATION"},{"type":"European Council","content":"ORGANIZATION"},{"type":"MiCA","content":"PERSON"},{"type":"Mike McSweeney","content":"PERSON"},{"type":"European Parliament","content":"ORGANIZATION"},{"type":"Final Compromises TFR","content":"ORGANIZATION"},{"type":"EPP","content":"ORGANIZATION"},{"type":"Aurore Lalucq","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Stefan Berger","content":"PERSON"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"Berger","content":"PERSON"},{"type":"March 31","content":"DATE"},{"type":"Paul Tang","content":"PERSON"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"European People’s Party","content":"ORGANIZATION"},{"type":"Seth Hertlein","content":"PERSON"}],"hashtag":["EUROPEAN PARLIAMENT"],"authors":["Kollen Post","The Block"]}