{"summary":"Circle is making it easier for developers to add user-friendly web3 wallets onto their platforms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238139\/circle-quietly-launches-wallet-as-a-service-developer-platform","publishDate":"2023-07-06T11:24:27","id":9552,"type":null,"title":"Circle quietly launches wallet-as-a-service developer platform","category":["COMPANIES"],"content":["Circle, the issuer of the USDC stablecoin USDC, launched a wallet-as-a-service platform for developers.&nbsp;","The <a href=\"https:\/\/www.circle.com\/en\/programmable-wallets\" data-v-f87c67ca=\"\">service<\/a> allows developers to embed web3 wallets in their apps, while offering a user-friendly design. The wallets can be used with any blockchain to give users easier access to NFTs, cryptocurrencies and other web3 digital assets.&nbsp;","\"If you are on the more technical side, you can self-serve into the platform and launch apps starting now,\" Circle CEO Jeremy Allaire said on Twitter.","Currently, users must self-custody their private keys, but forthcoming updates will allow for developers to have control over user private keys. The company's wallet-as-a-service developer platform is currently in beta testing.&nbsp;","Circle's USDC maintains the second-largest stablecoin supply behind Tether, according to The Block's Data Dashboard.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Allaire","content":"PERSON"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"USDC stablecoin USDC","content":"ORGANIZATION"}],"hashtag":["WALLET MAKERS"],"authors":["MK Manoylov","The Block"]}