{"summary":"Maersk and IBM are shutting down their blockchain-enable supply chain project.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190782\/maersk-ibm-shutting-down-blockchain-enabled-supply-chain-project","publishDate":"2022-11-29T17:52:43","id":9555,"type":null,"title":"Maersk, IBM shutting down blockchain-enabled supply chain project","category":["COMPANIES"],"content":["Danish shipping company Maersk and IBM are withdrawing their blockchain-enabled supply chain offering, TradeLens, and <a href=\"https:\/\/www.maersk.com\/news\/articles\/2022\/11\/29\/maersk-and-ibm-to-discontinue-tradelens\" data-v-f87c67ca=\"\">discontinuing<\/a> the platform.","<span data-v-f87c67ca=\"\">TradeLens was founded on the \"bold vision to make a leap in global supply chain digitization as an open and neutral industry platform,\" said Rotem Hershko, head of business platforms at Maersk.<\/span>","<span data-v-f87c67ca=\"\">Unfortunately, thought the platform was viable, the need for full global industry collaboration failed. As a result, TradeLens has not reached the level of commercial viability necessary to continue work and meet the financial expectations as an independent business, Hershko said.<\/span>","Several large companies have moved to enable blockchain-based supply chains to ensure further transparency in the process.","The platform will go offline by end of the first quarter.","Maersk will continue its efforts to digitize the supply chain and increase industry innovation through other solutions to reduce trade friction and promote more global trade.","The TradeLens platform was announced in 2018 and jointly developed by IBM and GTD Solution, a division of Maersk, as a blockchain-enabled shipping solution designed to promote more efficient and secure global trade.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"end of the first quarter","content":"DATE"},{"type":"IBM","content":"ORGANIZATION"},{"type":"Maersk","content":"ORGANIZATION"},{"type":"TradeLens","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Hershko","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Rotem Hershko","content":"PERSON"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}