{"summary":"The prosecution has been able to poke holes in Bankman-Fried’s line of defense that he did not understand how bad things were at FTX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260277\/inside-the-trial-prosecution-scores-more-points-on-last-day-of-sbfs-testimony","publishDate":"2023-10-31T16:27:28","id":9556,"type":null,"title":"Inside the trial: Prosecution scores more points on last day of SBF&#x27;s testimony","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Sam Bankman-Fried, the former CEO of the bankrupt crypto exchange FTX, finished testimony at his <a href=\"https:\/\/www.theblock.co\/tag\/sbf-trial\" data-v-f87c67ca=\"\">criminal trial<\/a> on Tuesday, as both sides prepare for closing arguments scheduled to start tomorrow.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Over its cross examination of the former billionaire, the prosecution has been able to poke holes in Bankman-Fried's line of defense that he did not understand how bad things were at FTX and sister trading firm Alameda Research until the very last moment.<\/span>","<span data-v-f87c67ca=\"\">U.S. assistant attorney Danielle Sassoon pressed Bankman-Fried about events in June 2022, months before the bankruptcy. The moment is important because that's when former FTX executives cooperating with the government say the $8 billion hole in Alameda's balance sheet was first discovered.<\/span>","<span data-v-f87c67ca=\"\">According to the recollections of former FTX head of engineering Nishad Singh and developer Adam Yedidia, they both talked to Bankman-Fried about the massive negative balance at Alameda, which was essentially money borrowed from FTX customers and never returned.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried, in turn, <\/span><a href=\"https:\/\/www.theblock.co\/post\/259893\/sbf-paints-alternative-view-of-his-knowledge-of-the-fiat-account-in-court\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">testified<\/span><\/a><span data-v-f87c67ca=\"\"> on Monday that even though he was told about the so-called \"<a href=\"https:\/\/www.theblock.co\/post\/254855\/inside-the-courtroom-why-fiat-will-be-key-to-the-sbf-trial\" data-v-f87c67ca=\"\">fiat@<\/a>\" account at Alameda, he did not have context necessary to understand its significance. Only in October 2022 does he maintain that he discovered what was going on.<\/span>","<span data-v-f87c67ca=\"\">The version of events Bankman-Fried gave on Tuesday was vague. He said that back in June, he \"overheard\" his team discussing the fiat@ account, but was not told about it directly. When he says he asked employees for details, \"they told me they were busy and I should stop asking questions.\"<\/span>","<span data-v-f87c67ca=\"\">A day before, Bankman-Fried <\/span><a href=\"https:\/\/www.theblock.co\/post\/260077\/inside-the-trial-days-before-the-collapse-sbf-says-he-thought-ftx-and-alameda-could-still-be-saved\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">testified<\/span><\/a><span data-v-f87c67ca=\"\"> that even though he was aware of Alameda’s $10 billion deficit, he was convinced the firm had $5 billion to $10 billion in liquid assets on hand and a net $10 billion positive balance. On Tuesday, Sassoon pulled up evidence showing Bankman-Fried's understanding of the situation might have been more realistic than that.<\/span>","<span data-v-f87c67ca=\"\">For example, a spreadsheet with Alameda's assets and liabilities as of October, obtained by the prosecution, listed $3.9 billion worth of FTT tokens, the cryptocurrency created by FTX, among Alameda's liquid assets. However, when asked if he understood that Alameda wouldn't be able to liquidate that amount of tokens without crashing the market, Bankman-Fried agreed he understood that.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Then the prosecutor asked whether on Nov. 6, when he <\/span><a href=\"https:\/\/www.theblock.co\/post\/260077\/inside-the-trial-days-before-the-collapse-sbf-says-he-thought-ftx-and-alameda-could-still-be-saved\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">claimed<\/span><\/a><span data-v-f87c67ca=\"\"> to be convinced about Alameda's solvency, he knew the FTT tokens on the firm's balance were not, in fact, liquid. \"Liquid is not a binary term,\" Bankman-Fried responded in a vague manner, <\/span><a href=\"https:\/\/www.theblock.co\/post\/260107\/inside-sbfs-trial-sam-wasnt-sure-nearly-one-hundred-and-fifty-times\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">typical<\/span><\/a><span data-v-f87c67ca=\"\"> of his style throughout the trial.<\/span>","<span data-v-f87c67ca=\"\">The prosecutor showed a screenshot from a Signal group chat where Bankman-Fried and a small group of FTX and Alameda executives discussed options during the unfolding liquidity crisis. In that chat group, Bankman-Fried posted his own estimate of the assets Alameda could sell in a matter of a week to satisfy user withdrawals. <\/span>","<span data-v-f87c67ca=\"\">The number he suggested at 3 a.m. on Nov. 7 was $3.9 billion, the screenshot showed, while $8 billion was needed. According to the same group chat, Bankman-Fried realized at that moment that the FTT, SRM and SOL tokens on Alameda's balance could not have been liquidated at that fast of a pace.<\/span>","<span data-v-f87c67ca=\"\">In the meantime, cash Alameda had in banks in October 2022 totaled at no more than $449 million, according to the same spreadsheet.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Sassoon also touched on other issues, like Bankman-Fried attempts to befriend the Bahamian government, including Prime Minister Philip Davies, with steps like offering to pay the nation's debt. The episode, described in Michael Lewis' book, \"Going Infinite,\" was not something Bankman-Fried could recall, he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The prosecutor also touched on Bankman-Fried's state of mind after the FTX collapse, while his former subordinates plead guilty to fraud and started collaborating with the government. According to a Google document reportedly drafted by Bankman-Fried and obtained by the government, at some point, he mused about why Nishad Singh did not join Caroline Ellison and Gary Wang in pleading guilty.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The trial will continue with closing arguments on Wednesday, as the defense has no more witnesses to bring.&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"Google","content":"ORGANIZATION"},{"type":"$3.9 billion","content":"MONEY"},{"type":"Nov. 7","content":"DATE"},{"type":"Nov. 6","content":"DATE"},{"type":"October 2022","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Danielle Sassoon","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"3 a.m.","content":"TIME"},{"type":"Wednesday","content":"DATE"},{"type":"Alameda","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Michael Lewis","content":"PERSON"},{"type":"June 2022","content":"DATE"},{"type":"Sassoon","content":"ORGANIZATION"},{"type":"SRM","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nishad Singh","content":"PERSON"},{"type":"$10 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Alameda","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Adam Yedidia","content":"PERSON"},{"type":"$449 million","content":"MONEY"},{"type":"Gary Wang","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Philip Davies","content":"PERSON"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["FTX","SBF TRIAL"],"authors":["Anna Baydakova","The Block"]}