{"summary":"GameStop&#x27;s foray into crypto appears to be over, as the company also killed off its wallet application last August.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272529\/gamestop-axes-nft-marketplace-citing-regulatory-uncertainty","publishDate":"2024-01-13T18:09:43","id":956,"type":null,"title":"GameStop axes NFT marketplace, citing regulatory uncertainty","category":["COMPANIES"],"content":["GameStop has announced the closure of its NFT marketplace. In a statement posted to the site, the company cites \"the continuing regulatory uncertainty of the crypto space\" as the reason behind the closure. The marketplace <a href=\"https:\/\/www.theblock.co\/post\/181452\/gamestop-officially-launches-nft-marketplace\" data-v-f87c67ca=\"\">officially launched<\/a> on Halloween of 2022, focusing on gaming assets in partnership with ImmutableX, an Ethereum layer 2 blockchain.&nbsp;","The news means GameStop is all but exiting the crypto space after the company <a href=\"https:\/\/www.theblock.co\/post\/242653\/gamestop-halts-crypto-wallet-service-citing-regulatory-uncertainty\" data-v-f87c67ca=\"\">axed its crypto wallet<\/a> last August. Customers will be able to sell their NFTs on other marketplaces, the website's message says, as the digital assets are hosted on the blockchain rather than any one storefront.&nbsp;","This news is unlikely to shock observers, though, as GameStop's NFT marketplace largely failed to make a dent in NFT trading volumes. The marketplace's <a href=\"https:\/\/twitter.com\/GameStopNFT\" data-v-f87c67ca=\"\">X account<\/a> hasn't been active since September of last year, either. Still, the move marks a significant turn for the company, which sought to rally its retail trader fans with its <a href=\"https:\/\/www.theblock.co\/linked\/148237\/gamestop-launches-self-custodial-crypto-wallet\" data-v-f87c67ca=\"\">foray into Web3<\/a> in 2022.&nbsp;","GameStop did not immediately respond to a request for comment from The Block.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"September of last year","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Zack Abrams","The Block"]}