{"summary":"Templum Markets filed a letter with the Securities and Exchange Commission that has led to confusion about the legality of blockchain miners\n\nSome wonder whether they can be deemed unregistered broker-dealers under federal securities laws, but doing so would have serious implications for the industry","author":["Contributor Network","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/32597\/why-blockchain-miners-shouldnt-be-considered-broker-dealers-the-legal-view","publishDate":"2019-07-22T19:12:15","id":956,"type":null,"title":"Why blockchain miners shouldn&#x27;t be considered broker-dealers: the legal view","category":["Legal"],"content":["<em data-v-f87c67ca=\"\"><span id=\"E326\" data-v-f87c67ca=\"\">Brian Farber is the General Counsel at Securitize,<\/span><span id=\"E327\" data-v-f87c67ca=\"\"> which delivers trusted global solutions for creating compliant digital securities. The Securitize compliance platform and protocol provide a proven, full-stack solution for issuing and managing digital securities (security tokens). Prior to joining Securitize, Brian was in-house counsel at ConsenSys and practiced law at Sullivan &amp; Cromwell LLP.<\/span><\/em>","<span class=\"s1\" data-v-f87c67ca=\"\">In early April, Templum Markets filed a <a href=\"https:\/\/www.sec.gov\/rules\/petitions\/2019\/petn4-743.pdf\" data-v-f87c67ca=\"\">letter<\/a> with the Securities and Exchange Commission requesting guidance on whether blockchain miners could be deemed unregistered broker-dealers under federal securities laws. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The filing has added a layer of confusion to the digital securities ecosystem and has caused some to jump to conclusions about the <a href=\"https:\/\/www.forbes.com\/sites\/nisaamoils\/2019\/05\/02\/can-crypto-miners-be-considered-broker-dealers\/#59afe38840de\" data-v-f87c67ca=\"\">legality<\/a> of issuing and trading digital securities on public blockchains. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">It’s quite possible that the timing of Templum’s request was no coincidence. Around the same time, Templum publicly announced a significant pivot in its business model from facilitating digital securities offerings on public blockchains, to using a private blockchain it was building with <a href=\"https:\/\/www.coindesk.com\/security-token-startup-templum-shifts-private-blockchains-symbiont\" data-v-f87c67ca=\"\">Symbiont<\/a>. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Regardless, it is critical that thoughtful analysis be given to new innovations without jumping to an immediate conclusion that they create issues under federal securities laws. A decision to classify miners as broker-dealers would have grave implications for innovation and growth in the industry.<\/span>","","","<span class=\"s1\" data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">What are Ethereum miners actually doing?<\/b><\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">As the majority of digital securities offerings to date have utilized the public Ethereum blockchain, this analysis focuses specifically on activities of Ethereum miners on the public chain. <\/i><\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Ethereum, like other blockchains, is a digital ledger system that records the occurrence of events and certain identifying information about those events (e.g. its participants). While the events being recorded on the blockchain are colloquially referred to as “transactions”, it is important to note that not all of them involve the exchange of value. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Transactions, in this context, represent units of work performed by a computer system. A transaction might be a purchase or sale of cryptocurrency like Ether, but it also might be a record of title for a plot of land.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Prior to being recorded on the ledger, transactions are processed by a network of high-speed computers called “miners”. When a transaction is proposed on the Ethereum blockchain, it is randomly sent to miners for confirmation. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Miners then aggregate that transaction with other unrelated transactions into a “block” (i.e., a group of transactions) and are able to confirm those transactions by solving cryptographic equations that require significant computing power. The miner that solves the equation quickest confirms the transactions within the corresponding block and the transactions are then recorded on the blockchain. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The miner then finally receives payment from the network in the form of Ether for its efforts. The amount of Ether dispensed to a miner is determined by block without reference to the block’s contents. As of June 2019, Ethereum miners receive two Ether per confirmed block.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">Do miners' activities fit within the scope of broker-dealer regulation?<\/b><\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">With limited exception, all persons who are deemed to be brokers or dealers are required to register with the SEC in accordance with the Securities Exchange Act of 1934. Registration can be time-consuming and creates onerous ongoing compliance requirements.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A <a href=\"https:\/\/www.law.cornell.edu\/uscode\/text\/15\/78c\" data-v-f87c67ca=\"\">“broker”<\/a> is “any person engaged in the business of effecting transactions in securities for the account of others.” We will examine in more detail if miners act as brokers engaged in the business of effecting transactions in securities for the account of others, but first let’s eliminate the idea that they are “dealers”. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A <a href=\"https:\/\/www.law.cornell.edu\/uscode\/text\/15\/78c\" data-v-f87c67ca=\"\">“dealer”<\/a> is “any person engaged in the business of buying and selling securities for [its] own account, through a broker or otherwise.” Miners on the Ethereum blockchain do not purchase digital securities for their own account when processing and recording on-chain transactions, therefore they should not be considered<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp; <\/span>“dealers” under SEC rules. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp; <\/span><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"hashtag":["SEC"]}