{"summary":"Alphapo&#x27;s hot wallets have been drained for at least $23 million on Ethereum, Tron and Bitcoin — causing customer HypeDrop to suspend withdrawals.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241048\/alphapo-hot-wallets-drained-for-23-million-hypedrop-disables-withdrawals","publishDate":"2023-07-23T05:10:58","id":9566,"type":null,"title":"Alphapo hot wallets drained for $23 million, HypeDrop disables withdrawals","category":["SECURITY"],"content":["Crypto payments processor Alphapo — which processes payments for HypeDrop, Bovada, Ignition and other gambling services — has had its hot wallets drained for at least $23 million on Ethereum, Tron and Bitcoin, according to ZachXBT.","The funds stolen on Ethereum were swapped for ether before being bridged to Avalanche and Bitcoin, the on-chain sleuth <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1682941291825627137?s=46&amp;t=yoL7WJcO9vZ3TjSE2j6FRQ\" data-v-f87c67ca=\"\">noted<\/a>.","The amount of bitcoin stolen from Alphapo is currently <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1682946088746074119\" data-v-f87c67ca=\"\">undetermined<\/a>.","Alphapo customer HypeDrop has disabled withdrawals.","\"Our provider is currently working to solve some recent issues from their side; they are facing problems specifically related to withdrawals of BTC, ETH, and TRX, as well as deposits for ETH and TRX,\" the project's verified Twitter account <a href=\"https:\/\/twitter.com\/HypeDrop\/status\/1682832668201721856\" data-v-f87c67ca=\"\">stated<\/a> in multiple replies.","\"We are actively monitoring the situation with them and will provide you with an update when more information is available,\" it added, before noting that \"if your payment has been affected, your funds are secure.\"","HypeDrop did not immediately respond to a request for comment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$23 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bovada","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Alphapo","content":"LOCATION"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Adam James","The Block"]}