{"summary":"Binance is breaking into the futures market following the acquisition of a little-known derivatives platform.  The world&#x27;s largest cryptocurrency exchange","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/38204\/binance-acquires-cryptocurrency-trading-platform","publishDate":"2019-09-02T10:55:45","id":957,"type":null,"title":"Binance acquires crypto derivatives exchange to offer options, futures and perpetual contracts","category":["EXCHANGES"],"content":["Binance is breaking into the futures market following the acquisition of a little-known derivatives platform.&nbsp;","The world's largest cryptocurrency exchange announced on Monday that it has <a href=\"https:\/\/www.binance.com\/en\/support\/articles\/360033256151\" data-v-f87c67ca=\"\">acquired<\/a> JEX, an exchange based in Seychelles. As part of the deal, JEX will be rebranded as Binance JEX and will offer derivatives products, including futures, options, and perpetual contracts, according to a press release.","For its part, Binance has been working on its own platform internally. Over the next couple of weeks, Binance will allow its clients to trade on both the JEX platform as well as the one it developed to get a sense of which is superior. Participating traders beta testing the two platforms can vote for their favorite for a chance to win up to 10,000 BNB tokens. Following the testing period, Binance will pick a winning platform based on client feedback. With the acquisition, Binance will also manage the JEX team and its native JEX tokens.","\"We think open competition is a great way to test out the products’ usability. Through the competition, we hope to fully review the two products in terms of market feedback, scalability and liquidation model design. It’ll help with the ultimate decision making,\" a Binance spokesperson told The Block.","The cryptocurrency exchange has also developed its own bitcoin perpetual swap paired against tether, according to <a href=\"https:\/\/binanceapitest.github.io\/Binance-Futures-Documentation\/Overview_of_the_Contract\/\" data-v-f87c67ca=\"\">documents<\/a> reviewed by The Block.","In February, The Block <a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/19\/the-derivatives-market-is-heating-up-in-crypto-and-binance-might-be-the-next-firm-to-jump-in\/\" data-v-f87c67ca=\"\">first reported<\/a> that Binance would enter the derivatives market. More details about the derivatives platform <a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/16\/binance-is-building-out-a-derivatives-platform-heres-everything-we-know\/\" data-v-f87c67ca=\"\">were revealed<\/a> to The Block in May, including that the exchange was looking to offer perpetual swaps to rival BitMEX, the cryptocurrency exchange giant that pioneered the financial instrument.&nbsp;","<b data-v-f87c67ca=\"\">Intensifying<\/b><strong data-v-f87c67ca=\"\">&nbsp;competition<\/strong>","With the debut of its derivatives platform, Binance is entering one of the most heated markets in the cryptocurrency trading space. Established brands in the derivatives market such as Deribit and BitMEX have seen their volumes continue to grow in recent months, with BitMEX's insurance fund <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/the-bitmex-insurance-fund-is-up-50-since-the-beginning-of-2019-holds-more-than-300-million\/\" data-v-f87c67ca=\"\">up by 50%<\/a> since the beginning of 2019 to over 31,300 BTC. Meanwhile, Deribit dominates around 95% of the total cryptocurrency options market. CoinFLEX, which specializes in physically settled futures contracts, recently raised $10 million and launched a market-making incentive program to boost its market share.&nbsp;","Confronted with the fierce competition in the derivatives space, Binance may have to count on its popularity in the spot market to win an edge, according to market maker Altonomy co-founder Ricky Li.&nbsp;","\"Given the huge existing customer base on spot and margin trading, it will be relatively much easier for Binance to build initial liquidity than other competitors, which is the most difficult part of starting up an exchange,\" said Li.","A Binance spokesman also told The Block it aims to address “the current common issues” plaguing the crypto derivatives market, including high latency, overloads, and poor risk-control mechanisms, alluding to some of the problems facing BitMEX.&nbsp;","<em data-v-f87c67ca=\"\">With contributions from Frank Chaparro.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance JEX","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Altonomy","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"Seychelles","content":"LOCATION"},{"type":"95%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Ricky Li","content":"PERSON"},{"type":"JEX","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["BINANCE","BNB"],"authors":["Steven Zheng","Celia Wan","The Block"]}