{"summary":"The regulatory agency charged Impact Theory with “conducting an unregistered offering of crypto asset securities.”\nImpact Theory is a YouTube channel and podcast studio co-founded by\nTom Bilyeu.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247706\/sec-brings-first-nft-enforcement-action-in-case-against-podcast-studio","publishDate":"2023-08-28T12:10:18","id":957,"type":null,"title":"SEC brings first NFT enforcement action in case against podcast studio","category":["NFT brands"],"content":["The Securities and Exchange Commission <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-163\" data-v-f87c67ca=\"\">charged<\/a> a Los Angeles-based podcasting studio on Monday over \"conducting an unregistered offering of crypto asset securities,\" marking the agency's first enforcement action involving an NFT project.&nbsp;","<span data-v-f87c67ca=\"\">Impact Theory raised roughly $30 million from hundreds of investors, the SEC said. The company is co-founded by <span class=\"x1lliihq x1plvlek xryxfnj x1n2onr6 x193iq5w xeuugli x1fj9vlw x13faqbe x1vvkbs x1s928wv xhkezso x1gmr53x x1cpjm7i x1fgarty x1943h6x x1i0vuye xvs91rp x1s688f x5n08af x10wh9bi x1wdrske x8viiok x18hxmgj\" dir=\"auto\" data-v-f87c67ca=\"\">Tom Bilyeu, host of a YouTube show and podcast also called <a href=\"https:\/\/www.youtube.com\/channel\/UCnYMOamNKLGVlJgRUbamveA\" data-v-f87c67ca=\"\">Impact Theory<\/a>. Bilyeu's YouTube channel has more than 3.7 million subscribers, and previous guests have included actor <\/span><\/span><span data-v-f87c67ca=\"\">Matthew McConaughey.<\/span>","The company \"encouraged potential investors to view the purchase of a Founders Key as an investment into the business, stating that investors would profit from their purchases if Impact Theory was successful in its efforts,\" the SEC said. \"The order finds that the NFTs offered and sold to investors were investment contracts and therefore securities.\"","At least one Impact Theory Founder's Key NFT collection listed on OpenSea <a href=\"https:\/\/opensea.io\/collection\/impact-theory-founders-key\" data-v-f87c67ca=\"\">has generated<\/a> about $5.4 million in trading volume. The collection was created in late 2021, according to OpenSea.","The SEC said that while Impact Theory has not admitted or denied the agency's findings, it agreed to a \"cease-and-desist order\" connected to violating the Securities Act of 1933 and an order to pay $6.1 million in penalties and interest.","Impact Theory will destroy Founders Keys NFTs in its \"possession or control,\" in addition to posting a notice on its website and across its social media channels, the SEC added.","<span class=\"s1\" data-v-f87c67ca=\"\">Republican Commissioners Hester Peirce and Mark Uyeda criticized the agency’s move and said it raised “<\/span><span class=\"s2\" data-v-f87c67ca=\"\">larger questions with which the Commission should grapple before bringing additional NFT cases.” <\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">They also said they disagreed with how the Howey Test was applied. <\/span><span class=\"s3\" data-v-f87c67ca=\"\">The SEC uses the Howey Test, a 1946 U.S. Supreme Court case, to help determine whether transactions are investment contracts and subject to securities laws.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">\"The handful of company and purchaser statements cited by the order are not the kinds of promises that form an investment contract,” Peirce and Uyeda said in a <a href=\"https:\/\/www.sec.gov\/news\/statement\/peirce-uyeda-statement-nft-082823?utm_medium=email&amp;utm_source=govdelivery\" data-v-f87c67ca=\"\">statement<\/a>. “We do not routinely bring enforcement actions against people that sell watches, paintings, or collectibles along with vague promises to build the brand and thus increase the resale value of those tangible items.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>","<em data-v-f87c67ca=\"\">Updated at 12:15 p.m. to include comments from SEC commissioners<\/em>"],"hashtag":["SEC"]}