{"summary":"A report from blockchain analysis Chainalysis this week indicates that the the correlation between bitcoin spending and the digital asset&#x27;s price went through dramatic changes amid the recent market volatility.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/60566\/bitcoin-payments-on-dark-markets-most-impacted-by-coronavirus-pandemic-chainalysis-report","publishDate":"2020-04-01T18:19:26","id":9571,"type":null,"title":"Bitcoin payments on dark markets most impacted by coronavirus pandemic: Chainalysis report","category":["BITCOIN"],"content":["A report from blockchain analysis Chainalysis this week indicates that&nbsp;<span data-v-f87c67ca=\"\">the correlation between bitcoin spending and the digital asset's price went through dramatic changes amid the recent market volatility.<\/span>","<span data-v-f87c67ca=\"\">The <a href=\"https:\/\/blog.chainalysis.com\/reports\/covid-19-bitcoin-price-bitcoin-spending\" data-v-f87c67ca=\"\">report<\/a>&nbsp;published on March 30 broke down the impact of the coronavirus on the consumer end of bitcoin. Although purchases related to merchant services, gambling services, the darknet market all underwent a decline as expected, their correlation with bitcoin's price differs for each service category and has shifted in surprising ways, according to the report.<\/span>","<em data-v-f87c67ca=\"\">Source: Chainalysis Insights<\/em>","<span data-v-f87c67ca=\"\">Merchant services remain relatively resilient to price swings and the amount of purchases has not dropped as much as what some would predict. <\/span>","<span data-v-f87c67ca=\"\">Indeed, the correlation between merchant services usage and bitcoin's price decreased by almost 50% since the outbreak of the coronavirus, according to Chainalysis. The report speculated that this result could be due to local business closures prompted by the pandemic. Bitcoin spenders might be paying for services that they could not otherwise purchase with fiat currencies. Services with recurring payments, like web hosting, might also have contributed to the relatively stable number of merchant services activities.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With cryptocurrency gambling services, bitcoin flows have experienced a drop. However, they do not exhibit a significant correlation to bitcoin's price. <\/span>","<span data-v-f87c67ca=\"\">This is very much expected, the report's authors said, since gambling activities don't often follow a clear or predictable rationale. In fact, amid a poor economic climate, the promise of winning a considerable amount of money at once could seem even more enticing.<\/span>","<span data-v-f87c67ca=\"\">Finally, dark market activities are showing a high correlation to bitcoin's price like never before. <\/span>","<span data-v-f87c67ca=\"\">A previous Chainalysis <a href=\"https:\/\/blog.chainalysis.com\/reports\/darknet-markets-cryptocurrency-2019\" data-v-f87c67ca=\"\">report<\/a>&nbsp;from January argued that purchases on the dark market are somehow immune to short-term market swings because people will purchase drugs, for example, regardless of the price. <\/span>","<span data-v-f87c67ca=\"\">The usually high-level of correlation between dark market activities and bitcoin's price right now could be due to a number of factors, according to the newest report. For instance, the pandemic has made it difficult to sell drugs since trafficking organizations are having a hard time sourcing material. Drug vendors might also be afraid that the bitcoin payments they receive today will not worth much in the future.&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Source: Chainalysis Insights<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March 30","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"January","content":"DATE"},{"type":"50%","content":"PERCENT"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}