{"summary":"Crypto-friendly Signature Bank is placing caps on deposits from clients in the digital assets industry.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193064\/signature-bank-adopts-caps-to-reduce-concentration-of-crypto-deposits","publishDate":"2022-12-07T15:58:22","id":9579,"type":null,"title":"Signature Bank adopts caps to reduce concentration of crypto deposits","category":["FINANCE FIRMS"],"content":["Signature Bank, long known as being friendly to crypto clients, is introducing caps to reduce the concentration of deposits from clients in the digital asset industry to below 20% of total bank deposits.","The bank, in an email to clients from group director Joseph Seibert obtained by The Block, said it would adopt a per-client deposit cap of at most 2% of total bank deposits.","\"Signature Bank will continue servicing clients in the digital asset industry, including stablecoin clients,\" Seibert said, citing \"rapid deposit growth and the ongoing market volatility in the digital asset industry\" for the change.","In a separate email to The Block in response to follow-up questions, Seibert said the cap would be $2 billion per client.","With deposits ending the third quarter at $102 billion, the measure would cap total deposits for the entire digital ecosystem at $20.4 billion, he said.","CEO Joe DePaolo first announced that it would reduce deposits from the crypto industry at a Tuesday event in New York, according to a report from CoinDesk.","The bank said it expected the strategy to impact a \"minimal amount\" of clients that have already been notified and that the decision would allow it to utilize capital in a more strategic manner.&nbsp;","\"We continue to invest resources in this space and expect growth to continue over the coming years as we continue to strive to the preeminent bank in servicing the digital asset industry,\" Seibert said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Joseph Seibert","content":"PERSON"},{"type":"2%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Joe DePaolo","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Seibert","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Signature Bank","content":"ORGANIZATION"},{"type":"$102 billion","content":"MONEY"},{"type":"New York","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"third quarter","content":"DATE"},{"type":"$20.4 billion","content":"MONEY"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["TRADFI BANKS"],"authors":["Nathan Crooks","Frank Chaparro","The Block"]}