{"summary":"The tool, powered by Base, also lets users leverage their digital assets to send USDC throughout the Ethereum ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277583\/defi-lender-moonwell-enables-usdc-lending-throughout-ethereum","publishDate":"2024-02-14T16:58:18","id":959,"type":null,"title":"DeFi lender Moonwell enables USDC lending throughout Ethereum","category":["STABLECOINS"],"content":["Moonwell, a decentralized lending and borrowing protocol, enabled cross-chain lending of Circle's USDC stablecoin to Moonwell from Ethereum networks with a tool called USDC Anywhere.&nbsp;","Moonwell can detect USDC in user wallets on Arbitrum, Avalanche, Base, Ethereum, Optimism and Polygon, employing Circle's cross-chain protocol to transfer the stablecoin onto the platform. The move forgoes the need to manually bridge the assets and allows users to send USDC throughout the Ethereum ecosystem by leveraging their digital assets on Moonwell, according to a company <a href=\"https:\/\/mirror.xyz\/moonwell.eth\/OhbycP9JioKO_UuMPxBgdVgnKxEI1fhfobLi5pB4Awk\" data-v-f87c67ca=\"\">release<\/a>.&nbsp;","Coinbase's Etheruem Layer 2 <a href=\"https:\/\/www.theblock.co\/post\/258394\/coinbase-ethereum-layer-2-base-open-sources-smart-contracts-frontend\" data-v-f87c67ca=\"\">Base<\/a> is the backbone of USDC Anywhere.","\"Base serves as the liquidity hub for this feature, marrying the robust security of Ethereum mainnet with the affordability and agility of modern Layer 2 solutions,\" Moonwell wrote in the statement. \"Coinbase has also made it easy to acquire USDC on their central exchange, offering free transfers to and from Base and free conversions to USD.\"","Moonwell's USDC Anywhere also uses the interoperability protocol <a href=\"https:\/\/www.theblock.co\/post\/273964\/socket-ether-recovery-bungee-exploit\" data-v-f87c67ca=\"\">Socket<\/a> to handle a user's gas before their funds make it to the new network.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Moonwell","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"USDC Anywhere","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Base","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Moonwell","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["USDC"],"authors":["MK Manoylov","The Block"]}