{"summary":"Agoric, a smart contract platform built on the Cosmos SDK, has raised $32 million in a private token sale.\nAgoric has also launched its mainnet. It now plans to launch an AMM and a native stablecoin.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124059\/agoric-cosmos-javascript-smart-contract-platform-funding-mainnet","publishDate":"2021-11-11T09:00:10","id":959,"type":null,"title":"Smart contract platform Agoric raises $32M, launches mainnet","category":["Venture Capital"],"content":["Agoric, a JavaScript-based smart contract platform built on the Cosmos SDK and with Tendermint proof-of-stake (PoS) mechanism, has raised $32 million in a private token sale and has also launched its mainnet after over three years of development.","Agoric was founded in 2018 to help JavaScript developers — the biggest developer community in the world with nearly 14 million people — build decentralized applications or dapps. JavaScript is a programming language like Ethereum's Solidity and Solana's Rust language.","\"The crypto market has overlooked the need to engage with non-crypto-native audiences to onboard the next wave of DeFi entrepreneurs,\" Agoric co-founder and CEO Dean Tribble told The Block. \"Agoric is aiming to bridge this divide.\"&nbsp;","Tribble is a former principal architect at Microsoft and leads Agoric with chief scientist Mark S. Miller, a Google research scientist who wrote a paper called Agoric Open Systems in 1988.","Now that the Agoric mainnet has been launched and the new capital has been raised, the platform hopes to build and grow its developer community. Tribble said Agoric will reward early developers with its native Build (BLD) token.&nbsp;&nbsp;","The next phase of Agoric's mainnet will include the launch of its native automated market maker (AMM) to let users swap tokens and a native USD-pegged stablecoin (RUN) for paying fees within the network.","There are currently 22 people working for Agoric, and Tribble plans to hire around ten more people across various roles to grow the platform, he said.","Agoric is backed by notable investors, including Polychain and Naval Ravikant. The private token sale round was backed by several investors, including Placeholder, NGC Ventures, Spartan Group, Compound VC, Acrew Capital, Figment, and Chorus.One.","The round brings Agoric's total funding to date to $38 million. It has previously raised $6 million in two rounds. Tribble said Agoric has no plans to raise more funds in the near future."],"hashtag":["COSMOS"]}