{"summary":"The move by FTX US — which is part of the Sam Bankman-Fried empire — is the company&#x27;s latest push into traditional financial markets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147745\/ftx-us-launching-zero-commission-stock-trading","publishDate":"2022-05-19T06:00:28","id":9590,"type":null,"title":"FTX US launching zero-commission stock trading","category":["EXCHANGES"],"content":["FTX.US is going where no crypto exchange has gone before: regulated US equities trading.&nbsp;","The firm — which is owned by billionaire wunderkind Sam Bankman-Fried — announced on Thursday the launch of a stock trading feature that would make the firm one of the most prominent companies in the crypto space to make the move into regulated securities. According to a press release, FTX Stocks will be offered through the FTX US mobile application. It plans to offer trading in hundreds of US-listed companies and exchange-traded funds.","Elsewhere, rivals like Coinbase have <a href=\"https:\/\/www.wsj.com\/articles\/coinbase-says-capital-markets-head-brett-redfearn-has-left-company-11628531644\" data-v-f87c67ca=\"\">indicated<\/a> that they do not intend to move into trading US securities. In 2021, Binance <a href=\"https:\/\/www.cnbc.com\/2021\/07\/16\/crypto-exchange-binance-halts-stock-tokens-as-regulators-circle.html\" data-v-f87c67ca=\"\">shut<\/a>&nbsp;down its stock-tied token trading operation.&nbsp;","FTX, according to a press release, is offering brokerage services through FTX Capital Markets, which is \"an affiliated broker-dealer registered with the SEC and member FINRA\/SIPC.\"","The functionality could be rolled out to all of FTX US' users over the course of the next several months. FTX US&nbsp;will not charge commission fees to make a trade and it will allow clients to fund their accounts with the popular stablecoin USDC.&nbsp;","“Our goal is to offer a holistic investing service for our customers across all asset classes,\" commented FTX US president Brett Harrison, a former high-speed trading tech wonk at Citadel Securities and Jane Street. \"With the launch of FTX Stocks, we have created a single integrated platform for retail investors to easily trade crypto, NFTs, and traditional stock offerings through a transparent and intuitive user interface.”","The news is striking given that Sam Bankman-Fried recently acquired a 7.6% stake in the poster-child of US retail stock trading: Robinhood. The stake — which amounted to about $648 million at the time of the investment — has spurred speculation among individuals close to the billionaire that he is keen to acquire the entire company. Such a move would fit in neatly with his ever-expanding grip over US capital markets.&nbsp;","FTX US has plans to offer crypto derivatives in the US via a proposal that would allow it to offer such instruments direct to consumers, potentially posing a threat to CME Group. Currently, exchanges offer futures and options products to customers through intermediaries like brokers and futures clearing merchants. CME Group — which dominates trading across commodity derivatives — has <a href=\"https:\/\/www.prnewswire.com\/news-releases\/cme-group-chairman-and-chief-executive-officer-terry-duffy-to-appear-before-us-house-of-representatives-agriculture-committee-301545514.html\" data-v-f87c67ca=\"\">come out<\/a> firmly against FTX, with its CEO Terry Duffy noting in a recent press release that FTX's proposal is \"glaringly deficient and poses significant risk to market stability and market participants.\"","FTX's mounting presence in traditional markets is also illustrated in its significant stake in equities exchange IEX, which was <a href=\"https:\/\/www.theblockcrypto.com\/post\/140542\/ftx-backs-flash-boys-exchange-iex-in-undisclosed-investment-as-firm-plots-crypto-journey\" data-v-f87c67ca=\"\">revealed<\/a> in April.&nbsp;","Still, FTX US plans to route its orders to Nasdaq's market, according to a news release. The firm does not plan to monetize the business via payment-for-order flow, which is the typical mechanism through which brokers make money. Through PFOF — as it is known in the industry — brokers route orders to liquidity providers to execute. Those trading firms pay the brokers for that order flow.&nbsp;","\"There is clear market demand for a new retail investment experience that offers full order routing transparency to customers and does not rely on payment for order flow,\" Harrison said. \"As we grow the product offering and capabilities, we are excited to give our customers even greater choice for order execution, as well as the tools they need to make informed routing decisions.\"","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7.6%","content":"PERCENT"},{"type":"Harrison","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"SIPC","content":"ORGANIZATION"},{"type":"Jane Street","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"Brett Harrison","content":"PERSON"},{"type":"FINRA","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Terry Duffy","content":"PERSON"},{"type":"FTX Capital Markets","content":"ORGANIZATION"},{"type":"$648 million","content":"MONEY"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["FINTECH","FTX"],"authors":["Frank Chaparro","The Block"]}