{"summary":"Having built up a strong balance sheet, Chorus One is now investing where it knows best: in staking and bridging protocols.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/140234\/staking-company-chorus-one-launches-30-million-venture-fund","publishDate":"2022-04-04T12:00:33","id":9591,"type":null,"title":"Staking company Chorus One launches $30 million venture fund","category":["VENTURE CAPITAL"],"content":["Crypto staking company Chorus One has launched a $30 million venture fund as it seeks to spend the cash it’s accrued after a booming year for staking businesses.","Chorus One runs across 28 blockchain networks and protocols and, at the height of the market late last year, was <a href=\"https:\/\/www.theblockcrypto.com\/news+\/126250\/crypto-staking-businesses-are-making-an-absolute-fortune\" data-v-f87c67ca=\"\">looking after $6.5 billion<\/a> in assets. At the time, the firm was estimating $30 million in yearly revenue. Since then, prices for proof-of-stake tokens have gone down — decreasing its AUM and revenue —&nbsp;but the business has still made bank.","To this end, it has created Chorus Ventures, a $30 million fund focused on decentralized protocols, mostly in areas that the staking company is familiar with. The fund will be investing its own capital rather than seeking external funding. It will be managed by Xavier Meegan, research and ventures lead at Chorus One.","“With the launch of Chorus Ventures, founders now have an alternative way to raise capital, through a company that has a vested interest in the longevity of decentralized networks,” Meegan told the Block.","Prior to launching this new structure, the firm had already made 26 investments into crypto projects. These include Lido, a liquid staking protocol, and Anchor, a yield-generating protocol. It also invested in Quicksilver, a liquid staking protocol focused on the Cosmos ecosystem, which <a href=\"https:\/\/www.theblockcrypto.com\/post\/135890\/quicksilver-a-liquid-staking-protocol-on-cosmos-spins-out-of-chorus-one\" data-v-f87c67ca=\"\">spun out of Chorus One<\/a> last month.","Chorus Ventures will mostly focus on ecosystems that Chorus One is familiar with. These are the Cosmos and Solana ecosystems, along with blockchains compatible with the Ethereum Virtual Machine, such as Ethereum, Avalanche, BNB Chain and others.&nbsp;","The fund will focus on key three areas across these blockchains. First is staking, such as liquid staking protocols — like Quicksilver — and protocols that look to support staking in various ways, for example by providing easier access to crypto governance processes.","The second is interoperability, or the ability to connect multiple blockchains for the purpose of sending tokens and information between them. This includes such novel technologies as bridges for direct transfers between blockchains and more complex protocols for making <a href=\"https:\/\/www.theblockcrypto.com\/news+\/127771\/what-the-heck-is-a-cross-chain-swap\" data-v-f87c67ca=\"\">cross-chain swaps<\/a>.&nbsp;","The third is middleware. This is the layer of data-based services that help to provide functions for blockchains and applications built on them. These include concepts like RPC (a way to make requests for data), oracles (that provide data to blockchains), indexing services (that gather data and make it accessible) and analytics services (that provide insights).","Other staking firms have also been investing in blockchain protocols, similarly leveraging their insights from working so closely with protocols in the industry. This includes Figment, which launched Figment VC in September 2021. At the time of launch, it said that JPK Capital had led a $17.5 million raise into its venture capital arm for investment purposes.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"$6.5 billion","content":"MONEY"},{"type":"RPC","content":"ORGANIZATION"},{"type":"Meegan","content":"PERSON"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"$17.5 million","content":"MONEY"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"Xavier Meegan","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["STAKING"],"authors":["Tim Copeland","The Block"]}