{"summary":"A16z crypto has urged the UK to consider a &quot;more nuanced approach&quot; to the regulation as the country considers a new digital assets framework.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228970\/a16z-crypto-uk-regulation","publishDate":"2023-05-01T13:37:58","id":9595,"type":null,"title":"a16z crypto urges the UK to consider &#x27;more nuanced&#x27; regulatory framework","category":["COMPANIES"],"content":["A16z crypto is urging the UK to consider a \"more nuanced approach\" to the regulation of digital assets as the country considers a new framework to govern both trading and lending.","\"A 'one-size-fits-all' approach to the regulation of cryptoasset transactions would not be consistent with the Treasury’s core design principle of 'same risk, same regulatory outcome,'\" <a href=\"https:\/\/api.a16zcrypto.com\/wp-content\/uploads\/2023\/04\/a16z_HMT-crypto-consultation-response-29-April.pdf\" data-v-f87c67ca=\"\">the venture capital fund said<\/a> in a letter to the UK Treasury. It was responding to a <a href=\"https:\/\/www.theblock.co\/post\/207488\/the-uk-finally-reveals-plan-to-regulate-crypto-trading-and-lending\" data-v-f87c67ca=\"\">consultation paper first published<\/a> by the UK government in February.&nbsp;","Both policymakers and regulators need to develop a \"more uniform\" understanding of how decentralization works in web3 systems, a16z crypto said.","The venture firm argued that regulatory frameworks should include a \"principles-based analysis\" that considers whether or not the very structure of a given platform or protocol has already mitigated possible risks. More specifically, a16z crypto said that regulations should not unnecessarily hinder a project from decentralizing.","\"We enthusiastically embrace the UK's approach for a 'proportionate and focused, agile and flexible,'\"&nbsp;a16z crypto policy head <a href=\"https:\/\/a16z.com\/author\/brian-quintenz\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Brian Quintenz<\/a> <a href=\"https:\/\/twitter.com\/BrianQuintenz\/status\/1653023839172050945\" data-v-f87c67ca=\"\">wrote on Twitter<\/a>. \"The UK’s suggested approach looks to ensure similar regulatory outcomes for crypto and doesn’t assume that superficially related activities automatically create the same legacy financial risks and require the exact same regulatory rules.\"","Quintenz said that rules that allowed for free token distributions by protocols looking to achieve decentralization would appeal to developers.&nbsp;","","","<a href=\"https:\/\/www.theblock.co\/post\/228847\/a16z-crypto-gensler-spiking-the-regulatory-football\" data-v-f87c67ca=\"\">In remarks last week<\/a>, Quintenz, a former commissioner at the U.S. Commodity Futures Trading Commission, was critical of the piecemeal approach taken by the U.S. Securities and Exchange Commission on the other side of the Atlantic.&nbsp;","\"The SEC’s continued broad and sporadic application of the Howey Test to bring enforcement actions has resulted in significant uncertainty that incentivizes regulatory arbitrage and has a severe economic drag on the entire web3 industry,\" a16z crypto said in the letter, referring to the test the SEC uses to determine whether or not an investment is a security and under its jurisdiction. It said that the uncertainty has increased the risk of asymmetrical information between developers of a project and its users.","\"The U.S. approach is not one that the UK should consider adopting,\" a16z crypto said. \"We believe the UK can successfully adopt a principles-based approach to decentralization that facilitates the broad dissemination of cryptoassets to drive web3 innovation in the UK while prioritizing consumer protection in cryptoasset transactions.\"","","","When it comes to decentralized finance, a16z crypto urged the regulation of DeFi applications and businesses, not protocols or software.","\"DeFi can pose unique risks that existing regulatory frameworks are ill-suited to cover,\" it said. \"For that reason, a bespoke regulatory framework is optimal ... businesses can comprehend and comply with jurisdictional regulations. Globally accessible software cannot.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Brian Quintenz","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Atlantic","content":"LOCATION"},{"type":"Quintenz","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"UK Treasury","content":"ORGANIZATION"},{"type":"U.S. Commodity Futures Trading Commission","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}