{"summary":"Circle&#x27;s Jeremy Allaire says that the programmable wallet launch is just one way the firm is doubling down on web3 services.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244510\/circles-jeremy-allaire-says-web3-is-going-mainstream","publishDate":"2023-08-11T13:06:07","id":9598,"type":null,"title":"Circle&#x27;s Jeremy Allaire says web3 is going mainstream","category":["COMPANIES"],"content":["Circle CEO Jeremy Allaire said Friday that the <a href=\"https:\/\/www.theblock.co\/post\/244176\/circle-banks-on-1-billion-cash-cushion-to-weather-stablecoin-race-bloomberg\" data-v-f87c67ca=\"\">firm<\/a> most known for stablecoins is doubling down on web3 services with the launch of its programmable wallets.&nbsp;","Allaire said the wallet offering is just the first of future additional web3 services that will include forthcoming stablecoin cross-chain payments and a simplified smart contract development platform.&nbsp;","\"We now see that web3 is poised to become mainstream,\" Allaire <a href=\"https:\/\/twitter.com\/jerallaire\/status\/1690027724688224256?s=20\" data-v-f87c67ca=\"\">wrote<\/a> in a thread on the social media platform formally known as Twitter.","\"It seems clear that nearly every major consumer internet company, brand and enterprise will start integrating Web3 primitives into their services. And nearly every fintech, payment company and financial institution will use Web3 for tokenization, payments, and financial apps,\" he added. \"To get there, we need way more developers who can build web3 apps.\"","Circle quietly released developer-friendly <a href=\"https:\/\/www.theblock.co\/post\/238139\/circle-quietly-launches-wallet-as-a-service-developer-platform\" data-v-f87c67ca=\"\">programmable<\/a> wallets in early July in an attempt to build out \"wallets-as-a-service.\" The wallets can use any blockchain to give customers easier access to cryptocurrencies, NFTs and other digital assets.","Circle's focus on new services comes amid a challenging time for the firm's juggernaut stablecoin USDC, which has seen supply dip 43% since the beginning of 2023.","The company is banking on <a href=\"https:\/\/www.theblock.co\/post\/244176\/circle-banks-on-1-billion-cash-cushion-to-weather-stablecoin-race-bloomberg\" data-v-f87c67ca=\"\">$1 billion<\/a> in cash reserves to help it get through the coming period of increased competition as payments giant PayPal enters the mix.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Allaire","content":"PERSON"},{"type":"Allaire","content":"PERSON"},{"type":"USDC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"43%","content":"PERCENT"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"July","content":"DATE"},{"type":"fintech","content":"ORGANIZATION"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}