{"summary":"According to the report, from 2017 to 2021 criminal groups used Binance to process at least $2.35 billion worth of illicit money.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150391\/how-north-korean-hackers-used-binance-to-launder-stolen-funds","publishDate":"2022-06-06T17:21:38","id":9599,"type":null,"title":"Reuters report says Lazarus Group used Binance to launder stolen funds","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">In September 2020, hackers from the North Korean Lazarus Group broke into Slovakian crypto exchange Eterbase and stole currency worth roughly $5.4 million. Using only encrypted email addresses, the hackers opened at least two dozen anonymous accounts on Binance and used them to “convert the stolen funds and obscure the money trail,” according to a new Reuters investigation.<\/span>","<span data-v-f87c67ca=\"\">According to the report, the interactions between the exchange and the well-known state-sponsored hacking group are part of a much larger picture of illicit activity. From 2017 to 2021, Binance was used to process transactions totaling at least $2.35 billion associated with hacks, investment frauds and illegal drug sales, Reuters said.<\/span>","<span data-v-f87c67ca=\"\">Lazarus group, which was sanctioned by the US Government in 2019 over cyberattacks designed to support North Korea’s weapons program, made headlines again in April when the US government <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/141985\/us-government-connects-north-korean-hacking-group-with-last-months-600-million-ronin-exploit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">drew a connection <\/span><\/a><span data-v-f87c67ca=\"\">between its actions and nearly $600 million stolen from Axie Infinity's Ronin sidechain network. <\/span><span data-v-f87c67ca=\"\">Blockchain analytics firm Chainalysis estimates that by 2020 Lazarus had stolen crypto worth $1.75 billion.<\/span>","<span data-v-f87c67ca=\"\">In response to Reuters’ investigation, Binance spokesperson Patrick Hillman claimed that accounts holding nearly $5.8 million used during the Ronin attack have been identified and frozen by Binance’s security team.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Many Binance team members were involved in the initial investigation,” a statement released by the company claimed. “We proactively share intelligence with law enforcement to map out North Korea’s modus operandi globally.”<\/span>","<span data-v-f87c67ca=\"\">Referring to the Eterbase attack, Binance stated that “we fully cooperated with requests received from Slovak authorities.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Binance strengthened its know-your-customer requirements in August 2021, and data from analytics firm Crystal Blockchain shows that flows of illicit funds have dropped significantly since then. However, with millions already stolen or used for illicit activity on Binance, it’s unclear what is being done to support victims of theft or fraud.<\/span>","While consumers in many countries can call on banks to freeze or reimburse stolen funds, Binance explains on its website that law enforcement must be directly involved and victims must sign non-disclosure agreements as a condition for freezing assets<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Crystal Blockchain","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"$2.35 billion","content":"MONEY"},{"type":"September 2020","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"August 2021","content":"DATE"},{"type":"$5.8 million","content":"MONEY"},{"type":"$5.4 million","content":"MONEY"},{"type":"$600 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Patrick Hillman","content":"PERSON"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"$1.75 billion","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"North Korean Lazarus Group","content":"ORGANIZATION"},{"type":"US Government","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE","HACKS"],"authors":["Sam Venis","The Block"]}