{"summary":"Three months ago, an NFT owner took out a 3.5 ETH loan and put up one of their NFTs as collateral.\nSince then, the value of the NFT has shot up to $340,000.\nBut they failed to repay the loan and the NFT was handed over to the lender.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/120020\/defi-meets-nfts-how-a-lender-received-a-340000-nft-after-a-loan-wasnt-repaid","publishDate":"2021-10-11T07:51:31","id":96,"type":null,"title":"How a lender received a $340,000 NFT after a loan wasn&#x27;t repaid","category":["DeFi"],"content":["In a combination of crypto's two biggest buzzwords, Ethereum innovators are starting to combine DeFi with NFTs — and it just <a href=\"https:\/\/discord.com\/channels\/677285101998178387\/715477898265624626\/896855938869362749\" data-v-f87c67ca=\"\">lost someone<\/a> a $340,000 NFT.","DeFi stands for decentralized finance and refers to any kind of financial tool that's built on a decentralized platform, while NFTs are tokens that represent images (and can have <span data-dobid=\"hdw\" data-v-f87c67ca=\"\">exorbitant<\/span> values).","In this case, traders have started putting up NFTs as collateral when borrowing money using DeFi lending platforms. The idea goes: you could put up an NFT worth 10 ETH, for example, and that would enable you to borrow 5 ETH as a loan. And if you don't pay back the loan in time, then you lose the NFT.","That's exactly what happened here.","Around three months ago, an NFT collector borrowed 3.5 ETH (currently worth $12,600) on the NFTfi platform. To make the loan, they put up an \"Elevated Deconstructions\" NFT — part of the Art Blocks Curated set — which were selling for about 11 ETH ($39,600) at the time. Although the last sale price for that NFT was 3.25 ETH ($11,700), which was below the value of the loan.","Over that timespan, the value of these NFTs shot up. This was largely triggered by <a href=\"https:\/\/twitter.com\/punk6529\/status\/1437905960115261444\" data-v-f87c67ca=\"\">endorsements<\/a> from Punk 6529 (a Twitter account run by the owner of that CryptoPunk) and Cozomo de' Medici, a pseudonymous art collector. Not before long they were selling for 85 - 200 ETH ($306,000 - $720,000).","Yesterday, the 3.5 ETH loan ended and the borrower had not repaid the loan during those three months. As a result, the collateral was passed to the lender, who ended up losing their 3.5 ETH but gaining the Elevated Deconstructions NFT.","The current floor price— the cheapest available NFT on the market in this collection — is 95 ETH ($342,000). In theory this puts the lender up about $329,000. Although, despite the high floor price, this doesn't necessarily mean the lender can sell the NFT for this much.","In fact, there hasn't been a sale of an Elevated Deconstructions NFT for 18 days. As a result, it's possible that the borrower chose to forgoe on the loan to get some immediate liquidity. This is unlikely, however, because they could have dropped the NFT price significantly and likely still sold for more than 3.5 ETH.","A curious twist to this story is the fact that this NFT has been put up as collateral twice in its history — and both times, the borrower has defaulted on it.","","","As the historical data shows, this NFT was part of a loan that was defaulted on in April over a 3 ETH ($10,800) loan, which is how the previous owner obtained it before giving it up over the weekend.","The previous owner has been involved in a couple of other NFT-backed loans. In April, they tasted their first liquidation, receiving an Arago NFT when a 3 ETH loan was not repaid. In May, they had 1 ETH returned (with interest) on a loan they gave out that was backed by a Decentraland parcel of land.","But since they took out the sale at the end of June, they haven't been particularly active. According to <a href=\"https:\/\/etherscan.io\/address\/0x022eb305961429bad9e95f7760b9bdd84578aace\" data-v-f87c67ca=\"\">blockchain records<\/a>, the wallet's last transaction was 58 days ago.","<em data-v-f87c67ca=\"\">H\/T to @<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">aradtski for highlighting this loan on Twitter.<\/span><\/em>"],"hashtag":[]}