{"summary":"Bitcoin miners in one of the major economic and technological development zones in China&#x27;s Xinjiang province have been ordered to shut down.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107707\/xinjiang-bitcoin-miner-shut-crackdown-china","publishDate":"2021-06-09T04:22:06","id":9606,"type":null,"title":"Some bitcoin miners in Xinjiang have been ordered to shut down","category":["CHINA"],"content":["<em data-v-f87c67ca=\"\">UPDATE (15:20 UTC time June 9): The Chinese provincial government of Qinghai also issued a document to local officials for closing down crypto mining operations in the region on June 9, based on a government document <a href=\"https:\/\/twitter.com\/WolfieZhao\/status\/1402644575416684547\" data-v-f87c67ca=\"\">seen by The Block.<\/a><\/em>","<em data-v-f87c67ca=\"\">According to data from the Cambridge Center for Alternative Finance, bitcoin’s hash rate in Qinghai only accounted for <a href=\"https:\/\/cbeci.org\/mining_map\" data-v-f87c67ca=\"\">0.26%<\/a> of the network’s total as of April 2020 whereas the computing power located in Xinjiang was more than 40%.<\/em>","Bitcoin miners in one of the major economic and technological development zones in China's Xinjiang province have been ordered to shut down their operations immediately.","The Reform and Development Commission in the Changji Hui Autonomous Prefecture in Xinjiang issued a notice on Wednesday to its subordinate government officials in the <a href=\"http:\/\/zd.cj.cn\/\" data-v-f87c67ca=\"\">Zhundong Economic Technological Development Park.<\/a> According to the notice seen and verified by The Block, officials in the development park have been instructed to shut down all crypto mining activities under their administration by 2:00 pm China time on Wednesday.","The park is a 15,500 square km area home to a variety of coal production industries including coal-based power plants and industrial factories. It also houses some of the largest bitcoin mining facilities in the country due to the high capacity of fossil fuel energy.","The instruction was based on the high-level bitcoin trading and <a href=\"https:\/\/www.theblockcrypto.com\/post\/105814\/china-bitcoin-miners-brace-regulatory-uncertainty\" data-v-f87c67ca=\"\">mining crackdown comment<\/a> brought up during the China State Council meeting last month, the notice said.","The notice cited the \"<a href=\"http:\/\/lawinfochina.com\/display.aspx?id=23537&amp;lib=law#:~:text=Measures%20for%20the%20Energy%20Conservation%20Examination%20of%20Fixed%2DAsset%20Investment%20Projects\" data-v-f87c67ca=\"\">Measures for the Energy Conservation Examination of Fixed-Asset Investment Projects<\/a>\" passed by China's National Reform and Development Commission as the relevant ordinance for government officials to carry out the order.","Though it is hard to pinpoint how much energy capacity exactly is powering up bitcoin mining operations in the Changji Prefecture, the Zhundong development park is known for being a major bitcoin mining hub in Xinjiang with predominantly fossil fuel energy.","Xinjiang's measures on Wednesday may impose a more serious impact on bitcoin's hash rate than the ones issued by its counterpart in Inner Mongolia.","Although both provinces are mostly dependent on fossil fuel energy, bitcoin mining operations in Xinjiang have always outrun those in Inner Mongolia by scale. Further, bitcoin miners in Inner Mongolia have already been moving out of the region since early March.","Bitcoin's total seven-day average computing power has seen a slight growth to 150 exahashes per second (EH\/s) since the last mining difficulty adjustment that happened on May 29.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","China's State Council, the central government cabinet, made a comment about cracking down on bitcoin trading and mining in a meeting last month.","The concern was due to a conclusion that bitcoin mining's growth in China was behind the rising demand for coal in certain parts of China, according to a Bloomberg report. The government in Inner Mongolia reacted almost immediately with plans to enforce eight measures to drive out bitcoin mining operations in the area.&nbsp;","Meanwhile, the government in Sichuan, another major bitcoin mining hub known for its cheap hydro-electricity, hosted a meeting last week to gauge how shutting down bitcoin miners would affect the local hydropower economy. No immediate plan was announced during the meeting.","The looming bitcoin mining crackdown in China has so far created <a href=\"https:\/\/www.theblockcrypto.com\/daily\/107104\/china-bitcoin-miners-state-council-crackdown\" data-v-f87c67ca=\"\">as much a challenge as an opportunity<\/a> for overseas bitcoin mining farms as Chinese investors have been turning to back-up plans.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sichuan","content":"LOCATION"},{"type":"April 2020","content":"DATE"},{"type":"Xinjiang","content":"LOCATION"},{"type":"National Reform and Development Commission","content":"ORGANIZATION"},{"type":"May 29","content":"DATE"},{"type":"Changji Hui Autonomous Prefecture","content":"LOCATION"},{"type":"Changji Prefecture","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"June 9","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Qinghai","content":"LOCATION"},{"type":"Reform and Development Commission","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Cambridge Center for Alternative Finance","content":"ORGANIZATION"},{"type":"China State Council","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Zhundong Economic Technological Development Park","content":"ORGANIZATION"},{"type":"State Council","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Energy Conservation Examination of Fixed","content":"ORGANIZATION"},{"type":"Inner Mongolia","content":"LOCATION"},{"type":"0.26%","content":"PERCENT"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}