{"summary":"By introducing the new category, crypto firms will be able to form industry groups and develop self-supervisory rules, Taiwan’s Ministry of Economic Affairs told The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246156\/taiwan-proposes-new-crypto-business-category-for-potential-industry-associations","publishDate":"2023-08-18T05:11:10","id":9618,"type":null,"title":"Taiwan proposes new crypto business category for potential industry associations","category":["ASIA"],"content":["Taiwan has proposed adding a new business category in relevant regulations, which may enable cryptocurrency-related companies to establish industry associations. This move is aimed at fostering the development of self-regulatory guidelines.","The Ministry of Economic Affairs <a href=\"https:\/\/domsba.moea.gov.tw\/MOADoms\/board\/view.htm?action=preview&amp;boardId=1120817142135424&amp;t=1692337709258\" data-v-f87c67ca=\"\">announced<\/a> Thursday that it has drafted an amendment to the Standards of Classification of Commercial Group regulations to add a category for digital asset services.","Today, an official from the economic ministry informed The Block that the newly proposed business category outlines the scope of operations within the cryptocurrency sector. This includes activities such as exchanging cryptocurrency for legal tender or other digital tokens, facilitating the transfer of cryptocurrencies, providing services for crypto storage or management, and offering assistance related to the issuance or sale of cryptocurrency.","The official added that crypto firms can form industry associations once the business category is added to relevant regulations. The ministry is soliciting public opinion and will finalize the amendment with the Ministry of the Interior in mid- or late-October.","Taiwan has required virtual asset services providers (VASPs) to comply with its anti-money laundering laws since the Financial Supervisory Commission introduced anti-money laundering rules in July 2021. Otherwise, the industry remains largely unregulated in the country.","By setting up an industry association, crypto firms can then come up with self-supervisory rules.","Binance, the world’s largest cryptocurrency exchange, is <a href=\"https:\/\/law.fsc.gov.tw\/LawContent.aspx?id=GL003218&amp;kw=%e8%99%9b%e6%93%ac%e9%80%9a%e8%b2%a8%e5%b9%b3%e5%8f%b0%e5%8f%8a%e4%ba%a4%e6%98%93%e6%a5%ad%e5%8b%99%e4%ba%8b%e6%a5%ad%e9%98%b2%e5%88%b6%e6%b4%97%e9%8c%a2%e5%8f%8a%e6%89%93%e6%93%8a%e8%b3%87%e6%81%90%e8%be%a6%e6%b3%95\" data-v-f87c67ca=\"\">applying<\/a> to get registered for AML compliance under the FSC, The Block reported last week.","Meanwhile, Taiwan’s FSC, which was only appointed in March as the main regulator overseeing the crypto industry, is currently formulating a broader set of guidelines on trading and payments related to cryptocurrencies for VASPs, the regulator <a href=\"https:\/\/www.fsc.gov.tw\/ch\/home.jsp?id=2&amp;parentpath=0&amp;mcustomize=news_view.jsp&amp;dataserno=202303300001&amp;dtable=News\" data-v-f87c67ca=\"\">said<\/a>.&nbsp;","An FSC official told The Block last week that the agency plans to publish the VASP guidelines by the end of September.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"VASP","content":"ORGANIZATION"},{"type":"Financial Supervisory Commission","content":"ORGANIZATION"},{"type":"Taiwan","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"FSC","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Standards of Classification of Commercial Group","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"July 2021","content":"DATE"},{"type":"The Ministry of Economic Affairs","content":"ORGANIZATION"},{"type":"Ministry of the Interior","content":"ORGANIZATION"}],"hashtag":["ASIAN REGULATION","BINANCE"],"authors":["Timmy Shen","The Block"]}