{"summary":"After days of rumors surrounding layoffs at Huobi, the Singapore-based crypto exchange confirmed it would cut about 20% of its overall staff.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199687\/huobi-cut-staff-20","publishDate":"2023-01-06T03:22:52","id":9619,"type":null,"title":"Crypto exchange Huobi says it will cut staff by 20%","category":["EXCHANGES"],"content":["After days of rumors surrounding layoffs at Huobi, the Singapore-based crypto exchange confirmed it would cut about 20% of its overall staff.","“The planned layoff ratio is about 20%, but it is not implemented now. With the current state of the bear market, a very lean team will be maintained going forward,” a Huobi spokesperson told The Block, adding: “The personnel optimization aims to implement the brand strategy, optimize the structure, improve efficiency and return to the top three.”","The confirmation comes roughly a week after journalist Colin Wu first <a href=\"https:\/\/twitter.com\/WuBlockchain\/status\/1608774459124781059?s=20&amp;t=c99c55iaBDTgpAm7nskqTg\" data-v-f87c67ca=\"\">reported<\/a> layoffs at the crypto exchange on Dec. 30. More recently, Wu said that Huobi had moved to <a href=\"https:\/\/twitter.com\/WuBlockchain\/status\/1610615698254102529?s=20&amp;t=c99c55iaBDTgpAm7nskqTg\" data-v-f87c67ca=\"\">enforce<\/a> salary payments in stablecoins instead of fiat currency, sparking protests from staff.","A recent internal Huobi email — translated into English and obtained by The Block — states that all domestic salaries will be paid in USDT, with staff required “to register a Huobi account to receive salary.” It further indicates that year-end bonuses have been canceled along with various other benefits, including welfare subsidies. Huobi’s spokesperson said that it is incorrect that bonuses and benefits have been cut, however.&nbsp;","Huobi was acquired by About Capital Management’s M&amp;A fund on Oct. 7. Days later, Tron founder Justin Sun was named an advisor to Huobi. Speculation abounded that he was, in fact, the actual buyer behind the About Capital deal, but Sun repeatedly <a href=\"https:\/\/www.theblock.co\/post\/175867\/justin-sun-denies-being-real-buyer-of-huobi-stake-sale-exclusive\" data-v-f87c67ca=\"\">denied<\/a> those claims in email correspondence with The Block. In late November, Sun <a href=\"https:\/\/www.theblock.co\/post\/188983\/huobi-eyes-caribbean-hub-as-part-of-post-acquisition-plans\" data-v-f87c67ca=\"\">unveiled<\/a> a plan to reestablish Huobi as one of the world’s biggest exchanges — with part of it hinging on establishing a hub in the Caribbean.","“The new shareholders have taken over so far, and in just three months, have slowly reversed the declining trend of the Huobi, established a new organizational structure, as well as adjusted the business departments, and partially optimized for the personnel,” Huobi’s spokesperson said, adding that the exchange is currently adding 390,000 new users monthly.","Twitter is currently awash with <a href=\"https:\/\/twitter.com\/search?q=huobi%20communication&amp;src=typeahead_click&amp;f=top\" data-v-f87c67ca=\"\">rumors<\/a> that Huobi has now closed down internal communication and feedback channels — which&nbsp;Huobi’s spokesperson denied. As it embarks on a global expansion plan, Huobi’s spokesperson said the exchange will “fully respect the legitimate demands of local employees, and continue to provide industry-competitive incentives and treatment for outstanding talent.”&nbsp;","<em data-v-f87c67ca=\"\">Story updated to reflect Huobi’s comments on bonus and benefit cuts, and communication channel closures.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dec. 30","content":"DATE"},{"type":"Colin Wu","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"Oct. 7","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Wu","content":"PERSON"},{"type":"About Capital Management","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Caribbean","content":"LOCATION"},{"type":"Tron","content":"ORGANIZATION"},{"type":"Huobi","content":"LOCATION"},{"type":"Huobi","content":"PERSON"},{"type":"USDT","content":"LOCATION"}],"hashtag":["JUSTIN SUN"],"authors":["Ryan Weeks","The Block"]}