{"summary":"The decision was due to difficulty scaling and a tough regulatory environment for cryptocurrency projects. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258016\/reddit-plans-to-sunset-its-blockchain-based-reward-service-community-points","publishDate":"2023-10-17T15:22:55","id":9622,"type":null,"title":"Reddit plans to sunset its blockchain-based reward service Community Points","category":["COMPANIES"],"content":["Social media platform Reddit plans to pull the plug on its blockchain-based reward service Community Points.&nbsp;","\"The regulatory environment has added to scalability limitations. Though the moderators and communities that supported Community Points have been incredible partners, as it's evolved, the product is no longer set up to scale,\" Reddit wrote in a message reviewed by The Block.&nbsp;","\"Moving away from Points allows us to invest in products that provide value to more Redditors,\" it added. \"We’ve also launched, or are actively investing in, several products that accomplish what the Community Points program was aimed at.\"","Reddit will sunset Community Points by Nov. 8.&nbsp;","Community Points first launched in 2020 as a way to reward users for constructive activity in certain subreddits, such as <a href=\"https:\/\/www.theblock.co\/post\/126842\/reddit-is-bringing-its-tokenized-community-points-to-more-subreddits\" data-v-f87c67ca=\"\">receiving<\/a> a large amount of upvotes for a comment or post, with the goal of augmenting user engagement and communities.","The points users earned were ERC-20 tokens stored in the platform's crypto wallet called Reddit Vault. Redditors could then spend their Community Points on perks such as emojis or badges, after which the points would be burned.&nbsp;","Though Community Points launched on Ethereum, the service <a href=\"https:\/\/www.theblock.co\/post\/162299\/reddits-community-points-are-migrating-to-arbitrum-nova\" data-v-f87c67ca=\"\">migrated<\/a> to the Layer 2 Arbitrum Nova in August of 2022 to lower transaction costs and improve scalability, The Block previously reported.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit Vault","content":"LOCATION"},{"type":"Arbitrum Nova","content":"ORGANIZATION"},{"type":"Reddit","content":"LOCATION"},{"type":"Though Community Points","content":"ORGANIZATION"},{"type":"Community Points","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Points","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"20","content":"DATE"},{"type":"Nov. 8","content":"DATE"},{"type":"August of 2022","content":"DATE"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}