{"summary":"Lightspeed Faction has launched a $285 million inaugural fund to invest in early-stage crypto and blockchain startups.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262389\/lightspeed-faction-crypto-venture-fund","publishDate":"2023-11-09T09:54:25","id":9626,"type":null,"title":"Lightspeed Faction launches $285 million inaugural crypto venture fund","category":["VENTURE CAPITAL"],"content":["Lightspeed Faction, a crypto-focused venture capital firm that was launched last year in a joint venture with Lightspeed Venture Partners, launched its inaugural fund worth $285 million.","Faction will primarily invest in early-stage crypto and blockchain startups, supporting their seed and Series A funding rounds, the firm said Thursday. It is open to investing across crypto verticals, with a focus on those using blockchain technology to deliver real utility to users and businesses.","\"We are very agnostic when it comes to investing in specific verticals of the industry,\" Samuel Harrison, co-founder and managing partner of Lightspeed Faction, told The Block. \"We are looking for projects we truly believe can make a positive impact on the ecosystem and drive blockchain innovation forward. Whether that be in DeFi, infrastructure, NFTs, or others, we are willing to do our due diligence and ensure we are representing the best industry projects without honing in on a specific vertical.\"","Lightspeed Venture Partners was an investor in the FTX crypto exchange that filed for bankruptcy last year in November. But Harrison said, \"Faction, our team and I personally did not invest in FTX. We passed on investing in FTX and all affiliates.\"","Lightspeed Faction was <a href=\"https:\/\/www.theblock.co\/post\/157116\/lightspeed-raises-over-7-billion-across-four-funds-launches-new-crypto-native-team\" data-v-f87c67ca=\"\">launched<\/a> in July 2022, and the fund had its first close at that time and the final close in July of this year, Banafsheh Fathieh, co-founder and general partner of Lightspeed Faction, told The Block. The original target for the fund was $250 million, Fathieh said, suggesting it was oversubscribed.","The fund's launch comes with a recent rally in the crypto market, although some analysts <a href=\"https:\/\/www.theblock.co\/post\/262324\/jpmorgan-crypto-rally-looks-overdone\" data-v-f87c67ca=\"\">believe<\/a> the rally may be overdone. Faction, however, is a \"long-term\" venture investor, \"so hypothesizing on short-term market movements is not where we spend a lot of our time,\" Fathieh said. \"We continue to believe that crypto is a key, generational technology trend, and its impact will be vast in the decades to come.\"","Faction has already deployed roughly 20% of the $285 million fund, Harrison noted. Its investments include Crossmint, Lens, Matter Labs, Narya.ai, and Skip.money. The firm aims to fully deploy the fund in around three-plus years, but it won't rush to meet that timeframe, Harrison said, adding that it will invest in both equity and token projects.","The fund's average check size ranges from $5-10 million, but it is \"very flexible and can go outside that range if needed, especially if we are entering into any mid-stage funding rounds,\" Fathieh said. Besides providing capital, Faction will also guide projects in areas such as tokenomics and business scaling.","While Faction shares some resources with Lightspeed Venture Partners, it has its dedicated limited partner base and complete investment discretion over the fund. LPs of the fund include fund of funds, endowments, family offices, and corporates both inside and outside the crypto industry, Fathieh noted.","Earlier today, Standard Chartered bank's SC Ventures and SBI Holdings also <a href=\"https:\/\/www.theblock.co\/post\/262317\/standard-chartered-unit-sbi-holdings-crypto?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">announced<\/a> a $100 million vehicle to invest in crypto startups.","<em data-v-f87c67ca=\"\">(Updates with additional comment from Samuel Harrison regarding FTX)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fathieh","content":"PERSON"},{"type":"Harrison","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$250 million","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Samuel Harrison","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"Lightspeed Faction","content":"ORGANIZATION"},{"type":"Crossmint","content":"PERSON"},{"type":"July of this year","content":"DATE"},{"type":"SBI Holdings","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Matter Labs","content":"ORGANIZATION"},{"type":"$5","content":"MONEY"},{"type":"Faction","content":"ORGANIZATION"},{"type":"SC Ventures","content":"ORGANIZATION"},{"type":"Banafsheh Fathieh","content":"PERSON"},{"type":"Lightspeed Venture Partners","content":"ORGANIZATION"},{"type":"$285 million","content":"MONEY"},{"type":"July 2022","content":"DATE"}],"hashtag":["NEW VC FUNDS"],"authors":["Yogita Khatri","The Block"]}