{"summary":"Antinalysis is a new tool that lets users check which bitcoin addresses may be linked to criminal activity.\nIt runs on Tor and was created by one of the developers of the Incognito Market.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/114461\/cybercriminals-turning-blockchain-analytics-advantage","publishDate":"2021-08-13T07:01:06","id":963,"type":null,"title":"Cybercriminals are turning blockchain analytics to their advantage","category":["Hacks"],"content":["Dark web users have developed a new tool to test whether funds will be snared by anti-money laundering checks.","Known as Antinalysis, the tool can be used by cybercriminals to identify which bitcoin addresses may be linked to criminal activity.","Elliptic, the blockchain analytics company, highlighted the existence of the new tool in <a href=\"https:\/\/www.elliptic.co\/blog\/cybercriminals-have-built-their-own-blockchain-analytics-tool\" data-v-f87c67ca=\"\">a blog post<\/a> published this morning. Elliptic is one of several well-capitalized companies that trace illicit funds using blockchain analysis, making it tricky for criminals to launder stolen funds.","“Antinalysis seeks to help crypto launderers to avoid this, by giving them a preview of what a blockchain analytics tool will make of their bitcoin wallet and the funds it contains,” wrote Elliptic co-founder Tom Robinson, in the blog post.","The Antinalysis site runs on Tor, an anonymous version of the web; charges $3 per bitcoin address scanned; and, according to Robinson, “claims to offer highly accurate results.” It was created by the one of the developers of Incognito Market, a darknet marketplace focused on the sale of narcotics.","Despite its well-founded reputation as a popular store of value among criminals, cryptocurrencies have become steadily less effective as a medium for money laundering — in large part thanks to the likes of Elliptic and Chainalysis, which between them have <a href=\"https:\/\/www.theblockcrypto.com\/post\/70627\/blockchain-analytics-firm-chainalysis-adds-13-million-to-its-series-b-funding-round\" data-v-f87c67ca=\"\">raised hundreds of millions of dollars<\/a>.","This trend is underscored by the massive recent seizures announced by law enforcement agencies around the world.","In a recent example, police in the United Kingdom announced <a href=\"https:\/\/www.theblockcrypto.com\/post\/111112\/uk-police-seize-250-million-worth-of-cryptocurrency\" data-v-f87c67ca=\"\">a $250 million coup<\/a> as part of an ongoing investigation into international money laundering. Cybercriminals are consequently turning to cryptocurrencies promising greater anonymity, <a href=\"https:\/\/www.ft.com\/content\/13fb66ed-b4e2-4f5f-926a-7d34dc40d8b6\" data-v-f87c67ca=\"\">such as Monero<\/a>.","The news that blockchain analysis is now being turned to the advantage of criminals is, therefore, a potential cause for concern. But Elliptic’s Robinson appeared to shrug it off.","“Elliptic’s own evaluation of the results returned [by Antinalysis] for a range of bitcoin addresses shows that it was poor at detecting links to major darknet markets and other criminal entities. This is perhaps not surprising — providing accurate blockchain analytics requires significant investment in technology and data collection, over long periods of time,” he wrote in the blog post.","One person involved in crypto law enforcement told The Block that while Antinalysis may pose issues for police on the trail of stolen digital assets, it is “only as good as the dataset.”"],"hashtag":["BITCOIN"]}