{"summary":"The exchange may have failed to recognize that it was minting XEN tokens on behalf of the attacker, per analysts. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176923\/someone-abused-ftxs-withdrawal-fee-subsidy-to-mint-70000-of-xen","publishDate":"2022-10-13T11:28:09","id":9632,"type":null,"title":"Someone abused FTX’s withdrawal fee subsidy to mint $70,000 of XEN","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">Someone has taken advantage of crypto exchange FTX’s willingness to pay blockchain transaction fees on its users’ behalf. They did so to mint more than $70,000 of XEN tokens, leaving the exchange with a $100,000 bill in subsidized transaction fees, according to a <\/span><a href=\"https:\/\/mirror.xyz\/x-explore.eth\/M2BJgQJaj2JK0mAO9OecByja3tU7mKXbHR_Agjs-MjA\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report<\/span><\/a><span data-v-f87c67ca=\"\"> from a security analyst at X-explore.<\/span>","<span data-v-f87c67ca=\"\">This is a rare case. It only happened because a recently launched token, called XEN, is free to mint as long as the underlying blockchain’s transaction fees are paid. Rather than pay for the transaction fees themselves, a user managed to trick FTX’s systems to do so on their behalf.<\/span>","<span data-v-f87c67ca=\"\">FTX processes ETH withdrawals for free and pays its users' transaction fee for them from its own hot wallet address. This lets customers send ether and other tokens to their wallets without worrying about fees.&nbsp;<\/span>","The user made this happen by withdrawing funds to call a <a href=\"https:\/\/etherscan.io\/address\/0xcba9b1fd69626932c704dac4cb58c29244a47fd3\" data-v-f87c67ca=\"\">smart contract<\/a> function, instead of just to a normal crypto address. This contract was designed in a way to loop the minting process and transfer the minted tokens to the said <a href=\"https:\/\/etherscan.io\/address\/0x1d371cf00038421d6e57cfc31eeff7a09d4b8760#tokentxns\" data-v-f87c67ca=\"\">user's address<\/a>, X-Explore told The Block.&nbsp;","<span data-v-f87c67ca=\"\">The person was able to carry out the mint primarily because FTX allows users to use up 500,000 gas units —a metric used for withdrawal fees —&nbsp; for withdrawal requests on Ethereum. Normally simple ether transfers only consume 21,000 gas units, but more complex on-chain activities like calling smart contract functions will need additional fees, which were covered by FTX in this incident. FTX does not impose a gas limit on transactions while also not charging a withdrawal fee. <\/span>","<span data-v-f87c67ca=\"\">The exchange failed to recognize that it was minting XEN tokens on behalf of the user, mistaking them for simple withdrawal requests, per analysts.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Blockchain security firm called BlockSec corroborated X-Explore’s findings. Its independent analysis showed that FTX exchange paid more than 100 ether ($120,000) for the user's minting of XEN tokens, BlocSec told The Block.<\/span>","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">We have reached out to FTX and will update this article should we hear back.<\/span><\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"$100,000","content":"MONEY"},{"type":"$70,000","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"BlockSec","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$120,000","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Vishal Chawla","The Block"]}