{"summary":"Retail traders and investors were behind this summer&#x27;s unusual liveliness.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116778\/retail-traders-drove-activity-in-stocks-and-crypto-this-summer-according-to-jpmorgan","publishDate":"2021-09-07T12:26:59","id":9634,"type":null,"title":"Retail traders drove activity in stocks and crypto this summer, according to JPMorgan","category":["BITCOIN"],"content":["Retail trading activity fueled the ascent of crypto and US equity markets over the course of the summer, according to new analysis penned by JPMorgan's Nikolaos Panigirtzoglou.","Retail investor flows into exchange-traded funds and US stocks hit a near-record high of $16 billion during July, with flows remaining high \"at around $13 billion, well above the previous record high of $10 billion seen last June,\" according to an indicator built by JPMorgan to track the retail market. Typically, the summer months are quiet for the markets as Wall Streeters go on vacation.","","","Flows into exchange-traded funds and mutual funds also illustrate the outsized presence of retail traders, according to the bank.","Thus far, equity funds have seen nearly $700 billion worth of flows or $1 trillion annualized, which represents a 58% increase relative to 2017. That's been a boon for the market with the S&amp;P 500 Index surging by more than 18% over the last 6 months.&nbsp;","\"As long as this retail flow continues, the equity market will keep going up,\" Panigirtzoglou wrote.","A similar story is playing out in the crypto market, according to JPMorgan.","\"The strength of the retail flow over the past month has not been confined to equities,\" according to Panigirtzoglou. \"Investors have been also bolstering crypto markets during August.\"","The note added:","\"The August rally in non-fungible tokens (NFTs) and the pickup in DeFi activity have helped not only Ethereum but also alternative cryptocurrencies that facilitate or plan to facilitate smart contracts such as Solana, Binance Coin and Cardano.\"","Data from The Block shows that crypto exchange web traffic rebounded to 408.2 million visits in August, an increase of 27.8% month-over-month.&nbsp;","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$700 billion","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"Cardano","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$16 billion","content":"MONEY"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"18%","content":"PERCENT"},{"type":"Nikolaos Panigirtzoglou","content":"ORGANIZATION"},{"type":"58%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"27.8%","content":"PERCENT"},{"type":"$1 trillion","content":"MONEY"},{"type":"summer","content":"DATE"},{"type":"Solana","content":"LOCATION"},{"type":"Binance Coin","content":"ORGANIZATION"},{"type":"$13 billion","content":"MONEY"},{"type":"Panigirtzoglou","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["JPMORGAN"],"authors":["Frank Chaparro","The Block"]}