{"summary":"Federal Deposit Insurance Corporation Vice Chair Travis Hill sharply criticized the SEC&#x27;s handling of SAB 121 during a speech on Monday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281780\/fdic-vice-chair-knocks-secs-crypto-accounting-bulletin-saying-it-sharply-departs-from-current-custodian-practices","publishDate":"2024-03-11T14:44:14","id":9636,"type":null,"title":"FDIC Vice Chair knocks SEC&#x27;s crypto accounting bulletin, saying it &#x27;sharply departs&#x27; from current custodian practices","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Federal Deposit Insurance Corporation Vice Chair Travis Hill sharply criticized the Securities and Exchange Commission's handling of a controversial crypto accounting guidance during a speech on Monday.<\/span>","Hill, the FDIC's second-in-command, said that the SEC's Staff Accounting Bulletin 121, or SAB 121, diverges from current custodian practices. Released in March 2022, the bulletin requires firms <span class=\"s2\" data-v-f87c67ca=\"\">that custody<\/span> cryptocurrencies <span class=\"s2\" data-v-f87c67ca=\"\">to record on their balance sheets their customers' crypto holdings as liabilities.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"This treatment sharply departs from how custodians account for all other assets held in custody, which are generally held off balance sheet and treated as the property of the customer, not the custodian,\" Hill said on Monday at an event hosted by the Mercatus Center about tokenization. Hill was nominated as a Republican to the FDIC in 2022.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The bulletin has drawn <\/span><span class=\"s4\" data-v-f87c67ca=\"\">controversy over the past year over concerns in the crypto industry that it could prevent banks from custodying digital assets. Lawmakers <a href=\"https:\/\/www.theblock.co\/post\/280000\/house-finance-committee-votes-to-move-forward-with-measure-to-overturn-secs-custody-bulletin\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">advanced<\/span><\/a> a resolution last month to rescind the bulletin after a Congressional <a href=\"https:\/\/www.theblock.co\/post\/260282\/congressional-watchdog-says-sec-needs-lawmaker-approval-before-moving-forward-with-controversial-bulletin\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">watchdog<\/span><\/a> said the SEC needed congressional approval before moving forward with SAB 121.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">Hill also brought up the effect of SAB 121 on spot bitcoin exchange-traded funds that the SEC approved earlier this year. Lawmakers had said banks couldn't be custodians for those ETFs because of the bulletin.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It is worth asking whether it is in the public interest for one crypto exchange to provide custody services for most of the market in approved bitcoin exchange traded products, while highly regulated banks are effectively excluded from the market,\" Hill said on Monday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC's definition of crypto is too broad and can include \"tokenized versions of real-world assets.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I think this is a clear example of why it is generally constructive for agencies to seek public comment before publishing major policy issuances,\" Hill said. \"At a minimum, I believe it would be helpful to clarify that SAB 121 does not apply to the wider universe of tokenized assets beyond blockchain native assets.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Hill said that regulators must also provide more clarity surrounding digital assets, blockchain, and distributed ledger technology.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I appreciate the need for regulators to be deliberative and careful in approaching these issues,\" Hill said. \"We should do our homework and make sure we understand the implications of new technologies that can reshape banking.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"There are significant downsides to the FDIC's current approach, which has contributed to a general public perception that the FDIC is closed for business if institutions are interested in anything related to blockchain or distributed ledger technology,\" Hill added.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Hill","content":"PERSON"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Federal Deposit Insurance Corporation Vice Chair Travis Hill","content":"ORGANIZATION"},{"type":"Mercatus Center","content":"ORGANIZATION"},{"type":"SAB","content":"ORGANIZATION"}],"hashtag":["FDIC"],"authors":["Sarah Wynn","The Block"]}