{"summary":"Ethereum co-founder Vitalik Buterin expressed concerns about overcomplicating the Ethereum consensus mechanism beyond its original design.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231676\/vitalik-buterin-urges-caution-when-it-comes-to-re-staking-on-ethereum","publishDate":"2023-05-22T07:27:35","id":9642,"type":null,"title":"Vitalik Buterin urges caution when it comes to re-staking on Ethereum","category":["CRYPTO ECOSYSTEMS"],"content":["Ethereum co-founder Vitalik Buterin expressed concerns about overcomplicating the Ethereum consensus mechanism beyond its original design, specifically in terms of re-staking.","In a new blog <a href=\"https:\/\/vitalik.ca\/general\/2023\/05\/21\/dont_overload.html\" data-v-f87c67ca=\"\">post<\/a>, Buterin voiced reservations about initiatives that could unnecessarily introduce risks into the ecosystem and complicate the roles of Ethereum validators beyond their primary duty of verifying the core protocol rules. Buterin was concerned about re-staking, a mechanism being developed by <a href=\"https:\/\/www.theblock.co\/post\/208015\/eigenlayer-series-a-round\" data-v-f87c67ca=\"\">Eigen Layer<\/a>, among others, which broadens the responsibilities of Ethereum validators to include securing external chains. He was worried that re-staking might introduce risks that could affect the safety of the network.","“We should tread lightly when application-layer projects aim to extend the ‘scope’ of blockchain consensus beyond the validation of essential Ethereum protocol rules,” Buterin stated in the post.","In Ethereum’s proof-of-stake model, validators are selected based on the number of ether they hold and are willing to stake. The network has the largest validator set among all proof-of-stake chains, both in terms of the number of validator entities and the total value of staked ether, some 18 million ETH (~$34 billion). This considerable size has prompted the development of systems to leverage this network security to secure third-party chains. However, Buterin advocated for a cautious approach.","Buterin noted that while re-staking can be used for low-risk purposes, there are situations where it could compromise the mainnet’s security, such as when Ethereum validators face slashing on third-party chains. Slashing is a punitive measure for validators who engage in undesirable activities, like improperly maintaining their stake or incorrectly processing transactions.","“We should instead preserve the chain’s minimalism and support uses of re-staking that do not seem like slippery slopes towards extending the role of Ethereum consensus,” Buterin suggested.","Buterin’s comments elicited responses from Sreeram Kannan, co-founder of Eigen Layer. Kannan agreed with Buterin’s analysis and <a href=\"https:\/\/twitter.com\/sreeramkannan\/status\/1660388939369431042\" data-v-f87c67ca=\"\">acknowledged<\/a> that Eigen Layer should avoid building complex financial primitives with the help of re-staking, as they “can spiral out of control.” Nevertheless, he <a href=\"https:\/\/twitter.com\/sreeramkannan\/status\/1660388940623515648\" data-v-f87c67ca=\"\">stated<\/a> that re-staking can be used for “low-risk” scenarios.","Kannan agreed that Eigen Layer can extend the functionality of validators beyond Ethereum but said these should be developed without the need for “slashing,” which would introduce unnecessary complexity. He further emphasized that Eigen Layer is cautious about not impacting Ethereum’s security in any way, aligning with Buterin’s blog post.","Buterin discussed a 2015 <a href=\"https:\/\/forum.gnosis.io\/t\/the-ultimate-oracle\/61\" data-v-f87c67ca=\"\">proposal<\/a> from Martin Köppelmann, the co-founder of Gnosis, for an “ultimate oracle,” deriving security from ETH stake. In the context of smart contracts, oracles are vital as they supply off-chain data. However, Buterin said that if the security of these data feeds were intertwined with Ethereum’s stake, it might contribute to increased complexity.&nbsp;","Buterin suggested that such expanded roles or “duties” added to Ethereum’s consensus mechanism could magnify the challenges and risks involved in operating as a validator. He emphasized, “Validators are required to exert significant human effort in terms of monitoring, running, and updating additional software to ensure their adherence to any newly implemented protocols.”&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Buterin","content":"PERSON"},{"type":"Eigen","content":"PERSON"},{"type":"2015","content":"DATE"},{"type":"Eigen Layer","content":"ORGANIZATION"},{"type":"Gnosis","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"oracle","content":"ORGANIZATION"},{"type":"$34 billion","content":"MONEY"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Sreeram Kannan","content":"PERSON"},{"type":"Kannan","content":"PERSON"},{"type":"Martin Köppelmann","content":"PERSON"}],"hashtag":["ETHEREUM","RESTAKING"],"authors":["Vishal Chawla","The Block"]}