{"summary":"CoinTracker had been valued at $1.3 billion this time last year, after it raised an $100 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206106\/crypto-tax-unicorn-cointracker-lays-off-19-employees-citing-industry-gloom-over-hiring","publishDate":"2023-01-27T18:46:39","id":9645,"type":null,"title":"Crypto tax unicorn CoinTracker cuts 20% of staff citing industry gloom, over-hiring","category":["COMPANIES"],"content":["Crypto tax unicorn CoinTracker laid off about a fifth of its staff due to market conditions.","A total of 19 employees were let go from the San Francisco-headquartered crypto tax company as its leadership cited headwinds from crypto winter alongside bringing on too many people, according to an email sent to workers that was seen by The Block.","\"Today we are confronted by the crypto winter, an unstable economy with high inflation and rising interest rates, and additional headwinds with crypto tax regulations,\" co-founder and CEO Jon Lerner said in the Jan. 26 letter. \"This is a very different environment than we experienced from mid-2020 to mid-2022. Our expectations for 2023 are different than anticipated in the past year.\"","A company spokesperson confirmed the layoffs in an email and said that 15 of the 19 who were let go were in the customer support team.&nbsp;","\"Before considering letting go of team members, we had systematically optimized all other costs,\" the company said.&nbsp;","Figures from LinkedIn and DealRoom suggest CoinTracker had roughly 100 employees before the cuts.&nbsp;","CoinTracker offered affected employees 12 weeks of pay, three months healthcare coverage for U.S.-based employees and a removal of the equity cliff meaning that anyone departing can remain a shareholder. They'll also be allowed to keep their laptops","\"Today is a difficult day, but we continue to believe we have the right foundation and assets to make a foundational product in crypto,\" Lerner said in the letter.&nbsp;","CoinTracker had been valued at $1.3 billion this time last year after it raised an $100 million <a href=\"https:\/\/www.theblock.co\/post\/131960\/crypto-tax-reporting-platform-cointracker-raises-100-million-in-series-a-funding\" data-v-f87c67ca=\"\">Series A<\/a> round backed by Accel, Y Combinator, Coinbase Ventures, Seven Seven Six and Kraken Ventures, among others.&nbsp;","Although not on the same scale as layoffs at Coinbase, the sentiment echoes that of CEO and co-founder Brian Armstrong in a letter to employees sent <a href=\"https:\/\/www.coinbase.com\/blog\/a-message-from-coinbase-ceo-and-cofounder-brian-armstrong\" data-v-f87c67ca=\"\">in June<\/a>. \"While we tried our best to get this just right, in this case it is now clear to me that we over-hired,\" wrote Armstrong.&nbsp;","Earlier this week it <a href=\"https:\/\/www.theblock.co\/post\/205419\/digital-currency-groups-luno-cuts-35-of-staff\" data-v-f87c67ca=\"\">was revealed<\/a> DCG-owned crypto exchange Luno would cut 35% of its staff. Coinbase also announced another round of layoffs <a href=\"https:\/\/www.theblock.co\/post\/200383\/coinbase-to-cut-20-of-staff-in-latest-round-of-layoffs\" data-v-f87c67ca=\"\">earlier in January<\/a>, cutting 950 jobs, or 20% of its headcount. Crypto.com also <a href=\"https:\/\/www.theblock.co\/post\/201947\/crypto-com-cuts-20-of-workforce-amid-sector-wide-layoffs\" data-v-f87c67ca=\"\">said<\/a> it would undertake a 20% headcount cut the same week.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"DCG","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"$1.3 billion","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Accel","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Jan. 26","content":"DATE"},{"type":"June","content":"DATE"},{"type":"35%","content":"PERCENT"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"Jon Lerner","content":"PERSON"},{"type":"Kraken Ventures","content":"ORGANIZATION"},{"type":"Lerner","content":"PERSON"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}