{"summary":"The U.S. Congress is currently grappling with the risks of reconvening in Washington during the ongoing COVID-19 pandemic\nA Senate staff memo dated April 30 explores the notion of remote voting, and the technical and legal considerations that it entails\nOne section of the memo notes the pros and cons of using blockchain-based voting","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63825\/congress-blockchain-voting-memo-coronavirus","publishDate":"2020-05-03T11:32:40","id":965,"type":null,"title":"Blockchain voting mulled in Senate memo as COVID-19 disrupts how Congress operates","category":["Technology"],"content":["The COVID-19 pandemic has disrupted&nbsp;the U.S. Congress's ability to meet and deliberate – a state of affairs that has forced a rethinking of how America's national legislature operates in a time of crisis.","And according to <a href=\"https:\/\/www.portman.senate.gov\/sites\/default\/files\/2020-04\/2020.04.30%20PSI%20Staff%20Memorandum%20-%20Remote%20Senate%20Process%20-%20Final_0.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a Senate memo<\/a> dated April 30 and obtained by The Block, blockchain-based voting could be part of the solution.","The memo was drafted in the context of the \"Roundtable on Continuity of Senate Operations and Remote Voting in Times of Crisis,\" an event hosted by the Permanent Subcommittee on Investigations, which is currently chaired by Senator Rob Portman of Ohio. As the memo explains, \"<span data-v-f87c67ca=\"\">[t]he COVID-19 virus has shut down major sectors of our society, including many functions of Congress,\" further noting:<\/span>","The subject of blockchain itself did not come up during <a href=\"https:\/\/www.hsgac.senate.gov\/subcommittees\/investigations\/hearings\/roundtable_-continuity-of-senate-operations-and-remote-voting-in-times-of-crisis\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">the nearly two-hour-long roundtable<\/a>, but the event did highlight the two core areas that any applicable technology would need to address: authentication and encryption. Put more simply, if any technology is going to be used for voting purposes in the Senate, it must be ensured that only actual senators are voting and outside attackers can't disrupt the process.","After a section exploring the use of end-to-end encryption technology for voting purposes, the memo posits that \"the Senate may consider blockchain.\"&nbsp;","As the memo explains in detail:","However, the memo itself does not openly endorse using the technology, and the subsequent paragraph lays out the risks involved with its potential deployment:","Voting as a blockchain use case has existed for years, and some decentralized protocols and communities currently use on-chain mechanisms for governance decisions. But the path to its potential application to the public sector has been a rocky one, attracting its fair share of <a href=\"https:\/\/www.technologyreview.com\/2018\/08\/09\/2425\/why-security-experts-hate-that-blockchain-voting-will-be-used-in-the-midterm-elections\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">critics<\/a>. Still, the concept has attracted supporters as well, including former U.S. presidential candidate <a href=\"https:\/\/www.theblockcrypto.com\/linked\/37238\/2020-presidential-candidate-andrew-yang-is-in-favor-of-blockchain-voting\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Andrew Yang<\/a>.&nbsp;","The discussion around remote voting comes as the Senate <a href=\"https:\/\/www.latimes.com\/politics\/story\/2020-05-03\/lawmakers-senate-coronavirus-relief-bill\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">is set to return<\/a> to Washington, D.C. this week at the behest of Senate Majority Leader Mitch McConnell of Kentucky, while the House of Representatives has no set timeline for reconvening in person. Concerns around testing and the health risks among a population that skews older are likely to persist.","Ultimately, it's fair to say that the Senate is unlikely to embrace blockchain tech as a voting solution anytime soon. The very idea of remote voting remains controversial primarily because the legislative process hinges on personal contact and deliberation. And while some leaders in Congress appear open to the concept of remote voting, progress on this front is likely to be slow-going.","Still, the memo is a notable example of how ideas around technology – blockchain or not – circulate in the corridors of power and could reshape how Congress operates in the wake of this national health crisis."],"hashtag":["CONGRESS"]}