{"summary":"The Merge will see Ethereum change to proof of stake. But it will also have a big impact on how much ETH is produced each year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167841\/how-ethereums-monetary-policy-will-change-after-the-merge","publishDate":"2022-09-09T08:55:51","id":9651,"type":null,"title":"How Ethereum’s monetary policy will change after The Merge","category":["THE MERGE"],"content":["Ethereum is on the brink of The Merge, which will transition the network from proof of work to proof of stake. This major shift is being undertaken primarily to reduce the network’s energy consumption and make it more environmentally friendly.","After the change to proof of stake, Ethereum will no longer make use of miners and their powerful, energy-hungry hardware. Instead, they’ll be replaced by validators, who pony up large amounts of ETH and tie it to their reputation — if they act maliciously, they lose some of their tokens.&nbsp;","But there is a second, highly anticipated change that will also happen: a significant change in Ethereum’s tokenomics.","This will result in a large reduction in Ethereum’s inflation rate, as fewer tokens will be issued each year. Put simply, the network is going to reward validators with fewer tokens than it currently awards to miners.","Additionally, with the amount of ether (ETH) that gets burned each year in the transaction fee process, it’s possible the network may even become deflationary — meaning, the total supply of ETH actually decreases each year.","Here’s a look at how Ethereum’s tokenomics will change and what impact that will have.","Under Ethereum's proof of work system, the network pays out 2 ETH for every block that a miner creates and 1.75 ETH for every uncle block. An uncle block is when a block is created but narrowly loses out to another block that was created around the same time — so it doesn’t end up in the chain but it still receives a smaller reward.","On average, this results in around 13,000 ETH issued each day and given to miners as rewards.&nbsp;","This translates to a 4.1% inflation rate (although there is also some issuance on the proof of stake chain already, so this is technically a little higher).","When Ethereum migrates to proof of stake, validators will replace miners. These validators will pony up large amounts of ETH as collateral and will get to produce blocks on the network. If they act maliciously, they can lose their collateral.&nbsp;","Since the network will no longer have to cover the expenses of miners (who pay massive electricity bills to power their 24-hour operations), it can be more efficient when it comes to handing out rewards for producing blocks.&nbsp;","Under the new system, there will be a dynamic payment model. This new model will be a lot lower than under the current system and it will vary depending on a few factors, including the amount of ETH staked.&nbsp;","Based on the current amount of ETH staked, the network will issue around <a href=\"https:\/\/ethereum.org\/en\/upgrades\/merge\/issuance\/\" data-v-f87c67ca=\"\">1,600 ETH<\/a> per day, translating to an inflation rate of 0.5%. This means when The Merge takes place, there will be an effective 90% decrease in the daily issuance of new ETH.&nbsp;","As more ETH gets staked, this issuance may increase to as high as 5,000 ETH. Yet even though this will rise, the effective yield for each validator will still decrease if this happens.","Until now, we’ve kept this discussion fairly simple and limited to the issuance of new ETH as mining or staking rewards.","But there is one other big element that impacts Ethereum’s effective inflation rate and that’s token burning.","Introduced as part of <a href=\"https:\/\/www.theblock.co\/post\/113595\/ethereums-london-hard-fork-what-it-is-and-why-it-matters\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">the London upgrade in August 2021<\/a>, EIP-1559 brought in a burning process as part of making transaction fees on the network. When a person makes a transaction on Ethereum, they have to burn part of their transaction fee and the rest goes to the miner (or soon, the validator). This removes part of the total supply of ETH.","This transaction fee burning has made a big impact. Since it was introduced, more than 2.6 million ETH has been destroyed through this alone. This roughly cut Ethereum’s inflation rate in half.&nbsp;","As Ethereum moves to proof of stake and the rewards will get cut significantly, this makes it much easier for the amount getting burned to be greater than the amount being issued. If this happens, the network will become deflationary — meaning the supply reduces over time","For the network to have an equal amount of issuance and burn after The Merge, transaction fees would need to happen at an average of 16 gwei (a unit of measurement used for paying fees). Anything higher than this at the network will be deflationary, and vice versa.","While transaction fees were very high for much of last year, they have dropped significantly. As a result, a lower number of ETH is now being burned due to transaction fees.","As a result, the net issuance after The Merge is expected to be around 0.1%.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"The Merge","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"August 2021","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"4.1%","content":"PERCENT"},{"type":"London","content":"LOCATION"},{"type":"0.5%","content":"PERCENT"},{"type":"0.1%","content":"PERCENT"},{"type":"Ethereum","content":"LOCATION"},{"type":"1559","content":"DATE"}],"hashtag":["ETHEREUM"],"authors":["Mike Truppa","Tim Copeland","The Block"]}