{"summary":"In a meeting today, core Ethereum developers agreed to a tentative timeline for the implementation of coming upgrades.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193350\/ethereum-developers-target-march-2023-for-shanghai-hard-fork","publishDate":"2022-12-08T12:25:17","id":9654,"type":null,"title":"Ethereum developers target March 2023 for Shanghai hard fork","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">Ethereum developers are targeting March 2023 for the next hard fork, called “Shanghai,” that will make it possible to withdraw ether staked with network validators.<\/span>","<span data-v-f87c67ca=\"\">In a meeting today, core developers set the tentative timeline for when they expect the Shanghai upgrade to be completed. <\/span><span data-v-f87c67ca=\"\">Also called \"Ethereum Improvement Proposal (EIP) 4895,\" Shanghai is a planned upgrade that will open validator staking withdrawals, a feature presently missing on the network.<\/span>","<span data-v-f87c67ca=\"\">It is not currently possible for users to withdraw staked funds from the Ethereum blockchain. Shanghai would fix that and provide greater flexibility and convenience to those who staked ether on the network before <\/span><a href=\"https:\/\/www.theblock.co\/post\/177704\/five-key-ways-the-merge-affected-the-ethereum-blockchain\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Merge<\/span><\/a><span data-v-f87c67ca=\"\">, the last upgrade when Ethereum transitioned to proof-of-stake consensus.<\/span>","<span data-v-f87c67ca=\"\">There's no guarantee that the proposed timeline can be met due to potential technical difficulties or other unforeseen issues.<\/span>","<span data-v-f87c67ca=\"\">\"Withdrawals will be enabled with Shanghai currently planned in March on the mainnet, if everything goes as planned,\" Pooja Ranjan, a project manager at Ethereum Cat Herders who was present at the meeting, told The Block.<\/span>","<span data-v-f87c67ca=\"\">Developers also discussed a second hard fork, planned for after Shanghai, sometime in the third quarter of 2023 that will introduce \"proto-danksharding,\" or EIP 4844, an upgrade which would further improve the network's capacity to handle more transactions.<\/span>","<span data-v-f87c67ca=\"\">EIP 4844 will introduce a new kind of transaction format to Ethereum called \"shard blob transactions” that will allow for off-chain data to be stored and accessed by Ethereum nodes temporarily to address scaling needs of blockchain apps.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"4895","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"third quarter of 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Pooja Ranjan","content":"PERSON"},{"type":"Ethereum Cat Herders","content":"ORGANIZATION"},{"type":"March 2023","content":"DATE"},{"type":"Shanghai","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}