{"summary":"New York’s financial regulator is accelerating its work on crypto business licensing.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/148030\/dfs-chief-adrienne-harris-explains-how-and-why-new-york-is-speeding-up-the-bitlicense-pipeline","publishDate":"2022-05-20T11:53:32","id":9659,"type":null,"title":"DFS chief Adrienne Harris explains how — and why — New York is speeding up the BitLicense pipeline","category":["POLICY"],"content":["New York’s financial regulator is accelerating its work on crypto business licensing.","Speaking with The Block on May 19, Adrienne Harris, the superintendent of New York’s Department of Financial Services promoted her work on expanding the DFS’ licensing regime for crypto firms — famous under the moniker “BitLicense.”","“Before my coming into DFS, the average time was up to a couple of years. We’re already moving much much faster. We’ve done three licenses this year, soon to do a fourth, compared to one in all of 2021,” Harris said.","The one authorized in 2021 was Bakkt. Another BitLicensee, Xapo, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/130119\/xapo-closes-shop-in-new-york-gives-up-bitlicense\" data-v-f87c67ca=\"\">gave up its license<\/a> and left New York in January 2022, weeks before Harris’ confirmation.","The queue to get a BitLicense has been a longstanding grievance among the crypto industry, especially given New York’s status as the global financial center.","“It’s no secret that the licensing and business filings have taken too long,” Harris said at an earlier fireside chat at Chainalysis’ LINKS conference.","Initiatives aimed at fixing those delays include updating the public <a href=\"https:\/\/www.dfs.ny.gov\/virtual_currency_businesses\" data-v-f87c67ca=\"\">guidelines<\/a> for BitLicense applications to explain which ones the DFS will consider incomplete.","Harris is also prioritizing crypto-related hiring, aiming to triple the size of DFS’s virtual currency team in 2022. But she also notes a lot of potential for operational streamlining.","Depending on who you ask, New York’s state BitLicense is the gold standard in crypto licensing or a case study in burdensome regulation. Introduced in 2015, only 22 firms hold such licenses, including PayPal’s conditional license which is contingent on its close partnership with Paxos.","Nine crypto companies hold special purpose banking charters, which allow those firms to do business and transmit money in New York. They can also take on fiduciary responsibilities, which legally requires a high degree of concern for a client’s well-being.","The BitLicense framework as drawn criticism over the years. At an April 26 <a href=\"https:\/\/crypto.live.ft.com\/agenda\" data-v-f87c67ca=\"\">keynote<\/a>, New York City mayor Eric Adams called for an end to the BitLicense. A lawsuit in New York <a href=\"https:\/\/www.theblockcrypto.com\/post\/40602\/a-lawsuit-against-nydfs-to-abolish-bitlicense-moves-to-the-states-highest-court\" data-v-f87c67ca=\"\">aimed to abolish the BitLicense<\/a>. Former US presidential candidate Andrew Yang’s policy <a href=\"https:\/\/web.archive.org\/web\/20190419041346\/https:\/\/www.yang2020.com\/policies\/digital-asset-regulation\/\" data-v-f87c67ca=\"\">platform<\/a>, which was celebrated for its encouragement of crypto, highlighted the BitLicense as an example of state regulation gone wrong.","Harris was unfazed. “We see the demand for the BitLicense and the limited purpose trust continue to go up,” she said, explaining:","“New York had the first banking law in the country, before there was federal banking law there was new york banking law in the 1800s. And Wall Street is here in New York. It’s not in DC. We have a great regulatory regime. We’re going to improve the operation of it, but the regs themselves I think are wonderful.”","Good actors, she says, want regulation, including what she called “bespoke supervisory requirements” that the DFS sets up for individual firms. “That’s why almost half of venture capital investment in crypto last year was in New York-based companies,” she said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"2015","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"May 19","content":"DATE"},{"type":"January 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DFS","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"BitLicense","content":"ORGANIZATION"},{"type":"Harris","content":"PERSON"},{"type":"Andrew Yang","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Xapo","content":"LOCATION"},{"type":"April 26","content":"DATE"},{"type":"Eric Adams","content":"PERSON"},{"type":"New York’s Department of Financial Services","content":"ORGANIZATION"},{"type":"1800s","content":"DATE"},{"type":"Adrienne Harris","content":"PERSON"},{"type":"DC","content":"ORGANIZATION"}],"hashtag":[],"authors":["Kollen Post","The Block"]}