{"summary":"Coinbase and OKX have partnered with crypto startup Archax to get UK financial promotions approved under new FCA regime.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255431\/coinbase-okx-and-binance-partner-with-uk-firms-as-regulations-come-into-force","publishDate":"2023-10-09T09:05:22","id":9666,"type":null,"title":"Coinbase, OKX and Binance partner with UK firms as regulations come into force","category":["REGULATION"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Two weeks after the crypto exchange Bybit officially <\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/252526\/bybit-suspends-services-uk-after-ceo-ben-zhou-said-exit-likely\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">exited the UK market<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">, citing the impact of new crypto marketing rules, several rival overseas players have adapted to the regime by teaming up with local partners.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Coinbase and <a href=\"https:\/\/www.theblock.co\/post\/250935\/okx-mclaren-manchester-city\" data-v-f87c67ca=\"\">OKX<\/a> are working with Archax to get their financial promotions approved, according to spokespeople for the exchanges.&nbsp;<\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Binance, meanwhile,&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.binance.com\/en-GB\/blog\/ecosystem\/binance-launches-uk-domain-in-compliance-with-new-financial-promotions-rules-2903800236178709961\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">said in a blog post published Oct. 8<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> that it had partnered with Rebuilding Society, a regulated peer-to-peer lending firm that has dished out just £35 million ($42.6 million) in loans since launching in 2013, according to its website.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The expectation is that these arrangements will allow the exchanges to continue serving UK customers from overseas despite new marketing rules from the Financial Conduct Authority — which include a cooling-off period for first-time investors — that have just come into effect.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">“The approvers, when they enter into an arrangement with the exchange or whoever else it might be, they approve the promotions and effectively they take responsibility for those promotions,” said George Morris, a partner at the law firm Simmons &amp; Simmons. “It’s very much a symbiotic thing.”<\/span>","The FCA issued a statement to The Block, asserting that it is the responsibility of authorized firms to ensure the promotions they approve comply with FCA rules.","\"From 7 February 2024, authorized firms approving the financial promotions of unauthorized firms can only do so if they have received specific approval from the FCA to provide this service,\" the FCA added. The UK's financial regulator also noted that authorized firms can charge for this service, emphasizing that \"It is ultimately a commercial decision for a firm whether they offer this service.\"","Archax CMO Simon Barnby told The Block that the firm has an assessment criteria process in place for deciding which crypto asset service providers they will work with. \"We have a process in place which includes adverse media checks, full due diligence, and AML\/KYC checks,\" Barnby said.","Barnby added that Archax charges crypto asset service providers an upfront fee to set everything up and then an ongoing service fee. \"The actual fee levels depend a lot on the requirements and activities of the client that need to be covered,\" he said.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.fca.org.uk\/consumers\/warning-list-unauthorised-firms\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">FCA also put out an announcement on Oct. 8<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> warning that 143 entities are operating in the UK without permission and naming them in a list. That list includes HTX and KuCoin, two major global exchanges.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The specific warning given by the FCA for both HTX and <a href=\"https:\/\/www.theblock.co\/post\/236838\/crypto-exchange-kucoin-mandatory-kyc\" data-v-f87c67ca=\"\">KuCoin<\/a> stated: “This firm may be promoting financial services or products without our permission. You should avoid dealing with this firm.”<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Graham Rodford, CEO of Archax, which itself was one of the first businesses in the UK to be added to the FCA’s anti-money laundering crypto register, said that, before the regulator’s new marketing rules, offshore exchanges could offer services in the UK “pretty freely.”&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">“As a result, I think the financial promotions rules are a little further reaching,” he said, adding that Archax has taken on roughly half the clients that have approached it about working on getting promotions approved.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The FCA's new regime for crypto asset financial promotions took effect on Oct. 8. <\/span>\"Firms could be given until 8 January 2024 to introduce features that require greater technical development, with the core rules still coming into effect from 8 October 2023,\" the FCA said in an <a href=\"https:\/\/www.fca.org.uk\/news\/press-releases\/fca-sets-expectations-ahead-incoming-crypto-marketing-rules\" data-v-f87c67ca=\"\">announcement<\/a>.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The new rules apply for crypto promotions across various media forms, from websites and social media outlets to online advertising. To stay on the right side of the regulations, unregistered crypto asset firms have four routes to lawfully communicate crypto asset promotions within the UK.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The first route is that a promotion is communicated by an FCA-authorized person. The second is that a financial promotion is approved by an authorized person. The third way, employed by Coinbase, OKX, and Binance, involves the promotion being communicated by a crypto firm registered under the FCA's anti-money laundering regulations. <\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Lastly, promotions that comply with the conditions of an exemption in the Financial Promotion Order are deemed lawful.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The regulator said unregistered crypto asset firms who fail to comply with the new financial promotions guidelines are likely to be in breach of section 21 of the UK's Financial Services and Markets Act 2000. This would be a criminal offense, punishable by up to two years imprisonment, an unlimited fine, or both.<\/span>","(<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Updated with additional quotes from Archax CMO Simon Barnby and the FCA<\/i>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Archax CMO Simon Barnby","content":"ORGANIZATION"},{"type":"Archax","content":"PERSON"},{"type":"CMO Simon Barnby","content":"ORGANIZATION"},{"type":"Financial Promotion Order","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2000","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$42.6 million","content":"MONEY"},{"type":"2013","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"January 2024","content":"DATE"},{"type":"February 2024","content":"DATE"},{"type":"Graham Rodford","content":"PERSON"},{"type":"Simmons &amp; Simmons","content":"ORGANIZATION"},{"type":"Oct. 8","content":"DATE"},{"type":"October 2023","content":"DATE"},{"type":"OKX","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Barnby","content":"PERSON"},{"type":"George Morris","content":"PERSON"},{"type":"UK's Financial Services","content":"ORGANIZATION"}],"hashtag":["ANTI-MONEY LAUNDERING","BINANCE","COINBASE","CRIME","FCA","HTX","OKX","UK PARLIAMENT"],"authors":["Brian McGleenon","Ryan Weeks","James Hunt","The Block"]}