{"summary":"Concerns about rehypothecation in layer 2 protocols for Bitcoin are overblown. We don’t need to fear rehypothecation, we just need to accurately price its","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/12036\/rehypothecation-btcs-path-to-becoming-king-of-collateral","publishDate":"2019-02-15T16:09:13","id":9670,"type":null,"title":"Rehypothecation: BTC&#x27;s path to becoming king of collateral","category":["BITCOIN"],"content":["<span data-v-f87c67ca=\"\">Concerns about rehypothecation in layer 2 protocols for Bitcoin are <a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/14\/the-gospel-of-long\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">overblown<\/a>. We don’t need to fear rehypothecation, we just need to accurately price its risk premiums. There’s inflationary and deflationary forms of derivative open interest. The deflationary version comes in the form of fully-backed synthetic cash positions, which fuels Bitcoin Dollarization and gives a sensible valuation-growth model for Bitcoin. To understand these nuances, we have to understand bank credit.<br data-v-f87c67ca=\"\">\n[related id=\"1\"]<br data-v-f87c67ca=\"\">\n<\/span>","<b data-v-f87c67ca=\"\">If your collateral is so good, why not use it like any other collateral?<\/b>","<span data-v-f87c67ca=\"\">What is fiat? <\/span><span data-v-f87c67ca=\"\">Fiat is a b-side currency note, a form of immediate-term debt, it’s an asset, but only because of its legal connection to the amortization of debts. It is an anti-liability, but mathematically, by the transitive property - that’s an asset! <\/span>","<span data-v-f87c67ca=\"\">To restore some sanity, we call these “financial assets”, derivatives are also financial assets, that’s why you can be short them. For every $1 in someone’s pocket, which they are “long”, the Central Bank or Commercial Banks are short $1.<\/span>","<span data-v-f87c67ca=\"\">A real asset would be, for example, some Caterpillar machinery purchased with a secured loan. To buy real assets, people accept shorting units of fiat that they borrow, then spend. You get this phenomenon of “fiat” - let it be - the “creation” of new money in the form of credit. The difference between a licensed bank, and a pool of investors funding loans on LendingClub with full capital paid, or a bond investor, is that the bank has essentially a portfolio margin license from the government. You don’t have to fund loans with cash, you can fund them with credit. Your bank's credit. Also, the checking account deposits everyone depends on to survive are a junior, most-subordinated liability of the bank&nbsp;— thanks for looking out for us. <\/span>","<span data-v-f87c67ca=\"\">In essence, a lender is making a hypothesis that the borrower will pay them back. In the hypothetical scenario of a default, XYZ can be triggered (e.g. going and taking assets to settle the loan).&nbsp;So to hypothecate something, you just have to lend it.<\/span>","<span data-v-f87c67ca=\"\">To rehypothecate something then, you just… lend it again! Currency units issued by a bank as consideration for a new debt note, which may cycle back to that same bank and generally these days the value stays in the banking system, and around and around it goes. One man’s leveraged capex is another man’s revenue is another bank account’s deposit. You get the money multiplier effect.<\/span>","<span data-v-f87c67ca=\"\">People who are Pro-Bitcoin generally hate the Federal Reserve, inflation, and fractional reserve banking. This is because many of us came of age at a time where all of these institutions were called into question, amidst great cataclysm unleashed through corruption of the highest halls of capitalism, and also we saw this movie called Zeitgeist and watched Ron Paul run for president. We read Baby Boomers' rants about gold manipulation on ZeroHedge, and then we found BTC. Murray Rothbard, Hayek, and the general school of Austrian economics figured in, but people who consider themselves a priori, categorically, it’s gotta be Austrian, Austrians, are not necessarily representative of the majority of Pro-Bitcoin people.<\/span>","<span data-v-f87c67ca=\"\">In the default model of the Lightning Network, lots of BTC is needed in a fully-collateralized fashion to facilitate payments, earning a low yield from routing fees of generally under 1 percent per annum (what Nik Bhatia calls the “Lightning Network Reference Rate”). The presumption here, was that LN is necessarily going to be used in that way, that BTC would necessarily dominate liquidity in an environment of cross-chain asset swaps, and that nobody would use BTC\/LN in a way that would contravene these Austrian economics tenants of strictly deflationary currency - which by the way, aren’t strictly speaking representative of pre-Bitcoin Austrian economics, perhaps better described as Quebecois Economics, after its two most prolific proponents, Francis Pouliot and Pierre Rochard. Much respect.<\/span>","<span data-v-f87c67ca=\"\">However, one of the greatest things about Bitcoin is that nobody can censor usage of it. The only thing you can do to discourage certain kinds of usage is, either get mass consensus for a soft fork, changing around parameters that make it more difficult to relay “spam”, or have it be generally uneconomical. But if it’s economical, enough clients will relay it, and a single block-winning miner will include it, it can get in. Lightning Network is also a client-agnostic network in the sense that is has no global consensus state or specific blockchain. So it reasons, LN clients that run a bit differently could be pretty amazing for getting yield on BTC. For those who know what they are doing, there’s nothing that can be done to stop that, and it will have some degree of synthetic dilutive effect on BTC in the Lightning Network.<\/span>","<span data-v-f87c67ca=\"\">Rehypothecation of BTC across Lightning Nodes, creating some sort of money multiplier, is possible if channels are constructed that operate based on un-collateralized trades. Finance has given us solid math describing the adequate pricing, as least to the extent that major bank trading desks are able to stay in business, for trades both involving collateral and without. For those without, they price a sort of Credit-Default-Swap-like option premium, called a Counterparty Value Adjustment, in order to compensate the optionality of having some time window to deliver on a trade. <\/span>","<span data-v-f87c67ca=\"\">In the context of Lightning Network HTLC-like trades with a time-based escrow, someone can underwrite those failures to deliver as an income business, in a manner similar to a bail bondsman; think of it as collating the default risk of all those option-writes into a big secured loan that aggregates however many writes a party wishes to make. Those writes come with risk of default, but if there are recoverability mechanisms with a high efficacy rate, the business can end up looking like covered writes rather than risky, uncovered writes, and the premiums can get pretty cheap. Instead of stacking lots of BTC for a low yield, smaller sums of BTC can underwrite throughput for a higher yield and slightly higher risk, making loose trading more cost effective. Cheaper premiums allow people to trade up a storm, which creates derivatives&nbsp; of open interest (basically rehypothecated BTC). Time horizon is a major limiter to how much this sort of synthetic inflation can actually scale.<\/span>","<span data-v-f87c67ca=\"\">With Baakt, they start with a 1 Day contract, the community doesn’t cry fowl, they bridge the old money to the new, fees akimbo, great. That open interest is unlikely to become substantially larger than their daily volume, more likely the open interest will be a fraction of daily volume. They then position themselves to the retail public as anti-rehypothecation, but most likely with success on the 1 Day they’ll consider quarterlies and monthlies, and we’d quickly see open interest expansion. However, there are many spread positions in derivatives. Calendar spreads are an example, people trying to milk out a living at the edge of market efficiency, that expansion of open interest is inflationary to some extent and is rehypothecation-like, but it’s still healthy for market liquidity. What we’d like to see is the equivalent of the CME’s Commitment of Traders report for bitcoin derivatives, breaking down hedgers vs. speculators, and ideally, to separate the inflationary OI from the deflationary.<\/span>","<span data-v-f87c67ca=\"\">A loan default is deflationary. The money goes out of existence, it’s balanced, and it's why the Fed has done okay manipulating interest rates for the last 40 years. Derivatives portfolios are similarly limited. For swaps and futures open interest, scarcity in the cash-collateral is needed to capture the “risk-free” return of swap payments or futures premium; this creates demand in spot markets, soaks up supply, and puts BTC to work as collateral on higher time horizons.<\/span>","<span data-v-f87c67ca=\"\">But if Baakt, or even enterprising traders, are willing to adapt the horizon of Wall St. derivatives practice to loosening the margin requirements of Lightning-type DEX environments, we could end up with a situation where 1 BTC in margin can be used to portfolio-margin a lot of spreads in CVA options vs. BTC settled options that reference some price. We could then have those under-writers hedge by using graph default swaps, the equivalent of Credit Default Swaps but for sets of networked counterparties. These GDS price the risk of different sets of channels operating by different margin rules, and perhaps also with detectable capitalization levels that indicate greater risk, it will be possible to trade these GDS instruments effective in dynamic, data-informed strategies. <\/span>","<span data-v-f87c67ca=\"\">Imagine a CDS on BitMex’s contracts: the CDS pays you whatever percent of open interest is experienced as a shortfall on BitMex due to margin calls that are unfilled by a fast-moving market. BitMex has an insurance fund and a lot of revenue to replenish it, but let’s say it didn’t, such a CDS might be relevant to some traders, and provide a seemingly “free money” yield to those willing to take the other side. Now imagine the same for a decentralized BitMex based on LN. The nuanced degree of how much a contract shortfall can amount to makes these GDS potentially much more efficient to trade than traditional CDS, which deal in tail risks, usually involving extreme binary events. Sometimes corporates go bankrupt and semi-senior notes recover at some rate, or sovereigns default and try to force a restructure, but the percentages involved are usually greater than 50 percent of face value, rather than the 2-25 percent range that a volatility-stricken decentralized contract might suffer margin short-falls. <\/span>","<span data-v-f87c67ca=\"\">There are two strong attractors: the higher time-value based return of deploying BTC in the LN to channels operating along CVA-type margining, and the demand for leverage which keeps those premiums enticing. It’s a bilateral way of doing leverage in the Lightning Network between chains, in the form of options, which could complement more “traditional” perpetual swaps (less than three years old, BitMex launched XBTUSD perpetual swap in April 2016) that settle on LN just in BTC or LTC. <strong data-v-f87c67ca=\"\">All these forms of leverage create, temporarily, and against risk, some inflation in the trade-able supply of these coins. That’s just a fact of life.<\/strong><\/span>","<span data-v-f87c67ca=\"\">If we look at what happened to the gold market, prior to China’s buy-out plans, the lending of gold allowed banks to lend more gold on-paper than they had sitting in a vault. Gold banking, in other words. Before anyone turned in their tallysticks to buy shares in the Bank of England, gold receipt issuance was a source of fiat inflation. In the London\/New York gold market structure, both spot and derivatives markets were saturated with multipliers. These were not transparent systems, LN counterparties are probably much more auditable. It’s arguable that 200x open interest to warehouse inventory ratios, or having less detectable dilution of supply through rehypothecation of gold was bad for the gold market, and made some ideological investors pretty upset. But let me ask you: if your collateral is so good, why should it not be utilized like any other collateral? <strong data-v-f87c67ca=\"\">The main issuing is one of auditing transparency so that extreme financial practices don’t create moral hazards, systemic risks and information asymmetry.<\/strong><\/span>","<span data-v-f87c67ca=\"\">There’s a strong argument to be made that historically, when people were allowed to create currency, e.g. credit instruments, to facilitate trade, prosperity rose. See the late Stephen Belgin and Bernard Lietaer’s book <em data-v-f87c67ca=\"\">New Money For A New World<\/em> for more color on that. It’s probably not so simple as, fixed supply good, expanding supply bad. Elastic supply that is intelligently allocated, not by a single intelligent planner but by many people lending, trading, working, building and so forth in the economy, based on value production, not political graft, that is what seems to make a currency most dynamic and valuable. See also Niall Ferguson’s chapters in The Ascent of Money regarding the fortunes of the gold-hungry Spanish vs. the debt-happy Italians, it’s like night and day. <\/span>","<span data-v-f87c67ca=\"\">Power money that is more scarce in supply becomes useful as a market referent and collateral base that has the lowest perceived counterparty risk on the planet, which then evolves a complementary market mechanism. As with interest rates, a balance is achieved through price discovery, between inflation and deflation.<\/span>","<span data-v-f87c67ca=\"\">Bitcoin is valuable because it serves a purpose in that market mechanism, but with the added hyperfungibility of information; it’s globally transversable, melting capital controls like the invisible, imaginary boundaries they are. So it’s got an uptrend. It’s got time value as collateral. It’s got other derivative time-value returns that can be obtained at times, by using it to hedge, shorting those derivatives. These things have so far reinforced each other, with other key metrics like the thickness of Bitcoin’s mining moat being positively correlated.<\/span>","<span data-v-f87c67ca=\"\">This is how BTC becomes king collateral for the world:<\/span>","<span data-v-f87c67ca=\"\">Whereas banks currently employ quants crunching simulations of graph triangle-counters to try and process nettings of various derivatives counterparties (we’re talking about hundreds of thousands of big to medium sized bank counterparties), we can do this on the scale of hundreds of thousands of LN nodes. The utility in UXTO money is increased significantly.<\/span>","<span data-v-f87c67ca=\"\">In conclusion, I think the fear of rehypothecation may be overstated, but it’s indeed possible, and BTC scalability will depend on the influence of fiat-liquidity into the system, seeking a USD-benchmarked return, which will to some extent dilute supply through leverage. But on the other hand, safe-returns-seeking capital will tend to do the opposite, put on a 1:1 fully collateralized position, and ride it for the USD interest rate, which is very bullish for the supply and demand dynamics of any commodity money that becomes a popular synthetic-USD base. <\/span>","<span data-v-f87c67ca=\"\">I think most likely, the most extreme leverage, with the most survivability, will be with the most professional risk managers who can crunch the math on these derivatives and start making markets. Maybe not the 90 percent quoting-time market makers, but those who take smart views to trade mis-priced hedges, who take a market view, who lean into LN constellations with the best margin rules, or who exploit convexity between different instruments.<\/span>","<span data-v-f87c67ca=\"\">And that means most of the leverage dilution in imminent supply will be a boon to liquidity, and the sort of leverage that gets people rekt will remain a modest component of overall supply and demand. This will make Lightning many times more capital efficient, maybe not 10x like the typical fractional reserve banking money multiplier, but enough to create convex liquidity aggregation benefits in the LN in general. <\/span>","<span data-v-f87c67ca=\"\">Nik Bhatia’s counterparty risk spectrum fits into this. He cited cold storage as near-zero counterparty risk (there’s still operational risk of physical attack vectors and the credit risk of the underlying blockchain, small though it may be) and the average optimized return for routing fees a bit further up that scale, because you have to be in a live hot wallet perpetually to operate for that revenue. Then, off-chain lending was this example of a riskier thing yet, which veers into the realm of counterparty risk. But HTLCs used for margining general derivative contracts with BTC also come with counterparty risk that must be priced to make HTLC’s incentive-aligned enough that those trading mechanisms actually work. <\/span><span data-v-f87c67ca=\"\">We’re probably going to need to evaluate Schnorr-based discrete log contracts or some modification on the HTLC-based cross-chain atomic swap model, such that one party clearly holds the option, and the other party is short it. Having either side be equally able to jerk out of the trade is too problematic to be priced and functional.<\/span>","<span data-v-f87c67ca=\"\">It’s not just about 2:2 locked channels, hashed timelocks, or 2:3 watchtowers. There’s also 2:3 of M multisigs, where M is the number of signers, being used as a state channel for Byzantine Fault Tolerant staked sidechains. These create more decentralized watchtowers, allow for instant-finality of signed transactions, and facilitate state references to co-ordinate LN DEx contract settlements, especially once the migration to stealthy transactions with Schnorr\/Taproot\/unicast begins. <\/span>","<span data-v-f87c67ca=\"\">BFT Sidechains are going to figure into solving some of the technical weak spots in the Lightning Network settlement model. It bears considering, when I use portfolio margin on Deribit, ultimately Deribit is assuming underlying clearing risk for me blowing up my account. Perish the thought, but let’s say I was a sloppy options trader and I sold 10x the number of naked calls as my equity, Deribit would end up on the hook after that sudden $500 snap rally that you know can happen any day. Who takes the role of Deribit to enable more sophisticated margining? It would have to be the sidechain, with collateralized validators checking up on state, taking small fees, another layer of income and risk removed. <\/span>","<span data-v-f87c67ca=\"\">Turns out this risk spectrum goes in deep if you zoom in on the middle. It’s probably the next big thing in derivatives, fueled perhaps by hyper-bitcoin-dollarization, a process of mainstream finance replacing the Eurodollar model with a bitcoin-backed dollars model. If you look into how much time and money is spent on Wall Street trying to deal with collateralization and counterparty risks, you could see how with just the right amount of momentum, just the right amount of debt supercycle unwinding, macro tail-winds, pricing in every inch of a vast semi-decentralized network of dealers, could become quite interesting for Wall Street. They need this financial system, it will eventually save them so much money vs. the old, not because “blockchain technology reduces overhead on back-office auditing and compliance tasks - for the enterprise.” But rather because the collateral discounting rates will precipitously favor it. Time value of money is the crux of the whole banking business and they will follow the value in time.<\/span>","&nbsp;","&nbsp;","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Thanks to Nik Bhatia for providing good feedback on how to reposition the key themes of the essay front and center. Also to Dan Goldman for technical feedback.<\/span><\/i>","<em data-v-f87c67ca=\"\"><a href=\"https:\/\/twitter.com\/duganist?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Patrick Dugan<\/a> is a writer, trader, and designer. He founded TradeLayer, a protocol to introduce a native derivatives layer on top of Bitcoin and Litecoin. In previous adventures, Patrick worked in game design, temporarily administered the Omni Layer foundation and ran a sustainable farming-oriented ecommerce website.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Patrick","content":"PERSON"},{"type":"Niall Ferguson","content":"PERSON"},{"type":"Caterpillar","content":"ORGANIZATION"},{"type":"$500","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"CVA","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Nik Bhatia","content":"PERSON"},{"type":"CME’s Commitment of Traders","content":"ORGANIZATION"},{"type":"convexity","content":"ORGANIZATION"},{"type":"Schnorr\/Taproot\/unicast","content":"ORGANIZATION"},{"type":"Schnorr","content":"PERSON"},{"type":"50 percent","content":"PERCENT"},{"type":"Bhatia","content":"PERSON"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Stephen Belgin","content":"PERSON"},{"type":"Pro-Bitcoin","content":"ORGANIZATION"},{"type":"Patrick Dugan","content":"PERSON"},{"type":"Litecoin","content":"PERSON"},{"type":"Central Bank or Commercial Banks","content":"ORGANIZATION"},{"type":"Lightning Network HTLC","content":"ORGANIZATION"},{"type":"LTC","content":"ORGANIZATION"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"HTLC","content":"ORGANIZATION"},{"type":"Lightning Network Reference Rate","content":"ORGANIZATION"},{"type":"Pierre Rochard","content":"PERSON"},{"type":"Murray Rothbard","content":"PERSON"},{"type":"$1","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"Hayek","content":"PERSON"},{"type":"Quebecois Economics","content":"ORGANIZATION"},{"type":"Francis Pouliot","content":"PERSON"},{"type":"Dan Goldman","content":"PERSON"},{"type":"Nik Bhatia","content":"LOCATION"},{"type":"London","content":"LOCATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"1 percent","content":"PERCENT"},{"type":"Bernard Lietaer","content":"PERSON"},{"type":"Deribit","content":"ORGANIZATION"},{"type":"Ron Paul","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Baakt","content":"LOCATION"},{"type":"Fiat","content":"ORGANIZATION"},{"type":"April 2016","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"XYZ","content":"ORGANIZATION"},{"type":"Counterparty Value Adjustment","content":"ORGANIZATION"},{"type":"25 percent","content":"PERCENT"},{"type":"90 percent","content":"PERCENT"}],"hashtag":[],"authors":["Contributor Network","The Block"]}