{"summary":"a16z on Wednesday announced the launch of a $600 million fund dedicated to further building out the gaming industry.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147591\/a16z-launches-600-million-fund-to-invest-in-gaming-industry","publishDate":"2022-05-18T10:51:16","id":9672,"type":null,"title":"a16z launches $600 million fund to invest in gaming industry","category":["INVESTMENTS"],"content":["Venture capital firm Andreessen Horowitz (a16z) has raised $600 million to build the future of the gaming industry.","The firm has been investing in gaming for over a decade, but the new fund will \"play a pivotal role in defining how we socialize, play, and work over the next century,\" the firm said in a blog post announcing the move.","With the new a16z fund, named \"Games Fund One\" the team plans on investing on various different themes within the gaming industry. First, investments will be focused on gaming studios. \"These 'games-as-a-service' have become rich, interactive social networks, with players making in-game friendships that are just as meaningful as those made in-person,\" said the blog post, written by general partners Andrew Chen, Jonathan Lai, and James Gwertzman.&nbsp;","The team will also be investing in player communities.&nbsp; For example, social apps like Discord and Twitch were created for this purpose. Infrastructure will also be a key focus.&nbsp;","\"With GAMES FUND ONE, we will continue to add more functions and develop deeper networks that are tailored to the games ecosystem so we can help our portfolio companies with everything from building digital communities, to managing their virtual economies, to IP licensing best practices, to helping build their development teams,\" the team wrote.","NFT based games peaked in popularity last year, with a recent cool down, according to data compiled by The Block Research.","Gaming startups have still managed to raise significant capital in recent months, many which have been led by a16z. Carry1st, an African gaming startup, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/130766\/carry1st-raise\" data-v-f87c67ca=\"\">raised<\/a> $20 million earlier this year. At the tail-end of last year, Mythical Games <a href=\"https:\/\/www.theblockcrypto.com\/linked\/123306\/gaming-startup-mythical-games-raises-150-million-in-series-c-round-led-by-a16z\" data-v-f87c67ca=\"\">raised<\/a> $150 million led by a16z.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/gaming\/weekly-sales-gaming-nfts\/embed\" title=\"Weekly Sales Gaming NFTs\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"next century","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Jonathan Lai","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Andrew Chen","content":"PERSON"},{"type":"$20 million","content":"MONEY"},{"type":"$600 million","content":"MONEY"},{"type":"James Gwertzman","content":"PERSON"},{"type":"$150 million","content":"MONEY"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}