{"summary":"Peer-to-peer (P2P) cryptocurrency exchange LocalBitcoins received most criminal funds in 2019, for the third year in a row, according to blockchain analytics firm CipherTrace.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/67140\/p2p-crypto-exchange-localbitcoins-receives-most-criminal-funds-says-ciphertrace","publishDate":"2020-06-02T09:00:12","id":968,"type":null,"title":"P2P crypto exchange LocalBitcoins receives most criminal funds, says CipherTrace","category":["HACKS"],"content":["Peer-to-peer (P2P) cryptocurrency exchange LocalBitcoins received most criminal funds in 2019, for the third year in a row, according to blockchain analytics firm CipherTrace.","CipherTrace <a href=\"https:\/\/ciphertrace.com\/spring-2020-cryptocurrency-anti-money-laundering-report\/\" data-v-f87c67ca=\"\">analyzed<\/a> global cryptocurrency exchanges for its “Spring 2020 Cryptocurrency Crime and Anti-Money Laundering Report” and found that Finnish exchanges rank number one in receiving criminal bitcoin funds. They received 12.01% of all bitcoin funds coming directly from illegal sources, and LocalBitcoins accounted for over 99% of these funds, said CipherTrace.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLocalBitcoins acknowledged the issue, but said the transaction volumes from dark markets have reduced since it implemented anti-money laundering (AMLD5) and know-your-customer (KYC) regulations in September 2019. The exchange said by December 2019, it witnessed over 50% decrease, and by May 2020, over 70% decrease in transactions from dark markets.","\"We continue to work at protecting our service [and] we expect the dark market volumes to continue to decline,\" LocalBitcoins told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Russia and the U.K. follow next&nbsp;<\/strong><\/span>","Russian exchanges ranked number two in 2019, with 5.23% of all funds received coming directly from criminal sources, such as dark markets, ransomware, hacks, and other illicit activity, according to CipherTrace.","U.K. exchanges followed next, with 0.69% share, while Germany, Japan, and U.S.-based exchanges accounted for less than 0.1% for receiving criminal funds, per CipherTrace.","","","Notably, the proportion of illicit funds directly received by crypto exchanges halved from 2018 to 2019. “This trend marks a three-year low for cryptocurrency exchanges around the world, with only 0.17% of funds received by exchanges in 2019 coming directly from criminal sources,” said CipherTrace. This is mainly due to more crypto anti-money laundering regulations being implemented worldwide, including AMLD5 in Europe, said the firm.","Elsewhere in the report, CipherTrace also said that crypto thefts, hacks, and frauds have increased in the first five months of 2020, totaling to $1.36 billion, as compared to $4.5 billion in 2019.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","“The largest contributor to this high number is a billion-dollar Ponzi scheme by Wotoken in China,” said CipherTrace. “The scam promised investors unrealistic returns using a non-existent algorithmic trading software. Ultimately, one Wotoken operator (with ties to the infamous PlusToken Ponzi scheme) stole an estimated $1 billion in crypto from over 715,000 victims.\"","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Update (June 9): This story has been updated to includes comments from LocalBitcoins<\/em> <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"June 9","content":"DATE"},{"type":"U.K.","content":"LOCATION"},{"type":"50%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"December 2019","content":"DATE"},{"type":"0.1%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"September 2019","content":"DATE"},{"type":"$1.36 billion","content":"MONEY"},{"type":"Germany","content":"LOCATION"},{"type":"Russia","content":"LOCATION"},{"type":"0.17%","content":"PERCENT"},{"type":"Spring","content":"DATE"},{"type":"May 2020","content":"DATE"},{"type":"0.69%","content":"PERCENT"},{"type":"CipherTrace","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"99%","content":"PERCENT"},{"type":"5.23%","content":"PERCENT"},{"type":"12.01%","content":"PERCENT"},{"type":"Japan","content":"LOCATION"},{"type":"$4.5 billion","content":"MONEY"},{"type":"the first five months of 2020","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Yogita Khatri","The Block"]}