{"summary":"Crypto asset manager Bitwise has written a new letter to the U.S. SEC\nThe letter tries to address the regulator’s concerns of market manipulation and surveillance sharing for approving a bitcoin ETF\nUnfazed by rejections, Bitwise said it is “committed” to creating a bitcoin ETF","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51341\/bitwise-writes-to-sec-again-saying-it-is-committed-to-creating-a-bitcoin-etf","publishDate":"2019-12-21T11:00:08","id":969,"type":null,"title":"Bitwise writes to SEC again, saying it is ‘committed’ to creating a bitcoin ETF","category":["Bitcoin"],"content":["Cryptocurrency asset management firm Bitwise has written a new letter to the U.S. Securities and Exchange Commission (SEC), saying that it is “committed” to creating a bitcoin exchange-traded fund (ETF).","The <a href=\"https:\/\/www.sec.gov\/comments\/sr-nysearca-2019-01\/srnysearca201901-6563974-201035.pdf\" data-v-f87c67ca=\"\">letter<\/a>, submitted by Bitwise on Wednesday and published by the SEC on Friday, is the firm's response to the regulator’s <a href=\"https:\/\/www.sec.gov\/rules\/sro\/nysearca\/2019\/34-87267.pdf\" data-v-f87c67ca=\"\">112-page disapproval order<\/a> of its <a href=\"https:\/\/www.theblockcrypto.com\/post\/42711\/bitwises-bitcoin-etf-the-last-hope-has-been-denied\" data-v-f87c67ca=\"\">bitcoin ETF<\/a>&nbsp;in October.","Penned by Bitwise’s executive team - Hunter Horsley (CEO), Hong Kim (CTO), Teddy Fusaro (COO) and Matt Hougan (global head of research) - the letter tries to address the SEC’s concerns of market manipulation and surveillance sharing for approving a bitcoin ETF.","On market manipulation front, Bitwise said the bitcoin market is “uniquely resistant” because bitcoin’s price is set in the open market. Traditional markets, on the other hand, \"rely on coordinated fix pricing,” where scandals such as the London Interbank Offered Rate (LIBOR) scandal of 2012, have occurred, according to Bitwise.","“Bitcoin’s inherent fungibility and the market’s distributed nature allowed for effective arbitrage to take place between different trading venues, which helped insulate bitcoin from attempts to manipulate individual markets,” it added.","On the requirement of surveillance sharing, Bitwise said NYSE Arca (which filed the actual bitcoin ETF proposal for Bitwise) has a surveillance sharing agreement in place with CME through its participation in the Intermarket Surveillance Group.","“As another example, the CME CF Bitcoin Reference Rate that is used to settle the CFTC-regulated CME bitcoin futures contracts relies on a robust set of rules that account for data sharing and concerns about market manipulation. This rate is governed by an Oversight Committee, chaired by the CME, and draws prices from five spot bitcoin exchanges: Bitstamp, Coinbase, Gemini, itBit, and Kraken,” said Bitwise.","A similar argument was <a href=\"https:\/\/www.coindesk.com\/sec-punts-decision-on-wilshire-phoenixs-bitcoin-etf-proposal-to-february\" data-v-f87c67ca=\"\">reportedly<\/a> also made by Wilshire Phoenix founder and managing partner William Herrmann. Wilshire has also filed a proposal with the SEC for its bitcoin and U.S. Treasury bond ETF. But the regulator, just yesterday, <a href=\"https:\/\/www.sec.gov\/rules\/sro\/nysearca\/2019\/34-87813.pdf\" data-v-f87c67ca=\"\">postponed<\/a> the decision on the ETF to Feb. 26, 2020.","In Wednesday's letter, Bitwise also said that “a large number” of U.S. investors are today investing in bitcoin and the need for a safe and efficient market instrument is “critical.” Bitwise cited a recent study by brokerage giant Charles Schwab, which <a href=\"https:\/\/www.theblockcrypto.com\/post\/49451\/bitcoin-more-popular-than-netflix-stock-among-millennials-gbtc-one-of-their-top-5-equity-holdings\" data-v-f87c67ca=\"\">showed<\/a> that millennials have a higher holding in Grayscale’s Bitcoin Trust (GBTC) investment product than Netflix and some other stocks.","Bitwise first filed its ETF proposal with NYSE Arca in January 2019. Since then, Bitwise has met with the SEC eight times, Hougan told The Block, adding that the firm has also submitted 500 pages of a whitepaper and a presentation on fake volume during the period.","Unfazed by rejections, Bitwise said that it is “committed” to provide all investors with the ability to access bitcoin in a regulated and familiar fund format. “We believe such an ETF would add material protections for the millions of U.S. investors who currently use other avenues to access the bitcoin market, as well as for any future investors who may choose to do so,” it concluded.&nbsp;"],"hashtag":["SEC"]}