{"summary":"Yieldstreet, a platform that allows retail investors to access private markets, is letting its users invest in its first crypto venture fund.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/134574\/retail-investors-can-invest-in-panteras-early-venture-fund-through-yield-street","publishDate":"2022-02-17T08:07:58","id":9694,"type":null,"title":"Retail investors can invest in Pantera&#x27;s early venture fund through Yieldstreet","category":["THE BLOCK"],"content":["Yieldstreet — a platform that allows individual retail investors to access private markets — announced Thursday its entrance into the crypto market through a partnership with \"OG\" digital asset investment firm Pantera.&nbsp;","Launched in 2015, Yieldstreet bills itself as a place where retail can invest \"like the 1%,\" investing in asset classes including commercial real estate, credit, and private equity. Those investments target double-digit returns over months and years. According to co-founder Michael Weisz, the firm is able to offer end-clients access to these investment opportunities by fractionalizing its own LP interest in these funds.&nbsp;","Now, the firm's clients will be able to add exposure to Pantera's Early Stage Token Fund, which is expected to make new investments in crypto protocols. The fund has historically backed tokens like Polkadot and Aurora and has generated a life-long return of 1,400%.&nbsp;","\"We believe that more than 75% of investors want access to unique crypto investment strategies managed by premier crypto-specialists,\" Weisz said in a press statement. \"We intend to be the bridge from Wall Street to the crypto-verse.\"","Yieldstreet plans to add further crypto funds to its platform in the future.&nbsp;","Yieldstreet joins a long list of financial technology firms that have recently jumped on the crypto bandwagon, ranging from payment apps like Venmo to robo-advisory platform Betterment.&nbsp;","In an interview with The Block, Weisz said that venture exposure provides investors with \"convexity and growth\" that may not exist with more liquid token exposure.&nbsp;","\"It is also less susceptible to the volatility,\" he added.&nbsp;","To be sure, while private markets may offer idiosyncratic returns in the long-term, in the short-term there can be risks including the risk of <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-05-08\/yieldstreet-investors-are-learning-the-meaning-of-high-risk\" data-v-f87c67ca=\"\">default<\/a>.","Pantera, which manages more than $5 billion in assets, is led by Dan Morehead, a former macro trading executive at Tiger Management.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"Aurora","content":"LOCATION"},{"type":"1,400%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$5 billion","content":"MONEY"},{"type":"Tiger Management","content":"ORGANIZATION"},{"type":"75%","content":"PERCENT"},{"type":"Dan Morehead","content":"PERSON"},{"type":"Michael Weisz","content":"PERSON"},{"type":"Pantera","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"Weisz","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}