{"summary":"FTX said customers may get over 90% of distributable value worldwide in a shortfall claim if the amended plan is approved by Q2 in 2024.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/257847\/ftx-settles-customer-property-disputes-to-speed-up-bankruptcy-proceedings","publishDate":"2023-10-17T02:54:44","id":9698,"type":null,"title":"FTX settles customer property disputes to speed up bankruptcy proceedings","category":["BANKRUPTCY"],"content":["<span data-v-f87c67ca=\"\">Bankrupt crypto exchange FTX has reached a proposed settlement with key creditors for customer property disputes in an attempt to resolve the litigation filed against the debtors and confirm an amended payout plan as early as the second quarter of next year.<\/span>","<span data-v-f87c67ca=\"\">In a <\/span><a href=\"https:\/\/www.prnewswire.com\/news-releases\/ftx-debtors-announce-settlement-of-customer-property-disputes-301958144.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\"> released Monday, FTX said such a \"Customer Shortfall Settlement\" was reached among the FTX debtors, the executive committee of the ad hoc committee of non-U.S. customers, the official committee of unsecured creditors and putative class representatives.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"The proposed settlement of the customer property issues is another major milestone in our case,\" John. J. Ray III, chief executive officer and chief restructuring officer of FTX, said. \"Together, starting in the most challenging financial disaster I have seen, the debtors and their creditors have created enormous value from a situation that easily could have been a near-total loss for customers.\"<\/span>","<span data-v-f87c67ca=\"\">FTX said that the proposed settlement comes as part of the amended reorganization plan, which is expected to be filed by Dec. 16. FTX explained in a social media <\/span><a href=\"https:\/\/twitter.com\/FTX_Official\/status\/1714078230745886775\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\"> on X that if approved by the bankruptcy court, the settlement will create a special \"Shortfall Claim\" to facilitate an offer to eligible customers to settle customer preference exposure at an agreed amount.<\/span>","<span data-v-f87c67ca=\"\">Such a shortfall claim is estimated to be about $8.9 billion for FTX.com and $166 million for FTX US, according to the statement.<\/span>","<span data-v-f87c67ca=\"\">\"Taking into account both the priority and the non-priority portions of the Shortfall Claim, the FTX Debtors estimate that customers of FTX.com and FTX US would receive, collectively, over 90% of distributable value worldwide if the Amended Plan (incorporating the Customer Shortfall Settlement) is approved by the Bankruptcy Court by the end of the second quarter of 2024,\" FTX added.<\/span>","<span data-v-f87c67ca=\"\">FTX said that it anticipates that customers of both exchanges will not be paid in full \"with greater percentage losses by customers of FTX.com.\"<\/span>","<span data-v-f87c67ca=\"\">The official committee of unsecured creditors said in a <\/span><a href=\"https:\/\/twitter.com\/FTX_Committee\/status\/1714093184848945344\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\"> on X that the amended plan will help to speed up the Chapter 11 cases and the timeline for creditor and customer recoveries, but \"there is still significant work to be done.\"<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"J. Ray III","content":"PERSON"},{"type":"the Bankruptcy Court","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"end of the second quarter of 2024","content":"DATE"},{"type":"John","content":"PERSON"},{"type":"Dec. 16","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$8.9 billion","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"$166 million","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"second quarter","content":"DATE"}],"hashtag":["BANKRUPTCY FILINGS","FTX","SAM BANKMAN-FRIED"],"authors":["Timmy Shen","The Block"]}