{"summary":"Technology holding company IGWT Block is building a blockchain-based platform for second-hand mobile phones.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51292\/igwt-block-aims-to-bring-blockchain-to-the-second-hand-mobile-phone-market","publishDate":"2020-01-07T16:45:59","id":9699,"type":null,"title":"IGWT Block aims to bring blockchain to the second-hand mobile phone market","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">Technology holding company IGWT Block is building a blockchain-based platform for second-hand mobile phones.<\/span>","<span data-v-f87c67ca=\"\">Founded in 2017 as a subsidiary of mobile phone distributor PCS Wireless, <\/span><a href=\"https:\/\/www.igwtblock.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">IGWT Block<\/span><\/a>'s pitch is to use the technology in an effort to resolv<span data-v-f87c67ca=\"\">e trust issues that plague the market as it exists today.<\/span>","<span data-v-f87c67ca=\"\">Currently, platforms like Amazon have to manually inspect second-hand items to make sure that their conditions match the descriptions. This system introduces risks and the problem of trust, IGWT Block President Flavio Mansi told The Block, as buyers have to count on the intermediary to correctly judge a phone’s condition and return their money if a quality issue arises.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Why do you necessarily have to trust Amazon?” Mansi asked.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">IGWT Block’s proposed platform, on the other hand, will make use of smart contracts to directly connect buyers and sellers, eliminating the need for any middleman.<\/span>","<span data-v-f87c67ca=\"\">After a purchase is made, Mansi explained, the money will be stored in a smart contract until the buyer receives the phone, evaluates it using IGWT Block’s diagnosis tool, and makes sure that the product received matches the advertisement.<\/span>","<span data-v-f87c67ca=\"\">“If anyone is being deceitful in any way, the money reverts back,” Mansi said. “The smart contract is governing the transaction as opposed to us having to put ourselves in the middle and mediate disputes amongst them,”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As the technology evolves, Manisi said, customers will eventually be able to see images of the exact phone they wish to purchase. This will make information more symmetric and create a more educated buying force.<\/span>","<span data-v-f87c67ca=\"\">The model took inspiration from the secondhand car market, Mansi said. Indeed, companies like <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/48199\/jpmorgan-to-finance-a-ledger-based-inventory-system-to-remove-information-asymmetry-in-the-automobile-industry\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">JPMorgan<\/span><\/a><span data-v-f87c67ca=\"\"> are trying to create blockchain-based automobile inventory systems to phase out human inspectors and bring more efficiency to the commercial lending process.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Right now, IGWT Block is only selling certified pre-owned phones–much like what Amazon is doing to build up its customer base before the blockchain platform goes live.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The company is planning to spin out from PCS Wireless in the near future, an IGWT Block spokesperson told The Block, and is seeking partners and strategic investors.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"IGWT Block","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Flavio Mansi","content":"PERSON"},{"type":"Amazon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Mansi","content":"PERSON"},{"type":"Manisi","content":"PERSON"}],"hashtag":[],"authors":["Yilun Cheng","Frank Chaparro","The Block"]}