{"summary":"Revolut, the $33 billion British digital bank, has slashed fees for customers in the United States across a range of products.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/120988\/revolut-slashes-crypto-trading-fees-in-bid-to-boost-us-business","publishDate":"2021-10-19T09:00:51","id":9702,"type":null,"title":"Revolut slashes crypto trading fees in bid to boost US business","category":["FINTECH"],"content":["Revolut, the $33 billion British digital bank, has slashed fees for customers in the United States across a range of products.","The fintech firm’s U.S. customers will now be able to trade up to $200,000 in crypto each month without getting charged commission fees on trades. Previously, standard Revolut users could trade just $200 a month before incurring fees.","Other changes allow users to withdraw a certain amount of money a month, send up to 10 international remittances a month and set up five accounts for their children free of charge.","Ron Oliveira, CEO of Revolut in the U.S., told The Block that the move is about boosting awareness of the company locally. Revolut launched in the U.S. in March 2020, just as the Covid-19 pandemic struck. The unfortunate timing hampered its early marketing efforts, according to Oliveira.","“We had a very quiet opening,” he said. “Now it’s about where are we going from here. What we’ve discovered is that we have the deepest and widest offering of any fintech in the United States today.”","Launched in London in 2015, Revolut began as a foreign exchange tool. It now fashions itself as a financial “super-app,” offering current accounts, stock and crypto trading, and a range of other products. CNBC recently revealed that the startup plans to <a href=\"https:\/\/www.cnbc.com\/2021\/09\/21\/revolut-the-33-billion-fintech-player-is-rolling-out-commission-free-stock-trading-in-the-us-.html\" data-v-f87c67ca=\"\">roll out stock trading<\/a> for U.S. customers in the coming months.","Revolut is also pursuing a banking charter in the U.S., as it plans to in many of the markets in which it operates. The startup <a href=\"https:\/\/techcrunch.com\/2021\/03\/22\/revolut-applies-for-bank-charter-in-the-us\/\" data-v-f87c67ca=\"\">submitted a draft application<\/a> with the Federal Deposit Insurance Corporation and the California Department of Financial Protection and Innovation in March.","“Part of our strategic plan globally is that we want to have banking licenses either in countries where we already have a large presence, or where we think the upside is great, and the U.S. is of course the latter,” said Oliveira, adding that a charter would give Revolut the ability to offer a much wider range of products. The firm is already looking to roll out credit cards and unsecured lines of credit in the U.S., he said.","For its charter bid to be successful, however, Revolut will need to convince regulators that banking and crypto products can coexist within the same service.","“Crypto’s one of their top questions. ‘Well, how is crypto going to be handled, inside or outside the bank?’ That’s the key question. Is crypto inside or outside the bank?” said Oliveira. “For us, crypto is outside the bank... How it’s structured is that if you have the Revolut app and you want to buy crypto, you’re not going into the bank to buy that, you’re going outside the bank. You’re going to a different entity to do that.”","The proposed structure is reminiscent of the model adopted by Zopa, the British peer-to-peer lender founded in 2005. The company <a href=\"https:\/\/www.zopa.com\/blog\/article\/zopa-launches-new-digital-bank-offering-consumers-a-compelling-alternative-when-they-need-it-most\" data-v-f87c67ca=\"\">launched a licensed bank<\/a> in the United Kingdom in the summer of 2020, which it now runs alongside — but segmented from — its peer-to-peer lending business.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"2005","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"California Department of Financial Protection and Innovation","content":"ORGANIZATION"},{"type":"19","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Federal Deposit Insurance Corporation","content":"ORGANIZATION"},{"type":"Covid","content":"PERSON"},{"type":"$33 billion","content":"MONEY"},{"type":"March 2020","content":"DATE"},{"type":"March","content":"DATE"},{"type":"$200,000","content":"MONEY"},{"type":"Zopa","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"Ron Oliveira","content":"PERSON"},{"type":"$200","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Oliveira","content":"PERSON"},{"type":"United Kingdom","content":"LOCATION"},{"type":"summer of 2020","content":"DATE"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}