{"summary":"Hong Kong&#x27;s regulator spells out minimum thresholds needed for an ETF issuer to apply to list a crypto futures product.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/181409\/hong-kong-outlines-new-rules-for-crypto-futures-etf-issuers","publishDate":"2022-10-31T13:05:39","id":9712,"type":null,"title":"Hong Kong outlines new rules for crypto futures ETF issuers","category":["MARKET STRUCTURE"],"content":["Hong Kong's regulator has <a href=\"https:\/\/apps.sfc.hk\/edistributionWeb\/gateway\/EN\/circular\/doc?refNo=22EC60\" data-v-f87c67ca=\"\">detailed<\/a> the basic requirements that exchange-traded fund managers need to meet in order to list crypto products in the city.","The list forms part of a wider effort by city officials to re-establish Hong Kong as a center for virtual assets. The finance minister and other senior officials on Monday <a href=\"https:\/\/www.theblock.co\/post\/180305\/hong-kong-retail-consultation-virtual-assets\" data-v-f87c67ca=\"\">laid out<\/a> plans to attract crypto-related companies including clearer trading rules.","Hong Kong's regional government also re-emphasized its participation in China's broader experiment with central bank digital currencies.&nbsp;","Among those plans were crypto futures ETFs with underlying assets in instruments linked to bitcoin and ether futures traded on the Chicago Mercantile Exchange (CME), Securities and Futures Commission Deputy CEO Julia Leung announced at Hong Kong Fintech Week today.","A circular published after the forum closed for the day spelt out more details on what the SFC expected from any ETF issuer that sought regulatory approval to list a futures crypto product in Hong Kong.&nbsp;","''It has been observed that there are meaningful developments in the VA ecosystem recently and some of the initial concerns over VA Futures ETFs have become increasingly manageable and could be adequately addressed with proper safeguards, disclosure and investor education,'' the SFC said in its regulatory notice.","But despite the announcement the agency raised caution about cryptocurrencies and other virtual assets. The SFC's announcement noted that, \"a good part of the VA ecosystem (e.g., VA trading platforms) is still not subject to the same robust regulation as service providers or products in traditional financial markets, investment products that invest directly in spot VAs may continue to present investor protection issues.''","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Julia Leung","content":"PERSON"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"Securities and Futures Commission Deputy","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Benjamin Robertson","The Block"]}