{"summary":"2022 is looking like another important year for crypto currency as it faces the test of ongoing volatility and additional macroeconomic forces. Whilst the current pressure on the industry may feel substantial, the crypto market that emerges from this winter will be the fittest we’ve ever seen.  This period should also be used as an opportunity to consider another crucial tenet in evolving and maturing the asset class, regulation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153360\/regulation-will-bring-rewards-to-those-who-embrace-it","publishDate":"2022-06-22T09:00:37","id":9715,"type":null,"title":"Regulation will bring rewards to those who embrace it","category":["SPONSORED"],"content":["<b data-v-f87c67ca=\"\">Quick Take:<\/b>","<span data-v-f87c67ca=\"\">2022 is looking like another important year for crypto currency as it faces the test of ongoing volatility and additional macroeconomic forces. Whilst the current pressure on the industry may feel substantial, the crypto market that emerges from this winter will be the fittest we’ve ever seen.&nbsp; This period should also be used as an opportunity to consider another crucial tenet in evolving and maturing the asset class, regulation.<\/span>","<a href=\"https:\/\/www.lmaxdigital.com\/overview\/?utm_source=TheBlock&amp;utm_medium=sponsoredpost&amp;utm_content=link2&amp;utm_campaign=june2022\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">LMAX Digital<\/span><\/a><span data-v-f87c67ca=\"\"> saw a rapid increase in institutional adoption in 2021, as corporates, hedge funds and asset managers were drawn to its low latency, high throughput<\/span><a href=\"https:\/\/www.lmaxdigital.com\/technology\/?utm_source=TheBlock&amp;utm_medium=sponsoredpost&amp;utm_content=link3&amp;utm_campaign=june2022\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">institutional grade infrastructure<\/span><\/a><span data-v-f87c67ca=\"\">. Major investment banks continue to look at ways to access this fast-growing asset class and regulation is key for further institutional growth in the sector. Though a clear regulatory framework is required, one that is rushed and confused is not the answer.<\/span>","<b data-v-f87c67ca=\"\">The importance of regulatory determinism<\/b>","<span data-v-f87c67ca=\"\">Crypto is here to stay and a long-term lens needs to be applied to well-considered regulation that preserves market integrity, protects consumers and promotes confidence in a nascent industry that continues to develop.<\/span>","<span data-v-f87c67ca=\"\">It is a fine balance to strike, to set out the “rules of the game” that protect market participants and encourage this young sector without stifling growth; regulations that will provide economic benefits if applied fairly and consistently.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Policymakers and regulators around the world must therefore have a full understanding and be clear on industry strategy, what they are regulating and why. Only then can countries reap the rewards that come with an effective framework including greater innovation,<\/span><a href=\"https:\/\/www.lmaxdigital.com\/technology\/?utm_source=TheBlock&amp;utm_medium=sponsoredpost&amp;utm_content=link4&amp;utm_campaign=june2022\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">technology<\/span><\/a><span data-v-f87c67ca=\"\">, job creation and also monetary benefits in the way of taxes.<\/span>","<b data-v-f87c67ca=\"\">Determinism in action<\/b>","<span data-v-f87c67ca=\"\">As the industry has grown at pace, it is encouraging to see countries like the UK and US taking crypto regulation and market structure seriously. We have the solutions at our fingertips, and those who want the rewards have the ability to be a first mover.<\/span>","<span data-v-f87c67ca=\"\">The recent draft bill, and potentially the first major bipartisan legislation, by US senators Cynthia Lummis and Kirsten Gillibrand is a positive and important step forward to add credibility to the asset class,<\/span> <span data-v-f87c67ca=\"\">currently stymied by the offshore nature of trading and regulation. The aim of the Bill is a complete regulatory framework for digital assets that encourages responsible financial innovation, flexibility, transparency and robust consumer protections while integrating digital assets into existing law.<\/span>","<a href=\"https:\/\/www.lmaxdigital.com\/overview\/?utm_source=TheBlock&amp;utm_medium=sponsoredpost&amp;utm_content=link5&amp;utm_campaign=june2022\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">LMAX Digital<\/span><\/a><span data-v-f87c67ca=\"\"> has always advocated for fair and well-regulated capital markets, with crypto currencies regulated and aligned across jurisdictions globally. We very much believe that appropriate regulation will open up market access for financial services investors which in turn will accelerate institutional adoption of crypto, whilst also protecting the retail market.<\/span>","<b data-v-f87c67ca=\"\">The way forward<\/b>","<span data-v-f87c67ca=\"\">With ongoing demand from institutional and retail investors for digital assets, even during times of volatility, we are at a point in the lifecycle where there is an opportunity and need for regulation to play a greater role in supporting the asset class.<\/span>","<span data-v-f87c67ca=\"\">Some countries, notably the US and UK, are already in a unique position of having a growing group of supportive policy makers and innovative financial sectors to enable this.&nbsp; This blend is likely to foster huge rewards from the growth of cryptocurrency and in turn will continue to encourage the evolution and widespread adoption of digital assets.<\/span>","<span data-v-f87c67ca=\"\">Keep up to date with LMAX Digital, sign-up for the<\/span><a href=\"https:\/\/www.lmaxdigital.com\/?newsletter-signup\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">LMAX Digital News Bulletin<\/span><\/a>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by LMAX<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"winter","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"Kirsten Gillibrand","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"LMAX Digital News Bulletin","content":"ORGANIZATION"},{"type":"LMAX Digital","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}