{"summary":"Crypto fans have cumulatively spent $280,000 in transaction fees to mint more than 28,000 free Coinbase NFTs on Ethereum.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214646\/collectors-spend-280000-in-ethereum-fees-to-mint-28000-coinbase-nfts","publishDate":"2023-02-23T13:16:44","id":9721,"type":null,"title":"Collectors spend $280,000 in Ethereum fees to mint 28,000 Coinbase NFTs","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto fans have cumulatively spent $280,000 in transaction fees to mint more than 28,000 Coinbase NFTs on Ethereum. The NFTs were available to be minted for free for those who wanted to mark the testnet launch of Coinbase's Layer 2 network, Base.","Coinbase <a href=\"https:\/\/www.theblock.co\/post\/214183\/coinbase-unveils-layer-2-network-and-developer-fund\" data-v-f87c67ca=\"\">introduced<\/a> Base today as a Layer 2 network set to run on top of the Ethereum mainnet. It's built on Optimism's OP Stack and will be part of its \"Superchain\" — a name given to the Layer 2 networks built on the OP Stack that are compatible with each other.","Base will be a network for other protocols to build on top of and it will interact with Coinbase's product suite, but it won't have a token.","To mark the network's launch, Coinbase created a free mint NFT. The NFTs <a href=\"https:\/\/zora.co\/collections\/0xd4307e0acd12cf46fd6cf93bc264f5d5d1598792\/info\" data-v-f87c67ca=\"\">can be minted<\/a> for four days following the announcement and are on the Ethereum mainnet. They appear to be identical and show a blue circle.","The NFTs are available to be bought and sold on NFT marketplaces like OpenSea. Currently they have a base price of 0.011 ETH ($18), which is around the cost of buying one — in terms of Ethereum transaction fees. These NFTs have already seen 150 ETH ($247,000) in trading volume.","Each Base NFT has a number and ones with lower numbers seem to be selling for more. The highest sale so far was the Base NFT 45, which was sold for 1.88 ETH ($3,100).","Optimism also has a <a href=\"https:\/\/optimism.mirror.xyz\/2jk3D1Y8-hid8YOCUUa6yXmsyzNCYYyFJP0Nhaey9x0\" data-v-f87c67ca=\"\">free mint<\/a> available for subscribers to its Mirror newsletter with the same purpose in mind. So far, 23,719 NFTs have been minted but since they're on the Optimism network, the transactions fees paid will be much lower.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3,100","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$280,000","content":"MONEY"},{"type":"Base","content":"LOCATION"},{"type":"Base NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$247,000","content":"MONEY"},{"type":"$18","content":"MONEY"}],"hashtag":["COINBASE","ETHEREUM","OPENSEA"],"authors":["Tim Copeland","The Block"]}