{"summary":"MyPrize, an online crypto casino supporting multiplayer games, has emerged from stealth with $13 million in funding.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284636\/crypto-casino-myprize-funding-valuation","publishDate":"2024-03-26T07:13:52","id":9722,"type":null,"title":"Crypto casino MyPrize raises funds at a $140 million valuation","category":["VENTURE CAPITAL"],"content":["MyPrize, an online crypto casino supporting multiplayer games, has emerged from stealth with $13 million in funding.","The funding was realized via two rounds and brought MyPrize's valuation to $140 million based on its fully diluted equity capitalization and the implied fully diluted value of warrants, the startup said Tuesday.","The two rounds were structured as equity with token warrants, MyPrize co-founder Zach Bruch told The Block — adding that the first round, worth $5 million, closed last October and the second round, worth $8 million, closed this month. MyPrize doesn't have formal names for the rounds, such as pre-seed or seed, Bruch added.","The two rounds were led by Dragonfly and Boxcars Ventures, respectively, and saw participation from a16z Scout, Mechanism Capital, Arrington Capital, Breed VC, JST Capital, 2 Punks Capital and others. Angel investors, including Pudgy Penguins' Luca Netz, Blockchain.com's Peter Smith, Sei Labs' Jeff Feng, Jack Entertainment's Steve Rosenthal, and Spencer Noon, also joined the rounds.","MyPrize is a web3 gaming startup that also supports streaming, allowing users to collaborate and play together.","\"MyPrize takes all of the fun of the existing single-player online gaming market and makes it multiplayer,\" Bruch said.","Before starting up MyPrize, Bruch co-founded the NFT platform Recur, which <a href=\"https:\/\/www.theblock.co\/post\/246477\/recur-to-shut-down-less-than-two-years-after-raising-50-million-in-series-a\" data-v-f87c67ca=\"\">shut down<\/a> last August, citing \"unforeseen challenges and shifts in the business landscape.\" Recur <a href=\"https:\/\/www.theblock.co\/linked\/117485\/steve-cohen-backed-nft-platform-closes-series-a-at-333-million-valuation\" data-v-f87c67ca=\"\">raised<\/a> $50 million at a $333 million valuation in a round led by Digital, a metaverse investment fund backed by billionaire Steve Cohen's family office.","A month after Recur's shutdown, Bruch co-founded MyPrize in September. He said the MyPrize platform is launching in early access mode today and will last several weeks. Bruch added that the platform's general launch is expected within the second quarter of this year.","MyPrize has two websites, one for U.S. users and the other for non-U.S users. The U.S. site is a free-to-play social casino, and the global site is a real money crypto casino, Bruch said.","MyPrize also launched its rewards program today that will offer early users points called XP. Users across both U.S. and non-U.S. sites can earn XP, Bruch said, adding that they can also participate in a prize pool of $100,000.","\"Prizes are given primarily based on the number of referrals a user has,\" he said.","When asked if XP points will be converted into MyPrize's token, Bruch said he can't comment on the token model yet.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arrington Capital","content":"ORGANIZATION"},{"type":"Steve Cohen","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Bruch","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$13 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Steve Rosenthal","content":"PERSON"},{"type":"Punks Capital","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$140 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"Boxcars Ventures","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"},{"type":"August","content":"DATE"},{"type":"Pudgy Penguins","content":"PERSON"},{"type":"Jeff Feng","content":"PERSON"},{"type":"second quarter of this year","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Zach Bruch","content":"PERSON"},{"type":"$8 million","content":"MONEY"},{"type":"Luca Netz","content":"PERSON"},{"type":"Digital","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"$333 million","content":"MONEY"},{"type":"Jack Entertainment","content":"PERSON"},{"type":"Peter Smith","content":"PERSON"},{"type":"MyPrize","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Spencer Noon","content":"PERSON"},{"type":"$50 million","content":"MONEY"}],"hashtag":["GAME","SEED &AMP; PRE-SEED"],"authors":["Yogita Khatri","The Block"]}