{"summary":"Volumes on HashKey Exchange surged to many times their normal level late last week — a trading frenzy the company put down to a token rewards program.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265837\/hashkey-token-spike","publishDate":"2023-12-04T04:49:33","id":9725,"type":null,"title":"Hong Kong&#x27;s HashKey says token incentives drove spike in trading volumes","category":["COMPANIES"],"content":["Volumes on HashKey Exchange surged to many times their normal level late last week —&nbsp;an apparent trading frenzy the company put down to a token rewards program.","Daily trading on the month-old exchange <a href=\"https:\/\/www.coingecko.com\/en\/exchanges\/hashkey-exchange#statistics\" data-v-f87c67ca=\"\">rose to a high-point of around $4.5 billion<\/a> on Dec. 1, according to CoinGecko data. By comparison, Binance, the world’s largest crypto exchange, recorded $11.3 billion in volume over the past 24 hours.","On Dec. 3, HashKey’s daily trading volume fell sharply to $275 million — still higher than usual but closer to volumes recorded in its first month.","The exchange, part of the HashKey Group, became the first <a href=\"https:\/\/www.theblock.co\/post\/242897\/hashkey-obtains-first-license-in-hong-kong-to-offer-crypto-retail-trading\" data-v-f87c67ca=\"\">to obtain a license to offer retail crypto trading in Hong Kong<\/a> in August this year as part of a new regulatory regime in the region. It officially <a href=\"https:\/\/group.hashkey.com\/en\/newsroom\/HashKey%20-%20Launches%20-%20app\" data-v-f87c67ca=\"\">opened to traders<\/a> on Nov. 1.","A spokesperson for HashKey Group attributed the spike in volumes to trading incentives taking the form of HSK tokens — or EcoPoints — <a href=\"https:\/\/www.theblock.co\/post\/225852\/hashkey-token-hsk\" data-v-f87c67ca=\"\">which it first unveiled in April<\/a>. “The spike in activity is a result of our recent campaigns for HSK rewards,” they said. “At HashKey, we operate strictly within the regulatory framework, and any actions of misconduct are not tolerated.”","HashKey <a href=\"https:\/\/x.com\/HashKeyExchange\/status\/1730176566150435008?s=20\" data-v-f87c67ca=\"\">issued a post<\/a> outlining the details of one of its incentive campaigns via X (formerly known as Twitter) on Nov. 30. The post advertised the arrival of a DOT\/USD trading pair on the platform while encouraging users to “discover more ways to earn” through ongoing campaigns. “Log in, trade, and grab your share of HSK rewards!” it added.","The post did not exactly go viral, however. It garnered just 15 likes on X.","<span data-v-f87c67ca=\"\">HashKey Exchange Trade Volume. Image: <a href=\"https:\/\/www.coingecko.com\/en\/exchanges\/hashkey-exchange\" data-v-f87c67ca=\"\">CoinGecko<\/a>.<\/span>","<a href=\"https:\/\/x.com\/WuBlockchain\/status\/1730494793791496697?s=20\" data-v-f87c67ca=\"\">Although crypto sector<\/a> <a href=\"https:\/\/x.com\/MHiesboeck\/status\/1730499453168075005?s=20\" data-v-f87c67ca=\"\">commentators<\/a> on X have suggested, in recent days, that the sudden surge may be the result of wash trading, HashKey’s spokesperson said that no misconduct has been detected.","Justin d’Anethan, head of business development in Asia for crypto market-making firm Keyrock, said of the spike, “Many people in the crypto space assumed wash trading was taking place, where one or several players on the platform would intentionally match a large number of orders to artificially increase volumes — and so the perceived activity on the exchange. But it’s almost unbelievable. If one wanted to look more active, one would do it gradually instead of in one-go.”","The Asia-focused HashKey Group describes itself as an “end-to-end” crypto firm, with products spanning trading, custody, venture investment and web3 infrastructure. It was originally formed as a spinoff of Chinese conglomerate Wanxiang Group and was one of the earliest investors in Ethereum in 2014.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Justin d’Anethan","content":"PERSON"},{"type":"2014","content":"DATE"},{"type":"HashKey Exchange Trade Volume","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Dec. 3","content":"DATE"},{"type":"Dec. 1","content":"DATE"},{"type":"Nov. 30","content":"DATE"},{"type":"HSK","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"$275 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DOT\/USD","content":"ORGANIZATION"},{"type":"$11.3 billion","content":"MONEY"},{"type":"$4.5 billion","content":"MONEY"},{"type":"Nov. 1","content":"DATE"},{"type":"Keyrock","content":"PERSON"},{"type":"HashKey Exchange","content":"ORGANIZATION"},{"type":"Wanxiang Group","content":"ORGANIZATION"},{"type":"HashKey Group","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}