{"summary":"RAI co-founder Ameen Soleimani used the trade to support his argument that there’s a mistake in the way RAI was designed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205078\/vitalik-buterin-closes-seven-month-short-trade-on-rai-token-netting-92000","publishDate":"2023-01-24T10:56:59","id":9728,"type":null,"title":"Vitalik Buterin closes seven-month short trade on RAI token, netting $92,000","category":["CRYPTO ECOSYSTEMS"],"content":["Ethereum co-founder Vitalik Buterin closed a seven-month short position on the non-pegged purported stablecoin RAI, netting a cool $92,000, according to on-chain records.","Buterin took the trade out in May and June, borrowing 400,000 RAI and selling it for $1.2 million of DAI, a stablecoin pegged to the US dollar. This created an effective short position on RAI against the US dollar.","Buterin closed the position on Jan. 22, selling $1.13 million of DAI and ether for RAI. He was left with a gain of $92,000, according to those <a href=\"https:\/\/etherscan.io\/tx\/0xef28cfcf2e3a9352402ee3c4c1d21e6452cf606aa169850b270e17df2a338f2b\" data-v-f87c67ca=\"\">on-chain records<\/a> from Buterin's Ethereum wallet (as noted by on-chain researcher <a href=\"https:\/\/twitter.com\/kyoronut\/status\/1616955373851926533\" data-v-f87c67ca=\"\">kyoronut<\/a> on Twitter).","Built by Reflexer Labs, RAI is an experimental “stablecoin” that isn’t pegged to any specific token or fiat currency but is backed by ether. Those who want to mint RAI have to lock up their ether as collateral and pay a 2% fee.&nbsp;","RAI uses an algorithmic approach to stay stable. This design has an impact on the supply and demand for the token, helping to reduce its volatility — without keeping it pegged to any specific asset.","Due to its design, RAI does not stay pegged to the US dollar and does fluctuate over time. Over the last year, its price has decreased to $2.79 from $3.07. However it has remained much less volatile than most free-floating cryptocurrencies, including ether, which is used as its collateral.","Reflexer Labs co-founder Ameen Soleimani, who is currently the co-founder and CEO of SpankChain, used Buterin’s trade to support his argument that RAI’s current design was flawed.&nbsp;","“ETH-only RAI was a mistake,” he <a href=\"https:\/\/twitter.com\/ameensol\/status\/1617582677833699330\" data-v-f87c67ca=\"\">said<\/a> on Twitter.","Soleimani argued that because RAI holders don’t benefit from staking yields on the ether used as collateral, there’s an opportunity cost for minting it. As a result, he claimed the RAI redemption rate — what keeps RAI stable — should always be negative. This means the algorithm that is supposed to keep RAI flat would instead give it a slight downward trajectory. This is less than ideal since the whole point of the token was to try to keep it as stable as possible.","The way to solve this, he said, would be to use stETH as collateral. This is a liquid staking token that receives the ether staking yield. If this was used, then the collateral underpinning RAI would increase in line with the staking yield, benefitting RAI holders and removing the opportunity cost of minting it.","Only there’s a catch. When RAI was built, the founding team essentially threw away the keys. Unlike many Ethereum projects that have admin keys, giving them the ability to upgrade their protocols, RAI elected not to do so. Soleimani took the blame for this, acknowledging that it was mostly him in the founding team who was focused on what he described as “ungovernance.”","He added that the only way to fix this and introduce stETH as collateral would be to fully restart the protocol and try again with the changes. “Ungovern at your own risk,” he mused.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$1.13 million","content":"MONEY"},{"type":"Reflexer Labs","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"$1.2 million","content":"MONEY"},{"type":"DAI","content":"ORGANIZATION"},{"type":"Jan. 22","content":"DATE"},{"type":"Buterin","content":"LOCATION"},{"type":"RAI","content":"ORGANIZATION"},{"type":"$3.07","content":"MONEY"},{"type":"last year","content":"DATE"},{"type":"Ameen Soleimani","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"$2.79","content":"MONEY"},{"type":"$92,000","content":"MONEY"}],"hashtag":["DAI","STAKING","VITALIK BUTERIN"],"authors":["Tim Copeland","The Block"]}