{"summary":"The Block recent spoke with Tim McCourt, managing director at derivatives trading firm CME Group, on the sidelines of a crypto asset event in New York.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49265\/cme-group-can-better-serve-crypto-customers-than-nascent-crypto-native-firms-says-cme-managing-director-tim-mccourt","publishDate":"2019-12-24T16:12:53","id":9729,"type":null,"title":"Catching up with CME Group&#x27;s crypto executive Tim McCourt","category":["INSTITUTIONAL INVESTORS"],"content":["<iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/2Rt9T-G2yKw\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">The Block recent spoke with Tim McCourt, managing director at derivatives trading firm CME Group, on the sidelines of a crypto asset event in New York.<\/span>","<span data-v-f87c67ca=\"\">During a <\/span><a href=\"https:\/\/youtu.be\/2Rt9T-G2yKw\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">recent interview<\/span><\/a><span data-v-f87c67ca=\"\"> with The Block in late November, McCourt discussed the upcoming launch of CME’s bitcoin option, and the company’s position amid the proliferation of crypto-native trading venues and a growing Asian market.<\/span>","<span data-v-f87c67ca=\"\">Founded in 1848, the Chicago-based firm oversees the trading of financial derivatives contracts ranging from ones tied soybeans and corn to others tied to oil and other energy markets. It launched its first bitcoin product, cash-settled futures, in 2017. This year, McCourt said, the platform saw around 6,500 futures contracts processed everyday. Increasing demand from customers has prompted CME to expand into bitcoin options, starting Jan. 13 next year.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Besides conventional institutions, hedge funds, and commodity traders, McCourt also saw a proliferation of crypto-first clients on its platform. He believes that CME can serve these clients better than newly established crypto native venues.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">McCourt believes customers have not always prioritized security when choosing a marketplace, but will start to do so in light of these incidents.&nbsp;<\/span>","Still, CME is not the only institutional player looking to serve traders newfangled products tied to bitcoin. Intercontinental Exchange's Bakkt beat CME to the punch with its bitcoin option, which launched earlier this month. And ErisX, the TDAmeritrade-backed venture, rolled-out its bitcoin future product last week. Also, the unregulated nature of several offshore exchanges are attractive for certain traders, who want to trade with large amounts of leverage.","<span data-v-f87c67ca=\"\">In any case, McCourt also sees potential in the emerging Asian market. CME has seen a geographic breakdown of about 50% inside the U.S. and 50% outside the U.S. In fleshing out its upcoming bitcoin options market, he said, CME will strive to reach the same 50\/50 split.<\/span>","<b data-v-f87c67ca=\"\">Frank: <\/b>Ladies and gentlemen, we are joined by Tim McCourt. He is over at CME Group, leading a lot of the blockchain, well, crypto currency products that they have. We've got futures, options are on the table for January 19th, I think.","<b data-v-f87c67ca=\"\">Tim: <\/b>January 13th.","<b data-v-f87c67ca=\"\">Frank: <\/b>January 13th. He just got off this panel at the digital assets summit. We're excited to have you give us an overview about what's going on at CME right now. Futures growth is strong options are coming next year. What else you got cooking?","<b data-v-f87c67ca=\"\">Tim: <\/b>Well first of all thanks again for having me here. I'm always excited to talk to you and the team at The Block. So, yes at CME We've been focusing on bitcoin futures since December 2017, and it's been a great success story for the exchange. We really view ourselves as the leader for derivatives and cryptocurrency at this point in time where our product is grown. We're doing about 6,500 futures contracts a day in 2019, which is worth a little bit under thirty five thousand bitcoins per day. So when you look at that, in terms of the other venues available in the U.S. market particularly, we certainly are one of the leading centers of price discovery for Bitcoin. We're super excited about that. The balance participation in terms of global participation and customer balance, growing open interest, you know, all of these things come together, really have developed a robust futures market. And now it makes great sense for us to introduce options on top of that futures market, which will launch on January 13.","<b data-v-f87c67ca=\"\">Frank: <\/b>Now, when you're thinking about launching that options product, were you looking for the right liquidity in the futures product and able to roll that out? What informed the development of options from your experience running that futures platform?","<b data-v-f87c67ca=\"\">Tim: <\/b>Yeah, it's a great question. So I think first and foremost, when we look to design and develop products at CME group, it's always in response to clearly articulated customer demand. We're always working with customers to understand their risk management needs and design products that fit those needs. So customers were really asking for it. And that's perhaps the strongest signal. What you're talking about with respect to the future and things like that. That's really about the timing. When does it make sense? And you really need a robust futures market because it not only needs to be able to handle and absorb the associated hedging activity options, but it really needs to be a standalone market that can provide the price discovery to underlie that option. So two years in with the growth that we've seen in the global participation now makes great time to introduce those options. And customers agree with us and are looking forward to the launch.","<b data-v-f87c67ca=\"\">Frank: <\/b>We see price discovery moving to derivatives. Derivatives market in Asia is heating up. Almost seems like every day we get a new exchange announcement or a new product announcement on things like perpetual swaps, options and the like. CME is positioned really well, but how do you maintain that volume dominance, at least in the regulated futures side going into 2020.","<b data-v-f87c67ca=\"\">Tim: <\/b>Yeah, I think certainly CME is the leading venue for crypto derivatives right now. And in terms of maintaining our position in the marketplace, it's really focusing on customers. Not only for cryptocurrency, but all products at CME. We truly believe is central tenant. If we focus on giving customers what they want and enabling them to better manage their risk in the marketplace. That is a tried and tested strategy for success. And that is certainly what we've accomplished with Bitcoin futues.","<b data-v-f87c67ca=\"\">Frank: <\/b>And what do the clients look like? Are they almost the same as the folks trading your traditional derivative products?","<b data-v-f87c67ca=\"\"><\/b><strong data-v-f87c67ca=\"\">Tim:<\/strong> That's a good question for the most part, yes. Right. So we have very balanced participation in terms of retail institutions, hedge funds, CTAs all kind of usual cast of characters and customers that we have in other products. But what's been interesting to observe is we've seen the advent of crypto only customers. So you have these market participants and market professionals who have started crypto trading firms starting crypto hedge funds. So with the advent of crypto only firms, we've actually seen the customer base expand slightly for this product, very similar personas or personalities in the market. But, you know, a little bit of a proliferation in terms of the type of customer because of the crypto only focus.","<b data-v-f87c67ca=\"\">Frank: <\/b>We've seen a lot of issues with some of the crypto native exchanges in Asia. Deribit had a pricing miscalculation on one of their indexes. Bitmex for instance, exposed 30,000 customer e-mails. Despite the volume and attractiveness that they have in the market, there are some issues with the nascent infrastructure that they might have relative to a CME. Have you seen in recent weeks customers coming with the notion of, well, maybe we should be trading on a venue that's a little more up to snuff?","<b data-v-f87c67ca=\"\">Tim: <\/b>Yeah, I mean, certainly it's something that we haven't seen in the last few weeks because that's one of the main reasons people come to CME to begin with. So you know CME is nearly a 200 year old institution and we have a long standing tradition of delivering trusted solutions to the market for a trusted and tried counterparty. So I think what we're seeing now is some of the benefits of the central clearing model and a regulated venue are starting to come to light when you see some of those instances in the unregulated space or some of the OTC platforms, especially overseas. I think it's reinforcing what people have already known, but maybe not necessarily at the forefront of their trading decision. So when they're seeing some of these events happen in the marketplace, they're coming to CME even more so to manage their risk because it's tried, it's tested, it's transparent, it's regulated. And we have again kind of nearly a hundred eighty year history of developing products and meeting their risk management needs and being that central counterparty. I think that's becoming more important. But that's not new. That's what we do with the CME.","<b data-v-f87c67ca=\"\">Frank: <\/b>You guys have had a ton of success with this product despite, and maybe I was contributing to it, noise in 2018 about it not being physically delivered. Everybody wanted to physically delivered futures. The fact that, you know, it has to be fully collateralized. But despite that, not being in place, huge volume growth. Do you see that changing and maybe moving into physical, we've talked about this in the past, or allowing some leverage.","<b data-v-f87c67ca=\"\">Tim: <\/b>I think in general, when looking at the financial versus physical conversation for futures, it's not an either or decision. You see that in other asset classes. That's not a unique paradigm that exists just just in crypto. So there's certainly room for both in the marketplace and different clients and different participants will be attracted to different things. But I think one thing that does make CME unique is when we look at the fact that our Bitcoin futures and then therefore the options on those futures are tied to the CMEC of Bitcoin reference rate, that's a regulated benchmark. So back in September, that approved benchmark status in Europe, it's regulated under BMR. It's a European benchmark. So the fact that we now have a tried and tested benchmark that also underlies it. I mean, that's a product differentiator that we're also very proud of. And we think lends even further credibility to the price discovery of our associated products.","<b data-v-f87c67ca=\"\">Frank: <\/b>You were in Asia not too long ago when you had your cast on.","<b data-v-f87c67ca=\"\">Tim: <\/b>That's right.","<b data-v-f87c67ca=\"\">Frank: <\/b>We met office securities traders association. We were on a panel, that was fun! What's the interests like in Asia? How could CME tap into that?","<b data-v-f87c67ca=\"\">Tim: <\/b>Well, so what's interesting when we look at the Bitcoin futures. The geographic breakdown is about 50 percent inside the U.S. and 50 percent outside the U.S., both in terms of hours of trading as well as country of origin. And I think that really speaks largely to the demand that is coming out of the Asia region. Crypto is a red hot topic in Asia. There's a lot of interest, a lot of trading activity both on spot platforms as well as derivative platforms. So I think the demand is there. Now, what's interesting is when we look to introduce options in January, there's obviously demand for that. The trick for exchange operators is always, how do you manifest that demand into volume? We will certainly see that in January, but we're looking forward to it. So hard to say if we'll see that same 50 50 split that we've seen in futures but we're going to try and pull that off.","<b data-v-f87c67ca=\"\">Frank: <\/b>Right. Well, we're looking forward to the updates as they come.","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Editor's Note:<\/em><\/strong><em data-v-f87c67ca=\"\">&nbsp;This article has been corrected to properly attribute certain statements to McCourt.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CMEC","content":"ORGANIZATION"},{"type":"Intercontinental Exchange","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"December 2017","content":"DATE"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"1848","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"Jan. 13","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"January 13","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"the U.S","content":"LOCATION"},{"type":"Bitcoin futues","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Chicago","content":"LOCATION"},{"type":"50 percent","content":"PERCENT"},{"type":"CME","content":"ORGANIZATION"},{"type":"January 13th","content":"DATE"},{"type":"January 19th","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"McCourt","content":"PERSON"},{"type":"Tim McCourt","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","Yilun Cheng","The Block"]}