{"summary":"Fidelity Digital Assets will add Ethereum capabilities for its institutional customers on Oct. 28.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178462\/fidelity-digital-assets-will-begin-offering-eth-to-institutions-later-this-month","publishDate":"2022-10-19T18:06:56","id":973,"type":null,"title":"Fidelity Digital Assets will begin offering ETH to institutions later this month","category":["COMPANIES"],"content":["Fidelity Digital Assets will start offering its institutional customers the ability to transact with ether on Oct. 28, a spokesperson confirmed to The Block.","\"Investors will be able to buy, sell and transfer ether, accessing the same operational excellence, robust security, and dedicated client service model provided for bitcoin investments today,\" the company told institutions in an email that later circulated on social media.","Fidelity Digital Assets is an independent subsidiary of financial services company Fidelity Investments, focusing exclusively on digital assets. The company launched in 2018 with bitcoin trading and custody offerings and <a href=\"https:\/\/www.dfs.ny.gov\/reports_and_publications\/press_releases\/pr1911191\" data-v-f87c67ca=\"\">received<\/a> a trust charter from New York's financial services regulator in 2019.&nbsp;","\"With the Ethereum Merge completed, many investors are looking at Ethereum through a new lens,\" the screenshot posted to Twitter states.","Both Fidelity Digital Assets and its parent Fidelity Investments has revealed a slew of crypto-related announcements in recent weeks.","The Wall Street Journal <a href=\"https:\/\/www.theblock.co\/post\/168603\/fidelity-to-offer-bitcoin-trading-to-retail-customers-reports\" data-v-f87c67ca=\"\">reported<\/a> that Fidelity Investments was looking to launch bitcoin trading capabilities for retail customers on Sept. 12. Fidelity Digital Assets, Charles Schwab and Citadel Securities then said they were <a href=\"https:\/\/www.theblock.co\/post\/169643\/charles-schwab-citadel-fidelity-digital-launch-digital-asset-exchange\" data-v-f87c67ca=\"\">launching<\/a> a digital asset exchange called EDX Markets a day later. Fidelity Investments then <a href=\"https:\/\/www.theblock.co\/post\/174806\/fidelity-reveals-ethereum-index-fund-with-5000000-in-sales-in-new-filing\" data-v-f87c67ca=\"\">disclosed<\/a> that it would launch a new Ethereum Index Fund in a Sept. 26 Securities and Exchange Commission (SEC) filing.&nbsp;","Fidelity companies have also <a href=\"https:\/\/www.theblock.co\/post\/169733\/fidelitys-rumored-retail-crypto-plans-are-on-display-in-recent-job-ads\" data-v-f87c67ca=\"\">posted<\/a> several roles for crypto jobs in recent months, with open positions including a crypto wallet product owner at Fidelity Digital Assets.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Fidelity Investments","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Charles Schwab","content":"PERSON"},{"type":"Ethereum Merge","content":"ORGANIZATION"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"Sept. 26","content":"DATE"},{"type":"Sept. 12","content":"DATE"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"Oct. 28","content":"DATE"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Kristin Majcher","The Block"]}