{"summary":"Popular Solana NFT project DeGods has switched to a 0% royalty model, meaning it will no longer earn royalties on the sales of its NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175943\/degods-removes-nft-royalties-predicts-all-marketplaces-will-move-to-0-model","publishDate":"2022-10-10T12:44:46","id":9736,"type":null,"title":"DeGods removes NFT royalties, predicts all marketplaces will move to 0% model","category":["NFTS"],"content":["Popular Solana NFT project DeGods has switched to a 0% royalty model, meaning it will no longer earn royalties on the sales of its NFTs.","DeGods said that while it still believed that royalties are an “incredible use case” for NFTs and that it will support creators that want to find solutions to enforce them, this is the best decision for its business at this time.","DeGods spinoff collections t00bs and y00ts will also switch to a 0% royalty model, the company announced on <a href=\"https:\/\/twitter.com\/DeGodsNFT\/status\/1579018796244692993\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Twitter<\/a>.","NFT royalties have sparked an ongoing debate within the digital art industry. Proponents argue they are a necessary source of revenue for creators, particularly for smaller collections, and an artists' ability to continue earning after the initial sale is one of the key advantages NFTs have over physical art. Others argue that royalties undermine the idea of true ownership and that holders shouldn't have to pay out additional funds.","DeGods founder, who is known as Frank, <a href=\"https:\/\/twitter.com\/frankdegods\/status\/1558623075008098305\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">previously called<\/a> royalties “the best alignment of incentives between founders and holders (right now)” and warned those circumventing royalties not to be mad when “mints become more expensive and more projects rug.\" The team also floated the idea of removing some utility from NFTs not sold through approved marketplaces.","But now the company is switching course, with Frank citing data showing the growing popularity of 0% royalty marketplaces as a major factor.&nbsp;","“No good solutions are really out there for enforcing royalties and 0% markets are literally growing like weeds in terms of how many there are, pure user growth and volume growth filtered for wash trading. When you look at the data, it's just kind of hard to believe in my mind that most of these [other] marketplaces will not go to 0% royalties,” he said in a <a href=\"https:\/\/twitter.com\/i\/spaces\/1YqJDoMzvekGV\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Twitter Space<\/a> following the announcement.","While the likes of OpenSea and Magic Eden have remained steadfast in their support of royalties, new marketplaces and competitors have taken a more flexible approach. Platforms that have popped up in the past year, like SudoSwapAMM and YAWWW, allow users to purchase NFTs without paying royalties.","Low-fee marketplace X2Y2, which flipped OpenSea by monthly sales volume in July, introduced a flexible royalty option in August that allows buyers to choose how much they wish to give back to creators.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/nft-marketplace-monthly-volume\/embed\" title=\"NFT Marketplace Monthly Volume\" width=\"250%\" data-v-f87c67ca=\"\"><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><\/iframe>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/solana-nft-marketplace-volume\/embed\" title=\"Solana NFT Marketplace Volume\" width=\"250%\" data-v-f87c67ca=\"\"><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><\/iframe>","Frank argued that as 0% royalty marketplaces grow their market share, other marketplaces may ultimately remove royalty requirements in order to remain competitive. Without any way to prevent people circumventing royalties, he added that the model was “already broken” for the DeGods project, as it is bringing in decreasing revenues even as popularity grows.","The question that remains is what impact dwindling royalty revenues could have on creators. Larger brands are already courting VCs. Doodles <a href=\"https:\/\/www.theblock.co\/post\/169601\/doodles-announces-54-million-raise-plots-hiring-spree\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">raised<\/a> $54 million in September which it will used to grow out its team. In March, Bored Ape Yacht Club creators Yuga Labs raised $450 million at a huge $4 billion valuation.&nbsp;","Dust Labs, a project created by the DeGods community that builds NFT tooling products, also announced a $7 million raise recently from Metaplex, Jump, FTX Ventures, Solana Ventures, Foundation Capital and Chapter One. It plans to use the funds to build out its ecosystem.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Ventures","content":"ORGANIZATION"},{"type":"$450 million","content":"MONEY"},{"type":"$4 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Solana NFT","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"$7 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"FTX Ventures","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Frank","content":"PERSON"},{"type":"$54 million","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"Foundation Capital","content":"ORGANIZATION"},{"type":"0%","content":"PERCENT"},{"type":"Magic Eden","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}