{"summary":"The owner of the NFT will receive a signed painting, signed boxing gloves, as well as a video from the professional boxer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112093\/tyson-fury-nft-sells-for-nearly-1-million-on-nft-marketplace-hodooi","publishDate":"2021-07-21T10:00:19","id":9739,"type":null,"title":"Tyson Fury NFT sells for nearly $1 million on NFT marketplace HoDooi","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">A non-fungible token signed by British professional boxer Tyson Fury has sold for $987,000 on digital marketplace HoDooi, making it one of the most expensive sports NFT sales ever.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">NFTs, or non-fungible tokens, are digital assets that exist on the blockchain and can represent items like images, video, audio and more.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In this case, the one-of-a-kind token, titled “Lineal by Tyson Fury,” is an illustration of the boxer with two championship belts on his shoulders as well as a crown with his nickname “Gypsy King.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The winner will also receive a signed five-by-five foot painting of the artwork, signed boxing gloves as well as a video from Fury congratulating the buyer.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The HoDooi marketplace, which launched on July 14, is powered by the HOD token and operates on Binance Smart Chain.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$987,000","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"July 14","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Tyson Fury","content":"ORGANIZATION"},{"type":"Gypsy King","content":"ORGANIZATION"}],"hashtag":[],"authors":["Saniya More","The Block"]}