{"summary":"Portal, a startup building a Bitcoin-based cross-chain decentralized exchange and wallet, has raised $34 million in a seed funding round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275033\/bitcoin-dex-portal-seed-funding-coinbase","publishDate":"2024-01-30T06:00:06","id":9743,"type":null,"title":"Bitcoin-based DEX Portal raises $34 million in seed funding","category":["VENTURE CAPITAL"],"content":["<span data-v-f87c67ca=\"\">Portal, a startup building a <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.37%\n    <\/span><\/a> <!----><\/span><\/span>-based cross-chain decentralized exchange and wallet, has raised $34 million in a seed funding round. Investors in the round included <\/span><a href=\"https:\/\/www.theblock.co\/post\/268094\/coinbase-galaxy-polygon-multicoin-other-crypto-vc-funding-outlook-2024\" data-v-f87c67ca=\"\">Coinbase Ventures<\/a>, Arrington Capital, OKX Ventures, and Gate.io, Portal said Tuesday.","The seed round was structured as a combination of a simple agreement for future equity (SAFE) and convertible notes, all of which have been fully converted into equity, Portal co-founder and CEO Chandra Duggirala told The Block in an interview. There is no debt component in the round, Duggirala noted, declining to comment on valuation. He also declined to comment on the specific timeline for when the funding round started and ended but said it \"closed recently.\"","At $34 million, Portal's seed round surpasses the typical size for a seed round. Duggirala said it was oversubscribed by more than two times due to increased interest in the growth of the Bitcoin ecosystem.","The seed round brings Portal's total funding to $42.5 million, adding to the $8.5 million raised in pre-seed funding in 2021.","Portal is a Bitcoin-based cross-chain atomic swaps protocol. Its two main products are a decentralized exchange and a wallet.","Portal DEX enables Layer 2 atomic swaps of cryptocurrencies across blockchains. Portal wallet, a \"fully non-custodial\" tool, integrates the DEX and allows users to send, receive, and store cryptocurrencies across blockchains.","\"You can think of Portal as a cross-chain Lightning Network,\" Duggirala said. \"It's fast, inexpensive, easy, and there is no custodial risk.\"","The current cross-chain swap tools, such as wrapped tokens and bridges, are risky as they have <a href=\"https:\/\/www.theblock.co\/post\/268831\/the-10-largest-crypto-hacks-and-exploits-of-2023\" data-v-f87c67ca=\"\">lost billions<\/a> of dollars in hacks and involve some type of custody risk, Duggirala said, adding that Portal doesn't custody user funds at all, either through one signature or multiple signatures.","Portal products are currently in the testnet form, and \"mainnet readiness is quite feasible by March,\" Duggirala said.","With fresh funding in place, Portal plans to launch its products on the mainnet and grow its ecosystem. \"We want to support and integrate with as many wallets and single-chain decentralized exchanges that use bridges,\" Duggirala said. \"Our goal is to replace completely the custodial risk in this space.\"","Asked if Portal plans to launch its own native token, Duggirala said that decision would depend on the validators of the Portal network. The network runs on the xport (proposed ticker) token, an ERC-20 token, Duggirala said, adding that it is used to secure the network and reward validators for enabling the swaps.","Founded in 2019, Portal is based in the San Francisco Bay Area. Duggirala declined to comment on the current headcount of the firm but said the team has doubled in the last year, and Portal is continuing to hire.","In the coming months, Portal also plans to launch an AI-powered investment application that will help users leverage the AI technology to make \"intelligent\" investing decisions, Duggirala said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$34 million","content":"MONEY"},{"type":"Arrington Capital","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$8.5 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Chandra Duggirala","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Portal","content":"ORGANIZATION"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"billions<\/a> of dollars","content":"MONEY"},{"type":"San Francisco Bay Area","content":"LOCATION"},{"type":"-0.37%","content":"PERCENT"},{"type":"Duggirala","content":"PERSON"},{"type":"$42.5 million","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN","CROSS-CHAIN SWAPS","CRYPTO","DECENTRALIZED INFRASTRUCTURE","DEXS","PROTOCOLS","SEED &AMP; PRE-SEED"],"authors":["Yogita Khatri","The Block"]}