{"summary":"Uniswap, the world&#x27;s largest decentralized exchange protocol by trade volume, has officially launched on BNB Chain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/220159\/uniswap-officially-expands-exchange-services-to-bnb-chain","publishDate":"2023-03-15T12:02:31","id":9745,"type":null,"title":"Uniswap officially expands exchange services to BNB Chain","category":["CRYPTO ECOSYSTEMS"],"content":["Uniswap, the world's largest decentralized exchange protocol by trade volume, has officially launched on BNB Chain, a decentralized EVM-compatible smart contract blockchain initially founded by crypto exchange Binance. The move comes after a successful governance proposal in February to deploy on BNB Chain and contentious governance deliberations to decide on a bridge solution for the deployment.","With this expansion, Uniswap Protocol users will be able to leverage BNB Chain's low transaction fees, compared with Ethereum, to trade and swap tokens across the network.","“With BNB Chain's thriving and dedicated community, scalability, and accessibility, it is a launchpad for all things web3, where protocols looking to reach larger audiences can grow,\" said Alvin Kan, director of growth at BNB Chain. \"We are delighted to see Uniswap’s continued commitment to delivering value to its users and building for the future of decentralization.”","In February, a governance proposal by 0x Plasma Labs to deploy Uniswap v3 on BNB Chain passed with more than 55 million UNI token holders voting in favor. 0x Plasma Labs stated at the time that Uniswap could look to capture up to 50% of PancakeSwap's market share. PancakeSwap is the leading decentralized exchange on BNB Chain with <a href=\"https:\/\/defillama.com\/protocol\/pancakeswap\" data-v-f87c67ca=\"\">$2.5 billion<\/a> in total volume locked.","Uniswap's deployment on BNB Chain means that it can capture a larger share of the decentralized exchange niche and marks a significant step towards increasing accessibility and liquidity for its users.","Wormhole was chosen as the protocol's designated bridge to BNB Chain in a contentious governance vote, helping users transfer assets from Ethereum mainnet to BNB Chain. The vote <a href=\"https:\/\/www.theblock.co\/post\/208729\/a16z-votes-against-proposal-to-deploy-latest-uniswap-iteration-on-bnb-chain\" data-v-f87c67ca=\"\">pitted<\/a> two of the space's most active venture firms, Andreessen Horowitz and Jump Crypto, against each other. Venture firm A16z put its considerable UNI holdings to use by voting against the proposal to pick Wormhole.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alvin Kan","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Uniswap Protocol","content":"ORGANIZATION"},{"type":"Jump Crypto","content":"LOCATION"},{"type":"UNI","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$2.5 billion","content":"MONEY"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"BNB Chain","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"PancakeSwap","content":"ORGANIZATION"}],"hashtag":["BNB CHAIN","DEXS","UNISWAP"],"authors":["Vishal Chawla","Osato Avan-Nomayo","The Block"]}