{"summary":"Quicksilver is taking a middle man approach to liquid staking, one that offers certain benefits — but with lower revenue.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/135890\/quicksilver-a-liquid-staking-protocol-on-cosmos-spins-out-of-chorus-one","publishDate":"2022-03-02T04:00:06","id":9747,"type":null,"title":"Quicksilver, a liquid staking protocol on Cosmos, spins out of Chorus One","category":["INFRASTRUCTURE"],"content":["When Joe Bowman came back from the Cosmoverse conference – a community conference focused on Cosmos held in Lisbon – late last year, he had a sudden desire to start building in the space again.","At the time he was an engineering manager at Chorus One and had been working on a liquid staking concept for some time, but Chorus One – unlike many other top staking firms – had decided against executing on the idea. So, as Bowman told The Block in an interview, he figured he would build it himself.","He launched a company called Ingenuity to build the liquid staking protocol, now named Quicksilver, alongside two other Chorus One team members. Chorus One also invested in the project when it did a small seed round, cementing the new endeavor's connection to the mothership.","Quicksilver spun out of Chorus One on February 1 and released its <a href=\"https:\/\/quicksilver.zone\/whitepaper.pdf\" data-v-f87c67ca=\"\">whitepaper<\/a> yesterday. It plans to launch its testnet in the second quarter. As a native Cosmos blockchain, it will be looking to expand support across multiple zones in the Cosmos ecosystem once live.","<a href=\"https:\/\/www.theblockcrypto.com\/news+\/126250\/crypto-staking-businesses-are-making-an-absolute-fortune\" data-v-f87c67ca=\"\">Liquid staking<\/a> is a new form of staking that seeks to unlock the value held by the tokens that are being staked. Someone who uses a normal staking protocol is unable to access their staked tokens, while someone who uses a liquid staking protocol receives a set of tokens equivalent in value to their staked tokens – freeing up the liquidity that would otherwise have been frozen.","The biggest liquid staking protocol right now is Lido Finance, which launched on Ethereum and has the majority of the market share. Yet Quicksilver is focused on the Cosmos ecosystem, where it hopes to find greater opportunity for capturing market share. While there are some liquid staking protocols within the Cosmos ecosystem – such as Persistence’s PStake and Lido’s expansion to the Luna blockchain – the field is much more open.","Quicksilver is not your typical liquid staking protocol; it’s trying a different approach.&nbsp;","Rather than provide liquid staking as the main service, it seeks to be more of a middle man between people who want to stake their tokens and current staking services.","Right now, if you use a liquid staking protocol, it’s the protocol itself that issues you the tokens when you stake them. As a result, when you see protocols sucking up the majority of staked tokens, they end up with a lot of influence over governance decisions.","Quicksilver lets users stake their tokens with their desired staking provider and issues a token that provides liquidity – all while remaining separate from the staking provider. As a result, tokens are staked among multiple staking providers, while users are kept happy with the liquidity they receive.","Quicksilver also aims to let stakers retain their ability to decide governance proposals. It has a system that lets users vote on proposals and automatically passes these decisions along, so their votes get submitted.","The result of this is that it’s unable to take a 10% (or so) cut on staking rewards, as most staking protocols do. Right now it hasn’t specified how much its fee will be but it will be more in the low single digits.","So while many staking businesses are <a href=\"https:\/\/www.theblockcrypto.com\/news+\/135010\/crypto-staking-firms-are-racing-to-get-liquid-staking-to-institutions\" data-v-f87c67ca=\"\">pivoting to liquid staking<\/a>, Quicksilver looks to reverse that trend —&nbsp;taking charge of the liquid staking element and letting staking firms do their thing. But whether it catches hold will depend on how highly stakers value decentralization and the ability to exercise their governance rights.","<em data-v-f87c67ca=\"\">This article has been updated to clarify the percentage fee, based on follow up comments from Quicksilver.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Bowman","content":"PERSON"},{"type":"Lido","content":"LOCATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Joe Bowman","content":"PERSON"},{"type":"February 1","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"second quarter","content":"DATE"},{"type":"Lisbon","content":"LOCATION"}],"hashtag":["COSMOS"],"authors":["Tim Copeland","The Block"]}