{"summary":"The BMC won&#x27;t enforce any standards for members, but will act as a mode of transparency if members choose to engage.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108731\/the-bitcoin-mining-council-wants-to-dispel-negative-media-narratives","publishDate":"2021-06-17T17:40:22","id":9751,"type":null,"title":"The Bitcoin Mining Council wants to dispel negative media narratives","category":["BITCOIN"],"content":["Last month, MicroStrategy CEO Michael Saylor teased that he had convened a meeting of North American bitcoin miners to promote renewable energy and transparency.","Now, the so-called \"Bitcoin Mining Council\" (BMC) has held its first meeting, open to the public through Twitter Spaces.&nbsp;&nbsp;","Information about the council <a href=\"http:\/\/www.theblockcrypto.com\/linked\/105906\/elon-musk-bitcoin-miners-renewable-energy-michael-saylor-tesla\" data-v-f87c67ca=\"\">first<\/a> came to light through Tesla CEO Elon Musk. Tesla <a href=\"https:\/\/www.theblockcrypto.com\/linked\/104720\/tesla-stops-taking-bitcoin-payments\" data-v-f87c67ca=\"\">suspended<\/a> bitcoin payments for its products due to environmental concerns after <a href=\"https:\/\/www.theblockcrypto.com\/linked\/99172\/tesla-accept-bitcoin-btc\" data-v-f87c67ca=\"\">enabling<\/a> them just months prior. As many debated why the tech mogul would go all-in on bitcoin, enabling payments and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/94155\/tesla-has-bought-1-5-billion-bitcoin-btc\" data-v-f87c67ca=\"\">adding<\/a> the crypto to Tesla's balance sheet without examining the energy expenditure narrative, Saylor formed the council and invited Musk to speak with industry players.&nbsp;","But Musk was notably absent from the council's conversation, and the only reference to him came in one audience member's volatility concerns that \"one person's tweet, for example Elon Musk's tweet can create volatility in something that's supposed to be so widespread.\"","The BMC has dispelled any relationship with Musk on its <a href=\"https:\/\/bitcoinminingcouncil.com\/\" data-v-f87c67ca=\"\">website<\/a> by explaining that \"the extent of his involvement was joining an educational call with a&nbsp; group of North American companies to discuss Bitcoin mining.\"","The group took a more informational angle rather than positioning itself as a self-regulatory organization that could possibly assuage regulatory concerns. As the BMC says on its website: \"The BMC is not designed to have 'teeth' or tell anyone what to do.\"","In fact, much of the conversation centered on \"getting ahead of the media,\" as Saylor put it. Over the 90-minute meeting, members of the group presented their takes on topics like flare mining, the hash rate drop in China and the failed attempt to impose a mining moratorium in New York.","As put by Jamie Leverton, CEO of member organization Hut 8 Mining, the council's mission is:","Every facet of participation will be voluntary. Members are invited to be as transparent or opaque as they wish, without any imposed standards — including disclosures.&nbsp; It also won't create mandatory regulatory or compliance standards for its members, nor will it create any barrier to entry.&nbsp;","\"It's definitely not our agenda to provide any governance or any requirements or any rules because it's not a governance council,\" said Saylor.","This approach seems to be a way for participants to openly share what they feel is a fuller picture of the state of mining — a picture they feel mainstream media has failed to capture. Those participants include founding members MicroStrategy, Riot, Galaxy Digital, Marathon Digital, Hut 8, Hive, Core Scientific, Blockcap and Argo.&nbsp;","Amanda Fabiano, head of mining at Galaxy Digital, said it means miners and public companies engaging with mining can \"get ahead of some of these bad narratives we see in mainstream media.\"","As Saylor positioned it, those in the council support the Bitcoin network as it is. Though they as individuals might advocate for renewable energy use and seek to correct what they feel are bad or skewed narratives related to energy consumption, they're not bound by any governance model to commit to initiatives that would bow to regulatory regimes, like the censorship of transactions or mandated energy initiatives.","What will bind them together, according to Saylor, is joint advocacy for the network.","\"We're not here to fix Bitcoin,\" said Saylor. \"So I think you could just assume that we buy into the entire ethos as hardcore as anybody and we're going to do everything we possibly can to defend the values of Bitcoin. We're here to defend Bitcoin from people that misunderstand it, that would cause politicians to move against Bitcoin or cause negative media narratives that would undermine the spread of Bitcoin to the world.\"&nbsp;","It's early days for the council. The group is currently focused on signing up members and figuring out what to do as a group, so it has no budget thus far and no plans to spend any money. The idea over time, though, is to create a model of the Bitcoin mining network to show others the energy usage and mix of resources.","Saylor said the council would hope to publish any findings if it goes down that road so that others can make forecasts for the network. Still, this would be voluntary for any members, meaning the model the council eventually comes up with may not be the full picture.","Caitlin Long, CEO of digital asset bank Avanti, pressed Saylor and his council members on the involvement of public firms. With no mandated disclosures or other checks to keep larger firms from drowning out smaller miners, and public firms remaining beholden to the whims of board members, Long wondered whether public company involvement in mining was \"good for Bitcoin.\"","Though there is no formal commitment to avoid creating a block that could alter the network, Saylor said that idea hasn't entered any conversation.&nbsp;","Pointing to his experience as a CEO at a publicly-traded company, Saylor said the pressures from board members or activists are less of a concern. The broader fear is that the so-called media narrative surrounding mining will influence political developments, which would create real barriers to entry in particular jurisdictions.","The greatest threats are external, he said, and for that reason, it pays to unite with larger entities. The network needs corporations, institutions and exchanges to defend it along with mining pools and more decentralized entities, according to Saylor.&nbsp;","\"You could be a maximalist and say 'I'm against organization' as a matter of philosophy, but if you get sued by a multibillionaire that wants to sue an individual Bitcoin developer and you get buried in $10 million in legal fees, you'll be wishing that there was an organized legal defense fund for you...basically, we can't expect to succeed if we're disorganized.\"","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Jamie Leverton","content":"PERSON"},{"type":"Blockcap","content":"ORGANIZATION"},{"type":"Tesla","content":"LOCATION"},{"type":"Caitlin Long","content":"PERSON"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Avanti","content":"PERSON"},{"type":"Bitcoin Mining Council\" (BMC)","content":"ORGANIZATION"},{"type":"Musk","content":"ORGANIZATION"},{"type":"Riot","content":"ORGANIZATION"},{"type":"BMC","content":"LOCATION"},{"type":"Tesla CEO Elon Musk","content":"ORGANIZATION"},{"type":"Amanda Fabiano","content":"PERSON"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Saylor","content":"PERSON"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"China","content":"LOCATION"},{"type":"Michael Saylor","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["MINING"],"authors":["Aislinn Keely","The Block"]}