{"summary":"Sam Bankman-Fried will hand over his laptop and smartphone to lawyers next week.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225138\/sam-bankman-fried-bail-ftx-video-games","publishDate":"2023-04-05T16:05:26","id":9753,"type":null,"title":"Sam Bankman-Fried&#x27;s countdown has begun: The confined ex-CEO has about 125 hours left to play video games and use his phone","category":["EXCHANGES"],"content":["Sam Bankman-Fried has a few more days to use a smartphone and play video games before the government locks him in what experts are calling the legal equivalent of a “Faraday box.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","A judge <a href=\"https:\/\/www.courtlistener.com\/docket\/66631291\/122\/united-states-v-bankman-fried\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">granted<\/span><\/a> Bankman-Fried’s request to delay implementing his new bail terms until next week, which include strict conditions on his internet and electronic use.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Once the <a href=\"https:\/\/www.courtlistener.com\/docket\/66631291\/118\/united-states-v-bankman-fried\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">new rules<\/span><\/a> are in place, Bankman-Fried will have to hand over his smartphone to his lawyers in exchange for a new phone that can’t access the internet. He’ll trade in his laptop for a new, heavily monitored model that’s been customized to only allow access to certain websites. Approved sites include his lawyers’ website, Uber Eats and Spotify.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","An avid gamer before his arrest, Bankman-Fried will also be banned from using video games that permit chat or voice communication.","“He's under an electronic microscope at full magnification,” said Anthony Sabino, a law professor at St. John's University. “That is in essence the government constructing a Faraday box around SBF to cut off all electronic means of communication.”","A \"Faraday cage\" is an enclosure that doesn't allow the entry or exit of electromagnetic fields. The bail conditions are a significant shift for the disgraced crypto boss, who was extremely active online before — and even after — his crypto exchange collapsed.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Bankman-Fried’s lawyers asked a judge to delay the new rules until Tuesday because they are waiting for his new devices to arrive. A Bankman-Fried spokesperson did not comment on whether the former billionaire is still using the wider internet, a smartphone or video games in the days before his new bail conditions are put in place.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Although Bankmkan-Fried’s new bail restrictions are still pending, experts doubt he is taking much advantage of the delay. Bankman-Fried’s soon-to-be-implemented bail terms are certainly stricter, but the government has already been tracking his every move.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“The leash is very short. Any further breaches of bail conditions likely will land Bankman-Fried in jail pending trial,” said Jacob Frenkel, an attorney at the law firm Dickinson Wright.","Bankman-Fried pleaded not guilty to a litany of criminal charges in the U.S. District Court for the Southern District of New York, including bank fraud. He’s awaiting an October trial. The former crypto mogul has been under house arrest at his parents’ California home on a $250 million bond since December.","Prosecutors sought tighter bail conditions after Bankman-Fried contacted a potential witness in his criminal case using an encrypted messaging app, and used a virtual private network to access the internet. A federal judge approved stricter bail terms in a 10-page court order last month.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Charlie Shrem, who was <a href=\"https:\/\/www.justice.gov\/usao-sdny\/pr\/former-ceo-bitcoin-exchange-company-sentenced-manhattan-federal-court-two-years-prison\" data-v-f87c67ca=\"\">sentenced<\/a> to two years in prison for his involvement in the black-market trading of bitcoin, called being under house arrest \"devastating.\" Shrem pleaded guilty to transmitting nearly $1 million in bitcoins intended to facilitate drug trafficking on the “Silk Road\" black market in 2014, and serve a year in prison.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"House arrest is devastating, it’s almost worse than prison. Like Sam, I had an ankle bracelet and was confined to my parents’ house. When you are that young and facing decades behind bars, you stop caring about things,\" said Shrem, who is now a general partner at the venture fund Druid Ventures.","As part of the new rules, Bankman-Fried’s parents, Joseph Bankman and Barbara Fried, will also be subject to strict device monitoring. Their electronic devices must be password protected and outfitted with monitoring software that will photograph the device’s user every five minutes, according to the bail order.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Bankman-Fried will also be required to notify his lawyers before anyone visits him. His home security system must preserve video footage of everyone who enters the residence. Plus, a security guard will screen visitors with a metal detector and take any electronic devices for the duration of the visit. Sabino compared the new protocol to getting on an airplane.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“You might as well farm this out to TSA,” Sabino said. “They’re on red alert in terms of watching everything this guy is doing.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Sabino","content":"PERSON"},{"type":"Bankmkan","content":"PERSON"},{"type":"$250 million","content":"MONEY"},{"type":"TSA","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Shrem","content":"PERSON"},{"type":"Dickinson Wright","content":"PERSON"},{"type":"Druid Ventures","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Anthony Sabino","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"Charlie Shrem","content":"PERSON"},{"type":"Joseph Bankman","content":"PERSON"},{"type":"Jacob Frenkel","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"St. John's University","content":"ORGANIZATION"},{"type":"Barbara Fried","content":"PERSON"},{"type":"Uber Eats","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"California","content":"LOCATION"},{"type":"$1 million","content":"MONEY"},{"type":"Bankman","content":"PERSON"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}