{"summary":"The third week of Sam Bankman-Fried&#x27;s criminal trial ended with the testimony of FTX&#x27;s former general counsel, Can Sun.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258573\/inside-sbfs-trial-ftx-general-counsel-quit-after-he-learned-of-massive-hole-in-balance-sheet","publishDate":"2023-10-19T17:17:17","id":9755,"type":null,"title":"Inside SBF&#x27;s Trial: FTX general counsel quit after he learned of massive hole in balance sheet","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">The third week of Sam Bankman-Fried's criminal trial ended with the testimony of FTX's former general counsel, Can Sun, who made it all the way to New York from Japan to testify.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Sun testified under a no-prosecution agreement he signed with the Department of Justice on Oct. 17, just days before his testimony, he said. F<\/span><span data-v-f87c67ca=\"\">ormerly an attorney at Fenwick and West, Sun joined FTX in August 2021.<\/span>","<span data-v-f87c67ca=\"\">As a general counsel, Sun told the court he initially had no insight into FTX's critical flaw that let sister trading firm Alameda Research borrow user funds without their consent. \"Never approved anything like that, and I would never have done it either,\" Sun said.<\/span>","<span data-v-f87c67ca=\"\">Soon after he joined, Sun became aware Alameda was effectively exempt from automatic liquidations and could go negative on its balance at FTX, Sun said. That seemed inappropriate to him, and he talked to FTX leadership about removing the feature.<\/span>","<span data-v-f87c67ca=\"\">In a discussion with Bankman-Fried, head of engineering Nishad Singh and FTX chief regulatory officer Dan Friedberg, Sun said he pressed for change and got promised one: instead of no automatic liquidation, Alameda would get \"delayed liquidation.\" FTX users were to have been be made aware of this, as well as regulators, and the same feature would be made available to other institutional market makers on FTX. Those changes, however, were never implemented, Sun said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As a general counsel, Sun was responsible for documenting the loans Alameda Research issued to Sam Bankman-Fried, Gary Wang and Nishad Singh so they could buy FTX equity, he said. However, he was not aware the funds were actually coming from the FTX user deposits, he said. At some point, Sun himself took a $2.3 million loan from Alameda to buy a house in the Bahamas, he said. In hindsight, those loans felt wrong to him, he admitted.<\/span>","\"As general counsel I was involved in transactions that now, in hindsight, may have involved the misappropriation of customer funds, so, out of an abundance of caution, I asked the government for protection,\" Sun said.","<span data-v-f87c67ca=\"\">The last straw that convinced Sun something was wrong at FTX was a call with the asset manager Apollo Global Management in November 2022. Apollo was interested in investing in FTX and asked for a copy of the financial statement. When the copy was produced, Sun was \"shocked\" to see a $7 billion hole on FTX's balance sheet related to Alameda. When he confronted FTX leadership about it on November 7, 2022, he received no definitive answers, Sun said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Sam Bankman-Fried was typing on his laptop during the conversation and then just left the room to make calls, Sun told the court. Later, Bankman-Fried pulled Sun aside and asked him to put together a legal justification for the missing funds. Sun suggested several \"theoretical\" arguments that would legitimately explain the situation, but none of them really held water, he admitted to the CEO. Bankman-Fried \"was not surprised at all.\"<\/span>","<span data-v-f87c67ca=\"\">The same day Sun also talked to Nishad Singh, and the head of engineering confirmed that the same feature that allowed Alameda to avoid automatic liquidations also allowed it to borrow customer funds.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The next day, Sun resigned, he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As Thursday progressed, the court also heard from Robert Bourjeri, a former managing director at the asset managing firm Third Point which invested $35 million in FTX in 2021. Bourjeri was involved in negotiations prior to the transaction, he told the court.<\/span>","<span data-v-f87c67ca=\"\">However, if he had known about Alameda Research being exempt from liquidations at FTX, Third Point would not have invested, Bourjeri said.&nbsp;<\/span>","The trial will now take a week-long break and is due to start back up on Oct. 26.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"August 2021","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Bourjeri","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Oct. 26","content":"DATE"},{"type":"$2.3 million","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"November 2022","content":"DATE"},{"type":"Apollo Global Management","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"November 7, 2022","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"$35 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Nishad Singh","content":"PERSON"},{"type":"Japan","content":"LOCATION"},{"type":"Dan Friedberg","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"$7 billion","content":"MONEY"},{"type":"Third Point","content":"ORGANIZATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Oct. 17","content":"DATE"},{"type":"Gary Wang","content":"PERSON"},{"type":"Fenwick","content":"ORGANIZATION"},{"type":"Robert Bourjeri","content":"PERSON"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Anna Baydakova","The Block"]}