{"summary":"It confers full commercialization rights to holders to create projects and products based on their NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163519\/cryptopunk-and-meebits-holders-can-now-use-their-nfts-for-commercial-projects","publishDate":"2022-08-16T05:29:51","id":9756,"type":null,"title":"CryptoPunk and Meebits holders can now use their NFTs for commercial projects","category":["NFTS"],"content":["Yuga Labs released its long-awaited intellectual property (IP) licensing agreement for CryptoPunk and Meebits non-fungible token (NFT) holders on Monday.","CryptoPunk and Meebits holders have been waiting for this announcement since Yuga Labs first bought the collections from Larva Labs in March. The <a href=\"https:\/\/licenseterms.cryptopunks.app\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">agreement<\/a>&nbsp;confers full commercialisation rights to create projects and products based on a holder’s NFTs, putting them on par with the IP rights enjoyed by the Bored Ape Yacht Club’s holders, some of whom have already used the IP in projects.","Among them, Seth Green is launching a show based on his <a href=\"https:\/\/www.theblock.co\/linked\/151443\/seth-green-pays-nearly-300000-to-recover-stolen-bored-ape-buzzfeed\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">recently-returned Ape<\/a>, which was — in his words — “kidnapped” in May. Restauranteur Andy Nguyen also opened Bored Ape-themed restaurant Bored &amp; Hungry in Los Angeles in June.","While Yuga Labs owns the IP, it licenses it to NFT holders. Previously, collection owners Larva Labs handled IP licensing differently and retained the intellectual property rights to the collections — a decision which attracted criticism and prompted at least one holder to sell their CryptoPunk in protest.","Across the board, collection creators have taken different approaches to handling IP rights. Popular brand Moonbirds ruffled feathers earlier this month when it <a href=\"https:\/\/www.theblock.co\/post\/161819\/moonbirds-ruffles-some-holders-feathers-with-abrupt-copyright-switch\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">switched<\/a> to a public domain usage model, adopting the Creative Commons CC0 copyright code. This allows anyone to commercially use and reproduce art from both Moonbirds and its sister project Oddities.","The decision prompted backlash on social media as holders argued that they had bought into the project believing they had exclusive rights to their NFT.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Seth Green","content":"PERSON"},{"type":"earlier this month","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Larva Labs","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Moonbirds ruffled feathers","content":"ORGANIZATION"},{"type":"Los Angeles","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Moonbirds","content":"PERSON"},{"type":"Andy Nguyen","content":"PERSON"}],"hashtag":["CRYPTOPUNKS","MEEBITS","YUGA LABS"],"authors":["Callan Quinn","The Block"]}