{"summary":"This past week: a $200 million hack, two infamous figures arrested, two voices of support for Binance, and two more stories.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253745\/the-top-5-stories-from-last-week-in-crypto","publishDate":"2023-09-30T16:50:46","id":9758,"type":null,"title":"The top 5 stories from last week in crypto","category":["THE BLOCK"],"content":["<span data-v-f87c67ca=\"\">Five major stories made headlines in crypto this past week. Mixin Network was hacked for $200 million as two infamous crypto figures were arrested. Plus, VanEck prepares its ether futures ETF filing as Binance, which exited Russia this week, got two voices of support in its case against the SEC.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Let’s take a closer look at each story in this recap.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Mixin Network, a decentralized wallet service, recently lost approximately $200 million in funds to a security breach. In response, the company temporarily suspended its deposit and withdrawal services. The blockchain security company SlowMist was brought in to assist with the investigation into the <\/span><a href=\"https:\/\/www.theblock.co\/post\/252698\/mixin-network-suspends-services-after-hack-involving-200-million-in-funds\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">attack<\/span><\/a><span data-v-f87c67ca=\"\">, which targeted Mixin Network's cloud service provider database.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Mixin founder Feng Xiaodong later revealed that only about half of the user assets were secure post-hack. To address the situation, he proposed issuing \"bond tokens\" for users to claim, with intentions for Mixin to repurchase them in the future. In an attempt to negotiate, Mixin Network extended an on-chain offer to the hacker, proposing a $20 million \"bug bounty reward\" in exchange for the return of the stolen funds. Mixin also <\/span><a href=\"https:\/\/www.theblock.co\/post\/253154\/mixin-network-offers-hacker-20-million-bug-bounty\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">stated<\/span><\/a><span data-v-f87c67ca=\"\"> that the losses from the hack might not be as substantial as initially estimated.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Su Zhu, the co-founder of defunct crypto hedge fund Three Arrows Capital, was <\/span><a href=\"https:\/\/www.theblock.co\/post\/253618\/three-arrows-capital-co-founder-su-zhu-apprehended-in-singapore-bloomberg\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">detained<\/span><\/a><span data-v-f87c67ca=\"\"> at an airport in Singapore while attempting to leave the country. This arrest followed his non-compliance with a court order that required his cooperation in an investigation related to the liquidation of the fund. As a result, he was sentenced to four months in prison.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a separate incident, crypto influencer Ben Armstrong, also known as Bitboy Crypto, was <\/span><a href=\"https:\/\/www.theblock.co\/post\/252882\/crypto-influencer-ben-armstrong-arrested-trying-to-confront-former-business-partner\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">arrested<\/span><\/a><span data-v-f87c67ca=\"\"> while trying to confront a former business associate. Prior to his arrest, Armstrong had been livestreaming his attempt to confront his former partner, with some speculating it was to retrieve his Lamborghini. This arrest comes after Armstrong's departure from the popular YouTube channel, Bitboy Crypto, amid allegations of substance abuse and causing harm to the Bitboy Crypto community.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">VanEck is gearing up to launch its Ethereum Strategy ETF (EFUT), which will focus on ether futures contracts. This actively managed ETF will not invest directly in ETH or other digital assets but will instead concentrate on standardized, cash-settled ETH futures contracts, primarily those traded on the Chicago Mercantile Exchange. The ETF is <\/span><a href=\"https:\/\/www.theblock.co\/post\/253426\/vaneck-prepares-to-launch-ethereum-futures-etf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">set<\/span><\/a><span data-v-f87c67ca=\"\"> to be listed on the CBOE and will be actively overseen by VanEck's head of active trading, Greg Krenzer.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a notable move reflecting its commitment to the Ethereum community, VanEck has also announced its intention to <\/span><a href=\"https:\/\/www.theblock.co\/post\/253426\/vaneck-prepares-to-launch-ethereum-futures-etf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">donate<\/span><\/a><span data-v-f87c67ca=\"\"> 10% of the profits from this Ethereum Strategy ETF to The Protocol Guild, a collective of Ethereum core protocol contributors. This donation pledge is set for a minimum duration of 10 years, emphasizing VanEck's dedication to supporting the ongoing development and stewardship of Ethereum's infrastructure.<\/span>","<span data-v-f87c67ca=\"\">Circle, the issuer of the stablecoin USDC, has <\/span><a href=\"https:\/\/www.theblock.co\/post\/253553\/circle-sec-case-binance\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">voiced<\/span><\/a><span data-v-f87c67ca=\"\"> its perspective on the U.S. Securities and Exchange Commission's (SEC) lawsuit against Binance. The SEC's case alleges that Binance's affiliate, BAM Trading, sold unregistered securities, including BNB and the stablecoin BUSD. In response, Circle asserted that stablecoins intended for payments lack the fundamental characteristics of an investment contract and, therefore, should not be under the SEC's jurisdiction. They emphasized that users of such stablecoins do not anticipate profits from holding them.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Separately, crypto venture capital firm Paradigm <\/span><a href=\"https:\/\/www.theblock.co\/post\/253671\/paradigm-says-sec-is-trying-to-change-the-law-with-case-against-binance\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">criticized<\/span><\/a><span data-v-f87c67ca=\"\"> the SEC's approach in the Binance case, accusing the agency of attempting to alter the law without following the proper rulemaking process. Paradigm highlighted that while assets like gold, silver, and fine art can appreciate in value, their sale doesn't necessarily equate to a security. Both Circle and Paradigm's statements come amidst a broader debate on the classification and regulation of digital assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Binance has decided to fully exit the Russian market due to ongoing legal challenges. The company announced the <\/span><a href=\"https:\/\/www.theblock.co\/post\/253146\/binance-fully-exits-russia-amid-legal-risks-sells-business-to-commex\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">sale<\/span><\/a><span data-v-f87c67ca=\"\"> of its Russian business to the newly launched crypto exchange, CommEX. This decision was driven by Binance's recognition that operating in Russia was not in line with its compliance strategy. As part of the transition, Binance emphasized that all assets of its existing Russian users are secure, and the migration of assets to CommEX might take up to a year.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Changpeng Zhao, Binance's founder and CEO, clarified in a post that some former Binance employees <\/span><a href=\"https:\/\/www.theblock.co\/post\/253331\/binance-former-employees-commex-cz\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">may have joined<\/span><\/a><span data-v-f87c67ca=\"\"> CommEX, and highlighted that the design and APIs of CommEX are similar to Binance to ensure a seamless user experience. Furthermore, he stated that CommEX does not service users from the United States or the European Union and that he does not own any shares in the new exchange. The ownership and operational details of CommEX remain largely undisclosed, raising questions within the crypto community.<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">This article was produced with the assistance of OpenAI's ChatGPT 4<\/span><\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ben Armstrong","content":"PERSON"},{"type":"The Protocol Guild","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Greg Krenzer","content":"PERSON"},{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"CBOE","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"VanEck","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"Bitboy Crypto","content":"LOCATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Feng Xiaodong","content":"PERSON"},{"type":"Bitboy Crypto","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Binance","content":"LOCATION"},{"type":"European Union","content":"LOCATION"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Mixin Network","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"$20 million","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Zack Abrams","The Block"]}