{"summary":"Rumors had emerged that the company laid off around 300 employees at its off-site event in Mallorca, something Parity denies.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256161\/parity-plans-partial-transition-to-decentralized-teams-in-polkadots-ecosystem-impacting-staff","publishDate":"2023-10-12T10:59:14","id":9759,"type":null,"title":"Parity plans partial transition to decentralized teams in Polkadot’s ecosystem, impacting staff","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Blockchain infrastructure provider Parity Technologies told The Block it is seeking to transition some of its existing go-to-market functions to multiple teams within <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Polkadot <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248359\/polkadot-dot-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/polkadot.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">DOT<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +1.02%\n    <\/span><\/a> <!----><\/span><\/span>’s decentralized ecosystem, impacting staffing at the firm.<\/span>","Rumors had <a href=\"https:\/\/x.com\/chainyoda\/status\/1712343125283184700?s=46&amp;t=oHf46otX4Di1EPF3Xc_kDA\" data-v-f87c67ca=\"\">emerged<\/a> that the company laid off around 300 employees at its off-site event in Mallorca, something Parity denies, stressing that any staffing changes connected to the decentralized transition to various ecosystem-funded entities would occur over a period of several months.","Parity’s changes were communicated across the company last week, with future plans being hashed out at the firm’s Mallorca retreat that's currently taking place.","Parity said on X (formerly Twitter) it was shifting its focus toward delivering Polkadot’s next-generation technology, aiming to “improve the developer experience” and foster a “strong developer community.” It will be sunsetting some of its existing go-to-market functions as a result, which it says would be more effectively driven by the broader Polkadot community.","“We are passionate advocates for decentralization, yet as we've expanded our mandate, we've had to navigate the risk of becoming a bottleneck for Polkadot’s growth,” the firm <a href=\"https:\/\/x.com\/paritytech\/status\/1711752651887480906?s=20\" data-v-f87c67ca=\"\">posted<\/a> on Tuesday. “Throughout our own growth journey, we have remained steadfast in our belief that the strength of any ecosystem lies in its diverse builders, where competition meets collaboration. Parity has been undergoing key changes to further align with that belief.”","Parity particularly thanked its teams involved in driving Polkadot’s outreach and expanding its market presence, adding that a <a href=\"https:\/\/x.com\/paritytech\/status\/1711752661844787368?s=20\" data-v-f87c67ca=\"\">new funding program<\/a> from the Web3 Foundation would bootstrap new and existing on-chain and off-chain entities to continue working on such Polkadot growth initiatives.","The Polkadot founding Web3 Foundation <a href=\"https:\/\/x.com\/Web3foundation\/status\/1711750273322954960?s=20\" data-v-f87c67ca=\"\">stated<\/a> the funding initiative is targeting the deployment of 20 million Swiss francs ($22 million) and 5 million DOT (currently $18.3 million) throughout 2024.","“It will augment the community-governed funding mechanism from the Polkadot Treasury to help projects that will have a meaningful impact on the future of Polkadot,” the Web3 Foundation said, adding that it would share more details in the coming weeks about an official launch date and how to apply for funding.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Parity Technologies","content":"ORGANIZATION"},{"type":"$22 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"+1.02%","content":"PERCENT"},{"type":"Mallorca","content":"LOCATION"},{"type":"20 million Swiss francs","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$18.3 million","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"Web3 Foundation","content":"ORGANIZATION"},{"type":"Polkadot Treasury","content":"ORGANIZATION"}],"hashtag":["LAYOFFS"],"authors":["James Hunt","The Block"]}