{"summary":"Payments giant Visa is launching a web3 rewards loyalty program through a partnership SmartMedia Technologies. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270492\/visa-announces-web3-loyalty-rewards-partnership-with-smartmedia-technologies","publishDate":"2024-01-04T16:44:41","id":9760,"type":null,"title":"Visa announces web3 loyalty rewards partnership with SmartMedia Technologies","category":["COMPANIES"],"content":["Payments giant Visa has launched a web3 loyalty reward system it says can boost customer engagement.&nbsp;","The move will give customers digital wallets that are used to collect tokenized tickets, loyalty coins, digital collectibles and other perks from brands which can then be applied to virtual and physical experiences, according to company <a href=\"https:\/\/www.businesswire.com\/news\/home\/20240104359908\/en\/Visa-Reimagines-Customer-Loyalty-with-New-Web3-Engagement-Solution#:~:text=The%20new%20value%2Dadded%20service,to%20earn%20and%20burn%20loyalty\" data-v-f87c67ca=\"\">statements<\/a>.&nbsp;","Users of the platform don't have to have advanced knowledge of blockchain technology to use the rewards, a Visa spokesperson told The Block, adding that \"the offering makes web3 easy for both partners and consumers alike, from our partner's first-of-its-kind engagement platform to our simple 2-click mobile registration.\"","The enterprise web3 platform SmartMedia Technologies is powering Visa's new <a href=\"https:\/\/www.theblock.co\/post\/215750\/starbuckss-web3-odyssey-is-seeing-early-signs-of-success-bofa-says\" data-v-f87c67ca=\"\">web3 loyalty<\/a> platform. Founded in 2018, SmartMedia Technologies has collaborated with payments firm American Express, consumer goods company Unilever, and the luxury fashion brand Burberry, among others.&nbsp;","The new collaboration with Visa \"is not just about enhancing customer rewards, it's about redefining the value exchange between brands and consumers in a mobile payments-first world,\" SmartMedia Technologies CEO Tyler Moebius said in a company release.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Tyler Moebius","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"American Express","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SmartMedia Technologies","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Unilever","content":"ORGANIZATION"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}