{"summary":"“Today’s action should make clear to the marketplace that staking-as-a-service providers must register and provide full, fair, and truthful disclosure and investor protection,” SEC Chair Gary Gensler said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210332\/kraken-settles-sec-charges-over-its-staking-program","publishDate":"2023-02-09T15:15:43","id":9763,"type":null,"title":"Kraken settles SEC charges over its staking program","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Kraken agreed to settle charges brought by the Securities and Exchange Commission for failing to register the offer and sale of its “crypto asset staking-as-a-service program” and will pay a $30 million fine.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Today’s action should make clear to the marketplace that staking-as-a-service providers must register and provide full, fair, and truthful disclosure and investor protection,” SEC Chair Gary Gensler said in a <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-25\" data-v-f87c67ca=\"\">statement<\/a> on Thursday. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC alleged that Kraken since 2019 has offered and sold its staking services to the general public, with the company touting \"that its staking investment program offers an easy-to-use platform and benefits that derive from Kraken’s efforts on behalf of investors, including Kraken’s strategies to obtain regular investment returns and payouts.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“When investors provide tokens to staking-as-a-service providers, they lose control of those tokens and take on risks associated with those platforms, with very little protection,” the agency said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Kraken did not admit or deny the allegations. A spokesperson said the company had agreed to end its on-chain staking services for U.S. clients only.<br data-v-f87c67ca=\"\">\n<\/span>","\"Starting today, with the exception of staked ether (ETH), assets enrolled in the on-chain staking program by U.S. clients will automatically be unstaked and will no longer earn staking rewards,\" the Kraken spokesperson said in a statement.&nbsp;","Staking services for non-U.S. clients will continue uninterrupted, the spokesperson added, noting that those clients will receive staking services from a separate Kraken subsidiary.","“Whether it’s through staking-as-a-service, lending, or other means, crypto intermediaries, when offering investment contracts in exchange for investors’ tokens, need to provide the proper disclosures and safeguards required by our securities laws,” Gensler said.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">The settlement a day after Coinbase Chief Executive Officer Brian Armstrong tweeted that he heard “rumors that the SEC would like to get rid of crypto staking in the U.S. for retail customers,” and after Bloomberg reported that the regulator was investigating Kraken over securities violations.<\/span><span class=\"s1\" data-v-f87c67ca=\"\"> Coinbase shares declined 15% on Thursday amid the news.<\/span>","Gensler first raised eyebrows about staking last year after Ethereum's proof-of-stake transition when he hinted that the commission could classify tokens in proof-of-stake networks as securities.","\"Staking is not a security,\" Coinbase's <span class=\"s1\" data-v-f87c67ca=\"\">Armstrong said yesterday. \"Regulation by enforcement doesn’t work. It encourages companies to operate offshore, which is what happened with FTX.\"<\/span>","SEC Commissioner Hester Peirce, a longtime crypto advocate, said she disagreed with the commission's action and issued a <a href=\"https:\/\/www.sec.gov\/news\/statement\/peirce-statement-kraken-020923?utm_medium=email&amp;utm_source=govdelivery\" data-v-f87c67ca=\"\">dissenting<\/a> statement, arguing that using enforcement actions to set law in an emerging industry is not \"efficient or fair.\"","&nbsp;\"A paternalistic and lazy regulator settles on a solution like the one in this settlement,\" she wrote. \"More transparency around crypto-staking programs like Kraken’s might well be a good thing. However, whether we need a uniform regulatory solution and if that regulatory solution is best provided by a regulator that is hostile to crypto, in the form of an enforcement action, is less clear.\"","<em data-v-f87c67ca=\"\">(<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Updated with Commissioner Hester Pierce's dissent to the SEC's decision.<\/i>)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hester Peirce","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Kraken spokesperson","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"Hester Pierce","content":"PERSON"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}