{"summary":"The stablecoin from PlatypusDefi, Platypus USD, suddenly dropped over 52%, and the on-chain evidence points to a flashloan exploit.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212711\/flash-loan-exploit-appears-to-be-behind-platypus-usd-stablecoin-attack","publishDate":"2023-02-16T18:08:16","id":9765,"type":null,"title":"Flash loan exploit appears to be behind Platypus USD stablecoin attack","category":["STABLECOINS"],"content":["Platypus USD (USP) lost its dollar parity on Thursday following an apparent exploit that allowed a wallet to siphon off about $8.5 million from the token's liquidity pools, just weeks after Platypus issued the stablecoin.","<span data-v-f87c67ca=\"\">The presumed hack was accomplished by means of a flash loan exploit, during which an attacker takes out an enormous loan and settles it in the same block, sandwiching transactions that use the capital to exploit other protocols in between. The Platypus swap function on the network has been disabled since the attack.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“There has been a flash-loan attack on USP,\" a pinned message in the official Platypus Telegram channel warns users. \"We are currently trying to assess the situation and will communicate promptly on it. For now all operations are paused until we get more clarity.”<\/span>","<span data-v-f87c67ca=\"\">The alleged attacker appears to have taken out a $44 million flash loan from Aave V3, and in turn minted some 41 million US Platypus tokens. Next, the attacker cashed out some $8.5 million into other stablecoins, and paid back the flash loan. These actions all took place in the same block of transactions, on-chain <\/span><a href=\"https:\/\/snowtrace.io\/tx\/0x1266a937c2ccd970e5d7929021eed3ec593a95c68a99b4920c2efa226679b430\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">data<\/span><\/a><span data-v-f87c67ca=\"\"> show.<\/span>","“The vulnerability lies in the solvency checking in the function emergencyWithdraw of the MasterPlatypusV4 contract,” web3 security firm Certik told The Block.","“The solvency check doesn’t take into account the value of the user’s debt. It only checks whether the debt amount has reached the max limit,” Certik said. “After the solvency check passes, the contract allows the user to withdraw all deposited assets.”","","","<span data-v-f87c67ca=\"\">The borrowing history of the attacker address.<\/span>","With the pool’s liquidity drained in the previous block, the remaining 33 million tokens reside in attacker’s wallet, unable to be traded.","<span data-v-f87c67ca=\"\">USP is now trading around $0.47 after dropping by just over 52%.<\/span>","","","<span data-v-f87c67ca=\"\">Chart data from CoinGecko.<\/span>","<span data-v-f87c67ca=\"\">Platypus did not immediately respond to a request for comment from The Block.<\/span>","<em data-v-f87c67ca=\"\">Correction: Updated to correct Platypus' formal name.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$0.47","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"Certik","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$8.5 million","content":"MONEY"},{"type":"USP","content":"ORGANIZATION"},{"type":"$44 million","content":"MONEY"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"USD (USP","content":"ORGANIZATION"},{"type":"52%","content":"PERCENT"}],"hashtag":[],"authors":["Jeremy Nation","Osato Avan-Nomayo","The Block"]}