{"summary":"Crypto exchange Coinbase is testing a new subscription-based service that would give users access to enhanced features, according to materials reviewed by","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123134\/coinbase-is-testing-a-subscription-service-with-zero-trading-fees-and-prioritized-support","publishDate":"2021-11-03T09:51:08","id":9770,"type":null,"title":"Coinbase is testing a subscription service with zero trading fees and prioritized support","category":["THE BLOCK"],"content":["Crypto exchange Coinbase is testing a new subscription-based service that would give users access to enhanced features, according to materials reviewed by The Block.&nbsp;","Dubbed Coinbase One, the subscription product will be offered to a small number of users to start. Benefits include zero-fee trading and prioritized phone support \"even on holidays and weekends.\"","The launch of a subscription service could help Coinbase diversify its retail business, which derives most of its revenue from transaction fees. It's not clear at this time how much Coinbase will charge for the new service.","Coinbase is also planning to include added account protection, according to a screenshot of the page that outlines the types of benefits being offered.","\"If any funds in your Coinbase account are stolen by someone you don't know due to an account takeover, you may be eligible for a reimbursement of up to $1 million in losses,\" the exchange noted.","\"Coinbase has started testing a subscription product for our customers,\" a spokesperson at the firm said in a statement. \"Customers in the test group will have the ability to buy, sell, and convert digital currencies on the Coinbase platform without a Coinbase fee for each trade (spread fees still apply). We’re always looking to learn more about how we can best serve our customers in different ways. Right now we are still in early stages so everything about the future product experience will be shaped by the feedback we receive from our users.\"","In a sense, Coinbase is taking a leaf from the playbook of other retail-oriented brokerage firms. For example, Robinhood offers a service dubbed Robinhood Gold, a <a href=\"https:\/\/robinhood.com\/us\/en\/support\/articles\/gold-overview\/\" data-v-f87c67ca=\"\">monthly subscription<\/a> service that gives users access to higher-quality market data and margin investing.&nbsp;","The plan also fits into a broader effort at Coinbase to diversify its business lines, something that chief financial officer Alesia Haas discussed in an interview with The Block while the firm was undertaking a direct stock listing.","\"We are focused on the long-term where we will continue to diversify our offerings,\" Haas said at the time. \"Today we are primarily investing, but interestingly enough, we’re seeing over 20% of users engaging with multiple products - from staking to earning, and borrowing\/lending.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Haas","content":"PERSON"},{"type":"Alesia Haas","content":"PERSON"}],"hashtag":["COINBASE"],"authors":["Frank Chaparro","The Block"]}