{"summary":"The SEC says it is looking to dismiss its lawsuit against DEBT Box after the agency&#x27;s lawyers admitted it made inaccurate statements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275276\/sec-plans-to-dismiss-case-against-debt-box-after-admitting-inaccurate-statements-were-made","publishDate":"2024-01-30T16:44:22","id":9776,"type":null,"title":"SEC plans to dismiss case against DEBT Box after admitting inaccurate statements were made","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission is looking to dismiss its lawsuit against crypto startup DEBT Box after the agency's lawyers admitted inaccurate statements were made in court.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The agency, which first sued Digital Licensing Inc., doing business as DEBT Box, in July, told Utah U.S. District Court Judge Robert Shelby that it planned to dismiss the action without prejudice, meaning the SEC can still refile its case.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The Commission has determined that the best way to proceed is to dismiss this action without prejudice. Thus, the Commission has authorized the filing of a motion to dismiss this action without prejudice, which will be forthcoming,\" SEC lawyers said in a filing on Tuesday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC <a href=\"https:\/\/www.theblock.co\/post\/269087\/sec-admits-it-made-inaccurate-statements-in-utah-crypto-case\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">admitted<\/span><\/a> in late December that it made inaccurate statements and said it \"fell short\" of the expectations to be accurate and candid in the court. Judge Shelby had criticized the agency's lawyers and ordered the SEC to explain \"<\/span><span class=\"s3\" data-v-f87c67ca=\"\">false or misleading\" statements after it claimed the company was trying to move assets overseas in order to escape the regulator's jurisdiction.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">The SEC also said sanctions were not warranted. Judge S<\/span><span class=\"s1\" data-v-f87c67ca=\"\">helby had ordered the SEC late last year to explain why sanctions should not be <a href=\"https:\/\/www.theblock.co\/post\/266811\/judge-grants-sec-another-week-to-explain-misrepresentations\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">imposed<\/span><\/a> upon its lawyers.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"While the Commission recognizes that its attorneys should have been more forthcoming with the Court, sanctions are not appropriate or necessary to address those issues,\" the SEC said on Tuesday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">An SEC spokesperson declined to comment beyond the public filings. The SEC has brought multiple lawsuits against crypto firms over the past year, and its chair Gary Gensler has repeatedly said most cryptocurrencies are securities.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC's suit against DEBT Box alleged it defrauded thousands of investors of at least $49 million by offering customers so-called \"node licenses\" to receive revenue from mining 11 tokens, though they were never mined.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Digital Licensing Inc.","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"$49 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Robert Shelby","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"The Commission","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Utah U.S. District Court","content":"ORGANIZATION"},{"type":"Shelby","content":"PERSON"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}