{"summary":"Crypto lending platform Hodlnaut has halted withdrawals in an apparent liquidity crisis as it works on a recovery plan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162035\/crypto-lending-platform-hodlnaut-halts-withdrawals-and-is-working-on-a-recovery-plan","publishDate":"2022-08-08T06:19:41","id":9777,"type":null,"title":"Crypto lending platform Hodlnaut halts withdrawals and is working on a recovery plan","category":["THE BLOCK"],"content":["Crypto lending platform Hodlnaut has halted withdrawals in an apparent liquidity crisis. The firm cited recent market conditions for the move and said that it needs to \"focus on stabilising our liquidity and preserving assets.\"","According to a <a href=\"https:\/\/www.hodlnaut.com\/press\/hodlnaut-message-to-our-users\" data-v-f87c67ca=\"\">statement<\/a> today, the platform has also stopped token swaps and deposits. In light of this, it is working with Singapore law firm Damodara Ong LLC on a recovery plan.","\"Halting withdrawals and token swaps was a necessary step for us to stabilise our liquidity, and give us the time to work closely with our legal advisors to come up with the best possible restructuring and recovery plan for our users,\" said the platform.","Hodlnaut has also withdrawn its license application with the Monetary Authority of Singapore. Without this application, it's unable to support token swaps, which are a regulated service.","Hodlnaut said that it will continue to pay out interest to its customers until further notice.","The platform added that it will be turning off its social media platforms except for a few official channels. The platform has deleted its YouTube account and founder Juntao Zhu has set his Twitter account to private.","The Hodlnaut website has also removed its team page that previously listed its two founders, five staff members and an advisor. An achive of the page can be seen on the Wayback Machine<i data-v-f87c67ca=\"\">.<\/i>","<em data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow <a href=\"https:\/\/twitter.com\/TheBlock__\" data-v-f87c67ca=\"\">The Block<\/a> on Twitter.<\/em>","<em data-v-f87c67ca=\"\">This article has been updated with details of the removal of the team page and social media channels. H\/T to @DegenSpartan&nbsp; for pointing these details out.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Juntao Zhu","content":"PERSON"},{"type":"Wayback Machine","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Damodara Ong LLC","content":"ORGANIZATION"}],"hashtag":["CRYPTO","LENDING"],"authors":["Tim Copeland","The Block"]}