{"summary":"Bitfinex announced the decision to remove the availability of its products and services for certain customer in the UK.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270911\/bitfinex-will-remove-products-and-services-for-some-uk-customers","publishDate":"2024-01-08T11:53:34","id":9778,"type":null,"title":"Bitfinex will remove products and services for some UK customers","category":["COMPANIES"],"content":["Bitfinex will remove availability of products and services for certain customers in the UK in order to align with regulatory requirements in the country.&nbsp;","The changes are set to affect all existing individual customers who are UK residents, and all existing corporate customers who are UK residents and do not fall into an exemption under the UK’s Financial Promotions Order. Bitfinex added that new UK-based customers who created accounts on the platform on or after Nov. 1 2023 will no longer be eligible to apply for individual account verification.","The cryptocurrency exchange said that from Jan. 10, certain existing UK customers will no longer be able to make new deposits, enter into new contracts or increase existing margin positions. However, customers will still be able to continue to reduce or close their positions, and withdraw their funds from the platform.","\"If we understand you are not exempt, you will be notified separately by Bitfinex that effective from 10 January 2024, you will no longer be able to make any new deposits, create new contracts, or increase existing margin positions,\" Bitfinex <a href=\"https:\/\/blog.bitfinex.com\/announcements\/notice-to-uk-customers\/\" data-v-f87c67ca=\"\">said<\/a> in the announcement dated Jan. 4.","Bitfinex said that corporate UK residents who meet the specific criteria of a high net worth company, unincorporated association or trust will not be affected by the changes.","\"Going forward, Bitfinex will no longer be accepting applications for verification of corporate UK residents, with the exception of those who meet the definition of a high-net-worth company, unincorporated association or trust, or another relevant applicable exemption,\" the announcement added.&nbsp;","Bitfinex said that the specific criteria of a high net worth company is defined under legislation in the UK.","\"If you are a corporate UK resident making an application for verification, we may request further information from you as part of your application in order to ensure you meet the eligibility requirements as a high net worth company, unincorporated association or trust, or another relevant applicable exemption,\" the exchange added.","At the end of October, Bitfinex was <a href=\"https:\/\/www.theblock.co\/post\/260192\/bitfinex-placed-on-uk-financial-regulators-warning-list-of-unauthorized-firms\" data-v-f87c67ca=\"\">placed<\/a> on the UK Financial Conduct Authority’s warning list of unauthorized firms.","\"You should avoid dealing with this firm,\" the FCA&nbsp;<a href=\"https:\/\/www.fca.org.uk\/news\/warnings\/bitfinex-bitfinexcom\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">stated<\/a> on its website at that time.","The financial regulatory body said that firms cannot promote financial services in the country without the necessary authorization or approval. It added that Bitfinex is \"not authorized by us and may be targeting people in the UK.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"UK Financial Conduct Authority","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Bitfinex","content":"PERSON"},{"type":"FCA","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Jan. 10","content":"DATE"},{"type":"January 2024","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Nov. 1 2023","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"Jan. 4","content":"DATE"},{"type":"October","content":"DATE"},{"type":"UK’s Financial Promotions Order","content":"ORGANIZATION"}],"hashtag":["FCA","UK PARLIAMENT"],"authors":["Brian McGleenon","The Block"]}