{"summary":"Blockchain analytics firm Blocktrace, which has a history of government contracts, is stepping into the public eye with a new API called Fusion. \nFusion aims to put together crypto wallet data provided by leading analytics firms.","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108869\/blockchain-analytics-firm-creates-api-that-pools-data-from-elliptic-ciphertrace","publishDate":"2021-06-21T09:00:32","id":978,"type":null,"title":"Blocktrace creates API that pools data from Elliptic, Ciphertrace","category":["Hacks"],"content":["Blockchain analytics firm Blocktrace is launching Fusion, an API that draws on blockchain datasets from other analytics firms.","Fusion will bring together blockchain datasets containing crypto wallet ID information from companies including Elliptic and Ciphertrace as well as more firms in the future.","Austin-based Blocktrace first came onto the crypto stage in 2018. Since then, it has largely been a service provider to the U.S. government, along with financial risk institutions, while keeping a relatively low profile.","With Fusion, however, the firm is going commercial.","\"Our primary goal of announcing Fusion publicly is to gain the attention of crypto businesses and banks who are looking for a comprehensive crypto anti-money laundering solution,\" said Blocktrace founder Shaun MaGruder.","In its announcement of Fusion, Blocktrace identifies \"third-generation crypto laundering threats\" facing authorities; Fusion's API allows clients to access formerly siloed blockchain data to help fight such threats. And although it's currently limited to just a couple of clients, the list could be expanded if more providers allow Fusion access.","\"It is also worth mentioning that we will be able to add functionality of other providers (e.g. Chainalysis) without them being official Fusion partner. All we need is a provider's AML API integration document to add additional functionality to Fusion. It's quite simple to make these changes,\" said MaGruder.","Blockchain analysis is a growing field. High-profile examples of illicit crypto use — like the <a href=\"https:\/\/www.theblockcrypto.com\/daily\/107005\/how-the-colonial-pipeline-attackers-cashed-out-bitcoin-ransom\" data-v-f87c67ca=\"\">Colonial Pipeline ransomware attack<\/a> — have drawn public attention to the need for such thorough on-chain investigation. This means that investigators, from criminal authorities to intelligence services to private financial risk assessors, are reconfiguring their operations to track crypto transactions.&nbsp;","Just last week, the Dallas office of Immigration and Customs Enforcement gave Blocktrace a $36,000 <a href=\"https:\/\/sam.gov\/opp\/3e74b7d9024d48d6938a9f3f8c290994\/view\" data-v-f87c67ca=\"\">contract<\/a>. Neither MaGruder nor the ICE contracting officer would provide details.&nbsp;","The contract is a relatively small sum compared to the <a href=\"https:\/\/www.theblockcrypto.com\/post\/108737\/blockchain-analytics-firm-trm-labs-raises-14-million-series-a\" data-v-f87c67ca=\"\">$14 million fundraise<\/a> that analytics firm TRM labs saw last week. That, in turn, pales in comparison to the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/99544\/chainalysis-2-billion-valuation-100-million-series-d-funding-round\" data-v-f87c67ca=\"\">$2 billion valuation<\/a> that leading U.S. government contractor Chainalysis hit in March.&nbsp;","<em data-v-f87c67ca=\"\">Correction 06\/22\/21: This article originally identified Blocktrace as dating to a 2015 Barclays Accelerator. That was a different firm that now goes by Everledger.&nbsp;<\/em>"],"hashtag":[]}