{"summary":"Coinbase Wallet revealed its integration with Blockaid, which has helped users save over $75 million from theft in the past five months.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282230\/coinbase-wallet-blockaid-75-million-usd","publishDate":"2024-03-13T09:00:03","id":9780,"type":null,"title":"Coinbase Wallet says it helped users save over $75 million in five months","category":["SECURITY"],"content":["Coinbase Wallet revealed today that it teamed up with web3 security startup Blockaid five months ago — and, since then, the integration has helped its users save over $75 million from being stolen.","Blockaid stopped nearly 800,000 wallet connections to malicious decentralized applications by scanning and analyzing 114 million transactions and dApp connections during this period, Coinbase Wallet said.","\"Integrating Blockaid helped evolve and improve onchain security for our users,\" Chintan Turakhia, senior director of engineering at Coinbase, said in a statement. \"By supporting safety on Ethereum Mainnet as well 6+ other EVM chains such as Base, Optimism, and Polygon, we have been able to improve both UX and safety for Coinbase Wallet users. Getting security right is critical for bringing one billion people onchain,\" Turakhia added.","The $75 million figure in savings represents the lower end, Blockaid co-founder and CTO Raz Niv told The Block. Blockaid's other clients include MetaMask, OpenSea, Zerion Wallet and Rainbow Wallet. Niv said the MetaMask integration has helped users save \"hundreds of millions of dollars thus far,\" although he declined to provide specific figures for MetaMask and other clients.","Blockaid <a href=\"https:\/\/www.theblock.co\/post\/258907\/blockaid-web3-security-funding-israel\" data-v-f87c67ca=\"\">emerged<\/a> from stealth mode last October after announcing a $33 million funding round. Niv and his other co-founder, Ido Ben-Natan, both previously worked in the cybersecurity research and development team of the Israeli military's cyber intelligence unit and the Office of the Prime Minister of Israel.","Blockaid provides security tools to prevent crypto fraud, phishing, and hacks. Coinbase Wallet uses three Blockaid APIs to enhance security for users while browsing dApps, transacting with web3 protocols or addresses, and communicating on-chain.","Blockaid is backed by high-profile investors, including Sequoia Capital, Ribbit Capital and Greylock Partners, and it operates out of New York and Tel Aviv.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sequoia Capital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"CTO Raz Niv","content":"ORGANIZATION"},{"type":"Greylock Partners","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"\"hundreds of millions of dollars","content":"MONEY"},{"type":"Zerion Wallet","content":"ORGANIZATION"},{"type":"Ribbit Capital","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Niv","content":"ORGANIZATION"},{"type":"Tel Aviv","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$75 million","content":"MONEY"},{"type":"Ethereum Mainnet","content":"PERSON"},{"type":"Natan","content":"ORGANIZATION"},{"type":"Israel","content":"LOCATION"},{"type":"Rainbow Wallet","content":"ORGANIZATION"},{"type":"Coinbase Wallet","content":"ORGANIZATION"},{"type":"Ido Ben","content":"PERSON"},{"type":"Chintan Turakhia","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"$33 million","content":"MONEY"}],"hashtag":["COINBASE","EXPLOITS","HACKS"],"authors":["Yogita Khatri","The Block"]}