{"summary":"Connectivity layer Redeem raised $2.5 million from investors including Kenetic to enable individuals to participate in web3 using just their phone numbers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215721\/redeem-raises-2-5-million-to-transfer-nfts-over-text-message","publishDate":"2023-03-01T12:00:31","id":9782,"type":null,"title":"Redeem raises $2.5 million to transfer NFTs over text message","category":["DEALS"],"content":["Blockchain agnostic connectivity layer Redeem has raised $2.5 million to enable individuals to participate in web3 using just their phone numbers.","The pre-seed funding round is led by Kenetic. Other investors in the round include VC3 DAO, CMT Digital and Flyover Capital, the company said in the release.","The startup, founded by Toby Rush, a former Alibaba executive and the founder of <a href=\"https:\/\/fortune.com\/2016\/09\/13\/alibaba-buys-eye-scan-firm-eyeverify\/\" data-v-f87c67ca=\"\">biometric startup EyeVerify<\/a>, wants to provide the infrastructure to enable users to tap into web3 using just their phone numbers.&nbsp;\"If there were a through line between the various companies, I would say it's around how do you let people do more by doing less,\" Rush said. \"A more tongue in cheek way, people are lazy and I try to help them be productive while being lazy,\" he added.","Redeem's model is business- to-business and business-to-customer with a focus on exchanging utility NFTs, Rush said.","\"We have not yet really gotten to peer-to-peer NFTs,\" Rush said. \"I love the concept. I don't know how we're gonna handle that piece.\"","A business will be able to send or receive NFTs or web3 rewards using familiar services such as Whatsapp or iMessage through Redeem's connectivity layer.&nbsp;\"I feel like I need a t-shirt to say I heart phone numbers,\" Rush said. \"They're just a fascinating construct that we've already fully opted into and so we're trying to create this connectivity layer between phone numbers and the rest of web3 and blockchain to be able to specifically unlock utility in daily life.\"","While the vision may seem ambitious, a prototype is already in use, Rush said. At an event over the weekend, individuals could scan a QR code from Redeem and select between WhatsApp or SMS to claim an NFT from the event. On the back-end, the startup is creating a wallet, putting NFTs into a wallet and sending a link immediately back to the user.&nbsp;","\"Near-term roadmap, you can configure what you want your default wallet to be,\" Rush said. \"And it would simply route the appropriate NFT to the wallet that you've chosen.\"","The startup hasn't yet integrated with any wallet providers and is currently using its own wallet. Integrations will be customer driven.&nbsp;","It also aims to be blockchain agnostic, but the current prototype runs on Polygon because it is fast and cheap. It's also using web2 technologies such as Twilio and Amazon to make the service possible.\"It's definitely a web2.5 play where there's some [technology] in the web3 world, some is in the web2 world,\" Rush said.","While Redeem's connectivity layer offers users ease, the linking of phone numbers to wallets could also be viewed as a threat to some of the core ideals of web3 and the anonymity of blockchain wallets. Rush disagrees.","\"As soon as you order something that gets sent to your house, they know your name, they require your phone number, so it's just not realistic that the entire web through blockchain crypto world stays anonymous forever,\" Rush said. \"We need much better privacy layers, we need the ability to not necessarily always live out in the open but I guess I'm a bit of a contrarian in that I don't think anonymity is the big unlock of blockchain and crypto.\"","The funding raising round closed in November and will be used to continue building out a core feature set ahead of a second-quarter strategic partnership launch, the company said.","“Adoption is the holy grail of web3,\" said Jehan Chu, founder of Kenetic, in the release. \"Redeem’s core features allow users to access the universe of web3 in seconds with no prior crypto blockchain knowledge.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CMT Digital","content":"ORGANIZATION"},{"type":"Amazon","content":"LOCATION"},{"type":"$2.5 million","content":"MONEY"},{"type":"Alibaba","content":"ORGANIZATION"},{"type":"Rush","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"weekend","content":"DATE"},{"type":"Toby Rush","content":"PERSON"},{"type":"Kenetic","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Jehan Chu","content":"PERSON"},{"type":"Flyover Capital","content":"ORGANIZATION"}],"hashtag":["NFT INFRASTRUCTURE","ONBOARDING","SEED &AMP; PRE-SEED","UTILITY NFT"],"authors":["Kari McMahon","The Block"]}