{"summary":"Intercontinental Exchange, the parent company of the New York Stock Exchange and crypto venture Bakkt, boasted a record 2019 during its fourth quarter earnings call.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55107\/consumer-adoption-will-be-key-focus-for-bakkt-in-2020-according-to-ice-ceo","publishDate":"2020-02-06T09:35:44","id":9788,"type":null,"title":"Consumer adoption will be key focus for Bakkt in 2020, according to ICE CEO","category":["THE BLOCK"],"content":["Intercontinental Exchange, the parent company of the New York Stock Exchange and crypto venture Bakkt, boasted a record 2019 during its fourth quarter earnings call.&nbsp;","Fourth-quarter earnings per share (EPS) increased 1% year over year from 0.94 per share to $0.95 per share, according to a release.&nbsp;","\"We are pleased to report our 14th consecutive year of record revenues,\" ICE chief executive officer Jeffrey Sprecher said in a release. \"Leveraging our leading technology and market expertise, we expanded our suite of risk management solutions, adding new products and services across an array of asset classes and geographies.\"","<a href=\"https:\/\/ir.theice.com\/~\/media\/Files\/I\/Ice-IR\/events-presentations\/presentation\/4q19-presentation.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Source: ICE<\/em><\/a>","During the call, Bakkt was identified as a key growth initiative alongside ICE Abu Dhabi. &nbsp;","Sprecher outlined Bakkt's history and highlighted the announcement of its planned acquisition of Bridge2 Solutions, a provider of loyal reward programs.&nbsp;","He said it will \"accelerate the second phase of our digital asset strategy.\"","\"A little more than a year ago we outlined our future plans for Bakkt,\" he said. \"Our mission was was to build a broader ecosystem to support the full life cycle of a digital asset.\"","The acquisition, he added, will position Bakkt as \"an aggregator and a marketplace for a broad set of digital assets.\"","As for how ICE will judge the success of Bakkt, Sprecher said during the Q&amp;A portion of the call that the focus for 2020 will be \"broad adoption\" of the consumer application.","\"We will be looking at consumer adoption more than revenue or expenses,\" he said. \"We are having a lot of conversations with larger consumer brands and merchants.\"","Sprecher also addressed a Wall Street Journal report that ICE <a href=\"https:\/\/www.theblockcrypto.com\/linked\/54923\/nyse-parent-company-ice-makes-offer-to-buy-ebay-report\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">had approached<\/a> eBay about a potential acquisition. Such a deal makes sense, given ICE's desire to innovate in new nascent asset classes.&nbsp;","\"Is there a marketplace for swords and sickles that are on a video game?\" he noted.","\"We aren't crazy, we didn't lose our minds,\" Sprecher said, answering a question about its conversations with eBay. \"We feel really good about our ability to continue to find more asset classes.\"","Following the close of the deal, which is expected to occur later this quarter, Bridge2 will be incorporated into Bakkt.&nbsp;","Bakkt will leverage Bridge2 Solution's merchant relationships to build out its consumer facing application, which will offer a wallet for users to store an array of digital assets, including cryptocurrencies and loyalty rewards.","Already, Bridge2 manages loyalty rewards platforms for merchants and financial institutions with a combined total of $60 billion worth of rewards points, as reported by <a href=\"https:\/\/fortune.com\/2020\/02\/05\/bakkt-rewards-points-bitcoin-cash-wallet\/?utm_medium=social&amp;utm_source=twitter.com&amp;xid=soc_socialflow_twitter_FORTUNE&amp;utm_campaign=fortunemagazine\" data-v-f87c67ca=\"\">Fortune<\/a>. It is also working on a pilot called Loyalty Pay, which will allow companies to issue credit cards tied to rewards.&nbsp;","A spokesperson for ICE told The Block the application will be available in the first half of the year, adding that \"users will be able to pay with Bakkt at any merchant through a variety of direct and indirect integrations.\"","The app will also allow users to convert between bitcoin, loyalty points, and in-game rewards in real time. Loyalty Pay will be integrated into the app, but will remain a stand-alone solution, a spokesman said.&nbsp;","Elsewhere, Bakkt is seeing the continued growth of its bitcoin futures product, which launched in September of 2019.&nbsp;","The one-month contract's open interest hit a new all-time high $12.6 million on February 5th, according to data provided by Skew. Volume stood at $16.4 million, bringing the total trading volume for the product to more than $1 billion since launch.&nbsp;","","","The firm also recently launched an option tied to its physically-delivered futures contract.","The contract, which has been less successful than the futures contract, went ten days without trading at the end of January, as The Block previously <a href=\"http:\/\/theblockcrypto.com\/post\/54294\/bakkts-bitcoin-options-saw-zero-volume-last-week\" data-v-f87c67ca=\"\">reported<\/a>.&nbsp;","Open interest for the contract stood at $0.2 million on February 5th. To date, the contract has seen $1.9 million in traded volume.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$12.6 million","content":"MONEY"},{"type":"Intercontinental Exchange","content":"ORGANIZATION"},{"type":"September of 2019","content":"DATE"},{"type":"Bakkt","content":"ORGANIZATION"},{"type":"Jeffrey Sprecher","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"Bakkt","content":"PERSON"},{"type":"$0.95","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Bakkt","content":"LOCATION"},{"type":"Sprecher","content":"PERSON"},{"type":"$0.2 million","content":"MONEY"},{"type":"$1.9 million","content":"MONEY"},{"type":"Abu Dhabi","content":"PERSON"},{"type":"February 5th","content":"DATE"},{"type":"fourth quarter","content":"DATE"},{"type":"$60 billion","content":"MONEY"},{"type":"$16.4 million","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"2020","content":"DATE"}],"hashtag":["EARNINGS"],"authors":["Frank Chaparro","The Block"]}