{"summary":"A board member of the Ethereum Classic Cooperative has resigned\nThe board member, James Wo, said his resignation is due to disagreement with the organization’s executive director Bob Summerwill \nEthereum Classic Cooperative is a Digital Currency Group-backed research organization focusing on the development of Etheruem Classic","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58953\/ethereum-classic-collective-board-member-resigns-withdraws-funding-support","publishDate":"2020-03-17T10:49:53","id":979,"type":null,"title":"Ethereum Classic Collective board member resigns, withdraws funding support","category":["Layer 1s"],"content":["<span data-v-f87c67ca=\"\">A board member of Ethereum Classic Collective (ECC) <a href=\"https:\/\/jameswo888.wordpress.com\/2020\/03\/17\/mismanagement-at-ethereum-classic-cooperative\/\" data-v-f87c67ca=\"\">announced<\/a> today that he decided to leave his post at the nonprofit research organization that focuses on the Ethereum Classic Network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"<\/span><span data-v-f87c67ca=\"\">I regret to say that, as a matter of principle, I must resign from the Board, effective immediately, because of gross mismanagement. I have reluctantly concluded that the executive director, Bob Summerwill, lacks the integrity and judgment needed to build the organization,\" the board member James Wo wrote in a statement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Wo, who is also the founder of another Ethereum Classic research group Ethereum Classic Labs, was one of the three board members of ECC, with the other two being Digital Currency Group CEO Barry Silbert and Cody Burns, a long-term Ethereum core supporter and manager of blockchain architecture at Accenture. <\/span>","<span data-v-f87c67ca=\"\">Besides resigning from the board, Wo will also discontinue the financial support to ECC in 2019 and 2020, although he claimed he \"provided significant funding\" in 2018, per the statement.&nbsp;<\/span>","”James quitting ECC [will have a] big impact. He's one of the few strong supporters after ETC went quiet after 2017,\" said China-based ETC community member Chao Du.","\"The Asia-side is mainly supported by James. The America side is mainly Terry promoting some cooperation with Ethereum,\" Chao continued, referring to Ethereum Classic Labs CEO Terry Culver.","Summerwill did not respond to The Block's request for comment on Wo's allegations by press time. When reached, he sent&nbsp;<a href=\"https:\/\/etccooperative.org\/etc-cooperative-agm-2020-new-governance\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">an update release<\/a> on the ECC's Annual General Meeting, which took place on Tuesday. The group has added to its board of directors, naming BITKIO CEO Roy Zou, Global Financial Access blockchain engineer Elaine Ou, and Grayscale legal director Craig Salm. Salm will serve as chair of the board of directors, according to the post.","\"One of the primary tasks assigned to me when I joined the ETC Cooperative as Executive Director just over a year ago was 'design and put in place a new governance structure for the ETC Coop',\" Summerwill wrote. \"That work has taken another step forward today as the culmination of months of work alongside our new Treasurer, Alison Alexis CPA, who has been instrumental to our progress. Two Resolutions were passed today, which strengthened our Board of Directors and put the new governance policies, processes and procedures in place to enhance the ETC Cooperative’s transparency and overall mission[.]\"","One of the two resolutions passed <a href=\"https:\/\/etccooperative.org\/wp-content\/uploads\/2020\/03\/ETC-Coop-2020-Resolutions-Election-and-Removal-of-Directors.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">mentioned Wo<\/a>&nbsp;and stated that \"pursuant to Article III, Section 6 (Resignation) of the By-Laws, the following person’s resignation as a member of the Board is accepted[.]\"","<span data-v-f87c67ca=\"\">Wo said that his resignation is solely due to what he alleged as incompetence and mismanagement on the part of Summerwill. In the statement, Wo accused Summerwill of nepotism, failing to meet the basic goal of expanding the ECC funding, pursuing a personal agenda at the organization’s expenses, among other things.<\/span>","<span data-v-f87c67ca=\"\">\"There is a lack of transparency about the budget, operations, and programs. There is consistent mismanagement of finances, including funding for pet projects that have little value, and constant travel expenses that seem more personal than professional,\" Wo wrote.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Among the allegations outlined in the statement, Wo noted that Summerwill's supporting for shift the existing Proof-of-Work mining algorithm Ethhash to SHA3 as an example of him pursuing a personal objective, which, in this case, is to do the opposite of Ethereum regardless of the consequences.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Summerwill is said to continuously push for this shift even though the community did not reach an agreement on it <\/span><a href=\"https:\/\/eng.ambcrypto.com\/ethereum-classic-rejects-progpow-while-sha-3-gains-majority-support\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">during a discussion in November last year<\/span><\/a><span data-v-f87c67ca=\"\">. Based on a screenshot Summerwill sent to a group chat titled #Core in February and reviewed by The Block, Summerwill described the next hard fork as including the SHA3 proposal, although Wo said this proposal was not discussed nor agreed upon.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, Summerwill has allegedly not provided Wo or the board with any financial reports. Nonprofit organizations in the U.S. are required by laws to file Form 990 to the Internal Revenue Service to maintain its tax exemption status. <\/span>","<span data-v-f87c67ca=\"\">ECC filed the form for 2018 and Wo said this is the only report available to him. However, ECC did publish mid-year and end-of-year reviews for 2018 that stated that its had $530,000 in cash at the end of 2018.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In January, Grayscale Investments, a subsidiary of DCG, announced that it will extend its financial support for ECC for another two years. Since 2017, the firm has donated around $1 million to the organization. In the latter half of 2018, the firm donated $250,000, with 15,000 ETC registered as other contributions, according to ECC's end of year report for 2018.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It is unclear whether some of the 15,000 ETC is Wo’s contribution, as he stated that <\/span><span data-v-f87c67ca=\"\">he “provided significant funding to the ECC in 2018 and was prepared to do so in 2019-2020.\"&nbsp;<\/span>","Although Summerwill pointed out to The Block in a follow-up email that the 15,000 ETC was a <a href=\"https:\/\/www.google.com\/url?q=https:\/\/medium.com\/@virgilgr\/special-projects-announces-donation-to-ethereum-classic-cooperative-e3bc28c95d0&amp;source=gmail&amp;ust=1584717503795000&amp;usg=AFQjCNH9JFFCRDhKXNOieNAT68vshp0Smw\" data-v-f87c67ca=\"\">donation<\/a> from the Ethereum Foundation, and that Wo <a href=\"https:\/\/etccooperative.org\/250k-funding-digital-finance-group\/\" data-v-f87c67ca=\"\">contributed<\/a> to the organization $250,000 in May, 2018 through Digital Finance Group, a crypto fund he runs.&nbsp;","<span data-v-f87c67ca=\"\">Meanwhile, <\/span><span data-v-f87c67ca=\"\">ECC promised to publish a full-year transparency report for 2019 by March 2020 when the Grayscale announcement was made, although the report cannot be found on the ECC website.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"I don’t make this decision lightly. I respect Bob's experience. But I cannot, in good conscience, continue to be associated with an organization whose executive director divides our community, lacks integrity, and is only looking out for himself. The Coop needs an experienced and professional leader who can collaborate with others,\" Wo wrote.&nbsp;&nbsp;<\/span>","<em data-v-f87c67ca=\"\">This story has been updated with additional information about Tuesday's ECC governance meeting and the naming of three additional board members.&nbsp;<\/em>"],"hashtag":[]}