{"summary":"Joe McCann is the Founder and Chairman of the Board of NodeSource and former quant trader for Passport Capital. This piece is purely for informational","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/30409\/bulls-defend-the-bid","publishDate":"2019-07-08T15:56:30","id":9790,"type":null,"title":"Bulls defend the bid","category":["BITCOIN"],"content":["<i data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\"><a href=\"https:\/\/twitter.com\/joemccann?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Joe McCann<\/a>&nbsp;is the Founder and Chairman of the Board of NodeSource and f<\/em>ormer quant trader for Passport Capital. This piece is purely for informational purposes; nothing in this post should be construed as investment advice.<\/i>","<span data-v-f87c67ca=\"\">After a scary moment for bulls early last week when the price of bitcoin dipped all the way to $9,650, a short covering rally followed by dip buyers pushed the price of bitcoin up for an 11% gain to end the trading week. Some choppy action ensued for the rest of the week, while traders digested the intense volatility over the past couple of trading weeks. Look to this week for direction with bitcoin poised to test $12,500 and potentially the year-to-date highs of $13,900.<\/span>","","","<span data-v-f87c67ca=\"\">Last week we ended in on a rather bearish note with a <a href=\"https:\/\/www.investopedia.com\/terms\/g\/gravestone-doji.asp\" data-v-f87c67ca=\"\">gravestone doji<\/a> (bearish reversal where open, low, and closing are all near each other) forming on the weekly close. I suggested a defensive posture on the long side and an opportunistic one on the short side, which boded well for both positions this past week. After a dip below $10,000 once again, bitcoin quickly and fiercely bounced off the $9,650 area as many traders who were short from the blow-off top around $13,900 started to covering their positions, allowing price to end the week up 11.3%.<\/span>","","","<span data-v-f87c67ca=\"\">Price continued its streak of closing above the 20-day moving average for 24 straight days. The 10-day moving average will likely bounce off the 20-day moving average or slice through it lower causing, a bearish crossover at some point this week.<\/span>","<span data-v-f87c67ca=\"\">Volume was well below average the last four trading sessions, declining overall since the $13,900 top a couple of weeks ago. This is something to keep an eye on as there's some clear distribution (profit taking) taking place.<\/span>","","","<span data-v-f87c67ca=\"\">As mentioned last week, we were set up for a bearish MACD crossover and it came with a vengeance, dragging price all the way down to $9,650 before bouncing firmly higher. The MACD is slowing down a bit but I currently see no edge in its signal.<\/span>","","","<span data-v-f87c67ca=\"\">Momentum indicators are pretty useless for now as they are all sitting in the midpoints of their respective ranges. Keep an eye on the RSI but beyond that, not much to report.<\/span>","<span data-v-f87c67ca=\"\">One thing that you should definitely be aware of this week is the rising channel of bitcoin volatility, or \"vol\" for short.<\/span>","","","<span data-v-f87c67ca=\"\">An explosive move in vol appears likely, which means an explosive move in <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">price <\/span><\/i><span data-v-f87c67ca=\"\">(<\/span><span data-v-f87c67ca=\"\">up <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">or<\/span><\/i><span data-v-f87c67ca=\"\"> down.) Keep an eye on vol over the next couple of weeks as well and consider positioning yourself accordingly.<\/span>","<span data-v-f87c67ca=\"\">Good luck!<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$13,900","content":"MONEY"},{"type":"$10,000","content":"MONEY"},{"type":"$9,650","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Joe McCann","content":"PERSON"},{"type":"$12,500","content":"MONEY"},{"type":"MACD","content":"ORGANIZATION"},{"type":"Board of NodeSource","content":"ORGANIZATION"},{"type":"11%","content":"PERCENT"},{"type":"RSI","content":"ORGANIZATION"},{"type":"11.3%","content":"PERCENT"}],"hashtag":[],"authors":["Contributor Network","The Block"]}