{"summary":"Celsius customer emails were leaked in the same Customer.io data breach that impacted OpenSea.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160148\/celsius-also-hit-by-costumer-io-email-data-breach","publishDate":"2022-07-28T16:31:05","id":9795,"type":null,"title":"Celsius also hit by Customer.io email data breach","category":["SECURITY"],"content":["An employee at one of Celsius' vendors leaked a list of customer emails to a \"third-party bad actor,\" according to the company.","The crypto lender said in an email Thursday that it was hit by the same Customer.io data breach <a href=\"https:\/\/www.theblock.co\/post\/155010\/opensea-hit-by-data-breach\" data-v-f87c67ca=\"\">that impacted OpenSea as well<\/a>.&nbsp;","Although Celsius doesn't think that its customers face \"any high risks,\" it does see the data breach as a \"severe violation of vendor-client relations\" and has contacted the appropriate authorities, the company said.","Five other Customer.io customers were affected beyond OpenSea, <a href=\"https:\/\/customer.io\/blog\/update-to-compromised-email-addresses-incident\/\" data-v-f87c67ca=\"\">according to an update from the company.<\/a>","Customer.io initially said on June 30 that no Celsius data had been affected, Celsius’ email said. On July 8, however, the company warned that a list of Celsius customer emails had in fact been leaked, even though Celsius had removed all data held with Customer.io right after finding out about the incident.","Customer.io also said that \"no other Celsius client data was accessed or taken by the employee.\"","The employee in question was a senior engineer that has since been fired, Customer.io's update noted.","\"We do not expect to learn any additional information since this incident resulted from the actions of a single employee, who had legitimate access to these email addresses as part of the employee’s job,\" it also said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 30","content":"DATE"},{"type":"July 8","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"}],"hashtag":["OPENSEA"],"authors":["Catarina Moura","The Block"]}