{"summary":"If there is a new acronym or concept that you&#x27;ve picked up in the last year, it is most likely &#x27;NFTs&#x27;, short for Non-fungible tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/121910\/nft-markets-pain-point-lack-of-utility-and-how-we-should-change-this","publishDate":"2021-10-27T09:00:03","id":9797,"type":null,"title":"NFT Markets Pain Point: Lack of Utility and How We Should Change This?","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Vincenzo Lee, CEO of Kollect<\/em><\/span>","<span data-v-f87c67ca=\"\">If there is a new acronym or concept that you've picked up in the last year, it is most likely 'NFTs', short for Non-fungible tokens. An NFT is a unique digital asset representing ownership of a digital item and is then stored on a digital ledger we call the blockchain to verify and authenticate. <\/span><a href=\"https:\/\/www.reuters.com\/technology\/nft-sales-surge-107-bln-q3-crypto-asset-frenzy-hits-new-highs-2021-10-04\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Reports<\/span><\/a><span data-v-f87c67ca=\"\"> from Reuters show that in the third quarter of 2021 alone, NFT sales volumes reached an insurmountable amount of $10.7 billion; Roughly eight times more than that of the previous quarter, and thus, has been making the news constantly.<\/span>","<span data-v-f87c67ca=\"\">It is now common to see NFT project launches from all sorts of brands and celebrities; We all know what it feels like when there's a new project hitting the wire and making headlines globally. Some notable celebrities and brands that we have seen starting their NFT projects in recent days include Snoop Dogg, Lindsay Lohan, Coca-Cola, Paris Hilton, Ellen DeGeneres, Dolce &amp; Gabbana, Mark Cuban, and much more. However, some of them are only digital collectibles with minimal actual usage.<\/span>","<span data-v-f87c67ca=\"\">Although the broader NFT market has been booming, and we have seen owning some specific NFTs could bring the owner a certain social status, most projects lack true utility, meaning buyers can not further leverage their NFTs after purchasing them.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Gary Vaynerchuk, a world-recognized entrepreneur, speaker, internet influencer, and now NFT specialist, <\/span><a href=\"https:\/\/www.instagram.com\/p\/CVReQ-AALA5\/?utm_medium=copy_link\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">spoke<\/span><\/a><span data-v-f87c67ca=\"\"> about the recent digital boom, stating that 90% of NFTs will have little to no value in 3-5 years. Coinbase founder and CEO supported Gary's beliefs. He compared it to the early internet companies in the late '90s, where he sees that due to the lack of utility, sustainability, and \"value\". As a result, 90% of these projects are doomed to fail.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The market is eager to see a paradigm shift in the current NFT market, where it's still primarily driven by hype, pure speculation, and a group of niche collectors and short-term profit-taking investors. Instead, we need a more utility-driven environment to allow NFT projects to transform into a long-term sustainable model so that they can be quickly adopted and appreciated by the masses.<\/span>","<span data-v-f87c67ca=\"\">There are some projects that are making an effort to help initiate that paradigm shift and turn the NFT market into a more utility-friendly place. <\/span><a href=\"https:\/\/kollect.cards\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Kollect<\/span><\/a><span data-v-f87c67ca=\"\"> could be one of them.<\/span>","<span data-v-f87c67ca=\"\">Kollect is set to become the hub of NFT collectibles and play-to-earn games for recognized brands and IPs. It contains two major parts: Kollect.book and Kollect.game. Kollect.book is a collection book for the NFTs that is available on the Kollect platform. It has a unique built-in play-to-earn feature, allowing users to strategically stake their cards in different collection books to earn rewards. This feature enables flexible gamification and earns functions for all the collecting activities.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, Kollect.game is an in-house game launchpad. Games launched on Kollect can leverage the collection book system to enjoy a broader player base, while players can use the NFT cards they collected in the collection books to participate in the games.<\/span>","<span data-v-f87c67ca=\"\">Projects like Kollect, where users can put their NFTs into real action and have real utility, rather than purely a collectible item, could drive the new wave of growth in the NFT\/GameFi market.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Figure 1: An illustration of a card game in Kollect features original IP &lt;Dumpling Empire vs Slime Kingdom&gt;<\/span>","","","<span data-v-f87c67ca=\"\">Source: Kollect.cards<\/span>","<span data-v-f87c67ca=\"\">From a broader perspective, the utility of NFTs remained an under-discussed area in the space. While many are still focused on the headline value of NFTs, bringing in actual usage for NFTs could open up a whole new market. Here's the utility that all the Kollect NFTs will have and what we believe will be able to drive the value of those NFTs:<\/span>","<span data-v-f87c67ca=\"\">It's essential for collectors and players to understand the above value drivers for NFTs. That's because when consumers recognize where the value is, demand will be generated. We have seen that NFTs have transformed the traditional collection market with new ecosystems built based on peoples' desire to collect digital assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With the addition of interactive gamification and crypto-economic incentives to generate financial yield, projects such as Kollect could potentially unlock the value in the digital collectible and GameFi space at the intersection of psychology, technology, and finance.<\/span>","<span data-v-f87c67ca=\"\">Although bringing utility into the NFT scene could trigger the paradigm shift in the scene, that's not enough to take a project to thrive.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">What makes Kollect unique is that it leverages its connections and partnerships with globally recognizable intellectual property in gaming, animation, and entertainment. In addition, the team behind Kollect also has extensive experience as a creative gaming studio. As a result, it can address apparent issues that were holding back the potential of the NFT space.<\/span>","<span data-v-f87c67ca=\"\">Combining high-quality games, decent financial yield systems, and household anime names such as Power Rangers, Kollect will directly address all the aspects of the market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The current NFT Market is booming with projects launched daily and world-recognized brands and celebrities stepping their feet into the market. However, the growth that we are experiencing is not sustainable due to a lack of utility and ecosystem for long-term survivability. Projects such as Kollect aims to change that. There will be hurdles and challenges for sure. Still, with over 20+ years of experience in game development, Kollect will trigger the paradigm shift by bringing true utility into NFT.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kollect","content":"LOCATION"},{"type":"90%","content":"PERCENT"},{"type":"Snoop Dogg","content":"ORGANIZATION"},{"type":"Kollect","content":"PERSON"},{"type":"third quarter of 2021","content":"DATE"},{"type":"Vincenzo Lee","content":"PERSON"},{"type":"Lindsay Lohan","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"NFT Market","content":"ORGANIZATION"},{"type":"Coca","content":"LOCATION"},{"type":"Power Rangers","content":"ORGANIZATION"},{"type":"Gary","content":"PERSON"},{"type":"Dumpling Empire vs Slime Kingdom","content":"ORGANIZATION"},{"type":"Ellen DeGeneres","content":"PERSON"},{"type":"Dolce &amp; Gabbana","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Mark Cuban","content":"PERSON"},{"type":"Cola","content":"ORGANIZATION"},{"type":"Paris Hilton","content":"LOCATION"},{"type":"Gary Vaynerchuk","content":"PERSON"},{"type":"3","content":"DATE"},{"type":"$10.7 billion","content":"MONEY"}],"hashtag":[],"authors":["Sponsored","The Block"]}