{"summary":"Shima Capital has struggled to get audited, having dealt with several firms without finding one that will stick around.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239833\/shima-capital-auditors","publishDate":"2023-07-18T11:01:08","id":9798,"type":null,"title":"One of crypto’s most active venture investors still can’t find an auditor","category":["DEALS"],"content":["<span data-v-f87c67ca=\"\">For Shima Capital, which began investing in crypto in early 2021, deal flow and fundraising have come easy. It’s backed close to 200 startups, consistently ranking among the sector’s most active venture funds, and just last August announced a raise of $200 million for its debut fund, with backers including billionaires Bill Ackman and Alan Howard, former presidential candidate Andrew Yang and industry heavyweights like Animoca Brands and Dragonfly Capital. <\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But Shima has had a harder time securing the services of an auditor, based on documents reviewed by The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Puerto Rico-based company — which was originally based in Delaware — has flirted with several accountancy firms, but after more than two years of feverish investment, it doesn’t appear to have undergone a formal audit. <\/span>","A <a href=\"https:\/\/reports.adviserinfo.sec.gov\/reports\/ADV\/320929\/PDF\/320929.pdf\" data-v-f87c67ca=\"\">form ADV filed in May<\/a> this year suggests the fund<span data-v-f87c67ca=\"\">’s annual statements are subject to an annual audit. A spokesperson for&nbsp;<\/span><span data-v-f87c67ca=\"\">Shima said the company<\/span><span data-v-f87c67ca=\"\"> is “currently in the process of engaging with multiple auditors” but didn't provide answers to other questions.<\/span>","<span data-v-f87c67ca=\"\">Shima is run by Yida Gao, who in 2020 <\/span><a href=\"https:\/\/www.forbes.com\/profile\/yida-gao\/?sh=610994745469\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">made Forbes’ 30 Under 30 list<\/span><\/a><span data-v-f87c67ca=\"\"> of budding young venture capitalists. Prior to forming Shima, he spent time at Divergence Digital Currency and Struck Capital, two venture firms. He previously worked for New Enterprise Associates and Morgan Stanley.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The documents reviewed by The Block — many of them published as part of an ongoing court case involving Gao and his former employer Adam Struck — paired with comments from people familiar with Shima underscore its struggles to find an auditor.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">An investor presentation from the Summer of 2021 suggests Shima tried to engage auditing firm Richey May &amp; Co. to perform tax and auditing services. Stephen Vlasak, a partner at Richey May, confirmed in an email that the firm had “never been officially engaged or issued any audit reports for Shima Capital.”<\/span>","<span data-v-f87c67ca=\"\">A slightly altered version of the same presentation suggests Shima then turned to BDO. Gao himself names BDO USA as Shima’s “potential auditor” in a court filing. In a separate investor update in 2022, BDO Cayman was named as Shima’s auditor. But the accountancy firm informed Shima in March 2023 that, after a policy change, the venture firm fell outside of BDO’s risk parameters. BDO’s U.S. and Cayman Islands units didn’t respond to requests for comment. <\/span>","<span data-v-f87c67ca=\"\">Next came Marcum LLP, which recently began appearing in Shima’s regulatory filings. Marcum was engaged earlier this year, according to a person familiar with the matter, but the accountancy firm ultimately determined that Shima lay outside its risk parameters. Marcum didn’t respond to multiple requests for comment.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On June 21, Marcum was <\/span><a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-114?utm_medium=email&amp;utm_source=govdelivery\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">charged by the U.S. Securities and Exchange Commission<\/span><\/a><span data-v-f87c67ca=\"\"> with “systemic quality control failures throughout the firm.” Marcum agreed to pay a $10 million penalty to settle the charges.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">More than two years after Shima began investing in startups, its search for an auditor goes on.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A spokesperson for the company didn’t respond to most of The Block’s questions, except to confirm that Shima is currently engaging with multiple auditors and to point out that securing an auditor in the U.S. has been “a huge crypto industry-wide challenge,” with formerly friendly outfits like Mazars and Armanino halting work in the sector after the disastrous collapse of FTX last year.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To be sure, Shima is not the first crypto VC to struggle to get accounts signed off. Animoca Brands, the hyperactive web3 investment firm, finally <\/span><a href=\"https:\/\/www.animocabrands.com\/animoca-brands-releases-fy-2020-annual-report\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">produced a long-delayed set of audited accounts<\/span><\/a><span data-v-f87c67ca=\"\"> for 2020 in early June this year. In <\/span><a href=\"https:\/\/www.theblock.co\/post\/198445\/animoca-brands-allowed-deadline-extension-for-filing-results\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">an earlier statement<\/span><\/a><span data-v-f87c67ca=\"\">, Animoca chair Yat Siu said the company’s “financial auditing process required breaking entire swathes of new ground,” tackling questions about how to account for token sales and NFTs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">When Shima unveiled its $200 million fund in August last year, Gao said in a statement that the company had identified a pocket of web3 founders that were too small for tier 1 investors. Shima planned to focus there, writing checks of $500,000 to $2 million. <\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We also observed that early-stage funds usually do not provide extensive value-adds for founders given limited resources. At Shima, we take the opposite approach and spend the necessary resources to provide our portfolio companies with surgical support typically found only with larger funds,” Gao said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Shima’s strategy seems to have resonated with founders. The venture firm racked up a dozen deals or more for six consecutive quarters until Q2 this year, when it made 9 investments.<\/span>","<span data-v-f87c67ca=\"\">Source: The Block Research<\/span>","<span data-v-f87c67ca=\"\">Shima’s rise has not been without incident, however. Late last year, <a href=\"https:\/\/unicourt.com\/case\/ca-la23-yida-gao-et-al-vs-adam-b-struck-et-al-668443\" data-v-f87c67ca=\"\">news broke<\/a> that Gao had sued his former employer, Adam Struck of Struck Capital Management, in an attempt to enforce his partnership rights amid claims he had been frozen out of the company. Later, Struck countersued.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Gao had been hired to help run Struck Capital’s blockchain investments in 2016.&nbsp;<\/span><span data-v-f87c67ca=\"\">Gao accused Struck of breaching the terms of their partnership. <\/span><span data-v-f87c67ca=\"\">Struck alleged, among other things, that Gao had stolen proprietary materials to start a competing firm, Shima. Gao had also taken a position at a Cayman Islands-based Special Purpose Acquisition Vehicle that Struck alleged had links with authorities in China. <\/span>","<span data-v-f87c67ca=\"\">In February of this year, The Financial Times <\/span><span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.ft.com\/content\/3da34c10-f886-4048-aaa9-eefa35d417a1\" data-v-f87c67ca=\"\">examined<\/a> investor presentations in which Shima initially touted outsized returns on an investment in BitClout, a blockchain-based social media outfit, only to scrub that reference in a subsequent version. Gao told the FT the change was due to “a clerical error” and noted he hadn’t had “a Grant Thornton or somebody audit my personal books.” The same article stated that BDO’s Cayman Islands unit had been engaged to prepare an audit of Shima’s 2022 financial results, which, at the time, were due “in a matter of months.”&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Update to reflect that Gao in fact sued Struck first, and that he was not a general partner while at Struck Capital.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cayman Islands","content":"LOCATION"},{"type":"Marcum","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"” Gao","content":"ORGANIZATION"},{"type":"Adam Struck of Struck Capital Management","content":"ORGANIZATION"},{"type":"Alan Howard","content":"PERSON"},{"type":"May<\/a> this year","content":"DATE"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Armanino","content":"ORGANIZATION"},{"type":"Special Purpose Acquisition","content":"ORGANIZATION"},{"type":"Dragonfly Capital","content":"ORGANIZATION"},{"type":"Richey May","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"Stephen Vlasak","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"New Enterprise Associates","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Richey May &amp; Co.","content":"ORGANIZATION"},{"type":"Summer of 2021","content":"DATE"},{"type":"June this year","content":"DATE"},{"type":"Shima","content":"PERSON"},{"type":"Yat Siu","content":"PERSON"},{"type":"Shima","content":"LOCATION"},{"type":"BDO","content":"ORGANIZATION"},{"type":"March 2023","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$500,000","content":"MONEY"},{"type":"Gao","content":"ORGANIZATION"},{"type":"Shima Capital","content":"ORGANIZATION"},{"type":"Mazars","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Grant Thornton","content":"LOCATION"},{"type":"2016","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Delaware","content":"LOCATION"},{"type":"Struck Capital","content":"ORGANIZATION"},{"type":"Bill Ackman","content":"PERSON"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Puerto Rico","content":"LOCATION"},{"type":"$200 million","content":"MONEY"},{"type":"June 21","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"BDO Cayman","content":"PERSON"},{"type":"February of this year","content":"DATE"},{"type":"Divergence Digital Currency and Struck Capital","content":"ORGANIZATION"},{"type":"Yida Gao","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"BDO’s Cayman Islands","content":"ORGANIZATION"},{"type":"August last year","content":"DATE"},{"type":"Andrew Yang","content":"PERSON"},{"type":"Marcum LLP","content":"ORGANIZATION"},{"type":"The Financial Times","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}