{"summary":"Web3 wallet MetaMask is now letting users verify their airdrop eligibility and NFT claims via a partnership with onchain project Daylight.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287537\/metamask-now-lets-users-check-if-they-are-eligible-for-airdrops-and-nft-claims","publishDate":"2024-04-10T06:04:07","id":98,"type":null,"title":"MetaMask now lets users check if they are eligible for airdrops and NFT claims","category":["CRYPTO ECOSYSTEMS"],"content":["Web3 wallet MetaMask is now letting users verify their airdrop eligibility via an integration with onchain project Daylight.","\"We've partnered with Daylight to help users check if they qualify for any airdrops in the ecosystem,\" the Consensys Software Inc.-developed wallet wrote in <a href=\"https:\/\/twitter.com\/MetaMask\/status\/1777697903584121242\" data-v-f87c67ca=\"\">a post<\/a> on X.","\"Your favorite dapp decentralized and dropped a token? Don’t remember if you missed out on any that are still valid? Check “Eligible Airdrops” to find out,\" it also wrote in <a href=\"https:\/\/metamask.io\/news\/latest\/how-to-find-and-claim-airdrops-and-nfts-easily-with-metamask-portfolio\/\" data-v-f87c67ca=\"\">a blog post<\/a>.","Specifically, airdrop and NFT-claim eligibility can be found in the Explore page in MetaMask Portfolio.","There, Daylight API suggests unique NFT recommendations per user based on \"a variety of social factors,\" such as if they are on an allowlist, hold a required token or hold a related token. It also considers whether a user has minted a different token from the same creator or if an NFT was minted by someone they follow on Farcaster — among other things.","Airdrop and NFT-claim eligibility is supported across Ethereum, Optimism, Arbitrum, Base, Zora and Polygon.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Arbitrum","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"MetaMask Portfolio","content":"ORGANIZATION"},{"type":"Consensys Software Inc.","content":"ORGANIZATION"},{"type":"Base","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Daylight API","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["WALLET MAKERS"],"authors":["Adam James","The Block"]}