{"summary":"A Telegram game called Super Sushi Samurai saw its LP wallets drained for $4.6 million due to a bug.\nThe bug allowed any user to send all of their funds back to themselves — which would double them.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284007\/telegram-game-super-sushi-samurais-lp-wallets-drained-for-4-6-million-as-bug-let-users-double-their-own-funds","publishDate":"2024-03-21T13:23:21","id":980,"type":null,"title":"Telegram game Super Sushi Samurai&#x27;s LP wallets drained for $4.6 million as bug let users double their own funds","category":["Crypto Ecosystems"],"content":["An idle Telegram game called Super Sushi Samurai saw its liquidity provider wallets drained for $4.6 million due to a bug that let users double their own funds.","\"<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">We have been exploited, it's mint related. We are still looking into the code. Tokens were minted and sold into the LP,\" said the project's <a href=\"https:\/\/twitter.com\/SSS_HQ\/status\/1770836683426062397\" data-v-f87c67ca=\"\">official X account<\/a>.<\/span>","A Yuga Labs smart contract developer known as Coffee noted that the token contract <a href=\"https:\/\/twitter.com\/coffeexcoin\/status\/1770834359601217886\" data-v-f87c67ca=\"\">had a bug<\/a>. If a user transferred the entire balance of their wallet to themselves, it would double their funds.","It seems the attacker did exactly this and then used the funds to drain the liquidity on decentralized exchanges. The attacker sold the newly minted tokens for 1,310 wrapped ether, worth $4.6 million at current prices.","However, the funds may not entirely be lost. The person who drained the funds <a href=\"https:\/\/twitter.com\/pcaversaccio\/status\/1770840376636481833\" data-v-f87c67ca=\"\">sent a message<\/a> saying that it was a whitehat rescue hack. They provided details for contacting them and said that users should get reimbursed. The project said it had <a href=\"https:\/\/twitter.com\/SSS_HQ\/status\/1770846767497564301\" data-v-f87c67ca=\"\">reached out<\/a> to the exploiter.","The game is played through Telegram and runs on the Blast network. Rewards are generated from a combination of a trading tax, an onchain transaction fee rebate from Blast and through yield generated from ether in the LP pool."],"hashtag":["EXPLOITS","HACKS"]}