{"summary":"Square made $55 million in Q2 bitcoin profits and is set to increase Cash App&#x27;s user base through a $29 billion acquisition deal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113217\/square-bitcoin-revenue-triple-29-billion-fintech-acquisition","publishDate":"2021-08-01T23:56:21","id":9803,"type":null,"title":"Square’s bitcoin profit tripled in Q2, reports $29 billion fintech acquisition","category":["BITCOIN"],"content":["Twitter founder and CEO Jack Dorsey's payments startup Square has made $2.72 billion of bitcoin revenue for the second quarter this year.","In its shareholder letter released on late Sunday Eastern Time, Square said its Cash App generated \"$2.72 billion of bitcoin revenue and $55 million of bitcoin gross profit during Q2, each up approximately 3x year over year.\"","But the bitcoin revenue has decreased on a quarter-over-quarter basis, Square said, which was \"driven primarily by relative stability in the price of bitcoin, which affected trading activity compared to prior quarters.\" For <a href=\"https:\/\/www.theblockcrypto.com\/post\/104136\/square-reports-3-51-billion-in-bitcoin-revenue-via-its-cash-app-for-first-quarter-of-2021\" data-v-f87c67ca=\"\">Q1 this year<\/a>, Cash App made $75 million in bitcoin gross profit on $3.51 billion bitcoin revenues.","That said, Cash App is poised to expand its user bases through Square's $29 billion acquisition deal over an Australia payment firm Afterpay, which is listed on the Australia Stock Exchange.","In a separate announcement released on Sunday, Square said the acquisition will enable both firms to offer their financial products to more clients. The transaction is expected to close in Q1 2022.","Afterpay is a payment platform that allows users to receive products first and pay later over multiple installments with no interest if their payments are on time. It claimed to have 16.2 million users as of June 30.","\"Afterpay consumers will receive the benefits of Cash App’s financial tools, including money transfer, stock and Bitcoin purchases, Cash Boost, and more,\" Square said in the announcement.","Square said it also recognized a bitcoin impairment loss of $45 million on its bitcoin investment in Q2. But the fair value of its total investment in bitcoin since Q4 last year stood at $281 million as of June 30, which is \"$127 million greater than the carry value of the investment.\"","Overall, excluding bitcoin revenues, Square brought in $1.96 billion as total net revenue for Q2.","Cash App's bitcoin revenue represents the total sale amount of bitcoin sold to customers with the cost referring to the total amount of bitcoin it purchased. Cash App made profits by charging a spread.","Earlier last month, Square <a href=\"https:\/\/www.theblockcrypto.com\/post\/110916\/jack-dorsey-square-bitcoin-hardware-wallet\" data-v-f87c67ca=\"\">said<\/a> it is also committed to making bitcoin hardware wallets in order to \"make bitcoin custody more mainstream.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"June 30","content":"DATE"},{"type":"$2.72 billion","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"$281 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Cash App","content":"ORGANIZATION"},{"type":"$1.96 billion","content":"MONEY"},{"type":"$3.51 billion","content":"MONEY"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Sunday Eastern Time","content":"ORGANIZATION"},{"type":"$127 million","content":"MONEY"},{"type":"$45 million","content":"MONEY"},{"type":"$75 million","content":"MONEY"},{"type":"Australia","content":"LOCATION"},{"type":"$29 billion","content":"MONEY"},{"type":"second quarter this year","content":"DATE"},{"type":"$55 million","content":"MONEY"},{"type":"Australia Stock Exchange","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["Wolfie Zhao","The Block"]}