{"summary":"The CFPB found that crypto fraud and scam complaints are on the rise.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185712\/cfpb-romance-scams-and-pig-butchering-play-key-role-in-growing-crypto-complaints","publishDate":"2022-11-10T20:42:08","id":9809,"type":null,"title":"CFPB: Romance scams and &#x27;pig butchering&#x27; play key role in growing crypto complaints","category":["REGULATION"],"content":["The lovelorn among us are prime candidates for crypto scammers, a new bulletin from the U.S. Consumer Financial Protection Bureau (CFPB) shows.","CFPB data show that fraud and scams were the focus of about 40% of the 8,300 crypto-related complaints it&nbsp; received between October 2018 and September 2022. Among the major culprits were romance scams, impersonation and a tactic called \"pig butchering.\"&nbsp;","\"Crypto-assets are often targeted in romance scams, where scammers play on a victim’s emotions to extract money,\" the CFPB wrote in the bulletin.","The so-called \"pig butchering\" technique involves people pretending to be successful crypto traders on social media and convincing victims to set up accounts and make investments that will supposedly earn them returns.","Impersonating social media influencers or crypto companies' customer service representatives were also popular tactics, the CFPB bulletin said. A lack of customer service options on crypto platforms has opened the door to scammers who try to impersonate representatives, it said, with the aim of stealing crypto from customers' wallets.&nbsp;","Transaction problems — such as not being able to execute transactions immediately —were the second-biggest cause of crypto complaints the bureau received.&nbsp;","Other problems the CFPB recorded included hacking, issues with identity verification and technology problems with crypto platforms.&nbsp;","\"In situations where consumers have been defrauded, or had their account hacked, they are often told there is nowhere to turn for help,\" the CFPB said in a statement about the bulletin.&nbsp;A majority of the crypto complaints originated in California.&nbsp;","In addition to looking out for the above-mentioned scams, the CFPB also <a href=\"https:\/\/www.consumerfinance.gov\/about-us\/newsroom\/cfpb-publishes-new-bulletin-analyzing-rise-in-crypto-asset-complaints\/\" data-v-f87c67ca=\"\">encouraged<\/a> consumers to report crypto websites or apps misusing the Federal Deposit Insurance Corporation name or logo to make it seem like they carry government protections. In August, the FDIC <a href=\"https:\/\/www.theblock.co\/post\/164553\/fdic-issues-cease-and-desist-letters-to-ftx-us-other-crypto-firms-over-deposit-insurance\" data-v-f87c67ca=\"\">sent<\/a> cease-and-desist letters to five companies: FTX.US, Cryptonews.com, FDICCrypto.com, SmartAsset.com and Cryptosec.info.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"FDIC","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"CFPB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"October 2018","content":"DATE"},{"type":"September 2022","content":"DATE"},{"type":"U.S. Consumer Financial Protection Bureau (CFPB","content":"ORGANIZATION"},{"type":"Federal Deposit Insurance Corporation","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"40%","content":"PERCENT"},{"type":"August","content":"DATE"}],"hashtag":["CFPB"],"authors":["Kristin Majcher","The Block"]}