{"summary":"US Commodity Futures Trading Commission (CFTC) Commissioner Kristin Johnson highlighted the importance of investor education and outreach in a recent roundtable discussion about digital assets.\nThe roundtable discussed digital assets within the context of their popularity among historically underserved groups. ","author":["Kristin Majcher","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164583\/cftc-focuses-on-outreach-as-digital-assets-gain-popularity-among-underserved-groups","publishDate":"2022-08-19T16:36:06","id":981,"type":null,"title":"CFTC focuses on outreach as digital assets gain popularity among underserved groups","category":["Congress"],"content":["<span data-v-f87c67ca=\"\">The US Commodity Futures Trading Commission (CFTC) sees a need to increase investor education and outreach as the market for digital assets grows and faces downturns, Commissioner Kristin Johnson said during a recent roundtable discussion.<\/span>","<span data-v-f87c67ca=\"\">“We must increase investor education and outreach to empower consumers and contemporaneously combat illicit activity and safeguard the integrity and stability of our financial markets,” Johnson <a href=\"https:\/\/www.cftc.gov\/PressRoom\/SpeechesTestimony\/opajohnson1?utm_source=govdelivery#_ftn15\" data-v-f87c67ca=\"\">said<\/a> last week during an event focused on digital assets organized by the CFTC’s Office of Minority and Women Inclusion (OMWI) among others in the commission.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The roundtable was the latest chance for policymakers to discuss cryptocurrencies through the lens of financial inclusion, focusing on topics such as investor protections for underserved groups and creating legislation to best serve those communities. Attendees also discussed the regulation, policy and innovation in the digital asset space.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The roundtable also addressed the <\/span><a href=\"https:\/\/www.theblock.co\/post\/161198\/senators-introduce-bill-establishing-cftc-regime-for-crypto-exchanges\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">bipartisan<\/span><\/a><span data-v-f87c67ca=\"\"> Digital Commodities Consumer Protection Act of 2022 (DCCPA). If passed, the legislation would mandate, among other things, a CFTC study on how digital assets impact “diverse communities.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The CFTC commissioner’s prepared remarks also highlighted a June 1<a href=\"https:\/\/www.kansascityfed.org\/research\/payments-system-research-briefings\/the-cryptic-nature-of-black-consumer-cryptocurrency-ownership\/\" data-v-f87c67ca=\"\"> report<\/a> from the Federal Reserve Bank of Kansas City that “indicates that historically underserved groups have higher levels of participation in the crypto-investment community than the investment communities for traditional financial products.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The CFTC must maintain high standards of enforcement and educational outreach to protect retail participants in the cryptocurrency market — a group that includes greater representation of younger and diverse investors,” Johnson’s prepared remarks said.&nbsp;<\/span>","&nbsp;"],"hashtag":["CFTC"]}