{"summary":"Su Zhu is set to be released this month and also faces questioning in a two-day Singapore court hearing this week, Bloomberg reported.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267382\/3ac-co-founder-su-zhu-set-to-be-released-faces-singapore-court-questioning","publishDate":"2023-12-13T06:40:17","id":9814,"type":null,"title":"Su Zhu to be released, faces Singapore court questioning: Bloomberg","category":["LEGAL"],"content":["Su Zhu, co-founder of the now-defunct crypto hedge fund Three Arrows Capital (3AC), is set to be <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-12-13\/liquidators-question-three-arrows-su-zhu-in-singapore-court-to-find-assets\" data-v-f87c67ca=\"\">released<\/a> this month following his arrest in September for not cooperating with liquidation efforts, Bloomberg reported, citing sources familiar with the matter.","Zhu also faces two days of questioning in a Singapore court this week, Bloomberg added. The <a href=\"https:\/\/www.judiciary.gov.sg\/hearing-list\/hearing-list-details\/ds-1-558091\" data-v-f87c67ca=\"\">hearing<\/a> requires him to respond to lawyers for liquidator Teneo for the first time as it seeks to gather information on behalf of creditors owed $3.5 billion following 3AC’s <a href=\"https:\/\/www.theblock.co\/post\/158169\/three-arrows-capital-3ac-creditors-list-3-5-billion-crypto-affidavits\" data-v-f87c67ca=\"\">collapse<\/a> last year. Details sought include the cause of the fund’s failure and the location of assets. The information will be shared with creditors to help maximize recoveries, Bloomberg’s sources said, requesting anonymity as the proceedings are private.","The proceedings are a civil matter, and Zhu hasn’t faced any criminal charges in Singapore. Zhu’s legal representatives, the court, and Teneo did not respond to requests for comment from The Block. Su Zhu’s account began posting on X again on Dec. 1 for the first time since Sept. 29, simply <a href=\"https:\/\/x.com\/zhusu\/status\/1730432448646025721?s=20\" data-v-f87c67ca=\"\">writing<\/a> “gm.”","Zhu was <a href=\"https:\/\/www.theblock.co\/post\/253618\/three-arrows-capital-co-founder-su-zhu-apprehended-in-singapore-bloomberg\" data-v-f87c67ca=\"\">apprehended<\/a> at Changi Airport in Singapore in September while trying to travel out of the country. He was also sentenced to four months in prison but is set to be released this month based on standard provisions for good behavior, the Bloomberg sources said.","<span data-v-f87c67ca=\"\">The moment Su Zhu was arrested. Image: The Block Pro<\/span>","Teneo informed Bloomberg that it had received a committal order against Zhu following his failure to comply with a court order instructing him to cooperate with an investigation related to liquidation.","A similar order was issued against the fund’s other co-founder, Kyle Davies, sentencing him to four months in prison. However, he has not yet been apprehended, and his whereabouts remain unknown.","Earlier that month, the Monetary Authority of Singapore <a href=\"https:\/\/www.theblock.co\/post\/250928\/singapore-regulator-issues-bans-against-three-arrows-capital-founders\" data-v-f87c67ca=\"\">prohibited<\/a> Zhu and Davies from participating in regulated business activities in the country. Teneo is also attempting to recover <a href=\"https:\/\/www.theblock.co\/post\/236717\/3ac-liquidators-seek-1-3-billion-from-zhu-davies-bloomberg\" data-v-f87c67ca=\"\">$1.3 billion<\/a> directly from the co-founders, alleging that Zhu and Davies took on significant leverage after their fund became insolvent.","The pair collaborated with Mark Lamb, founder of CoinFLEX, to launch a new exchange business, <a href=\"https:\/\/www.theblock.co\/post\/224781\/su-zhu-opnx-launches-token-giveaway\" data-v-f87c67ca=\"\">OPNX<\/a>. This venture, among other objectives, aims to enable users to trade bankruptcy claims.","3AC, once a major player in the crypto hedge fund market, encountered difficulties following the collapse of the Terra ecosystem last year and <a href=\"https:\/\/www.theblock.co\/post\/155578\/three-arrows-capital-files-for-chapter-15-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">filed for bankruptcy<\/a> in July 2022. It owes over $3.5 billion to its top creditors, as stated in documents released at the time.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"gm","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Kyle Davies","content":"PERSON"},{"type":"$1.3 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Sept. 29","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Su Zhu","content":"ORGANIZATION"},{"type":"Zhu","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Mark Lamb","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Teneo","content":"ORGANIZATION"},{"type":"Dec. 1","content":"DATE"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Davies","content":"PERSON"},{"type":"$3.5 billion","content":"MONEY"},{"type":"Changi Airport","content":"LOCATION"},{"type":"July 2022","content":"DATE"}],"hashtag":["INVESTMENT FIRMS","SU ZHU"],"authors":["James Hunt","The Block"]}