{"summary":"Ethereum developers tried out proof of stake for the first time on a fork of the blockchain. And it went well.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141609\/ethereum-largely-passes-first-major-test-for-proof-of-stake","publishDate":"2022-04-12T09:06:25","id":9817,"type":null,"title":"Ethereum largely passes first major test for proof of stake","category":["THE MERGE"],"content":["<span data-v-f87c67ca=\"\">Yesterday, Ethereum developers carried out the first major test of the blockchain’s upcoming move to proof of stake.<\/span>","<span data-v-f87c67ca=\"\">Up until now developers had largely been testing out the big change on testnets, which are dedicated clones of the Ethereum blockchain designed for testing purposes. What was different yesterday was they carried out a test on a version of the actual mainnet, in order to try to see if the code worked on the real blockchain.<\/span>","<span data-v-f87c67ca=\"\">Since the developers did not want to actually carry out the change in full, they created what’s called a “shadow fork” to test it. This is an experimental exercise where some of the validator nodes split off from the main network and made the upgrade on their own. It did not affect the rest of the network.<\/span>","<span data-v-f87c67ca=\"\">“Shadow forks give us a more realistic environment to test in than launching new testnets, because existing testnets already have transactions happening organically on them, and a large state size and block history which put nodes under more stress than new testnets,” Tim Beiko, w<\/span>ho runs the core protocol meetings for Ethereum, explained in a <a href=\"https:\/\/github.com\/timbeiko\/eth-roadmap-faq\/blob\/hackmd\/README.md#shadow-forking\" data-v-f87c67ca=\"\">Github post<\/a>.","The event was designed to help the Ethereum developers prepare for \"the merge\" —&nbsp;an anticipated event when Ethereum changes its consensus algorithm from its proof of work to proof of stake. The Ethereum team has planned a switch to proof of stake <a href=\"https:\/\/stackoverflow.com\/questions\/33802343\/when-will-ethereum-switch-to-proof-of-stake\" data-v-f87c67ca=\"\">since 2016<\/a> and it looks like it’s finally closing in on its goal.","The goal of the shadow fork was to check if the validator nodes from both of Ethereum’s two chains (one proof of work, the other proof of stake) can work together once their data has been “merged.” Another objective for the shadow fork was to see whether client software used to run Eth<span data-v-f87c67ca=\"\">ereum nodes — like Nethermind, Besu, Geth, and Erigon — ran normally and without bugs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The shadow fork merged data from its two parallel blockchains — known as the execution layer and the consensus layer — and created an <\/span><a href=\"https:\/\/explorer.mainnetshadowfork1.ethdevops.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">experimental network<\/span><\/a><span data-v-f87c67ca=\"\"> around 12 PM UTC time.<\/span>","Jayanthi and other developers reported that the event was largely successful. The forked network was able to produce blocks and finalize transactions entirely using the proof-of-stake algorithm. The validator nodes produced about 26,176 at an average block time of about 13 seconds, according to a <a href=\"https:\/\/explorer.mainnetshadowfork1.ethdevops.io\/\" data-v-f87c67ca=\"\">block explorer<\/a> designated to this fork.","<a href=\"https:\/\/twitter.com\/parithosh_j\/status\/1513494565529001984?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">According to<\/span><\/a><span data-v-f87c67ca=\"\"> Ethereum DevOps engineer Parithosh Jayanthi, the Ethereum team only noticed \"minor issues” in two Ethereum clients: Nethermind and Besu.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Christine Kim, a researcher at Galaxy Digital, <\/span><a href=\"https:\/\/twitter.com\/christine_dkim\/status\/1512101436313767945\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> that Beiko emphasized the outcome of this shadow fork would be key in deciding the timing of the merge. More details on the topic are expected to surface in an upcoming <\/span><a href=\"https:\/\/github.com\/ethereum\/pm\/issues\/508\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">developers call<\/span><\/a><span data-v-f87c67ca=\"\"> on 15 April.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yesterday’s shadow fork was the first of two such scheduled events, and the second is set to occur on April 22.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"Geth","content":"PERSON"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"April 22","content":"DATE"},{"type":"Besu","content":"LOCATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Ethereum DevOps","content":"ORGANIZATION"},{"type":"Christine Kim","content":"PERSON"},{"type":"Tim Beiko","content":"PERSON"},{"type":"Parithosh Jayanthi","content":"PERSON"},{"type":"Nethermind","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Beiko","content":"PERSON"},{"type":"April","content":"DATE"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}