{"summary":"While the Wintermute team has yet to provide an official post-mortem, security analysts have offered some insights into the hack.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171192\/experts-blame-a-vanity-address-bug-for-wintermutes-160-million-hack","publishDate":"2022-09-20T10:00:02","id":9819,"type":null,"title":"Experts blame a &#x27;vanity address&#x27; bug for Wintermute&#x27;s $160 million hack","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">On Tuesday, crypto market making firm Wintermute said that it <\/span>had <a href=\"https:\/\/www.theblock.co\/post\/171135\/crypto-market-maker-wintermute-hacked-for-160-million\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$160 million<\/span><\/a><span data-v-f87c67ca=\"\"> stolen from its <\/span><a href=\"https:\/\/etherscan.io\/address\/0x00000000ae347930bd1e7b0f35588b92280f9e75\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum vault,<\/span><\/a><span data-v-f87c67ca=\"\"> a type of crypto wallet account holding its assets in a smart contract.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While the Wintermute team has yet to provide an official post-mortem, security analysts have offered some insights into the hack. According to Mudit Gupta, Polygon's chief information security officer, a vulnerability may well have enabled the hacker to calculate the private keys of the vault’s admin address — allowing them to drain the vault of its funds.<\/span>","<span data-v-f87c67ca=\"\">As a market maker, Wintermute maintained several crypto assets in a vault. This vault relied on an admin address with a prefix “0x0000000,” which analysts say is a “vanity address.” At the same time, the vanity address functioned as an admin account (in the form of a hot wallet) to authenticate transactions for <a href=\"https:\/\/etherscan.io\/address\/0x00000000ae347930bd1e7b0f35588b92280f9e75\" data-v-f87c67ca=\"\">Wintermute’s vault<\/a>.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Vanity addresses contain identifiable names or numbers within them — or have a particular style — and can be generated using certain online tools like Profanity. Last week, decentralized exchange aggregator 1inch published a security disclosure report claiming that “vanity addresses” generated with Profanity were not secure. Per 1inch, the private keys linked to Profanity-generated addresses could be extracted with brute force calculations.<\/span>","<span data-v-f87c67ca=\"\">Gupta and other security analysts have hypothesized that since the admin address is a vanity address, the hacker calculated its private key, took over Wintermute’s vault and transferred funds out to another<\/span> <a href=\"https:\/\/etherscan.io\/address\/0xe74b28c2eae8679e3ccc3a94d5d0de83ccb84705\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">address<\/span><\/a><span data-v-f87c67ca=\"\"> in their control.<\/span>","<span data-v-f87c67ca=\"\">“The vault only allows admins to do these transfers and Wintermute’s hot wallet is an admin, as expected. Therefore, the contracts worked as expected but the admin address itself was likely compromised,” Gupta wrote in a separate<\/span> <a href=\"https:\/\/mudit.blog\/wintermute-muted-in-crypto-winter\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blog post<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","Gupta said that it seems like Wintermute moved all the ether (ETH) from the vanity address wallet itself prior to the hack, perhaps as a precaution in light of the Profanity disclosures — but the firm didn't change its admin privileges.","SlowMist, a smart contract security firm, corroborated Gupta’s findings. It told The Block: “After analysis, we think that the reason may be that Wintermute's stolen externally-owned account (EOA) is a wallet created by Profanity (starting with 0x0000000).”","<a href=\"https:\/\/twitter.com\/SlowMist_Team\/status\/1572187251928334344\" data-v-f87c67ca=\"\">According<\/a> to SlowMist, the hacker has now deposited $114 million worth of stolen assets into decentralized exchange Curve.","Wintermute founder Evgeny Gaevoy did not reply to a request for comment on whether the vanity address was the cause of the hack. On Twitter, Gaevoy did not address this directly but he <a href=\"https:\/\/twitter.com\/EvgenyGaevoy\/status\/1571089099968348160\" data-v-f87c67ca=\"\">quote tweeted<\/a> a tweet by Yearn Finance lead developer Banteg referencing a previous case of a hack involving vanity addresses, saying, \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Karma is a bitch:)<\/span>\"","Why use a vanity address at all? Gupta told The Block that Wintermute may have used one it's considered more gas-efficient for making transactions. Gaevoy <a href=\"https:\/\/twitter.com\/EvgenyGaevoy\/status\/1572181989242937345\" data-v-f87c67ca=\"\">confirmed<\/a> on Twitter that this was why the firm used one.","In the past, contract addresses were created using vanity address generators to have many zeros in them as teams believe such addresses lead to gas savings. Here the cost savings really depend on the usage. For a market maker like WinterMute that does thousands of transactions every day for market making, every bit of gas matters.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wintermute","content":"LOCATION"},{"type":"$160 million","content":"MONEY"},{"type":"Gupta","content":"PERSON"},{"type":"Wintermute","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"$114 million","content":"MONEY"},{"type":"Gaevoy","content":"PERSON"},{"type":"Evgeny Gaevoy","content":"PERSON"},{"type":"EOA","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"Banteg","content":"PERSON"},{"type":"Yearn Finance","content":"ORGANIZATION"},{"type":"Wintermute’s","content":"ORGANIZATION"},{"type":"Mudit Gupta","content":"PERSON"}],"hashtag":["HACKS","WINTERMUTE"],"authors":["Vishal Chawla","The Block"]}