{"summary":"New amendments to the European Union’s anti-money laundering bill cement NFT platforms as obliged entities.\nThe fork from the scope of the Markets in Crypto-Assets regulation is also addressed. ","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216681\/eu-nft-anti-money-laundering-bill","publishDate":"2023-03-03T10:18:23","id":982,"type":null,"title":"EU keeps focus on NFTs in latest anti-money laundering bill draft","category":["Metaverse &amp; NFT"],"content":["Policymakers in the European Parliament are negotiating changes to the text of an EU anti-money laundering bill to highlight that NFT platforms or other companies providing services related to NFTs are covered by the regulation.","This diverges from the scope of the European Union's standard-setting crypto rulebook, the Markets in Crypto-Assets regulation, which explicitly left them out.","<span data-v-f87c67ca=\"\">The MiCA framework, expected to pass a final vote next month, lays down the foundations of crypto regulation across the 27-nation bloc. While lawmakers intentionally exempted NFT platforms from its coverage, operators appear likely to be caught up in obligations under the proposed AML rules.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“NFT platforms are not covered in the current definition of crypto-assets service providers under the MiCA Regulation to the extent they do not provide services in crypto-assets that are fungible and non-unique,” reads a draft of the AML proposal obtained by The Block and confirmed by multiple sources familiar with the negotiation. “In order to close this gap and mitigate associated money laundering and terrorist financing risks, NFT platforms should therefore be included in the horizontal AML\/CFT framework as a separate category of obliged entities.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">NFTs were first <\/span><a href=\"https:\/\/www.theblock.co\/post\/173652\/europe-aml-rules-could-implicate-defi-daos-and-nfts\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">included<\/span><\/a><span data-v-f87c67ca=\"\"> in the AML regulation in September, but the new language may further cement their place in the legislation.<span class=\"c-message__edited_label\" dir=\"ltr\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>The Financial Action Task Force, an international agency tasked with monitoring money laundering, <a href=\"https:\/\/www.fatf-gafi.org\/en\/publications\/Methodsandtrends\/Money-Laundering-Terrorist-Financing-Art-Antiquities-Market.html\" data-v-f87c67ca=\"\">warned<\/a> last month that NFT marketplaces are&nbsp;an \"emerging vulnerability\" in the fight against illicit cash flows.&nbsp;","<span data-v-f87c67ca=\"\">The amendments will need to pass a vote in the two parliamentary committees overseeing negotiations on March 28, followed by a vote on the whole text. Then, the bill will move forward for a plenary vote before it enters inter-institutional negotiations.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Self-hosted wallets and addresses were recently <\/span><a href=\"https:\/\/www.theblock.co\/post\/213380\/self-hosted-wallet-ban-avoided-in-new-draft-of-eus-anti-money-laundering-bill\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">under the microscope<\/span><\/a><span data-v-f87c67ca=\"\"> in the AML regulation, as Parliament cleared up the definitions and their implications. By clarifying those, the bill may have circumvented a full ban on non-custodial services in the EU.<\/span>"],"hashtag":["EUROPEAN PARLIAMENT","EUROZONE REGULATION"]}