{"summary":"Bitcoin, as both a technology and an asset, offers a world of freedom, privacy, and financial inclusion. A world where any individual can control their money and use it however they wish.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286893\/thesis-announces-mezo-aims-to-make-a-wider-world-of-commerce-possible-on-bitcoin","publishDate":"2024-04-09T09:01:08","id":9824,"type":null,"title":"Thesis announces Mezo, aims to make a wider world of commerce possible on Bitcoin","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Bitcoin, as both a technology and an asset, offers a world of freedom, privacy, and financial inclusion. A world where any individual can control their money and use it however they wish.<\/span>","<span data-v-f87c67ca=\"\">But even after 15 years, Bitcoin adoption is lacking and self-custody remains complex. The future <\/span><a href=\"https:\/\/thesis.co\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Thesis<\/span><\/a><span data-v-f87c67ca=\"\"> envisions requires a Bitcoin scaling network that <\/span><b data-v-f87c67ca=\"\">prioritizes the user journey<\/b><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">The market is tired of technology-first narratives. Projects building on Bitcoin over-index on infrastructure innovations, while users are simply looking for a straightforward and secure way to use their BTC.<\/span>","<span data-v-f87c67ca=\"\">Thesis has carefully designed <\/span><a href=\"https:\/\/mezo.org\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Mezo<\/span><\/a><span data-v-f87c67ca=\"\"> to unlock bitcoin for <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">everything, <\/span><\/i><span data-v-f87c67ca=\"\">with the goal of bringing 25% of the world’s economy on-chain.<\/span>","<span data-v-f87c67ca=\"\">Bitcoin is renowned for its simplicity: any user can create a wallet and use BTC without the threat of seizure. Global access and robust decentralization are core values of Bitcoin that can resonate with everyone.<\/span>","<span data-v-f87c67ca=\"\">Mezo prioritizes the economic needs of users and bitcoin holders to create <\/span><b data-v-f87c67ca=\"\">the first Bitcoin Economic Layer. <\/b><span data-v-f87c67ca=\"\">Mezo changes how users interact with Bitcoin by focusing on growing wealth, community, and productive use.<\/span>","<span data-v-f87c67ca=\"\">A Bitcoin Economic Layer aligns its core technology features with the economic ambitions of bitcoin holders, and Mezo achieves this in several ways.<\/span>","","","<span data-v-f87c67ca=\"\">Mezo uses Proof of HODL as a consensus mechanism. Users secure the network by locking BTC and MEZO tokens and validating transactions via CometBFT consensus.<\/span>","<span data-v-f87c67ca=\"\">Proof of HODL begins with the <\/span><a href=\"https:\/\/mezo.org\/hodl\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Mezo Portal<\/span><\/a><span data-v-f87c67ca=\"\">, where users can lock up BTC and make a statement of conviction. The longer users lock up their deposits, the greater their HODL Score. Beyond activating bitcoin, Proof of HODL is the key to building a community; a personal inner circle of fellow bitcoin holders that understand the value of long-term commitment.<\/span>","<span data-v-f87c67ca=\"\">At the launch of Mezo mainnet, users can contribute to network security with Proof of HODL, earning an honest yield for simply holding bitcoin.<\/span>","<span data-v-f87c67ca=\"\">Mezo makes a wider world of commerce possible on Bitcoin. This is the essence of Bitcoin’s Economic Layer—a more diverse range of user-centric applications for bitcoin. The ideal world runs on the hardest currency using networks cheap and fast enough for daily transactions, from groceries to tuition, all while retaining custody of bitcoin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">At <\/span><a href=\"https:\/\/thesis.co\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Thesis<\/span><\/a><span data-v-f87c67ca=\"\">, our work revolves around building brands that make value attainable for the Bitcoin community. We’ve been building on Bitcoin for over a decade, making Mezo the Economic Layer built <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">by <\/span><\/i><span data-v-f87c67ca=\"\">Bitcoiners, <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">for<\/span><\/i><span data-v-f87c67ca=\"\"> Bitcoiners.<\/span>","<span data-v-f87c67ca=\"\">Our secure bitcoin wrapper,<\/span><a href=\"https:\/\/dashboard.threshold.network\/overview\/network\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> tBTC<\/span><\/a><span data-v-f87c67ca=\"\">, created a new way for bitcoin holders to use their wealth on-chain. Since its launch nearly 4 years ago, tBTC has safely bridged 6k BTC. Mezo is built on tBTC, which helps achieve our vision of a Bitcoin-first network that amplifies core Bitcoin values.<\/span>","","","&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mezo","content":"ORGANIZATION"},{"type":"Bitcoin Economic Layer","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"HODL","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Mezo Portal","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Bitcoiners","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}