{"summary":"Luxor is launching an auction-style platform for buying and selling Bitcoin mining hardware.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206741\/luxor-launches-auction-style-platform-for-mining-machines","publishDate":"2023-02-01T09:00:02","id":9826,"type":null,"title":"Luxor launches auction-style platform for mining machines","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitcoin mining firm Luxor launched an auction-style platform for buying and selling Bitcoin mining hardware.","The new product is meant to improve price discovery and increase liquidity in the secondary market, the company said.","\"Before, buyers and sellers relied on a patchwork of venues to buy and sell mining hardware,\" Luxor operations manager Lauren Lin said. \"Now, they can observe offers, listings, and settlement prices all in one place, which improves pricing transparency and expedites the mining hardware procurement process.\"","The platform will allow buyers to request orders by condition, model type, location and more. Sellers can mix-and-match different models and manufacturers in their orders.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-asic-price-index\/embed\" title=\"Bitcoin ASIC Price Index\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Prices for ASIC mining machines have been falling for the past year, as the industry has struggled with declining margins. They lost more than 80% of their value in 2022.","Luxor also launched a derivatives product based on bitcoin mining revenue in October, stating it was just the first of \"many derivatives\" that it plans to launch.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"Lauren Lin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Luxor","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"ASIC","content":"ORGANIZATION"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}