{"summary":"A security bug allowed a hacker to drain about $90 million from Mirror Protocol on the old Terra blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/149342\/a-90-million-defi-exploit-on-terra-went-unnoticed-for-seven-months","publishDate":"2022-05-30T12:05:17","id":9828,"type":null,"title":"A $90 million DeFi exploit on Terra went unnoticed for seven months","category":["HACKS"],"content":["<span data-v-f87c67ca=\"\">In October 2021, DeFi application Mirror Protocol succumbed to a $90 million exploit on the old Terra blockchain — and it went completely unnoticed until last week.<\/span>","<span data-v-f87c67ca=\"\">Mirror protocol allowed users to take long or short positions on tech stocks using synthetic assets. It was built on Terra, which collapsed earlier this month after its main stablecoin lost its peg to the US dollar, dragging its sister token Luna down with it. (The blockchain has now been revived as Terra 2.0, while the original chain lives on as Terra Classic).<\/span>","<span data-v-f87c67ca=\"\">The exploit was <\/span><a href=\"https:\/\/twitter.com\/FatManTerra\/status\/1529978964676169750\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">discovered<\/span><\/a><span data-v-f87c67ca=\"\"> by a Terra community member and analyst called “FatMan.” He has been one of the most vocal antagonists in the recent launch of the new Terra blockchain.<\/span>","<span data-v-f87c67ca=\"\">Security firm BlockSec <\/span><a href=\"https:\/\/twitter.com\/BlockSecTeam\/status\/1530865203029499905\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">corroborated<\/span><\/a><span data-v-f87c67ca=\"\"> the community member’s findings by analyzing the specific exploit transaction. BlockSec confirmed an exploit did indeed take place.<\/span>","<span data-v-f87c67ca=\"\">Whenever someone wanted to bet against a stock on Mirror, they had to <\/span><a href=\"https:\/\/docs.mirror.finance\/contracts\/lock\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">lock collateral<\/span><\/a><span data-v-f87c67ca=\"\"> — including UST, LUNA Classic (LUNC), and mAssets — for a minimum of 14 days.<\/span>","<span data-v-f87c67ca=\"\">After the trade concluded, users could unlock the collateral to release the funds back to the wallet. All of this was done with the help of smart contract-generated ID numbers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, due to buggy code, the Mirror’s lock contract allegedly failed to check when someone used the same ID more than once to withdraw funds.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In October 2021, one unknown entity noticed that they could use a list of duplicate IDs to repeatedly unlock hundreds of times more collateral than they had. This basically meant the perpetrator could withdraw funds without any authorization.<\/span>","<span data-v-f87c67ca=\"\">This entity drained about $90 million in total, according to <\/span><a href=\"https:\/\/finder.terra.money\/classic\/tx\/08DD2B70F6C2335D966342C20C1E495FD7A8872310B80BAF3450B942F79EBC1F\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blockchain records<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","The Mirror exploit may be one of the rare events where, despite the presence of on-chain data, a major hack remained undisclosed for a long time. Usually, projects are quick to report security events for the sake of transparency.","<span data-v-f87c67ca=\"\">BlockSec said the exploit likely went unnoticed because fewer people were scanning for issues on Terra compared to Ethereum and Ethereum-compatible chains.<\/span>","In addition, there was no interface on the Mirror website that made it possible to check the total amount of collateral in the protocol. This made it much harder to notice the vulnerability without sifting through a large amount of blockchain data.","Earlier this month, Mirror developers quietly <a href=\"https:\/\/github.com\/Mirror-Protocol\/mirror-contracts\/commit\/56cc6946b9457293ede6aa0feb296ee1d16f6974?diff=split\" data-v-f87c67ca=\"\">fixed<\/a> the vulnerability, at around the same time as the UST stablecoin began to collapse. A week later after the patch, community members began wondering if there could have been an exploit, according to a <a href=\"https:\/\/forum.mirror.finance\/t\/was-there-a-security-hole-in-the-lock-contract\/3390\" data-v-f87c67ca=\"\">governance discussion<\/a>. It's unclear if Mirror’s developers knew about the exploit.","<span data-v-f87c67ca=\"\">This isn't, however, the first time a hack has gone under the radar for a short time. When hackers stole $600 million from the Ronin sidechain in March 2022, a week went by before anyone realized it had happened. It was only when users found they were unable to withdraw their funds did anyone realize there was a shortfall.<\/span>","<span data-v-f87c67ca=\"\">Mirror Protocol, which is the subject of an <a href=\"https:\/\/www.theblockcrypto.com\/post\/146426\/the-sec-has-already-sued-terraform-labs-it-has-every-reason-to-investigate-ust-lawyers-say\" data-v-f87c67ca=\"\">SEC enquiry<\/a>, has not yet made an official comment on the matter. The team at Mirror or Terraform Labs haven’t yet responded to a request for comment.&nbsp;<\/span>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$90 million","content":"MONEY"},{"type":"Terra 2.0","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Terra Classic)","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"$600 million","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"October 2021","content":"DATE"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}