{"summary":"Two-thirds of those polled in an Aleo study said they would adopt products that protect user, data but very few trust crypto firms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281851\/aleo-says-its-ironic-hardly-anyone-trusts-crypto-firms-with-privacy-when-blockchain-is-a-solution","publishDate":"2024-03-12T09:00:07","id":9830,"type":null,"title":"SoftBank-backed Aleo&#x27;s new study shows hardly anyone trusts crypto with privacy","category":["COMPANIES"],"content":["Aleo has published a new study finding a majority of consumers want products and technological solutions that are committed to protecting user data, but barely anyone has faith in crypto firms.","The study found that 67% of consumers would switch to products that offer data protection. Aleo said it also discovered the majority of people, regardless of age, are worried about their privacy. But only 10% of respondents expressed \"a great deal of\u2028 trust\" in crypto companies.","Of those polled, 14%\u000Fsaid they had a \"fair amount\" of trust in blockchain-based organizations.","\"The lack of trust in cryptocurrency companies regarding data privacy and security, despite the foundational role of cryptography and blockchain in enhancing these aspects, is a paradox rooted in the industry's rapid evolution and its associated challenges,\" Aleo Ventures Chief Strategy Officer Leena Im told The Block. \"This ironic situation arises from the industry's growing pains, where the decentralized nature of blockchain, while promising privacy and security, has also attracted bad actors who have exploited vulnerabilities, thereby eroding trust.\"","The study appears to prove Aleo's core mission. The organization <a href=\"https:\/\/www.theblock.co\/post\/274575\/aleo-mainnet-set-to-come-within-weeks-with-lofty-goal-of-bringing-privacy-to-crypto\" data-v-f87c67ca=\"\">announced in January<\/a> it was close to launching its mainnet, once some final bugs had been resolved. At the time, the organization said it aims to bring enhanced privacy to crypto and it plans to unlock use-cases around confidential payments and identity solutions.&nbsp;","For its study, Aleo said it polled about 2,200 people and its results have a margin of error of plus or minus 2%. The study was conducted in October 2023.","\"The decision to delay the report's publication until now was deliberate, aiming to craft an analysis that resonates and is meaningful, without succumbing to the pressure of rushing its release,\" said Im, who previously worked in Meta's payments and blockchain division.","Aleo uses zero-knowledge proofs at the core blockchain level to support transactions and smart contract interactions that are private by default. In 2022, the project <a href=\"https:\/\/www.theblock.co\/post\/133218\/aleo-raises-200-million-softbank-tiger-others-blockchain\" data-v-f87c67ca=\"\">raised $200 million<\/a> in a Series B funding round co-led by SoftBank Vision Fund 2 and Kora Management. Tiger Global, a16z, Samsung Next, Slow Ventures, and Sea Capital also participated.","At the time, the new raise gave Aleo a valuation of $1.45 billion.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"Meta","content":"ORGANIZATION"},{"type":"SoftBank","content":"ORGANIZATION"},{"type":"Sea Capital","content":"ORGANIZATION"},{"type":"67%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"October 2023","content":"DATE"},{"type":"Kora Management","content":"ORGANIZATION"},{"type":"14%","content":"PERCENT"},{"type":"$200 million","content":"MONEY"},{"type":"Aleo","content":"PERSON"},{"type":"Samsung Next","content":"ORGANIZATION"},{"type":"Aleo Ventures Chief Strategy Officer Leena Im","content":"ORGANIZATION"},{"type":"$1.45 billion","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}