{"summary":"AlphaOrBeta, powered by OpinionLabs, launched BNB Zone on March 8th, marking a new milestone in the Binance ecosystem. This launch demonstrates their innovative approach to opinion and prediction markets, providing users with a dynamic platform for engagement and insight sharing. Simultaneously, after being selected as a member of Binance Labs&#x27; Most Valuable Builders (MVB) Season 7, AlphaOrBeta accumulated over 100,000 users and a DAU of 10,000 in just two months, securing the Top 1 SocialFi project position on Mantle and ranking fourth on Arbitrum. Following this achievement, the team intends to launch a large reward pool, with details to be announced to the community soon.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282496\/alphaorbeta-launches-bnb-zone-revolutionizing-prediction-markets-as-binance-labs-mvb-season-7-cohort","publishDate":"2024-03-15T09:01:02","id":9833,"type":null,"title":"AlphaOrBeta Launches BNB Zone, Revolutionizing Prediction Markets As Binance Labs MVB Season 7 Cohort","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">AlphaOrBeta, powered by OpinionLabs, launched BNB Zone on March 8th, marking a new milestone in the Binance ecosystem. This launch demonstrates their innovative approach to opinion and prediction markets, providing users with a dynamic platform for engagement and insight sharing. Simultaneously, after being selected as a member of Binance Labs' Most Valuable Builders (MVB) Season 7, AlphaOrBeta accumulated over 100,000 users and a DAU of 10,000 in just two months, securing the Top 1 SocialFi project position on Mantle and ranking fourth on Arbitrum. Following this achievement, the team intends to launch a large reward pool, with details to be announced to the community soon.<\/span>","<span data-v-f87c67ca=\"\">AlphaOrBeta has emerged as the inaugural Web3 prediction and polling network, transforming how consumer feedback and projections are viewed, appreciated, and compensated. Not only is the aforementioned launch set to be an absolute game-changer when it comes to Binance’s ecosystem, but it is also indicative of the notion that opinion-sharing and prediction markets are going to be taken more seriously from now on. Unsurprisingly then, AlphaOrBeta had been selected from a slew of potential candidates for the 4th Season of Binance Lab’s MVB (Most Valuable Builders.<\/span>","<span data-v-f87c67ca=\"\">The network’s main feature is its steadfast dedication to developing a cultivated prediction and opinion market. In this one-of-a-kind ecosystem, everyone wins, with winners earning ETH and others receiving native tokens. Once again, the focus is on making sure that each and every opinion is given equal attention and rewarded appropriately.<\/span>","<span data-v-f87c67ca=\"\">AlphaOrBeta has been very successful so far, the AlphaOrBeta campaigns for Seasons 1, 2, and 3 on Mantle have achieved impressive results. We have successfully registered over 135,000 users, with participation in tasks exceeding 521,000. The on-chain transactions have also been significant, reaching a total of over 423,000. Presently, ranked for the first SocialFi project on Mantle and fourth on Arbitrum.<\/span>","<span data-v-f87c67ca=\"\">AlphaOrBeta, established by an innovative entrepreneurial team and supported by top investors and Web3 advisors, is undoubtedly a shining example of innovation. Moreover, AlphaOrBeta, which has strategic partnerships with industry giants such as Hooked, Coin98, and Ultiverse, provides users with a dynamic platform to participate in different topics and polls.<\/span>","<b data-v-f87c67ca=\"\">About Opinion Labs&nbsp;<\/b>","<a href=\"https:\/\/opinionlabs.xyz\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Opinion Labs<\/span><\/a><span data-v-f87c67ca=\"\"> is sculpting a new reality, one that includes an economy where opinions are not just shared but heard, valued, and owned. The team is on a mission to build the world’s most expensive opinion identity and financial network, an omnipresent social infrastructure that values human opinions through the power of blockchain, cryptography, and AI.<\/span>","<b data-v-f87c67ca=\"\">About AlphaOrBeta<\/b>","<a href=\"https:\/\/app.alphaorbeta.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">AlphaOrBeta<\/span><\/a><span data-v-f87c67ca=\"\"> is the first Web3 polling and prediction network where users' opinions and predictions can be heard, valued, and rewarded by participating in various polls and topics. Founded by a team of capable entrepreneurs and backed by top investors and Web3 advisors, AlphaOrBeta is supported by strategic partners such as Hooked, Coin98, Ultiverse, Magic Square, Community Gaming, Safepal, Particle Network, and Certik.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">“Alpha”orBeta<\/b><b data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/b><span data-v-f87c67ca=\"\">A featured Poll addressing Biden’s administration ban on TikTok is coming up soon along with the new AlphaOrBeta Prediction Market. Some alpha says this poll comes with surprising incentives and even Airdrops. Keep an eye out for the updates and fingers are crossed. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span>","<b data-v-f87c67ca=\"\">Contact:<\/b>","<span data-v-f87c67ca=\"\">Opinion Labs: <\/span><a href=\"https:\/\/opinionlabs.xyz\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/opinionlabs.xyz\/<\/span><\/a>","<span data-v-f87c67ca=\"\">Linktree: <\/span><a href=\"https:\/\/linktr.ee\/Opinionlabs\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/linktr.ee\/Opinionlabs<\/span><\/a>","<span data-v-f87c67ca=\"\">AlphaOrBeta: <\/span><a href=\"https:\/\/app.alphaorbeta.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/app.alphaorbeta.com\/<\/span><\/a>","<span data-v-f87c67ca=\"\">White Paper: <\/span><a href=\"https:\/\/whitepaper.opinionlabs.xyz\/opinion-labs-whitepaper\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/whitepaper.opinionlabs.xyz\/opinion-labs-whitepaper\/<\/span><\/a>","<span data-v-f87c67ca=\"\">Media Contact: <\/span><a href=\"https:\/\/app.alphaorbeta.com\/login?affiliateCode=PARTNERSHIP_THE_BLOCK\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/app.alphaorbeta.com\/login?affiliateCode=PARTNERSHIP_THE_BLOCK<\/span><\/a>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March 8th","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Certik","content":"ORGANIZATION"},{"type":"Magic Square","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Community Gaming","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ultiverse","content":"ORGANIZATION"},{"type":"Safepal","content":"LOCATION"},{"type":"TikTok","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Mantle","content":"PERSON"},{"type":"Ultiverse","content":"LOCATION"},{"type":"Particle Network","content":"ORGANIZATION"},{"type":"AlphaOrBeta Prediction Market","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"4th Season of Binance Lab’s MVB (Most Valuable Builders","content":"ORGANIZATION"},{"type":"AlphaOrBeta","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}