{"summary":"Gemini is preparing to launch services for French retail and institutional customers within weeks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273109\/gemini-vasp-france","publishDate":"2024-01-17T10:01:38","id":9838,"type":null,"title":"Gemini obtains VASP approval in France: CNBC","category":["EXCHANGES"],"content":["The crypto exchange Gemini, founded by Cameron and Tyler Winklevoss, is preparing to launch a platform serving French users.&nbsp;","Gemini obtained approval as a virtual asset services provider from the French markets regulator Autorite des marches financiers. It will launch services for retail and institutional customers in France within weeks, giving users access to 70 cryptocurrencies and Gemini's website, mobile app, Gemini eOTC and the ActiveTrader platform, according to a company <a href=\"https:\/\/www.gemini.com\/blog\/gemini-secures-french-crypto-registration-continuing-global-expansion\" data-v-f87c67ca=\"\">release<\/a>.&nbsp;","“We are delighted to welcome customers based in France onto the Gemini platform in the coming weeks as we further expand access to crypto across Europe,” said Gillian Lynch, Gemini’s Head of Ireland and EU in a statement. “France is a global innovation leader and has a vibrant crypto community as showcased by the success of Paris Blockchain Week. We are excited to soon be able to provide French customers with compliant and secure access to the future of finance as we continue on our mission to unlock the next era of financial, creative and personal freedom.”","Gemini's entry into France comes as the exchange sees consistent monthly trading volume increases. The firm brought in $1.58 billion in spot trading volume in December 2023 — a 26.4% increase compared to the month prior, according to The Block's Data Dashboard.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\/embed\" title=\"Cryptocurrency Monthly Exchange Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Gemini is not the only crypto firm eyeing a French market. In December 2023, stablecoin issuer Circle received conditional registration from the AMF as a digital asset service provider and hired Coralie Billmann as Head of French Operations, The Block previously <a href=\"https:\/\/www.theblock.co\/post\/268853\/circle-obtains-conditional-registration-in-france-appoints-head-of-operations-in-country\" data-v-f87c67ca=\"\">reported<\/a>.","<em data-v-f87c67ca=\"\">(Updates with information from official Gemini statement.)<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gemini","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"France","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Autorite des","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"$1.58 billion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Tyler Winklevoss","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"26.4%","content":"PERCENT"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Cameron","content":"PERSON"},{"type":"December 2023","content":"DATE"},{"type":"Coralie Billmann","content":"PERSON"},{"type":"Ireland","content":"LOCATION"},{"type":"Gillian Lynch","content":"PERSON"},{"type":"Paris Blockchain Week","content":"ORGANIZATION"},{"type":"AMF","content":"ORGANIZATION"}],"hashtag":["EUROZONE REGULATION","GEMINI"],"authors":["MK Manoylov","The Block"]}