{"summary":"The FTX debtors and joint provisional liquidators in the Bahamas declared a courtroom truce in the massive crypto firm&#x27;s bankruptcy case.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203048\/ftx-bankruptcy-ditches-the-courtroom-drama-for-now","publishDate":"2023-01-17T16:51:29","id":9839,"type":null,"title":"FTX bankruptcy debtors ditch the courtroom drama — for now","category":["LEGAL"],"content":["Lawyers for crumbling crypto exchange FTX and liquidators in the Bahamas have smoothed things over after a contentious courtroom brawl over who has jurisdiction in the failed company’s bankruptcy.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The truce between the FTX debtors and the Bahamian liquidators earlier this month is welcome news for FTX’s creditors, who want to recover at least some of their money locked in the company. It might also bring a sense of normalcy to a wide-reaching and unconventional bankruptcy case that has captivated the world beyond the crypto industry.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“What had been happening in the case was unusual,” said Matthew Gold, a partner at the law firm Kleinberg, Kaplan, Wolff &amp; Cohen who advises on bankruptcy issues. “Now they have agreed to stop fighting and to establish a cooperative protocol so that the case I think, will probably now follow a more ordinary track.”","FTX filed for Chapter 11 bankruptcy protection in Delaware after a run on its native utility token in November. The massive firm, which has an estimated 9 million customers, was once valued at $32 billion and could owe its top 50 creditors as much as $3.1 billion. Meanwhile, disgraced former CEO Sam Bankman-Fried faces a litany of fraud charges in a separate criminal court for his alleged mishandling of FTX customer funds.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Some aspects of the FTX bankruptcy are playing out in Delaware, but others are unfolding in the Bahamas, where FTX Digital Markets and many FTX executives were based. Regulators in the Bahamas seized $426 million around the time FTX filed for bankruptcy protection.","In the early weeks of the bankruptcy proceedings, lawyers for the FTX debtors in the United States and the liquidators in the Bahamas warred over issues including access to FTX computer systems. The two parties came to an agreement at the beginning of the month.","“They've agreed to go to the neutral corners and do their jobs. And if they need to fight about something later, they reserve the right to do so. But their goal is not to do that,” said Joseph Moldovan, partner at the law firm Morrison Cohen, commenting broadly on how bankruptcy cases work.","Even with an agreement between the debtors in the U.S. and the liquidators in the Bahamas, the bankruptcy could take years to unwind in court. New FTX CEO John Ray has said he does not trust the few financial records that existed at FTX before he took over, meaning the debtors need to figure out how much money the company has and what it can return to creditors.","Although he agreed to cooperate with the Bahamian liquidators, Ray also gave himself some wiggle room in announcing their agreement earlier this month.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“There are some issues where we do not yet have a meeting of the minds, but we resolved many of the outstanding matters and have a path forward to resolve the rest,” Ray said in a statement. Lawyers for the debtors and the liquidators did not respond to requests for comment.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“We're probably still in the first inning of this,” said Jeffrey Blockinger, general counsel for the web3 company Quadrata. “The most important thing really is: Are we seeing assets starting to accumulate? Because if you're a creditor, that's what you care about.”","The FTX debtors have identified $5.5 billion in cash, liquid cryptocurrency and liquid securities, which Ray called <a href=\"https:\/\/www.theblock.co\/post\/203026\/ftx-debtors-identify-5-5-billion-of-liquid-assets-in-herculean-effort\" data-v-f87c67ca=\"\">a “Herculean effort”<\/a> to maximize value for creditors. The sum does not include millions of dollars worth of crypto in the custody of Bahamian regulators.","Bankruptcy experts noted that despite the agreement, conflicts are still likely to arise because the bankruptcy case is so large. FTX’s bankruptcy filing encompasses a web of 134 entities in several jurisdictions. The debtors and liquidators are already making plans to sell four relatively independent companies, including LedgerX, and the firm’s $253 million Bahamian real estate portfolio.","“Can they fight later? Sure. Will there be disagreements? Well, everybody's human. There will be disagreements. Will these disagreements get resolved? I'm a bankruptcy lawyer. Disagreements always get resolved,” Moldovan said. “That's the way it works.”","<i data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Delaware","content":"LOCATION"},{"type":"$253 million","content":"MONEY"},{"type":"Matthew Gold","content":"PERSON"},{"type":"Jeffrey Blockinger","content":"PERSON"},{"type":"Ray","content":"PERSON"},{"type":"Joseph Moldovan","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"$5.5 billion","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"$426 million","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Kleinberg, Kaplan, Wolff &amp; Cohen","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"December 2022","content":"DATE"},{"type":"John Ray","content":"PERSON"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"Morrison Cohen","content":"PERSON"},{"type":"FTX Digital Markets","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}