{"summary":"Tron founder Justin Sun says he’s willing to spend up to $5 billion to help ailing crypto firms. \nSun told The Block that Tron is engaging an investment bank to advise on potential deals.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156584\/justin-sun-5-billion-help-troubled-crypto-firms-ma","publishDate":"2022-07-08T12:59:09","id":985,"type":null,"title":"Justin Sun says he&#x27;s ready to spend $5 billion on acquisitions as crypto firms struggle","category":["Mergers &amp; Acquisitions"],"content":["Justin Sun, the creator of the Tron blockchain ecosystem, said he's ready to join FTX's Sam Bankman-Fried and Binance's Changpeng Zhao in offering support to ailing crypto firms — and could spend up to $5 billion on acquisitions.&nbsp;","\"Lots of\" companies have reached out to Sun and Tron for help, Sun told The Block when contacted after <a href=\"https:\/\/twitter.com\/justinsuntron\/status\/1545369541269921792?s=20&amp;t=sXg4pIKz2NWWtASertMy-Q\" data-v-f87c67ca=\"\">a tweet<\/a> earlier today that he was \"ready to serve.\"&nbsp;","As crypto markets sag, FTX has helped companies such as Voyager Digital and <a href=\"https:\/\/www.theblock.co\/post\/155516\/blockfi-strikes-680-million-credit-deal-with-ftx-us-outlines-acquisition-path\" data-v-f87c67ca=\"\">BlockFi<\/a> with credit facilities — winning Bankman-Fried <a href=\"https:\/\/www.economist.com\/finance-and-economics\/2022\/07\/05\/cryptos-last-man-standing\" data-v-f87c67ca=\"\">comparisons<\/a> with John Pierpont Morgan's efforts to prop up financial firms in the early 20th century. Similarly, Binance CEO Zhao recently <a href=\"https:\/\/www.theblock.co\/post\/154087\/binance-receives-5200-deal-proposals-amid-market-downturn-ceo-zhao-says\" data-v-f87c67ca=\"\">said<\/a> dozens of crypto firms are seeking the exchange operator's help due to its \"largest cash reserve in the industry.\"&nbsp;","Now, it appears, Sun wants to get involved too.&nbsp;","When asked how many companies have reached out to him or Tron compared to <a href=\"https:\/\/www.theblock.co\/post\/154087\/binance-receives-5200-deal-proposals-amid-market-downturn-ceo-zhao-says\" data-v-f87c67ca=\"\">Binance's claimed 50 to 100 figure<\/a>, Sun said the number is similar for Tron as well.","\"We are actively reviewing it and see what we can do here,\" Sun said. \"We are ready to spend [$]5 b[illion] on helping the industry builder[s] to continue [to] build.\"","Sun said Tron is engaging an investment bank to advise on potential deals, although he declined to name it, citing non-disclosure agreements.","When asked whether the $5 billion figure would be his personal money or Tron's, Sun said a mix of both. Sun added that both he and Tron are targeting healthy businesses as well as distressed firms and would go through a due diligence process before making any deal. Tron's DAO is sitting on reserves of $2.3 billion, according to <a class=\"c-link c-link--focus-visible\" tabindex=\"-1\" href=\"https:\/\/tdr.org\/#\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/tdr.org\/#\/\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">its website<\/a>.","\"Our interest is platforms with a large user base,\" Sun said. \"Both CeFi [centralized finance] and DeFi [decentralized finance] platforms.\"","As for the current market downturn, Sun said he thinks the worst is behind us.","\"I think currently the de-leverage process is passed the worst time. So we just need to clean it up and move forward. I don't think [the] market will be super bullish, of course,\" he said."],"hashtag":["JUSTIN SUN"]}