{"summary":"Instadapp, one of the biggest DeFi protocols, was inspired by multiple other projects like Aave and Uniswap in building Fluid.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255466\/instadapp-introduces-lending-protocol-fluid-in-testing-phase-aiming-for-january-release","publishDate":"2023-10-10T10:37:21","id":9850,"type":null,"title":"Instadapp introduces lending protocol Fluid in testing phase, aiming for January release","category":["EXCHANGES"],"content":["Decentralized finance platform Instadapp introduced a lending protocol named Fluid — integrating functionalities from Aave, Compound, Uniswap, Maker, and Curve.","Fluid was developed over a span of 1.5 years, aiming to address a recurrent concern in the DeFi sector: liquidity fragmentation, the team noted. Traditionally, emerging protocols with advanced features have faced challenges in amassing liquidity.","Presently, Fluid is in its preliminary testing stages. The team expects to finalize the audits by the end of November and is planning a bug bounty event in December. The official release of the protocol is projected for January.","Instadapp's native token INST will be the governance token for Fluid.","Fluid’s “Liquidity Layer” design is devised to offer users a consistent transition across major DeFi protocols, consolidating liquidity and features for lending services and ensuring stable lending rates.","The protocol incorporates several methodologies from key DeFi platforms on Ethereum. This incorporates Uniswap v3’s \"slot-based liquidity\" feature for improved loan liquidations, MakerDAO’s vault protocol for asset security, liquidity pool strategies from Compound and Aave to determine risks and design rate curves based on usage, and Curve-inspired “smart collateral” features.","The protocol will have the capability for users to borrow up to 95% of their ETH’s value, the team claimed, with a focus on risk mitigation. For enhanced security measures, Fluid’s loans will adapt in real-time, limiting unexpected significant transactions and reducing potential risks.","Instadapp has $1.8 billion of value locked in its smart contracts, <a href=\"https:\/\/defillama.com\/protocol\/instadapp\" data-v-f87c67ca=\"\">according to DefiLlama<\/a>, making it the 10th biggest DeFi platform across all blockchains.","In 2021, Instadapp <a href=\"https:\/\/www.theblock.co\/linked\/108224\/defi-startup-instadapp-raises-10-million-in-new-funding\" data-v-f87c67ca=\"\">raised<\/a> $10 million in a funding round led by Standard Crypto, and contributions from DeFi Alliance, Longhash Ventures, and Andre Cronje.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.8 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Andre Cronje","content":"PERSON"},{"type":"Standard Crypto","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"Uniswap","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"95%","content":"PERCENT"},{"type":"Longhash Ventures","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}