{"summary":"After Jan. 31, Argent will start reducing zkSync Era alpha accounts, which will experience downgraded performance but no loss of security.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260179\/crypto-wallet-developer-argent-to-stop-zksync-era-development-to-prioritize-starknet","publishDate":"2023-10-31T10:39:51","id":9853,"type":null,"title":"Crypto wallet developer Argent to stop zkSync Era development to prioritize Starknet","category":["CRYPTO ECOSYSTEMS"],"content":["DeFi wallet developer Argent will stop zkSync Era development in favor of the Ethereum Layer 2 network and zk-rollup Starknet.","Argent will begin reducing support for zkSync Era alpha accounts from Jan. 31, but they will not close or lose security despite downgraded performance.&nbsp;","\"Following a six-month alpha phase and careful consideration of user feedback, we've decided to stop the development of the zkSync Era account to focus on Starknet,\" according to an Argent email obtained by The Block. Argent wants to focus on building products that augment its growing ecosystem.","Argent \"highly recommended\" users to transfer their zkSync Era assets from the platform to another zkSync Era wallet or bridge them to a Starknet or Ethereum account \"as soon as possible.\"","Argent's co-founder and CEO Itamar Lesuisse <a href=\"https:\/\/twitter.com\/itamarl\/status\/1719108591372681628\" data-v-f87c67ca=\"\">added<\/a> on social media that it is, \"just pausing an alpha to be more focused. We are doubling down on a strategy that has been a huge success for us (more than 1 million smart wallets on Starknet) and where we can have the biggest impact and show the full power of Account Abstraction as EVM is still an EOA first world, will take time for dapps to adapt.\"","\"ZkSync is killing it right now, constantly higher transactions-per-second of all L2s, extremely bullish on zkSync when it comes to scaling EVM,\" he added.","Argent was one of the first major crypto projects to <a href=\"https:\/\/www.theblock.co\/post\/222596\/zksync-era-first-zkevm-goes-live-in-major-development-for-ethereum\" data-v-f87c67ca=\"\">build<\/a> on zkSync Era, a zero-knowledge scaling protocol compatible with the Ethereum Virtual Machine, when the Layer 2 network went live in March. zkSync Era gives developers an easier time moving applications onto the network, along with quicker transactions and lower fees.&nbsp;","However, in late August, Argent <a href=\"https:\/\/www.theblock.co\/post\/248227\/argent-starknet-hito-studios\" data-v-f87c67ca=\"\">partnered<\/a> with the Starknet Foundation to launch Hito Studios, an early-stage venture studio concentrating on supporting startups building on Starknet, The Block previously reported.&nbsp;","zkSync Era maintains 40.3% of the value locked in Ethereum ZK Rollups, compared to 12.2% for Starknet, The Block's Data Dashboard shows.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/scaling-overview\/value-locked-of-ethereum-zk-rollups\/embed\" title=\"Value Locked in Ethereum ZK Rollups (Escrow Contracts)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","(<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Updates with comment from Argent<\/i>)&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"12.2%","content":"PERCENT"},{"type":"Jan. 31","content":"DATE"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Starknet Foundation","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"EOA","content":"ORGANIZATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Itamar Lesuisse","content":"PERSON"},{"type":"EVM","content":"ORGANIZATION"},{"type":"40.3%","content":"PERCENT"},{"type":"August","content":"DATE"}],"hashtag":["ZKSYNC"],"authors":["MK Manoylov","The Block"]}