{"summary":"Vega follows Whales Market and Pendle is supporting trading for points ahead of any potential token airdrop.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282182\/vega-creates-derivatives-market-for-crypto-points-starting-with-eigenlayer","publishDate":"2024-03-13T07:37:32","id":9855,"type":null,"title":"Vega creates derivatives market for crypto points, starting with EigenLayer","category":["CRYPTO ECOSYSTEMS"],"content":["Derivatives network Vega has created a market for derivatives trading of points, beginning with EigenLayer. The aim is to allow users to hedge the value of their points.","<a href=\"https:\/\/www.theblock.co\/learn\/274899\/what-are-crypto-points\" data-v-f87c67ca=\"\">Points<\/a> are a web2 mechanism — think airline miles — that have made their way into the crypto space in relation to airdrops. Often projects are giving out points in exchange for activity on their platforms, with the underlying assumption that these points could help to determine the distribution of a potential airdrop,&nbsp;if one is to take place.","Since these points have a potential to turn into tokens at some point, traders have started speculating on them. This may be to buy more points or to hedge against the potential airdrop. Platforms like Whales Market and Pendle have added points features, with the former allowing users to buy and sell points and the latter letting users leverage their points by 100X.","Vega is entering this nascent market with its derivatives market for points. It has started with EigenLayer — a network focused on restaking —&nbsp;but the underlying network supports permissionless market creation. This means anyone can spin up a market for points trading for any other points project.","Since points may or may not lead to a future token airdrop it is complicated creating a system for trading the potential outcome when it is so uncertain. Vega is tackling this by using a cash-settled futures market with options for fixed and dynamic settlement dates.","There are certainly plenty of projects offering points and many points available. At last check, we counted <a href=\"https:\/\/www.theblock.co\/post\/277823\/crypto-projects-115b-points\" data-v-f87c67ca=\"\">115 billion points<\/a> handed out across 14 projects. One project has even <a href=\"https:\/\/www.theblock.co\/post\/279807\/kelp-eigenlayer-points-kep?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">tokenized<\/a> these points. As more projects adopt them, it’s unsurprising that markets are emerging to facilitate their trading.","However, there are some risks with trading points ahead of airdrops. Some projects may choose not to give tokens to those who have traded their points ahead of an airdrop. For instance, <a href=\"https:\/\/docs.blast.io\/airdrop\/users\" data-v-f87c67ca=\"\">Blast says<\/a> any users who trade a liquid proxy for points will have their allocation set to zero.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pendle","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Vega","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"115 billion","content":"MONEY"}],"hashtag":["DERIVATIVES"],"authors":["Tim Copeland","The Block"]}