{"summary":"Freelancer-focused Neobank Ping closed a $15 million seed round backed by Y Combinator, Race Capital, BlockTower, Danhua Capital, Signum Capital and Goat Capital.","author":["Kristin Majcher","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185766\/y-combinator-backs-payment-startup-ping-in-15-million-seed-round","publishDate":"2022-11-10T22:46:43","id":986,"type":null,"title":"Y Combinator backs payment startup Ping in $15 million seed round","category":["Startups"],"content":["<span data-v-f87c67ca=\"\">Ping, a new freelancer-focused neobank, raised $15 million in a seed round as it plans to expand its focus from Latin America to new regions.<\/span>","<span data-v-f87c67ca=\"\">Firms including Y Combinator, <\/span><span data-v-f87c67ca=\"\">Race Capital, BlockTower, Danhua Capital, Signum Capital and Goat Capital participated in the round.<\/span>","<span data-v-f87c67ca=\"\">\"We’re going to be expanding big time,” Ping co-founder Jack Saracco said in an interview. He noted that the company currently serves users in 16 countries and<\/span><span data-v-f87c67ca=\"\"> hopes to expand its focus to markets including Southeast Asia and Western Africa. The company will also put the funding toward marketing and sales.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ping<\/span><span data-v-f87c67ca=\"\">’s app-based platform focuses on digital nomads and freelancers working internationally. It aims to ease the process of getting paid in dollars and converting those funds to local currency. <\/span>It allows users to create a U.S.-dollar bank account, invoice their employers and receive local currencies or crypto through bank transfers.","<span data-v-f87c67ca=\"\">The Miami-based company, founded in 2021, said it has processed more than $1 million in payment volume in its first few months of operations. It <a href=\"https:\/\/www.ycombinator.com\/launches\/GjH-ping-neo-bank-for-remote-workers\" data-v-f87c67ca=\"\">launched<\/a> through Y Combinator about four months ago.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ping is built on the rails of <\/span><a href=\"https:\/\/www.latamex.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Latamex<\/span><\/a><span data-v-f87c67ca=\"\">, which offers on- and off-ramps for exchanging crypto and fiat. Its platform allows users to buy and sell bitcoin, ether and Litecoin, as well as Tether (USDT) and USD Coin (USDC). Users can also deposit or withdraw U.S. dollar fiat currency. <\/span><span data-v-f87c67ca=\"\">The company also has a waitlist open for a new international Visa card.&nbsp;<\/span>"],"hashtag":[]}