{"summary":"Two Solana-based protocols have taken initial steps to reopen their services after the Mango Markets exploit.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179996\/solana-projects-reopen-after-getting-funds-back-from-mango-markets","publishDate":"2022-10-26T10:24:03","id":9861,"type":null,"title":"Solana projects reopen after getting funds back from Mango Markets","category":["LENDING"],"content":["<span data-v-f87c67ca=\"\">Two Solana-based decentralized finance (DeFi) protocols, Tulip and UXD, have recovered tokens from Mango Markets, a lending protocol that recently suffered a major exploit. This has enabled both projects to start reopening their services, giving confidence back to the Solana DeFi scene.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The projects were affected when Mango Markets suffered a price manipulation attack and lost <a href=\"https:\/\/www.theblock.co\/post\/177736\/privacy-policy\" data-v-f87c67ca=\"\">$114 million<\/a> in user deposits. Through negotiation efforts, the protocol managed to recover $67 million of the stolen funds.<\/span>","<span data-v-f87c67ca=\"\">The Mango Markets team opened claims on Oct. 20, allowing users, including other Solana projects, to recover funds they had lost during the attack. UXD Protocol and <a href=\"https:\/\/www.theblock.co\/linked\/122219\/solana-based-yield-aggregator-tulip-protocol-funding\" data-v-f87c67ca=\"\">Tulip Protocol<\/a> have recovered their respective funds and taken initial steps to reopen their individual services.<\/span>","<span data-v-f87c67ca=\"\">UXD Protocol, which is a decentralized stablecoin protocol on Solana, notified users that it has<\/span> <a href=\"https:\/\/twitter.com\/UXDProtocol\/status\/1585187327541846017\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">recovered<\/span><\/a><span data-v-f87c67ca=\"\"> all assets lost during the Mango exploit. The stablecoin maintains value by allocating funds into third-party investment strategies, including supplying its USDC stablecoin holdings on lending platforms to earn yields.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">UXD had lost access to $19.9 million it had deposited on Mango Markets. Now that it’s claimed back its assets, the team said it will resume full operations. This includes minting of new UXD stablecoin, which it had paused in light of losses incurred due the Mango exploit. To restart full operations, the team said it would need to reset the “asset liability management module,” a feature that's used to manage its diverse DeFi investments.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“UXD Protocol was able to recover all funds that were exposed to Mango Markets. We now have enough capital in the insurance fund to pave the way for the asset liability management module, which will be released very soon,” UXD Protocol founder Kento Inami told The Block.<\/span>","<span data-v-f87c67ca=\"\">Tulip Protocol, a Solana-based yield aggregator, has <a href=\"https:\/\/twitter.com\/TulipProtocol\/status\/1585176801617514496\" data-v-f87c67ca=\"\">claimed<\/a> and recovered assets worth $2.5 million, which it had staked on Mango Markets on behalf of its users. Tulip functions by letting users deposit funds and allocates them to different protocols as part of “strategy vaults.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Tulip Protocol was affected on its USDC and RAY strategy vaults as it lost access to 2.4 million USDC tokens and 68,475 raydium tokens ($30,000) deposited into Mango Markets at the time of the attack. Now the team has restored vault balances to the same state as before the exploit.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"UXD Protocol","content":"ORGANIZATION"},{"type":"RAY","content":"ORGANIZATION"},{"type":"$30,000","content":"MONEY"},{"type":"Tulip Protocol","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$2.5 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$114 million","content":"MONEY"},{"type":"$19.9 million","content":"MONEY"},{"type":"$67 million","content":"MONEY"},{"type":"Oct. 20","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Kento Inami","content":"PERSON"}],"hashtag":["LENDING","SOLANA"],"authors":["Vishal Chawla","The Block"]}