{"summary":"Coinbase Derivatives Exchange will offer new Bitcoin and Ether futures contracts starting next week, aimed at institutional clients. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232990\/coinbase-institutional-bitcoin-ether-futures-contracts","publishDate":"2023-06-02T12:57:05","id":9865,"type":null,"title":"Coinbase to launch &#x27;institutional-sized&#x27; bitcoin and ether futures contracts next week","category":["EXCHANGES"],"content":["Coinbase will launch new bitcoin and ether futures contracts next week, which the company says will offer lower fees for investors.","Coinbase’s derivatives exchange, which is regulated by the Commodity Futures Trading Commission, will launch the new futures contracts on Monday. They'll be available through leading third-party institutional futures commission merchants and brokers.&nbsp;","“BTI and ETI futures, sized at 1 bitcoin and 10 ether per contract, respectively, will enable participants to tailor their exposure to these growing digital asset commodities with granularity, allowing traders to seize opportunities in a highly dynamic market environment,” Coinbase said in a <a href=\"https:\/\/www.coinbase.com\/blog\/coinbase-derivatives-exchange-will-launch-institutional-sized-bitcoin-and\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">blog post<\/span><\/a>.","The announcement comes a year after Coinbase <a href=\"https:\/\/www.coinbase.com\/blog\/coinbase-derivatives-exchange-to-make-nano-bitcoin-futures-available-through-leading-brokers\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">launched<\/span><\/a> its \"nano\" bitcoin and ether contracts, and the company said that it has since seen institutional interest and demand for advanced derivatives products. <span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">The new futures contracts are \"designed to integrate into other trading strategies seamlessly\" with monthly expirations and USD settlement, the company <a href=\"https:\/\/www.linkedin.com\/feed\/update\/urn:li:activity:7070133629770743808\/\" data-v-f87c67ca=\"\">said on LinkedIn<\/a>.<\/span>","Along with lower fees, some institutions might qualify for incentive programs if they are “early adopters” of the contracts, Coinbase said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","\"With the launch of these institutional-sized USD-settled contracts, we look to empower institutional participants with greater precision in managing crypto exposure, expressing directional views, or tracking Bitcoin and Ether returns in a capital-efficient way,\" the company said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"BTI","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"ETI","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}