{"summary":"The idea behind zkPass is to use its privacy preserving technology to create concepts like decentralized identity passes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234384\/binance-labs-sequoia-china-2-5-million-funding-into-zkpass","publishDate":"2023-08-03T10:18:19","id":9868,"type":null,"title":"Binance Labs, Sequoia China and others invest $2.5 million in zkPass","category":["DEALS"],"content":["Privacy preserving protocol zkPass raised $2.5 million in a seed funding round.","Investors included Binance Labs, Sequoia China, OKX Ventures, dao5, SIG DT Investments — a Susquehanna International Group company — Cypher Capital, Leland Ventures and Blockchain Founders Fund.","<a href=\"https:\/\/zkpass.org\/home\" data-v-f87c67ca=\"\">zkPass<\/a> uses a combination of three types of technology: zero-knowledge proofs, multi-party computation and three-party transport layer security. This gives users the ability to disclose personal data on any website without revealing or uploading the documents themselves.","The technology can be used for concepts like decentralized identity passes, privacy-based healthcare data marketplaces and DeFi protocols that use off-chain data for credit applications.","The funding will support development of its pre-alpha testnet, which has 190,000 signups on its waitlist. The project was incubated by <a href=\"https:\/\/www.theblock.co\/post\/228565\/binance-labs-yibo-ling-investments\" data-v-f87c67ca=\"\">Binance Labs<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Susquehanna International Group","content":"ORGANIZATION"},{"type":"Sequoia China","content":"LOCATION"},{"type":"$2.5 million","content":"MONEY"},{"type":"Binance Labs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Leland Ventures","content":"ORGANIZATION"},{"type":"SIG DT Investments","content":"ORGANIZATION"},{"type":"Cypher Capital","content":"ORGANIZATION"},{"type":"OKX Ventures","content":"ORGANIZATION"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}