{"summary":"The AMF, the French stock market regulator, will subject crypto firms seeking a license to stricter registration requirements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244080\/french-regulator-tweaks-crypto-regulations-to-make-them-mica-ready","publishDate":"2023-08-10T05:44:00","id":9869,"type":null,"title":"French regulator tweaks crypto regulations to make them MiCA-ready","category":["POLICY"],"content":["The Autorité des Marchés Financiers (AMF), the French stock market regulator, today announced amendments to local crypto regulations — in part to bring them into line with the European Union’s Markets in Crypto-Assets (MiCA) regime.","The two main changes are the introduction of an enhanced registration framework for so-called Digital Asset Service Providers (DASPs) and tweaks to align local DASP licensing requirements with MiCA, according to <a href=\"https:\/\/www.amf-france.org\/en\/news-publications\/news\/digital-assets-amf-amends-it-general-regulation-and-its-policy-dasp-light-enhanced-registration-and\" data-v-f87c67ca=\"\">a blog post<\/a> published by the AMF today.","In the blog post, the AMF said that DASPs seeking a license in France will be assessed for a wide range of requirements, including, “adequate security and internal control systems, systems for managing conflicts of interest, clear, accurate and non-misleading information, public pricing policies, specific custody provisions (segregation of client assets vs. own assets), prohibition on using client assets without their express prior consent, agreement signed with clients, resilient and secure IT system, a ban on using client assets without their express prior consent, a signed agreement with clients, and a resilient and secure IT system.”","MiCA is a harmonized set of crypto rules for companies operating anywhere within the EU bloc. Lawmakers in the European Parliament officially <a href=\"https:\/\/www.theblock.co\/post\/227309\/mica-european-union-crypto-regulation-passes\" data-v-f87c67ca=\"\">approved the framework in April<\/a>, with rules first coming into effect in June.","“The Autorité des marchés financiers (AMF) is amending the provisions of its General Regulation and its policy on the regime for digital asset service provider (DASPs) to take due to the ‘enhanced’ registration introduced by the DDADUE Law,” the AMF wrote in the blog post.","“These changes, which will apply from January 1, 2024, are also intended to anticipate the transition to the European Regulation on markets in crypto-assets (MiCA) by adjusting the provisions relating to licenced DASPs.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"General Regulation","content":"ORGANIZATION"},{"type":"Autorité des Marchés Financiers (AMF","content":"ORGANIZATION"},{"type":"France","content":"LOCATION"},{"type":"Digital Asset Service Providers","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"European Union’s Markets","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"January 1, 2024","content":"DATE"},{"type":"June","content":"DATE"},{"type":"European Parliament","content":"LOCATION"},{"type":"MiCA","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Crypto","content":"LOCATION"},{"type":"AMF","content":"ORGANIZATION"}],"hashtag":["EUROPEAN PARLIAMENT"],"authors":["Ryan Weeks","The Block"]}