{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/19433\/kraken-allegedly-does-not-pay-its-head-of-institutional-sales-and-trading-business-after-departure","publishDate":"2019-04-12T15:30:31","id":9877,"type":null,"title":"Kraken allegedly does not pay its head of institutional sales and trading business after departure","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Silverman v. Payward, Inc., et al., Case №1:19-cv-02997 (SD NY Filed April 4, 2019) [NMR]<\/strong><\/em>","A theme that runs through most of the lawsuits that we cover at the Crypto Caselaw Minute is the idea that people should keep their promises. Promises are an integral part of society and human relations. They are how we negotiate deals, manage our relationships, and work together to achieve all that we do. Consequently, when someone feels that someone else broke a promise to them, they generally feel wronged, and sometimes, if there is enough money at stake, they bring a lawsuit. This case concerns an alleged broken promise between a former employee and one of the biggest names in the crypto space: Payward, Inc. Never heard of Payward, Inc.? Well, you may know it by another name: <a href=\"https:\/\/www.theblockcrypto.com\/linked\/93235\/kraken-own-chainlink-node-price-data-defi\" data-v-f87c67ca=\"\">Kraken<\/a>.","According to the allegations in the lawsuit, on or about April 2017 the plaintiff, Jonthan Silverman, was hired “to head Kraken’s Institutional Sales and Trading Business and relocate the business to New York.” As part of his alleged employment agreement the plaintiff agreed to receive a base salary of $150,000 and participation in a stock option plan. Allegedly, the plaintiff and Kraken CEO Jesse Powell also orally agreed that the plaintiff would receive 10% of any annual profits generated by the trading desk, to be paid out at the end of the year.","Fast forward to December 2017 and the plaintiff was allegedly involuntarily terminated. According to the plaintiff, this happened because Kraken had been representing to the public and regulators that Kraken conducted no business in the State of New York. From the time the plaintiff was terminated until July 2018, the plaintiff and defendants engaged in negotiations for a settlement amount to be paid to the plaintiff to compensate him for his involuntary termination. The result, allegedly agreed upon by both parties, was a promised payment of $907,631. Supposedly, this money was never paid and the plaintiff ultimately decided to file this lawsuit.","There are a couple of things that the plaintiff is seeking in this lawsuit. The first, of course, is the settlement amount of $907,631, but the plaintiff is also seeking damages related to this alleged promised commission based on the annual profit generated by the trading desk. That annual profit may be $19,000,000 according to another lawsuit filed against <a href=\"https:\/\/www.theblockcrypto.com\/post\/19433\/kraken-allegedly-does-not-pay-its-head-of-institutional-sales-and-trading-business-after-departure\" data-v-f87c67ca=\"\">Kraken<\/a> in the Southern District of New York. This suit attempts to recover damages for the plaintiff related to that profit under three legal theories: breach of contract (the supposed oral agreement to pay the plaintiff a commission), quantum meruit (the legal theory that even if there wasn’t a contract you may deserve the reasonable value of services rendered), and unjust enrichment (meaning one party, Kraken, benefited at the expense of another, the plaintiff).","This lawsuit just began, so these are unproven allegations. <a href=\"https:\/\/www.theblockcrypto.com\/post\/19814\/kraken-is-delisting-bitcoin-sv-amid-controversy-but-the-exchange-plans-to-list-2-coins-per-month-starting-in-may\" data-v-f87c67ca=\"\">Kraken<\/a> has not responded yet, but IF these allegations hold true this could be a case where Kraken ends up paying much more than they would have had they kept their promise and paid the original settlement amount.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silverman v. Payward, Inc.","content":"ORGANIZATION"},{"type":"$150,000","content":"MONEY"},{"type":"Jonthan Silverman","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"December 2017","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"Payward, Inc.","content":"ORGANIZATION"},{"type":"July 2018","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Kraken","content":"PERSON"},{"type":"$19,000,000","content":"MONEY"},{"type":"April 4, 2019","content":"DATE"},{"type":"Jesse Powell","content":"PERSON"},{"type":"State of New York","content":"LOCATION"},{"type":"$907,631","content":"MONEY"},{"type":"Payward, Inc","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"April 2017","content":"DATE"}],"hashtag":["KRAKEN"],"authors":["Nelson Rosario","The Block"]}