{"summary":"The post-Merge supply of ether has declined by over 400 ETH, compared to a theoretical proof-of-work increase of over 650,000 ETH.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184649\/ether-officially-turns-deflationary-amid-intense-crypto-market-fear","publishDate":"2022-11-09T06:21:53","id":9878,"type":null,"title":"Ether officially turns deflationary amid intense crypto-market fear","category":["LAYER 1S"],"content":["Ether, the native coin of the Ethereum network, officially turned deflationary 55 days after The Merge — its transition from proof-of-work to proof-of-stake.","The post-Merge supply of ether has <a href=\"https:\/\/ultrasound.money\" data-v-f87c67ca=\"\">declined<\/a> by over 400 ETH ($469,000), as of 5:35 a.m. ET, according to the Ethereum supply tracking website ultrasound.money. Ethereum's deflation rate is currently 0.001% annually.","Were the Merge never to have taken place and Ethereum remained proof-of-work, the total supply of ether would have increased by over 650,000 ETH ($762 million) with an inflation rate of nearly 3.6%.","Though Ethereum proponents are widely pleased to see the total ether supply decrease, it comes at a worrying time for the blockchain and cryptocurrency industry. Following a withdrawal freeze, FTX announced its <a href=\"https:\/\/www.theblock.co\/post\/184423\/ftxs-bankman-fried-gets-binance-bailout-in-stunning-reversal-of-fortune\" data-v-f87c67ca=\"\">intention<\/a> to sell to rival crypto exchange Binance after apparently turning insolvent. The high-profile event has spurred selling in the crypto markets as fears of widespread contagion spread.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"5:35 a.m. ET","content":"TIME"},{"type":"$469,000","content":"MONEY"},{"type":"$762 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"3.6%","content":"PERCENT"},{"type":"0.001%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Adam James","The Block"]}