{"summary":"The crypto world likes to tout decentralization, specifically the lack of controlling authorities over these new forms of money. But last night, Google","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/439\/app-stores-remind-us-who-the-powerful-gatekeepers-really-are","publishDate":"2018-09-13T15:03:47","id":9879,"type":null,"title":"App stores remind us who the powerful gatekeepers really are","category":["BITCOIN"],"content":["The crypto world likes to tout <em data-v-f87c67ca=\"\">decentralization<\/em>, specifically the lack of controlling authorities over these new forms of money. But last night, Google took action to remind everyone just how powerful some gatekeepers remain. While it is sometimes possible to skirt even government regulations by <a href=\"https:\/\/news.bitcoin.com\/the-daily-malta-sees-no-issue-with-unlicensed-crypto-firms-valletta-mansion-on-sale-for-crypto\/\" data-v-f87c67ca=\"\">moving your crypto venture to a friendly jurisdiction<\/a>, the mobile app stores controlled by Alphabet (Google's parent company) and Apple remain a somewhat impenetrable bulwark against unfettered crypto activity.&nbsp;","Overnight, per a report in&nbsp;The Next Web, <a href=\"https:\/\/thenextweb.com\/hardfork\/2018\/09\/13\/google-removes-cryptocurrency-wallets\/\" data-v-f87c67ca=\"\">three crypto wallet apps were taken down<\/a> from the Google Play store. It appears the reason is <a href=\"https:\/\/play.google.com\/about\/restricted-content\/financial-instruments\/cryptocurrencies\/\" data-v-f87c67ca=\"\">a recent decision by Google<\/a> with respect to crypto apps on the Play store. Here is the issue. The policy is simple: \"We don't allow apps that mine cryptocurrency on devices. We permit apps that remotely manage the mining of cryptocurrency,\" Google says. But the apps in question do not mine crypto. Bitcoin Wallet, CoPay, and BitPay are wallet apps and do not even hint at mining cryptocurrencies as part of their functionality. As of 1PM Eastern time, all but CoPay was back on the Play store, presumably after the app creators drew attention to their mysterious removal.&nbsp;","Still, while Google's rule&nbsp;<em data-v-f87c67ca=\"\">seems<\/em> clear, there is a lot of grey. Consider the case of Electroneum, which just <a href=\"https:\/\/bitcoinexchangeguide.com\/electroneum-crypto-mining-app-sees-1-million-downloads-in-google-play-store\/\" data-v-f87c67ca=\"\">celebrated its 1 millionth download in the Play store<\/a>. The headline from&nbsp;<em data-v-f87c67ca=\"\">Bitcoin Exchange News<\/em> reads: \"Electroneum Crypto Mining App Sees 1 Million Downloads In Google Play Store.\" Wait, what? If it is a crypto mining app and the company is touting its success, shouldn't it be shut down immediately by Google? Well, no. <a id=\"jump\" data-v-f87c67ca=\"\"><\/a>The headline is misleading -- as is a lot of the PR around the app. No mining takes place on your smartphone through the function Electroneum calls \"Mobile Miner\"","The idea of the mobile miner is not that you are actually mining because that isn't something that would be possible on a phone but by providing people with a mining experience which provides them with ETN [the company's token] that firstly gets them interested in cryptocurrency but also provides them with a currency that they can purchase things that will make an impact on their life.","Clear as mud, right? Apparently, though Google Play's watchdogs either never saw what Electroneum was claiming or simply came to understand it did not run afoul of the new guidelines. Indeed, whoever heard the complaints of the wallet companies today also understood that the mining-app ban should not apply.","But nothing prevents Google from going farther. It could have instead banned crypto wallets that do not comply with U.S. \"know your customer\" laws designed to combat money laundering. It can, within reason, impose nearly any rule it wishes <a href=\"https:\/\/www.coindesk.com\/coinbase-bitcoin-app-apple-app-store\/\" data-v-f87c67ca=\"\">as Apple did back in 2013 when it banned the Coinbase app<\/a>. That decision was, of course, subsequently reversed but it should serve as a reminder that in the mainstreaming of crypto two very powerful companies have a lot of say over distribution. They can determine what is and is not permissible and there is little recourse other than antitrust complaints. Not only do those take years to adjudicate, they require going through the very same governments decentralized money had hoped to avoid in the first place.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last night","content":"TIME"},{"type":"U.S.","content":"LOCATION"},{"type":"Google Play Store","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Electroneum","content":"LOCATION"},{"type":"Google Play","content":"ORGANIZATION"},{"type":"Bitcoin Exchange News","content":"ORGANIZATION"},{"type":"Electroneum Crypto Mining App","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mark Rogowsky","The Block"]}