{"summary":"Dai stablecoin issuer MakerDAO passed a governance proposal to remove renBTC from being used as collateral.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189884\/makerdao-passes-vote-to-close-alameda-linked-renbtc-as-stablecoin-collateral","publishDate":"2022-11-25T05:39:36","id":9880,"type":null,"title":"MakerDAO passes vote to close Alameda-linked renBTC as stablecoin collateral","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Dai stablecoin issuer MakerDAO<\/span> <a href=\"https:\/\/vote.makerdao.com\/polling\/QmTNMDfb#vote-breakdown\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">passed<\/span><\/a><span data-v-f87c67ca=\"\"> a governance proposal to remove renBTC from being used as collateral and reduce exposure to what’s deemed a risky asset by the DAO. RenBTC is a wrapped bitcoin asset developed by the Alameda Research-backed project Ren Protocol.<\/span>","<span data-v-f87c67ca=\"\">MakerDAO lets users mint the dai stablecoin by depositing excess cryptocurrency collateral. In December 2020, MakerDAO allowed users to deposit renBTC tokens in specialized \"RENBTC-A\" vaults and mint dai.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Earlier this year, Alameda Research, the sister trading firm of FTX exchange, acquired the Ren project and funded its development each quarter. After Alameda and the FTX exchange<\/span><a href=\"https:\/\/www.theblockresearch.com\/analysis-of-alameda-ftx-chapter-11-bankruptcy-filing-185945\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">&nbsp;filed<\/span><\/a><span data-v-f87c67ca=\"\"> for Chapter 11 bankruptcy protection, the Ren team<\/span> <a href=\"https:\/\/medium.com\/renproject\/moving-on-from-alameda-da62a823ce93\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> that its existing tokenized bitcoin offering, referred to as Ren 1.0, would be shut down and replaced by a new community-run Ren 2.0.<\/span>","<span data-v-f87c67ca=\"\">The Ren team said it was left with a runway to completion by the end of the year. Meanwhile, it has put renBTC issuance on hold and asked users to burn the circulating tokens on Ethereum and claim them back to the original chain. To get to this second version of Ren, the team will need to secure additional funding, it added.<\/span>","<span data-v-f87c67ca=\"\">In response to this development, MakerDAO's \"risk core unit\" team noted that since mints were disabled, renBTC potentially faced the risk of losing its pegged value to bitcoin. It then <\/span><a href=\"https:\/\/forum.makerdao.com\/t\/renbtc-a-proposed-offboarding-parameters-context\/18864\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">proposed<\/span><\/a><span data-v-f87c67ca=\"\"> closing renBTC vaults and liquidating the loan positions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"In light of the uncertainty surrounding the Ren Protocol, and following Risk Core Unit’s recommendation, Maker Governance voted to offboard the RENBTC-A vault type,\" MakerDAO <a href=\"https:\/\/twitter.com\/MakerDAO\/status\/1595811489985748993\" data-v-f87c67ca=\"\">announced<\/a>.<\/span>","<span data-v-f87c67ca=\"\">The vote on this proposal was passed yesterday with 100% of the votes of MakerDAO delegates in favor of it. <\/span><span data-v-f87c67ca=\"\">\"With Alameda filing for bankruptcy and the elevated risk of renBTC depegging, we support offboard renBTC as collateral to minimize risk to the platform,\"<\/span> <a href=\"https:\/\/vote.makerdao.com\/polling\/QmTNMDfb#comments\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> London Business School Blockchain, which works as a MakerDAO delegate.<\/span>","<span data-v-f87c67ca=\"\">Currently, there are multiple renBTC vaults on Maker that have loaned out more than 850,000 dai. These positions are to be liquidated starting Dec. 7, according to the approved vote. The liquidation ratio for these positions will be set at 5,000%. A high collateral ratio guarantees liquidations will be triggered, Maker’s risk unit said in the proposal.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"December 2020","content":"DATE"},{"type":"Ren","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Alameda","content":"PERSON"},{"type":"Dec. 7","content":"DATE"},{"type":"5,000%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"London Business School Blockchain","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}