{"summary":"Launched in 2001, RuneScape has a tangible influence on the crypto sector to this day.  ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207927\/crypto-kids-loved-runescape-but-theyre-building-their-own-games-backwards","publishDate":"2023-02-02T04:39:00","id":9883,"type":null,"title":"Crypto kids loved RuneScape, but they’re building their own games backwards","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-contrast=\"none\" data-v-f87c67ca=\"\">RuneScape is the sort of game metaverse enthusiasts dream about.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">It’s a mass multiplayer online role-playing game (MMORPG) set in the vast, virtual realm of Gielinor, a fantasyland brimming with quests and, according to <\/span><a href=\"https:\/\/mmo-population.com\/r\/runescape\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">estimates<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\">, half a million players each day. It boasts a dynamic in-game economy and currency, thousands of tradable items, countless ways to flaunt wealth and power — all without a blockchain in sight. The first version of the game was launched in 2001, yet to this day it has a tangible influence on the crypto set.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">For crypto gaming builders, RuneScape arguably tops a list of formative games that also includes World of Warcraft, Dota 2, Diablo, MIR4 and EVE Online. Now, many are trying to build virtual worlds just as engaging, but with the benefit of a blockchain base. <\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“Looking back, it seems like the seed for all of this is in RuneScape,” said Alisha Anderson, international general manager at Sino Global Games. “It at least trained us to want and do what we’re doing in gaming and NFTs. Simply looking at the economy, there was P2P and DeFi, scarcity, grinding, flexing, miracles of RNG (random number generation), flipping — all have parallels to crypto.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:0,&quot;335551620&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">There are few surer paths to virality on crypto Twitter than musing about how the web3 experience in some way recalls playing RuneScape as a kid. Quinn Slocum, co-founder of Metav3rse, produced <\/span><a href=\"https:\/\/twitter.com\/quinnslcm\/status\/1614413166297100288?s=20&amp;t=QY579XZr1wMvfoAqUBgV7w\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">a classic of the genre<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> on Jan. 15.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","if you played RuneScape growing up your odds of getting scammed through social engineering go down 99.9%","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“More than anywhere else online, it was where so many of us learned to trade, fell for scams, wised up to scams, figured out the grind, skilled up, took out monsters and each other, got taken out, and counted our achievements in a seemingly endless world,” Anderson said. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:0,&quot;335551620&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">What is it about Jagex’s smash hit that still appeals crypto folk twenty years later?<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">To understand the RuneScape-to-crypto pipeline, look no further than the way RuneScape’s economy functions — and has flourished.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Broadly speaking, players train up their skills to acquire items. Those items can be harvested through various kinds of hard virtual labor, such as fishing, woodcutting and cooking; through combat; or in other more esoteric ways. Whatever their chosen path, players accumulate both inventory and skill, paving the way to greater riches. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The process of training up and gathering materials is often painstaking; repeatedly clicking on ore-rich rocks to mine their contents, for instance. “People used to grind a lot playing Runescape to get the item they wanted,” explained Howard Xu, co-founder of Ancient8, a DAO developing infrastructure for GameFi. The game’s P2P and NPC&nbsp;combat scenarios offer a more thrilling, if riskier, path to riches. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">There are also items to be gained from quests and seasonal drops. Masks and party hats acquired from Halloween and Christmas giveaways in RuneScape’s early days became some of the game’s most valuable items. They had no ostensible use beyond display. Their sole value was their scarcity — a term that excites many a crypto enthusiast.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">But it’s what RuneScape players could do with their money and rare items, once acquired, that so imprinted the game on the minds of web3 folk. From its early days, trade was an integral part of the game.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“One thing that really stood out to me in RuneScape was the way that players could trade items and currency with each other,” said Salvino D’Armati, founder of a luxury fashion brand backed by Nouns DAO. “It was really fascinating to see how different items and currencies had different values based on scarcity and demand. I think that’s something that’s really important in the crypto gaming and NFT space as well — understanding how value is created and exchanged.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">At its most basic level, two RuneScape players choosing to trade with one another involves bartering over the exchange of a combination of goods and gold pieces (GP). In time, clusters of hundreds of players began forming in hotspots like Falador Park and a bank in the west of Varrock. Here, sellers would advertise their wares with colorful floating messages, while buyers hunted for a bargain.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The game even appealed to arbitrageurs, who made a living trading off price inefficiencies in these informal market hubs. (And while this happens in all sorts of markets, it may be worth noting that crypto arbitrageurs, too, have long made a killing trading off price inefficiencies between exchanges.) In RuneScape, this process is known as “merching.” Metav3rse’s Slocum, who played RuneScape from age seven up to 19 and would skip school “a few times a week” to stay up playing until 4 a.m., said merching taught players the basics of supply and demand. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The makers of RuneScape soon gave players a more efficient means of price discovery through the launch, in 2007, of the Grand Exchange, an automated trading system that gave buyers and sellers a way to post orders without interacting with other players directly, with prices varying based on supply and demand. As crypto Twitter <\/span><a href=\"https:\/\/twitter.com\/Cooopahtroopa\/status\/1429668205774065665?s=20&amp;t=HEaXmp_BSzJdAidc7NsXwA\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">puts it<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\">, the Grand Exchange became for RuneScape what OpenSea is to NFTs.&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“More than anything, RuneScape and its Grand Exchange showed that there is actual value in the time gamers put into the games they play and the associated rewards they gain,” said Sam Lehman, an investor at Symbolic Capital, <\/span><a href=\"https:\/\/www.theblock.co\/post\/165671\/polygon-and-cere-network-founders-launch-50-million-web3-fund\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">the $50 million web3 venture fund<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\">. “The concept is so inherent to web3 gaming it may sound obvious, but around the time of RuneScape it was a largely novel concept to let gamers sell, buy, and trade the items they earned in game.”&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Evidence for Lehman’s case — that players care about their stuff — may be found in the fact that RuneScape offers PIN-protected, in-game bank accounts in which gp and loot can be stowed. While such accounts may fall short of offering an immutable record of ownership, they’ve certainly proven somewhat durable. A player could be absent from the RuneScape for a decade and check in to find their estate just as they left it.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Similar marketplaces to RuneScape’s Grand Exchange have since emerged elsewhere in the gaming sector, Lehman added. One prominent example is the <\/span><a href=\"https:\/\/cs.money\/market\/buy\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">platform<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> on which players can trade skins used in Counter-Strike: Global Offensive. That Counter-Strike site deals in fiat money, however, meaning it’s more akin to a micro-transaction platform than an embedded exchange. There is a <\/span><a href=\"https:\/\/dmarket.com\/ingame-items\/item-list\/dota2-skins\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">similar site<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> for buying and selling Dota 2 skins, and many more besides. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">RuneScape’s marketplaces were unusual, though, in that they proved people place a value on in-game wealth <\/span><i data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">without<\/span><\/i><span data-contrast=\"none\" data-v-f87c67ca=\"\"> tying it to fiat money.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Web3 proponents argue that games such as these, whose players clearly value their loot, could be augmented through the introduction of blockchain technology.&nbsp;<\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">Slocum called RuneScape “the perfect example of an open world where you’re known for your avatar and digital footprint,” but added that it departs from the idea of a true metaverse because it lacks interoperability outside of Gielinor. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">With blockchain, players could in theory cash out of games they lose interest in, or even in time port items from that game into a wider gaming ecosystem. But the blockchain gaming faithful are going about realizing this vision backwards, according to Lehman and other experts in the field.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“The issue in applying this to web3 right now is that game makers are too focused on the economic side and start building out token models, exchanges, NFT items before actually having gameplay that’s engaging enough to create a sticky game people want to play and devote their time to,” Lehman said.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Crypto games are often bafflingly financialized from the outset. To the point, in some cases, that they appear to offer more in the way of financial apparatus — tools for staking, liquidity pools, token swaps and so on — than gameplay. Just visit <\/span><a href=\"https:\/\/defikingdoms.com\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">DeFi Kingdoms<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\">.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Aleksander Leonard Larsen, co-founder and COO of Axie Infinity developer Sky Mavis, thinks the rise of NFT and token sales as a funding method are to blame. “You have this new part of the games industry where you can tap into crowdfunding in a brand-new way, so you get a lot of amateur game developers,” he said.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Such developers tend to over-promise and under-deliver. After raising heaps of money through early token sales, they are then forced defend their token price while simultaneously wrestling with the reality that top-tier games take many years to deliver. There are <\/span><a href=\"https:\/\/www.theblock.co\/post\/177837\/sol-searching-after-halving-headcount-solchicks-creator-plows-on-with-new-p2e-platform\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">countless examples<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> in the crypto sector. Axie Infinity itself experienced a massive price spike in late 2021, in which its AXS token topped $160. Today, it trades at around $12. “It’s almost like you’re a public company from day one,” Leonard Larsen said.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Another issue for web3 game makers is how to infuse tokens into their games without becoming overwhelmed by mercenaries, who care more about financial rewards than the game itself. “It’s better to have an organic place where people meet, and even they might get a surprise drop or something like that, because then you might find the true believers who love your game,” Leonard Larsen said.&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">How, then, to make players love a game? If there’s a lesson for web3 to draw from RuneScape’s success, it’s surely that players didn’t value their treasures because of the game’s financial tools; financial tools were necessary <\/span><i data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">because <\/span><\/i><span data-contrast=\"none\" data-v-f87c67ca=\"\">they valued them.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Then again, there are many ways to value something. RuneScape players valued their loot, but not in the same way that they valued real-world money and possessions.&nbsp;Many fear that with fiat money at stake, levity will be lost from gaming. That’s part of the reason so many gamers have pushed back against plans from&nbsp;companies <\/span><a href=\"https:\/\/techcrunch.com\/2021\/11\/10\/discord-nfts-crypto-jason-citron\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">like Discord<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> to adopt web3 software.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Ancient8’s Xu likened it to playing poker. “Only when there’s a stake on the table, you have a stake in the game, then you start to play with a lot more strategy,” he said. “It enhances the experience to make it more intense or it creates a new experience for people.”&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">That may explain why the majority of web3 games, to date, offer relatively simple gameplay: they simply don’t need to do more to raise gamers’ pulses.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Yet promises of so-called “AAA” games abound in the crypto sector and a tidal wave of venture capital has been gambled on them coming true. For all the inspiration the sector draws from RuneScape and other category-defining games, then, can web3 produce one of its own?&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“For a lot of us RuneScape, Minecraft, World of Warcraft, or Grand Theft Auto was our starter metaverse.&nbsp;We didn’t call it that, living and being online wasn’t the point, the game was the point,” said Sino Global Games’ Anderson. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“We wanted to enjoy ourselves, and RuneScape provided — we met, gathered, explored, quested, achieved, skilled, killed, and died together in a world that was expansive enough to feel unending. That collective base layer for a metaverse, now we’re growing bigger and more encompassing.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sino Global Games","content":"ORGANIZATION"},{"type":"$12","content":"MONEY"},{"type":"Leonard Larsen","content":"PERSON"},{"type":"Diablo","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Halloween","content":"LOCATION"},{"type":"Alisha Anderson","content":"PERSON"},{"type":"Lehman","content":"LOCATION"},{"type":"Nouns DAO","content":"ORGANIZATION"},{"type":"Grand Exchange","content":"ORGANIZATION"},{"type":"Lehman","content":"PERSON"},{"type":"$160","content":"MONEY"},{"type":"RuneScape","content":"LOCATION"},{"type":"RuneScape’s Grand Exchange","content":"ORGANIZATION"},{"type":"Quinn Slocum","content":"PERSON"},{"type":"4 a.m.","content":"TIME"},{"type":"Anderson","content":"PERSON"},{"type":"Sino Global Games’ Anderson","content":"ORGANIZATION"},{"type":"Minecraft","content":"LOCATION"},{"type":"2001","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Symbolic Capital","content":"ORGANIZATION"},{"type":"Sam Lehman","content":"PERSON"},{"type":"Warcraft","content":"LOCATION"},{"type":"2007","content":"DATE"},{"type":"99.9%","content":"PERCENT"},{"type":"Jan. 15","content":"DATE"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Salvino D’Armati","content":"PERSON"},{"type":"twenty years later","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"NPC","content":"ORGANIZATION"},{"type":"Howard Xu","content":"PERSON"},{"type":"Mavis","content":"PERSON"},{"type":"$50 million","content":"MONEY"}],"hashtag":["PLAY2EARN"],"authors":["Ryan Weeks","The Block"]}