{"summary":"We view cryptoassets as digital money for the Digital Age. Bitcoin will be digital gold for the Digital Age, and it will have a place in most investor portfolios. Stablecoins will provide a new global money movement rail and will enable dollarization of much of the world. Crypto has enabled a great global casino for traders and speculators for the foreseeable future","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/73656\/jump-capital-crypto-theses","publishDate":"2020-08-02T10:53:30","id":9887,"type":null,"title":"The ascent of bitcoin and stablecoins: Jump Capital’s Mid-2020 Crypto Theses","category":["OP-ED"],"content":["<i data-v-f87c67ca=\"\">Peter Johnson is a principal at Jump Capital, where he leads their investments in the fintech and crypto sectors. Pete Mscichowski is an MBA venture associate intern for Jump Capital.<\/i>","At the start of the year we laid out our view on <a href=\"https:\/\/jumpcap.com\/blog\/why-2020-will-be-a-big-year-for-crypto\" data-v-f87c67ca=\"\">why we expect 2020 to be a big year for crypto<\/a>.","Much of that thinking still holds, but the world has changed a lot halfway through the year (a global pandemic, a market crash and rebound) so we thought it was a good time to collect our thoughts and articulate our core beliefs for bitcoin and cryptoassets over the next few years, and survey the most exciting investment areas and crypto business models we’re focused on here at Jump Capital.","We view cryptoassets as digital money for the Digital Age, and we find ourselves returning to three core beliefs about the space as we look out to what to expect over the next few years:","Here are the trends, catalysts, and potential we’re seeing for each.","<em data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">An Era of Stability, and Changing Times<\/b><\/em>","For centuries, people all over the world have sought out non-governmentally controlled stores of value to protect their wealth, mostly in the form of gold (though another recent example could include fine art).","Today, most of us in the US and developed world don’t feel the urgency of this need. We have lived in a remarkably peaceful and stable time over the past 40 years, with low inflation and a steady decline in interest rates, strong currency, and little major conflict. However, times are changing, and there are signs of increasing volatility and instability everywhere.","Countries around the world have seen increasing political instability, and in the past few months the US has seen the greatest social upheaval since the 1960s. In the wake of the COVID pandemic, major economies have implemented massive stimulus and increases to their monetary bases, pushing up already-high levels of debt. Whatever way you slice it – public, private, or household sector – the US debt is at some of the highest levels ever seen, all while millions of people are unemployed and supply chains around the world have been disrupted. We believe this sets up the coming years for the greatest likelihood of inflation or instability in decades.","It is also important to note that hyperinflation is not a prerequisite for people to seek out stores of value hedges like gold and bitcoin. Looking below at the chart showing what happened after the Financial Crisis in ’08 and the multiple rounds of QE that followed, gold outperformed stocks meaningfully in the 2008-2013 period, even as the blue line showing CPI inflation increased but never rose above 4%. A steady increase in inflation up to the 3-4% level would be a significant catalyst for increasing flows into stores of value like gold and bitcoin, and that type of increase doesn’t seem far-fetched given the recent surge in debt and money supplies.","","","<em data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">Top Global Macro Investors and Institutional Investors Buying BTC<\/b><\/em>","We are already seeing big name investors advocating for holding gold or bitcoin. Ray Dalio has prominently made the case for gold within the current macro backdrop, and more recently Paul Tudor Jones announced a significant position in bitcoin while laying out <a href=\"https:\/\/www.docdroid.net\/H1fuimX\/the-great-monetary-inflation-pdf\" data-v-f87c67ca=\"\">his thesis of “The Great Monetary Inflation”<\/a> as the reason for buying BTC futures to hedge against excessive government borrowing:","<i data-v-f87c67ca=\"\">“At the end of the day, the best profit-maximizing strategy is to own the fastest horse. Just own the best performer and don’t get wed to an intellectual side that might leave you weeping in the performance dust because you thought you were smarter than the market. If I am forced to forecast, my bet is it will be Bitcoin.” <\/i>","We believe an endorsement such as this from one of the all-time greatest macro investors can be a major catalyst as it helps remove some of the stigma of investing in this new asset class, and enables other up and coming portfolio managers to advocate for positions. Furthermore, we are already seeing data showing increasing open interest for CME bitcoin futures and record inflows into Grayscale’s Bitcoin Trust ETN – two of the most common vehicles for institutions to access BTC.","<em data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">Crypto Mass Market Adoption Emanating from Developing Markets<\/b><\/em>","It’s important to see top investors and institutions come into crypto, but the other key side here is mass market adoption.","Here, we need to look outside the US and developed economies for real usefulness. Crypto development has largely been US-centric, but the problems that BTC solves are not major pain points in the US. The USD is still strong and stable compared to most other currencies in the world; Visa, Venmo and PayPal work great at low cost, so it is easy for us to not understand the usefulness of bitcoin. The ‘usefulness’ of BTC is scarcity and censorship and seizure resistance, and these uses will be felt most strongly in developing markets with unstable monetary regimes and lack of trust in government and financial institutions – that is where we believe mass market crypto adoption will emanate from.","We are already seeing evidence of this, with peer-to-peer bitcoin exchange volumes in places like Africa and Latin America steadily growing over time in a way that is not fundamentally correlated to the price of Bitcoin:","&nbsp;","","","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Source: <\/span><a href=\"https:\/\/www.usefultulips.org\/index.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">UsefulTulips.org<\/span><\/a><\/em>","<em data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">Institutional Assessment of the Crypto Opportunity for a Non-Sovereign Store of Value<\/b><\/em>","Bitcoin’s market cap is around $200B today, but how much further could the market go and why invest today? John Pfeffer wrote the canonical case on the <a href=\"https:\/\/medium.com\/john-pfeffer\/an-institutional-investors-take-on-cryptoassets-690421158904\" data-v-f87c67ca=\"\">Institutional Investors Take on Cryptoassets<\/a> a few years ago which still frames up much of our view here.","If we want to know what to expect from a cryptoasset that serves as a non-sovereign controlled store of value, the best place to look is at the current technology fulfilling that role – gold. Today, there are roughly $2.6T in private gold bullion holdings and $2.1T in official government gold reserves. In the long run, we believe bitcoin’s market value could equal and potentially surpass the value of private gold holdings today, given the many advantages of BTC vs gold. We also believe bitcoin could serve some portion of the market for public gold reserves [1].","National treasuries may be slow to adopt crypto, but many governments have been trying to diversify their reserves and reduce their dependence on the US dollar – with the Chinese and Russian central banks most notably being big buyers of gold in recent years – and here again, cryptoassets have many advantages compared to gold (storage costs are much lower and crypto holdings are instantly verifiable). In a long run base case, we can imagine bitcoin serving 1x today’s private market value for gold holdings and perhaps ¼ of official gold reserves, which would equate to a total market potential of $3.1T, representing more than 15x upside to today’s ~200B market cap for bitcoin.","Furthermore, there are additional factors that could provide upside to this case. For one thing, since anyone in the world can easily access and store any quantity of crypto with nothing more than a phone and an internet connection, we could certainly imagine BTC expanding the market for private stores of value stocks. For another, the largest class of store of value holdings today are <a href=\"https:\/\/data.imf.org\/?sk=E6A5F467-C14B-4AA8-9F6D-5A09EC4E62A4\" data-v-f87c67ca=\"\">International Currency Reserves<\/a> with a value of ~$11.7T. As crypto continues to establish itself as a major global asset class, bitcoin could become an attractive alternative to many countries looking to diversify their reserves and minimize their dependence on the US dollar (and the control that comes with that). Many countries already hold a synthetic form of reserves in IMF SDRs, so how much of a stretch would it be to hold crypto?","There is real usefulness in a non-governmentally controlled store of value in a digital form, and the potential market for that kind of demand is likely to be huge under any set of assumptions. There are risks with crypto, but if it works it will be tremendously valuable. As investors look at this opportunity within the current macro backdrop, this risk reward skew of -1x vs 15x+ for bitcoin will make it an extremely attractive investment, which is why we believe BTC should be a part of every modern diversified portfolio – and over the next 10 years we expect it will be.","The biggest story in crypto in the last year has been the rise of US dollar-backed stablecoins, which have seen their total market value explode from ~$3B to nearly $12B, dominated by a handful of coins (notably, Tether on the unregulated USD stablecoin side and USD Coin on the regulated side).","Despite potential concerns about US monetary policy and debt levels, for billions of people around the world the USD is more stable than their local currency and is viewed as a safe haven – especially in developing countries. People want dollars. Evidence of this can been seen in the fact that of ~$1.9T in physical US currency, more than half at ~$1.1T is held abroad[2], or in the substantial size of the Eurodollar market, estimated at ~$13T[3]. Countries such as Ecuador have completely dollarized their monetary system in the past and Venezuela is moving toward dollarization today. Stablecoins will make it easier than ever for people to access dollars, enabling a dollar-based financial system for people in markets all over the world.","We believe US Dollar stablecoins, or crypto-dollars, may very well end up being the “killer app” for crypto. We would not be shocked to see the market value of stablecoins outstrip major cryptoassets like Ethereum or even Bitcoin in the coming years, and we may very well end up hearing calls for “Stablecoins not Bitcoin” in the same way we heard “Blockchain not Bitcoin” a few years ago.","Ultimately, we believe BTC and stablecoins will coexist in the same way the USD coexists with gold, but we are extremely bullish on the potential here and everything stablecoins open up in terms of payments, remittances and money movement. We believe the programmable nature of crypto – the ability to instantly transfer, settle and verify globally, 24\/7\/365 – combined with the stability of stablecoins will make them the global money movement rails of the future.","This takes us to our last “Core Belief” around speculation and crypto enabling a global casino.","Speculative trading has been the dominant use case for crypto so far, and there are several reasons for this. For one thing, if bitcoin\/crypto is going to become digital gold and digital money for the digital era, cryptoassets will need to massively increase in market capitalization for there to be enough liquidity to serve such a big use case – so there is an inherent “big bet” aspect to crypto. For another, the proliferation of new coins and derivative instruments has provided highly volatile assets which are extremely attractive and exciting for traders to trade. Moreover, the nature of many global crypto exchanges is that they are completely open to anyone with an email address and some crypto, enabling people from around the world to place their bets with little friction.","We are very bullish on crypto broadly – and on BTC as digital gold specifically – but we acknowledge that the technology is still new, it has much to prove, and is therefore fundamentally risky. Bitcoin is not digital gold yet, it is a bet that it will be in the future (this is why it should not be surprising to see BTC fall as it did during the recent COVID market panic, behaving like the risk asset that it still is). Until it becomes digital gold, we expect to see a lot of speculation, and we believe speculative trading will continue to be the largest market for crypto for the near future.","In trying to assess the potential for this use case, a good place to start is with the size of today’s gambling market, where the best estimates place the size of the total market for global gambling at ~$500b[4]. Furthermore, we can roughly estimate the size of annual global retail stock trading volume at ~$1.2T[5]. It is difficult to get a hard estimate of the size of the retail trading market, but the recent surge in volumes driven by discount brokers like Robinhood has clearly demonstrated the strong retail demand here. If crypto speculation can capture even a fraction of this speculative retail market, it would represent another large source of potential value for bitcoin and other cryptoassets.","<b data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Most Exciting Areas for Investment Opportunity<\/em> <\/b>","Given our three core beliefs...","...there are a few classes of business models we believe will accrue the most value that we are following closely.","These include:","This is by no means an exhaustive list of the types of companies and business models, but is meant to exemplify the types of businesses that currently align most closely with our core beliefs.","<em data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">Fiat Onramps<\/b><\/em>","We believe that this remains the most exciting area of investment opportunity, as these businesses are the key to all of the things we believe will happen (you have to be able to get your fiat into crypto for all of this to work), and these onramps are also a natural chokepoint in the stack that will be able to accrue value.","These onramps are often naturally coupled with the exchange businesses, which exhibit strong network effects due to liquidity needs and the positive feedback loop generated by liquidity. Today, trading of most developed asset classes like equities have consolidated to a handful of exchanges around the world, and while we expect the crypto landscape to end up in a similar place over time, for the foreseeable future we expect crypto exchanges to be built locally in most countries due to the high degree of variability in crypto regulations and varying ability for crypto companies to operate internationally. We expect these exchanges\/onramps will build moats in their local geographies based on four factors:","The onramp opportunities are most compelling in developing markets, the places where the crypto value proposition is strongest and where established players will have the most difficulty building themselves. What makes a country likely for crypto adoption and an attractive market for a fiat-onramp? We have looked at different regions all over the world and prioritized them based on several factors, including:","Layering these factors together, we generated a systematic list of the most compelling markets for crypto adoption and fiat onramp businesses and exchanges:","","","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Source: The World Bank – <\/span><a href=\"https:\/\/databank.worldbank.org\/reports.aspx?source=world-development-indicators\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DataBank: World Development Indicators<\/span><\/a><span data-v-f87c67ca=\"\">; <\/span><span data-v-f87c67ca=\"\">Gold data from <\/span><a href=\"https:\/\/www.gold.org\/goldhub\/data\/gold-supply-and-demand-statistics\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Gold.org<\/span><\/a><\/em>","Summarizing this list, we believe that some of the regions\/countries that offer the most compelling case for fiat\/crypto onramps include India, Latin America (Mexico, Brazil, Argentina), Southeast Asia (Indonesia, Philippines, Thailand, Vietnam, Malaysia), and Turkey.","<em data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">Cryptoasset Financial Infrastructure<\/b><\/em>","Many of our crypto investments at Jump Capital to-date have been in this realm of financial infrastructure – including digital asset custody and analytics – but there are still many areas that are particularly compelling, including:","<em data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">International Crypto Derivative Exchanges and CFD Brokers<\/b><\/em>","These types of business models are largely predicated on crypto being a new global, highly accessible market\/casino for speculators.","Crypto futures volumes on international derivative exchanges have surged recently, largely driven by a handful of large, established players that operate on a lightly regulated or unregulated basis. Today, much of this retail demand for crypto derivatives appears driven by regulatory arbitrage (anyone can sign up with just an email, no KYC\/AML) and access extremely high leverage (100x or more).","However, all signs point to crypto getting increasingly regulated over time, so we are most interested in regulated players (international derivative exchanges or CFD brokers offering crypto trading with leverage) that can serve this speculative use case for crypto in a more regulated future environment. Companies that can comply with regulations, connect with local banking systems, and best serve both speculators and those with real hedging needs, will be the players with the best eventual exit prospects and the businesses we are most excited about.","<em data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">Crypto Compliance Technology<\/b><\/em>","Some features of crypto inevitably lend themselves to fraud, scams and illicit activity. As crypto use and adoption continues, there will simply always be a need to be able to do blockchain forensics, transaction analysis, market surveillance, KYC\/AML, etc. – both by government bodies and financial institutions.","Additionally, an attractive feature of these business models is that they are not as driven by the price action of BTC. The leaders in the blockchain analytics space include Chainalysis, Elliptic and CipherTrace, but we also see opportunities for up and coming crypto compliance tech startups to break in and better serve the needs of some customers, particularly financial institutions.","We also see significant opportunities for compliance technology companies serving traditional financial institutions to succeed in the crypto market.","In summary, at Jump we are more confident than ever that the future is extremely bright for crypto - &nbsp;particularly for bitcoin, stablecoins, and trading. We are looking forward to continued investments across the industry and specifically in the areas of fiat\/crypto onramps, financial infrastructure, derivative exchanges, and compliance technology.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2.6","content":"MONEY"},{"type":"$2.1","content":"MONEY"},{"type":"4%","content":"PERCENT"},{"type":"IMF","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Malaysia","content":"LOCATION"},{"type":"1960s","content":"DATE"},{"type":"Global Macro Investors and Institutional Investors Buying BTC","content":"ORGANIZATION"},{"type":"Jump Capital","content":"ORGANIZATION"},{"type":"John Pfeffer","content":"PERSON"},{"type":"AML","content":"ORGANIZATION"},{"type":"$13T","content":"MONEY"},{"type":"Crypto Compliance Technology","content":"ORGANIZATION"},{"type":"Paul Tudor Jones","content":"PERSON"},{"type":"Crypto Opportunity","content":"ORGANIZATION"},{"type":"CFD Brokers","content":"ORGANIZATION"},{"type":"$500b","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Venmo","content":"PERSON"},{"type":"Chainalysis","content":"PERSON"},{"type":"Ecuador","content":"LOCATION"},{"type":"The World Bank – <\/span><a href=\"https:\/\/databank.worldbank.org\/reports.aspx?source=world-development-indicators\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DataBank","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"International Currency Reserves","content":"ORGANIZATION"},{"type":"Ray Dalio","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Pete Mscichowski","content":"PERSON"},{"type":"Africa","content":"LOCATION"},{"type":"Value","content":"ORGANIZATION"},{"type":"Investment Opportunity","content":"ORGANIZATION"},{"type":"Vietnam","content":"LOCATION"},{"type":"Turkey","content":"LOCATION"},{"type":"$1.1","content":"MONEY"},{"type":"$1.2","content":"MONEY"},{"type":"2013","content":"DATE"},{"type":"$3.1","content":"MONEY"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Indonesia","content":"LOCATION"},{"type":"$12B","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"$1.9","content":"MONEY"},{"type":"Philippines","content":"LOCATION"},{"type":"Argentina","content":"LOCATION"},{"type":"International Crypto Derivative Exchanges","content":"ORGANIZATION"},{"type":"T","content":"ORGANIZATION"},{"type":"$3B","content":"MONEY"},{"type":"$11.7","content":"MONEY"},{"type":"Peter Johnson","content":"PERSON"},{"type":"$200B","content":"MONEY"},{"type":"Venezuela","content":"LOCATION"},{"type":"Southeast Asia","content":"LOCATION"},{"type":"today","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"Mexico","content":"LOCATION"},{"type":"Cryptoasset Financial Infrastructure","content":"ORGANIZATION"},{"type":"2008","content":"DATE"},{"type":"next 10 years","content":"DATE"},{"type":"Thailand","content":"LOCATION"},{"type":"USD Coin","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Contributor Network","The Block"]}