{"summary":"Babel Finance suspended client withdrawals on Friday amid turbulence in crypto markets. \nThe Asia-based crypto financial services firm cited “unusual liquidity pressures.”","author":["Andrew Rummer","Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152677\/babel-finance-suspends-withdrawals-citing-unusual-liquidity-pressures","publishDate":"2022-06-17T07:18:13","id":989,"type":null,"title":"Babel Finance suspends withdrawals, citing &#x27;unusual liquidity pressures&#x27;","category":["Institutional Investors"],"content":["Babel Finance, the Asia-based crypto financial services firm, suspended client withdrawals five days after a <a href=\"https:\/\/www.theblock.co\/linked\/151522\/crypto-lending-firm-celsius-pauses-withdrawals-and-transfers-citing-market-conditions\" data-v-f87c67ca=\"\">similar move<\/a> by Celsius triggered a fresh bout of turbulence in crypto markets.&nbsp;","\"Due to the current situation, Babel Finance is facing unusual liquidity pressures,\" Babel said in a <a href=\"https:\/\/babel.finance\/article-views.html?id=50\" data-v-f87c67ca=\"\">notice<\/a> on its website on Friday. “During this period, redemptions and withdrawals from Babel Finance products will be temporarily suspended.”","A spokesperson for Babel said it's taking action to best protect the interests of clients. The firm promised a follow-up announcement once normal service has resumed.","Crypto markets were rocked at the top of the week as crypto lending platform Celsius halted withdrawals. This applied further downward pressure to crypto prices, amid a choppy macroeconomic backdrop as the Federal Reserve raised interest rates by three-quarters of a percentage point on Wednesday, the biggest hike since 1994.","Against this backdrop, crypto hedge fund Three Arrows Capital (3AC) was margin called this week and failed to meet its obligations, according to three people who <a href=\"https:\/\/www.theblock.co\/post\/152665\/ftx-deribit-bitmex-liquidated-three-arrows-capital\" data-v-f87c67ca=\"\">spoke<\/a> to The Block. As a result, there are fears of contagion for businesses with exposure to 3AC."],"hashtag":[]}