{"summary":"Lava Network has raised $15 million in seed funding and is offering reward points called Magma ahead of its mainnet launch in H1.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277605\/crypto-lava-network-funding-reward-points-magma","publishDate":"2024-02-15T10:00:02","id":9890,"type":null,"title":"Modular blockchain developer Lava raises $15 million, offering reward points called Magma","category":["DEALS"],"content":["Lava Network, a modular blockchain infrastructure developer, has raised $15 million in a seed funding round ahead of its mainnet launch.","Jump Capital, Hashkey Capital and Tribe Capital co-led the round, with North Island Ventures, Dispersion Capital, Alliance DAO, Node Capital, Finality Capital Partners, and others participating, Lava said Thursday. Unidentified executives from Celestia, Cosmos, StarkWare, Filecoin and other blockchain ecosystems also participated in the round, Lava added.","Lava was founded in 2022. The firm's CEO, Yair Cleper, said the seed round closed last December. He declined to comment on the structure of the round and valuation.","Lava is a <a href=\"https:\/\/www.theblock.co\/post\/270037\/the-block-researchs-analysts-2024-predictions\" data-v-f87c67ca=\"\">modular blockchain network<\/a> focused on providing data access through remote procedure calls (RPCs) and indexing. In web3, application developers need to make RPC requests to send and retrieve blockchain data, while indexing helps them get specific data from a blockchain network.","“Developers use Lava to retrieve and send blockchain data (‘access blockchains’),” Cleper said. “New chains and APIs are added permissionlessly to Lava, which means the network can dynamically and quickly support access to all of web3.”","Lava can be compared with the popular modular blockchain network <a href=\"https:\/\/www.theblock.co\/post\/260167\/modular-network-celestia-goes-live-on-mainnet\" data-v-f87c67ca=\"\">Celestia<\/a>, but the latter is focused on data availability, and the former is focused on data access, Cleper said. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe Lava network is currently in testnet. Last month, it launched an incentivized public RPC service on NEAR, Evmos, Axelar, and other blockchains and plans to add more chains in the near future.","Blockchain node operators join Lava and get rewarded for providing performant RPCs. “Rewards are distributed based on volume served and quality of service, i.e., speed, uptime, and accuracy, thereby optimizing performance for developers and users,” Cleper said.","Lava aims to launch its mainnet in the first half of this year. There are currently 26 people working for Lava, 20 of which are blockchain engineers, Cleper said, adding that the project is looking to hire more people.","Lava aims to introduce its modular approach to oracles, sequencing, and other blockchain data infrastructure in the future, serving as a \"permissionless everything store for any web3 service.\"","Ahead of its mainnet, Lava has today introduced a reward points program called Magma. Users can earn Magma points by switching their RPC connection to Lava, Cleper said. He declined to comment on whether Magma points will be redeemable for Lava’s own token in the future.","<a href=\"https:\/\/www.theblock.co\/post\/276219\/filecoin-protocol-glif-funding-reward-points-token\" data-v-f87c67ca=\"\">Points<\/a> are becoming increasingly popular among crypto projects to reward loyal users. Crypto projects have given out over 40 billion reward points so far, as The Block <a href=\"https:\/\/www.theblock.co\/post\/274587\/crypto-projects-40-billion-points?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">reported<\/a> recently.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"RPCs","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Tribe Capital","content":"ORGANIZATION"},{"type":"Hashkey Capital","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Evmos","content":"LOCATION"},{"type":"Lava","content":"LOCATION"},{"type":"Lava","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"Yair Cleper","content":"PERSON"},{"type":"Alliance DAO","content":"ORGANIZATION"},{"type":"Node Capital","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"RPC","content":"ORGANIZATION"},{"type":"Axelar","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Finality Capital Partners","content":"ORGANIZATION"},{"type":"Celestia","content":"LOCATION"},{"type":"North Island Ventures","content":"ORGANIZATION"},{"type":"Magma","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"Cleper","content":"PERSON"},{"type":"Dispersion Capital","content":"ORGANIZATION"}],"hashtag":["DATA PROVIDERS","DEVELOPER TOOLS","SEED &AMP; PRE-SEED","VALIDATORS"],"authors":["Yogita Khatri","The Block"]}