{"summary":"The European crypto lending platform has limited customers to maximum withdrawal limit of $5,000 per 24-hour period.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155779\/crypto-lender-coinloan-lowers-withdrawal-limit-citing-market-conditions","publishDate":"2022-07-04T16:45:42","id":9893,"type":null,"title":"Crypto lender CoinLoan lowers withdrawal limit citing market conditions","category":["LENDING"],"content":["CoinLoan, a platform that offers crypto-backed loans, says it has temporarily reduced the withdrawal limit for lenders amid the current market turmoil, the company <a href=\"https:\/\/coinloan.io\/blog\/temporary-change-in-withdrawal-limits\/\" data-v-f87c67ca=\"\">announced<\/a> on Monday.","The European crypto lender becomes the latest in the business to restrict withdrawals with several high-profile crypto businesses in <a href=\"https:\/\/www.theblock.co\/post\/155729\/voyager-digital-shares-drop-34-as-crypto-platform-limits-services\" data-v-f87c67ca=\"\">various forms of financial distress<\/a>. CoinLoan stated that the issues affecting the likes of Celsius, Voyager, BlockFi, and Three Arrows Capital have triggered a wave of withdrawals on its platform.","“The interest we pay on the Interest Accounts is yielded by issuing overcollateralized loans to other platform users. Hence in some instances, the estimated date of a complete withdrawal of assets from the Interest Accounts comes before, not after, loan closure,” CoinLoan stated in the announcement.","As such, the company has imposed the withdrawal limit \"in order to balance the flows of funds and prevent liquidity-related interruptions.\"","Customers are now restricted to a maximum withdrawal limit of $5,000 every 24 hours per today’s announcement.","CoinLoan distanced itself from the <a href=\"https:\/\/www.theblock.co\/post\/155578\/three-arrows-capital-files-for-chapter-15-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">contagion spreading<\/a> among crypto hedge funds and lending outfits. The platform stated that it had no exposure to Luna, staked ETH, or any of the affected firms adding that its policies prohibit investments in “risky activities.” CoinLoan also added that customer funds remain safe.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"Interest Accounts","content":"ORGANIZATION"},{"type":"$5,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Luna","content":"LOCATION"},{"type":"Voyager","content":"LOCATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}