{"summary":"It’s been an interesting year. We’ve been collectively holding our breath, waiting for the regulatory hammer to fall, and still waiting for that first","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51353\/nic-carter-on-what-2019-meant-for-crypto-and-what-2020-might-bring","publishDate":"2019-12-23T15:34:27","id":990,"type":null,"title":"Nic Carter on what 2019 meant for crypto and what 2020 might bring","category":["OP-ED"],"content":["It’s been an interesting year.","We’ve been collectively holding our breath, waiting for the regulatory hammer to fall, and still waiting for that first killer app.","We’ve been frustrated on both counts. Encouragingly, the industry has begun to acknowledge what really matters here, and the stakes of the game that we’re playing.","I don’t expect the road ahead to be easy. The sheer scope of malinvestment and opportunism has not yet subsided to pre-bubble levels. We are midway through a deleveraging, both financially, but also in terms of expectations. We still have some ways to go.","","","I expect the SEC will continue to find their teeth, building precedent on top of precedent.","As we saw with Shopin, they will likely keep referring criminal charges for issuers. A standard template will emerge: full rescission, fines, permanent bans from the securities industry. It’s possible that many issuers are waiting for the resolution of the Kik\/Kin case to make the final call.","If that case is decided in 2020, it could trigger an immediate wave of settlements.","Launching a presold base-layer protocol from scratch will prove virtually impossible. Some of the more high-profile sales will lobby intensely for a safe harbor, and they may even get it. This is one of the most permissive SECs in living memory, after all.","But the marginal projects will face the wrath of a securities regulator, which is well and truly sick of hearing about crypto. If I had to guess, I’d expect that the SAFT will finally be challenged. I am not sunny about its prospects.","The increased pressure on exchanges listing these assets will accelerate the die-off, as their liquidity is cut off.","","","In the last few months, former altcoin casinos-in-chief Binance and Poloniex have kicked U.S. traders off their platforms (although Binance did launch a neutered version for U.S. traders). Bitfinex has been geofenced for a while now. On the heels of a lawsuit, BitMEX may well become more strict about U.S. traders.","The honeymoon looks to be ending as exchanges servicing U.S. customers try to avoid the scrutiny of the dreaded quartet — the SEC, CFTC, FinCEN, and NYAG. It’s tough going out there.","It’s not just the Yanks, either. The U.K. just appointed crypto-skeptic Andrew Bailey to head the Bank of England. The FCA, which has in the past bleated about its commitment to innovation, looks to be souring on domestic crypto products. In the E.U., January 10 will mark the imposition of the grisly 5th Anti-Money Laundering Directive.","This confluence of events will see crypto exchanges come under pressure in Europe. Together with the SEC’s ever more austere attitude, by the end of 2020, the two largest global markets for capital may well effectively ban the long tail of cryptoassets. While crypto is a global market, capital is unevenly distributed. The exodus of U.S. and E.U. traders from these platforms will pressure the liquidity of coins that trade exclusively on the less-regulated exchanges. Korea and Japan alone are not sufficient to keep them ticking over.","The pariah exchanges will continue shuttling from jurisdiction to jurisdiction and hoping to avoid the long reach of the law. They can still function, lacking banking and a fixed headquarters thanks to the unstoppable liquidity engines that are Bitcoin and Ethereum. This gives them an ability to resist coercion that is rather unprecedented.","That said, the BTC-e case study is worth reflecting on. No matter where you are located, the U.S. probably has a way to sniff you out. I wouldn’t want to be running one of these bucket shops in 2020.","","","As it becomes entirely clear that the ICOs sold from 2014–19 were, for the most part, entirely without merit, scrutiny will expand from the issuers of these assets to their enablers.","Court cases bring discovery, and discovery surfaces unpleasant information about the entities profiting from and facilitating these launches. Some of the class actions will shine a light on the funds that made a good living flipping ICOs to retail. Many funds acted as effective underwriters\/issuers of these tokens, by buying early allocations, marketing the tokens to the public, and exiting the position in the public sale. These could well constitute rule 144 violations.","This behavior has gone generally overlooked so far, but if the SEC chooses to expand its appetite, those subpoenas might well turn into enforcement actions. Even high profile venture funds were not above this behavior. It’s no secret that many VCs encouraged failing portfolio companies to raise nondilutive capital from retail investors to stay in business.","If the scale of their involvement in some of these meritless issuances becomes known, they could incur reputational black eyes, not to mention potential legal consequences.","","","Some of the most popular assets in the last 18 months have been cashflow derivatives; that is, tokens which derive their value from some stream of cashflows.","MKR’s value derives in part from the automated buy-and-burn functionality that gradually contracts the supply of the asset, financed by fees that the protocol spits off.","Similarly, Binance offers owners of BNB an informal commitment to plough some of their exchange revenues into a (purported) buyback. Following the success of BNB, many other exchanges dreamed up their own cashflow tokens.","While these have done fairly well, especially as ‘commodity’ cryptoassets and utility tokens sold off over the last year, holders came to realize that the buyback model wasn’t really akin to a stock buyback. Reducing the float of an arbitrary token with no ultimate claim on the assets of the company doesn’t really constitute a capital return to tokenholders. And, in a move reminding us why corporate governance exists, Binance unilaterally altered the language in the white paper where they specified their obligation towards BNB holders.","Issuers have historically been leery about building in genuine cashflow-backing into their assets. This has been borne out of the somewhat utopian desire to avoid securities regulation.","As I wrote in my&nbsp;<a class=\"bv dh ht hu hv hw\" href=\"https:\/\/coinmetrics.io\/papers\/dissertation.pdf\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-v-f87c67ca=\"\">master’s thesis<\/a>&nbsp;three years ago:","ICO promotion is a game of brinksmanship between convincing investors that the tokens sold will endow them with rights to use and profit from the network, and convincing regulators that the tokens do not represent securities. It may ultimately prove to be an impossible balancing act.","Of course, the halcyon days of spotty enforcement are coming to an end. Now that it’s quite clear that issuing pseudo-equity to a retail audience is generally&nbsp;<em class=\"ia\" data-v-f87c67ca=\"\">verboten&nbsp;<\/em>in most sensible jurisdictions<em class=\"ia\" data-v-f87c67ca=\"\">,&nbsp;<\/em>the stragglers still experimenting with token models will consider biting the bullet and issuing strongly codified tokens.","In the U.S. this will mean more legal offerings under the aegis of the SEC. Issuers will understand that they have a formal obligation to tokenholders, instead of a loosely defined, informal one. I expect to see some creativity here.","I’d like to see tokens offering investors specific assurances as to their place on the capital stack, genuine dividends (not just insipid buy-and-burn models, which are NOT equivalent), and perhaps some other more creative obligation — bonus points if it’s uniquely enabled by the blockchain™.","There’s a lot that can be done here if issuers understand that they are creating something tantamount to equity.","","","As the realization slowly sinks in that there is no demand for many of these ‘feature chains’, users and service providers will refocus on the blockchains with actual usage.","If usage picks up on Bitcoin once again, exchanges will be ready. Many of them have integrated with settlement platforms like Liquid, which better suited to trust-minimized inter-exchange settlement than systems like Lightning.","Traders may well come to appreciate Liquid’s advantages. Confidential assets means WhaleCalls can’t broadcast your inbound USDT deposits to all of Crypto Twitter. Who likes being frontrun? Additionally, many traders and arbitrageurs used chains like Litecoin and Ripple as emergency spillways when Bitcoin fees climbed in late 2017.","By using a sidechain like Liquid, traders can avoid the complication of moving into another asset to circulate funds. I know Liquid has seen scant usage so far, but it could well become relevant if fees ever rise on Bitcoin once again. By periodically settling transfers on a bilateral basis with a sidechain like Liquid, exchanges could pass fee savings on to their users.","Granted, this looks like a reach given Liquid’s minimal uptake. I would expect that it will take a catalyst like rising fees to push users into cheaper blockspace — but this time, instead of other chains, it could well be a sidechained variant of Bitcoin.","","","Many of the early exchanges covered the full stack of brokerage, order matching, and custody simply because they were rebuilding the financial system from scratch. A decade into the crypto phenomenon, providers of this financial infrastructure have begun to specialize. While some exchanges like Coinbase still aim to remain vertically integrated, specialization is rapidly becoming the norm.","This would mirror the development of mature equity markets. Already, clear delineations are emerging between brokers like River Financial, dedicated exchanges like Bakkt and ErisX, and custodians like BitGo or Fidelity Digital Assets. It makes more sense for these competencies to be split up.","It’s unlikely that the best customer service organization is also the most secure custodian.","","","Several commentators have noted how odd it is that issuers of fiat-backed stablecoins like USDC have, thus far, managed to convince regulators that a state of blissful ignorance about the internals of the transactional graph was sufficient.","I’m no statist — I believe firmly in cash, and the right to transactional privacy — but I have been shocked at the persistence of this apparent regulatory loophole. Can stablecoin issuers really KYC the edges of the network and ignore the internals? The policy so far seems to be: don’t ask (users), don’t tell (regulators).","Analysing the chain doesn’t help much either. USDC (or USDT, or TUSD, and so on) transactions don’t come with metadata. Is it possible that stablecoin issuers retain the ability to administer these networks without making meaningful efforts to police their actual usage? I have a hard time believing that. If I had to guess, 2020 will be the year in which FinCEN and the alphabet soup agencies start asking some really nasty questions of the various stablecoin issuers. From there, it’s anyone’s guess.","The grey market issuers like Tether could well be the beneficiaries of a situation like this. If they survive their feud with the NYAG.","","","It’s sometimes said that the creators of blockchain games forgot the first rule of games, which is that they<em class=\"ia\" data-v-f87c67ca=\"\">&nbsp;have to be fun<\/em>. OK, that’s seldom said. But it’s quite true. Blockchaining a game doesn’t an enjoyable game make. They must stand on their own two feet.","In 2020, several high-profile game studios will launch games which have some blockchain element — perhaps a natively integrated marketplace, or genuine ownership of in-game items. These experiences will be seamless. Users may not know that their assets are registered on chain. Enough talent has worked on this theme for enough time that some of the game experiences will be genuinely fun.","But this doesn’t work for all games. They don’t all deserve an open-loop marketplace. Indeed, most games actually suffer if you add one. The most natural candidates for the financialization that on-chain elements grant you will be game types which are already somewhat marketplace-driven in the first place. Collectible card trading games — where players are perfectly used to the idea of trading card packs — make sense here.","I’d expect to see some successful launches in this category in the next year.","Some of you may find my prognostications too dark. If this is the case, it’s because the prospects for many segments of the “crypto industry” are, indeed, rather grim. But these reckonings are healthy overall. An excess of utopianism and opportunism accumulated over the last few years, and we are just now getting around to scrubbing the stains out of the carpet.","It’s not the most pleasant experience, but it has to be done.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"E.U.","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"last 18","content":"DATE"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"January 10","content":"DATE"},{"type":"Kik\/Kin","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"USDT","content":"ORGANIZATION"},{"type":"NYAG","content":"ORGANIZATION"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"Shopin","content":"PERSON"},{"type":"Japan","content":"LOCATION"},{"type":"Andrew Bailey","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"SAFT","content":"ORGANIZATION"},{"type":"Litecoin","content":"PERSON"},{"type":"River Financial","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Nic Carter","The Block"]}