{"summary":"Crypto bills faces some major headwinds in 2024 and pushback from some lawmakers who are concerned that some of the bills don&#x27;t go far enough.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266114\/legislative-outlook-what-headwinds-does-crypto-legislation-face-in-2024","publishDate":"2023-12-25T16:01:21","id":9902,"type":null,"title":"Legislative outlook: What headwinds does crypto legislation face in 2024?","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Cryptocurrency legislation faces some major headwinds in 2024 including an upcoming election season, potential opposition from Securities and Exchange Commission Chair Gary Gensler, and pushback from some lawmakers who are concerned that some of the bills don't go far enough to regulate the sector.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Crypto had a wild year from the criminal trial of former FTX CEO Sam Bankman-Fried and charges against multiple exchanges to some wins in the court for the industry, the downfall of former Binance CEO Changpeng Zhao and excitement for a spot bitcoin exchange-traded fund. Going into 2024, lawmakers likely have all that in mind as they work on legislation to reign in the industry.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The focus has been largely on two Republican-led bills over the past year. One bill wants to regulate stablecoins on the federal level while the other takes a comprehensive approach to crypto's market structure. Both bills passed out of the House Financial Services committee led by Chair Patrick T. McHenry, R-N.C., in July, but would need to be brought to the Senate Banking Committee, which could prove to be a challenge next year.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Banking has been a tough nut to crack,\" said Sen. Cynthia Lummis, R-Wyo., a member of the Senate Banking Committee, in November during a panel at the Blockchain Association Policy Summit. \"It is a committee that advances very little legislation and has been reticent in the area of financial assets that are digitally based.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Chair McHenry, who is viewed as instrumental in pushing the stablecoin and market bill forward, recently announced he planned to <a href=\"https:\/\/www.theblock.co\/post\/266168\/crypto-friendly-rep-patrick-mchenry-wont-be-seeking-re-election\" data-v-f87c67ca=\"\">retire<\/a> at the end of his current term in early 2025, which could have an effect on the bills' passage.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Stablecoins could come up early in 2024, Lummis added. Stablecoin legislation was ultimately advanced out of the House Financial Services Committee in July, but hit a snag with blame put on the White House's opposition to the bill. At the time, former House Financial Services Committee Chair Maxine Waters, D-Calif., said the bill was \"deeply problematic\" due to a<\/span><span class=\"s2\" data-v-f87c67ca=\"\"> <a href=\"https:\/\/www.theblock.co\/post\/241749\/us-stablecoin-talks-stall-as-senior-house-republican-blames-white-house\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">provision<\/span><\/a> that allows state regulators to approve stablecoin issuances without Federal Reserve input.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Sen. Kirsten Gillibrand, D-N.Y., who was on the Blockchain Association panel with Lummis in November, said she spoke with Rep. Waters weeks ago to hear about her concerns and areas of the bill that worked.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"So we feel we got to a very good place,\" Gillibrand said In November. \"The House will still have to do their own work, but I at least had the benefit of getting to hear from Ranking Member Waters about what her biggest concerns were, what her goals were and I felt like we got to a very positive ending of that first meeting.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Waters is pivotal for passage of the stablecoin bill. If she ends up supporting the bill, that would then give the greenlight to Senate Banking Committee Chair Sen. Sherrod Brown, D-Ohio, to take up the bill, said Cody Carbone, <\/span><span class=\"s2\" data-v-f87c67ca=\"\">vice president of policy for the Chamber of Digital Commerce.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">However, Securities and Exchange Commission Chair Gary Gensler's view on stablecoins could prove to be another hurdle, Carbone said. Gensler has previously compared stablecoins to money market funds and has said dollar-pegged stablecoins could fall under his agency's jurisdiction, according to news reports.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"He [Gensler] is very, very close with Sherrod Brown,\" Carbone said. \"He is very, very close with Elizabeth Warren. I could see them saying okay, the SEC doesn't like this, we're not going to support it. Now does that stop it from moving forward, I don't know.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">When asked for a percentage on how likely the stablecoin bill will pass in 2024, Carbone put it at 60 percent. Ron Hammond, <\/span><span class=\"s2\" data-v-f87c67ca=\"\">director of government relations at the Blockchain Association, put that figure at about 75 percent.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It might be different from what we're seeing now but I think there is going to be some version of a stablecoin bill passed out of Congress in 2024,\" Hammond said. \"It could look very, very different depending on the vehicle.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The likelihood of passing the Financial Innovation and Technology for the 21st Century Act, which takes a comprehensive approach to regulating crypto at large, could prove to be tricky. The bill would seemingly shift more responsibility over to the Commodity Futures Trading Commission and directs <\/span><span class=\"s2\" data-v-f87c67ca=\"\">regulators to create a clear pathway for a digital asset to transition from being a security investment to a commodity.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Hammond said passage of that bill in some shape or form in 2024 had a 25 percent chance, due in part to likely SEC pushback, Waters' past opposition to it and Brown's silence on the issue.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Carbone declined to put a percentage on the bill's passage.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I think that one just faces a stronger uphill battle. Even though six Democrats came out and supported that bill, there is significant pushback from the SEC, who views it as limiting their jurisdiction,\" Carbone said. However, if the SEC faces pushback in the courts, that could cause Democrats to turn and drive momentum for the bill, he added.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC faced a <a href=\"https:\/\/www.theblock.co\/post\/239559\/sec-faces-wake-up-call-after-ripple-ruling-though-appeal-likely\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">partial<\/span><\/a> defeat in its case against Ripple over the summer and a judge ruled in a separate case where judges sided with <a href=\"https:\/\/www.theblock.co\/post\/258767\/us-court-confirms-grayscale-ruling-says-sec-must-re-review-bid-for-spot-bitcoin-etf\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">Grayscale<\/span><\/a> over its bid for a spot bitcoin exchange-traded fund.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lummis predicted \"substantive legislation\" to come out of 2024, when asked about the prospects of her own Responsible Financial Innovation Act, along with other potential crypto bills. One of the catalysts for that legislation could be the launch of spot bitcoin ETFs, which traditional finance has been actively involved in, if they are approved by the SEC early next year.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Multiple asset managers have been <a href=\"https:\/\/www.theblock.co\/post\/235753\/wisdomtree-invesco-and-blackrock-are-now-all-gunning-for-a-bitcoin-etf\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">vying<\/span><\/a> for a spot bitcoin ETF including WisdomTree, Invesco, Fidelity and BlackRock. The applications need the SEC's approval, and the regulator has yet to sign off on any spot crypto ETF.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lummis said some of her colleagues say they don't see a legitimate use case for digital assets, and only see an illicit use case. But a spot bitcoin ETF could dampen these criticisms.<br data-v-f87c67ca=\"\">\n<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I think it will sort of assuage some of the fears of those who think there's only an illicit use and make them look at this asset class again,\" Lummis said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lawmakers will also bring up SAB 121 next year after the Government Accountability Office said in October that the guidance needs to, by law, go in front of Congress before it can become effective.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC's Staff Accounting Bulletin No. 121, or SAB 121, was issued in March 2022 and requires firms that custody crypto to record customer crypto holdings as liabilities on their balance sheets.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The bulletin is subject to the Congressional Review Act, which requires that before a rule can go into effect, agencies have to submit a report on the rule to Congress, the congressional watchdog said on Tuesday. The CRA, enacted in 1996, aims to bolster congressional oversight of agency rulemaking.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Congress would then have the ability to review and disapprove the rules over a 60 day stretch, according to the GAO.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Elections can be good or bad for crypto legislation, the Chamber of Digital Commerce's Carbone said. It could be bad for legislative debate since lawmakers won't be readily in Washington and focus will be on getting re-elected, he said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It can be a good thing because people are outside of D.C. and maybe things can slip in where people weren't paying attention,\" Carbone said. Elections also raise awareness for crypto-related issues, he said, as even presidential candidates such as Republican Vivek Ramaswamy and Independent Robert F. Kennedy Jr., who have both been vocal in their support for crypto.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Do I think that they're going to be on the ballot in November, no,\" Carbone said.&nbsp; \"But like they're coming out with crypto plans, which is wild to say that a presidential candidate is coming out with a crypto plan even if they don't have a chance.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">There won't be a lot of attention to passing legislation, he added, which could empower federal agencies to fill the void through rulemakings and more enforcement actions.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Rep. Waters did not respond to a request for comment.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Sen. Brown, who is up for re-election in 2024, said a framework is needed for crypto that protects the economy — and shouldn't be written by the industry. The crypto industry notably hit a new record for federal lobbying spending in 2023, according to <a href=\"https:\/\/www.reuters.com\/business\/finance\/us-crypto-industry-lobby-spending-track-new-record-2023-2023-12-05\/#:~:text=Crypto%20companies%20spent%20%2418.96%20million,been%20a%20top%2Dten%20spender.\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">Reuters.&nbsp;<\/span><\/a><\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“After holding numerous hearings on crypto, it’s clear: the last thing we need is for the crypto industry to write their own rulebook — too many Ohioans have been burned by fraud and scams,” said Brown in an emailed statement. “We need a framework of rules for crypto that protects our economy and protects Ohioans’ hard-earned money from abuses.”<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Grayscale","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Sherrod Brown","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Robert F. Kennedy Jr.","content":"PERSON"},{"type":"Hammond","content":"PERSON"},{"type":"Brown","content":"PERSON"},{"type":"Ron Hammond","content":"PERSON"},{"type":"Kirsten Gillibrand","content":"PERSON"},{"type":"Carbone","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Ranking Member Waters","content":"ORGANIZATION"},{"type":"House Financial Services","content":"ORGANIZATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"2025","content":"DATE"},{"type":"N.Y.","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Blockchain Association Policy Summit","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"Vivek Ramaswamy","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Wyo.","content":"LOCATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Patrick T. McHenry","content":"PERSON"},{"type":"60 percent","content":"PERCENT"},{"type":"GAO","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"CRA","content":"ORGANIZATION"},{"type":"Senate Banking Committee Chair","content":"ORGANIZATION"},{"type":"SAB","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"D.C.","content":"LOCATION"},{"type":"McHenry","content":"PERSON"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"Financial Innovation","content":"ORGANIZATION"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"White House","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Lummis","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"House Financial Services Committee Chair Maxine Waters","content":"ORGANIZATION"},{"type":"Gensler","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Government Accountability Office","content":"ORGANIZATION"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"Cody Carbone","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Ohio","content":"LOCATION"},{"type":"1996","content":"DATE"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Calif.","content":"LOCATION"},{"type":"75 percent","content":"PERCENT"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Gillibrand","content":"PERSON"},{"type":"The House","content":"ORGANIZATION"},{"type":"25 percent","content":"PERCENT"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}