{"summary":"The simple power of Square Jack Dorsey&#x27;s Square has always been a brave and innovative company, focused deeply on simplicity of product and design as a","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/1020\/square-is-the-most-important-us-cryptocurrency-company","publishDate":"2018-10-01T16:27:25","id":9904,"type":null,"title":"Square is the most important US cryptocurrency company","category":["STARTUPS"],"content":["Jack Dorsey's Square has always been a brave and innovative company, focused deeply on simplicity of product and design as a core part of the DNA. Founded in February 2009, Square's first product was a gorgeous, square-shaped dongle that instantly turned a smartphone into a merchant credit card processing machine.&nbsp;Square has taken a methodical approach to growing its core business, moving from individuals to small businesses to medium sized firms over the past decade.","In 2013, Square introduced an iPad-based product, Square Stand, aimed at coffee shops and other small retailers. This hardware solution enables&nbsp;an&nbsp;iPad&nbsp;to&nbsp;be&nbsp;used&nbsp;as&nbsp;a&nbsp;payment&nbsp;terminal&nbsp;or&nbsp;full&nbsp;point-of-sale&nbsp;solution. And in 2017, the company introduced Square Register, an all-in-one&nbsp;offering&nbsp;that&nbsp;combines hardware,&nbsp;point-of-sale software, and&nbsp;payments&nbsp;technology. Today, Square's large-business customers account for nearly 50% of total payment volume, a vast difference from the company's early roots. Square's focus on simplicity of design and gradually moving into new customer segments has helped to spawn an empire that served more than <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2016-03-09\/square-revenue-tops-analysts-estimates-on-strong-growth\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">2 million merchants<\/a> by 2016 and serves ~30% of independent businesses that accept credit cards in the US.","In addition to increasing the merchant segments it serves, Square has also methodically expanded product offerings beyond payment processing. Square's oft-stated ambition is to be the \"operating system for small and medium sized businesses.\" To that end, it has introduced products such as Square Capital (funding to help businesses grow) as well as software for invoices, payroll, appointments, location and inventory management, CRM\/marketing tools, and more. <a id=\"jump\" data-v-f87c67ca=\"\"><\/a>Today, a company can run much of its operations on Square hardware and software.&nbsp;","At the same time Square has grown its merchant business, the company has acquired&nbsp;\"<a href=\"https:\/\/s21.q4cdn.com\/114365585\/files\/doc_financials\/2017\/2Q17\/SQ-2017-Q2-Shareholder-Letter.pdf\" data-v-f87c67ca=\"\">more than 90 million unique customer profiles<\/a> with an associated email address or phone number.\" Square&nbsp;has cleverly utilized consumer-facing services including <a href=\"https:\/\/www.trycaviar.com\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Caviar<\/a>&nbsp;food delivery and person-to-person payments product&nbsp;<a href=\"https:\/\/cash.app\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Cash App<\/a> -- as well as a tightly integrated merchant loyalty program -- to develop a massive list of consumer profiles that can be used both by merchants and Square itself. Just as their merchant products are designed with powerful simplicity at their core, so too are the consumer-facing products.","The common theme is that Square has methodically grown a monster consumer business with simple, powerful products and tight integration with its core merchant systems. While Square's website lists dozens of individual software products, hardware products, and business solutions [see image below], they tie together seamlessly into a handful of easy-to-use merchant and consumer interfaces. As a result, Square now has a&nbsp;powerful two-sided marketplace that gives Square many opportunities to introduce new products that can interact with both their consumer and merchant base.","","","&nbsp;","Square's success on both the merchant and consumer front has led to explosive growth in the company's stock price. $SQ has appreciated from $9 at its IPO to more than <a href=\"https:\/\/finance.yahoo.com\/quote\/SQ?p=SQ&amp;.tsrc=fin-srch\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">$97 as of October 2018<\/a>. This nearly 11x growth has created a financial powerhouse with a market cap of nearly $40 billion that many believe will challenge powerhouses like the \"Big Banks\" and PayPal in the coming decade. Unlike the more conservative PayPal or the heavily regulated Big Banks, Dorsey's Square can deliver startup-like innovation that merchants and consumers desire in near real time -- as they have far fewer incentives to preserve cash flow from expensive legacy business models.","Due to its powerful network built over nearly a decade and strong financial position, Square is in the driver's seat when it comes to introducing products to the US, where <a href=\"https:\/\/s21.q4cdn.com\/114365585\/files\/doc_financials\/2017\/4Q17\/Square_10K_2017.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">95%+ of Square's revenue is generated<\/a>. Thus, it is a huge boon to the cryptocurrency ecosystem that Square CEO Dorsey told The Times in March 2018, <em data-v-f87c67ca=\"\">\"The world ultimately will have a single currency, the internet will have a single currency. I personally believe that it will be bitcoin ... probably over ten years, but it could go faster.\"&nbsp;<\/em>Dorsey's proclamation is backed up by the company's activities on both the merchant and the consumer side.","On the merchant side, <a href=\"https:\/\/www.ccn.com\/bitcoin-accepted-everywhere-square-wins-patent-for-cryptocurrency-payment-network\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Square has patented a process<\/a> by which bitcoin or any other cryptocurrency may be accepted by a merchant, who could then choose to cash out in their chosen currency. Per the filing:","<em data-v-f87c67ca=\"\">“The disclosed technology addresses the need in the art for a payment service capable of accepting a greater diversity of currencies ... including virtual currencies including cryptocurrencies (bitcoin, ether, etc.) ... than a traditional payment system in a transaction between a customer and a merchant, and specifically for a payment service to solve or ameliorate problems germane to transactions with such currencies. Specifically, the payment service described herein can facilitate real-time (or substantially real-time) transactions, allowing a customer to pay in any currency of their choice, while the merchant can receive payment in a currency of their choice.”<\/em>","Square's technology, as described in the patent filing, would allow this process to occur at speeds comparable to credit card processing.&nbsp;That has been a major sticking point in the usage of cryptocurrency as a method of payment thus far. As impressive as the proposed technology itself is Dorsey and Square's stated commitment to continuing to develop cryptocurrency products. Per Dorsey, on Square's Q1 conference call, <em data-v-f87c67ca=\"\">\"We do believe that this is a transformational technology for our industry, and we want to learn as quickly as possible.\"&nbsp;<\/em>With a built-in merchant base of more than 2 million customers, the payments technologies that Square introduces have an immediate material impact on the market -- as their efforts with Cash App have demonstrated.","On the consumer side, Cash App is an absolute juggernaut, having overtaken Venmo and PayPal as the most downloaded finance app in the App Store. Cash App boasted more than <a href=\"https:\/\/www.recode.net\/2018\/2\/27\/17059182\/square-cash-app-monthly-active-users-customers-seven-million-december-venmo\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">7 million users<\/a> in December 2017 alone and is reported to have been downloaded more than <a href=\"https:\/\/www.cnbc.com\/2018\/08\/14\/square-poised-for-further-upside-as-cash-app-overtakes-venmo.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">33 million times<\/a>. The rise of Cash App and its impact on the company's stock price has coincided with the introduction of cryptocurrency to the app. Square announced in 2017 that they would allow users of Cash App to buy and sell bitcoin and introduced the feature in early 2018. By Q2 2018, Cash App had more than <a href=\"https:\/\/www.coindesk.com\/square-sees-profits-from-bitcoin-sales-double-in-q2\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">$37 million in cryptocurrency revenue<\/a>, 6% of the company's total. Square even went through the arduous process of <a href=\"https:\/\/www.reuters.com\/article\/us-cryptocurrencies-square\/square-obtains-ny-state-cryptocurrency-license-idUSKBN1JE1U6\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">securing a BitLicense <\/a>to operate in New York state and in June became only the 9th company to secure the license since 2015. The effort to operate in all 50 states shows a company very committed to growing its cryptocurrency footprint amongst US consumers.","While there are a few high profile US companies offering crypto services to consumers (Coinbase Consumer, Robinhood) and a few much smaller merchant efforts (Shopify, Coinbase Commerce, BitPay), no other company can catalyze US cryptocurrency adoption like Square can (other than two \"little\" Seattle-based firms that, an e-commerce operation and coffee joint you may have have heard of.)","Square is a public company that is led by a visionary founder in Jack Dorsey with unrivaled pure-play payments scale and a much smaller \"strategy tax.\" It has little legacy revenue from suboptimal business models to protect than rivals. There is no other financial services company in the US quite like Square, which seems to be executing even better as time passes and the product set grows. What better way to cement a differentiated business model far into the future than to develop a merchant cryptocurrency-payments network and a more substantial cryptocurrency consumer offering in Cash App. The cost savings and closed loop nature of the economic activity due to Square's ever-growing footprint could lead to a comprehensive payments network unlike anything the US has ever seen. At least since a half century ago in the early days of BankAmericard, which most of you know better by its current name: Visa.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$SQ","content":"MONEY"},{"type":"$97","content":"MONEY"},{"type":"6%","content":"PERCENT"},{"type":"2015","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"February 2009","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Square","content":"ORGANIZATION"},{"type":"Coinbase Commerce","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"December 2017","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"$9","content":"MONEY"},{"type":"March 2018","content":"DATE"},{"type":"a half century ago","content":"DATE"},{"type":"Dorsey","content":"PERSON"},{"type":"Seattle","content":"LOCATION"},{"type":"Square Stand","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"October 2018","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Cash App","content":"ORGANIZATION"},{"type":"$37 million","content":"MONEY"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"95%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Robinhood)","content":"ORGANIZATION"}],"hashtag":["PAYMENTS"],"authors":["Mike Dudas","The Block"]}