{"summary":"Now both the ruling and opposition political parties of South Korea are promising to allow spot bitcoin ETFs ahead of the upcoming election.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278170\/south-korea-opposition-bitcoin-etf","publishDate":"2024-02-20T06:06:50","id":9915,"type":null,"title":"South Korea’s opposition party vows to endorse spot bitcoin ETFs: report","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">South Korea’s opposing Democratic Party is pushing to allow local citizens to invest in spot bitcoin exchange-traded funds and enable financial institutions to launch their spot bitcoin ETFs, local news media reported Tuesday.<\/span>","<span data-v-f87c67ca=\"\">The party is pledging to allow investors to purchase spot bitcoin ETFs through their individual savings accounts, according to a Seoul Economy Daily <\/span><a href=\"https:\/\/www.sedaily.com\/NewsView\/2D5FN9Y550\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report<\/span><\/a><span data-v-f87c67ca=\"\">. An ISA is an all-in-one account for various investments in funds or equity-linked securities, which also offers tax exemptions to financial profits of up to two million Korean won ($1,497).<\/span>","<span data-v-f87c67ca=\"\">With the news, both ruling and opposing political parties have now <\/span><a href=\"https:\/\/www.theblock.co\/post\/277996\/south-koreas-ruling-party-spot-bitcoin-etf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reportedly taken on<\/span><\/a><span data-v-f87c67ca=\"\"> opening up spot bitcoin ETF investments and product launches in South Korea as one of their main pledges ahead of the general election on April 10.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Last month, the country’s <\/span><a href=\"https:\/\/www.theblock.co\/post\/272208\/south-koreas-samsung-securities-mirae-asset-suspend-foreign-spot-bitcoin-etfs-amid-regulatory-warning\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">financial regulator reiterated its ban<\/span><\/a><span data-v-f87c67ca=\"\"> restricting financial institutions from launching any kind of cryptocurrency ETFs. Local investors are currently restricted from investing in spot crypto ETFs, while foreign crypto futures products remain available.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A member of the Democratic Party reportedly said that it may take legislative measures to revise the existing financial regulations to accommodate spot bitcoin ETFs if the country’s financial authorities decide to oppose the authorization of the products, Seoul Economy Daily reported.<\/span>","<span data-v-f87c67ca=\"\">Other election promises from the opposition party shadowed those prepared by the ruling party, as reported a day earlier, including lifting the ban on institutions from directly investing in crypto and raising the threshold for the <\/span><a href=\"https:\/\/www.theblock.co\/post\/277963\/south-koreas-ruling-party-mulls-crypto-tax-delay\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">scheduled tax on crypto gains<\/span><\/a><span data-v-f87c67ca=\"\"> from 2.5 million won to 50 million won.<\/span>","<span data-v-f87c67ca=\"\">The Democratic Party will reportedly announce its full proposal to institutionalize and vitalize the digital asset sector on Wednesday.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Seoul Economy Daily","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"April 10","content":"DATE"},{"type":"Democratic Party","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$1,497","content":"MONEY"}],"hashtag":["ASIAN PARLIAMENTS","ASIAN REGULATION","SPOT BITCOIN ETF"],"authors":["Danny Park","The Block"]}