{"summary":"The Chicago DeFi Alliance (CDA) aims to bring together Chicago-based trading firms and DeFi projects. Inaugural members of the alliance include TD Ameritrade, DV Trading, Compound, and dYdX. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61035\/jump-drw-volt-capital-cmt-launch-alliance-to-connect-defi-projects-with-chicago-trading-firms","publishDate":"2020-04-07T21:33:37","id":9920,"type":null,"title":"New alliance launches to connect DeFi projects with Chicago crypto trading firms","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">A group of Chicago-based crypto trading shops is coming together to connect more closely with Open Finance (DeFi) projects.<\/span>","<span data-v-f87c67ca=\"\">Volt Capital, Jump Capital, CMT Trading and DRW Trading launched today the <a href=\"https:\/\/chicagodefi.org\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Chicago DeFi Alliance<\/a> (CDA. The organization, announced late Tuesday <a href=\"https:\/\/medium.com\/volt-capital\/announcing-the-chicago-defi-alliance-b66de98de1a4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">in a blog post<\/a>, seeks to bring together the Chicago-based trading firms and DeFi projects from the world.<\/span>","<span data-v-f87c67ca=\"\">Inaugural members of the alliance include TD Ameritrade, DV Trading, Arca, dYdX, and Compound.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The alliance aims to help DeFi projects understand the Chicago trading ecosystem, a major financial hub famous for its derivatives market. As DeFi projects look to bootstrap liquidity and onboard professional traders, CDA provides them a platform to communicate with trading firms, liquidity providers, and over-the-counter desks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"<\/span><span data-v-f87c67ca=\"\">I decided to join the CDA because I see a significant knowledge gap between the DeFi startups I talk with on a daily basis, and my colleagues at Jump Trading and other trading firms in the industry. My hope is that the CDA can help close that gap by helping DeFi startups understand where there are (and are not) real potential opportunities to work with trading firms and involve them in the DeFi ecosystem,\" said Jump Capital head of fintech investing Peter Johnson.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Each DeFi startup will be paired with a mentor and go through a four-to-six-week program to learn about trading firms' needs in DeFi. The end goal, according to Volt Capital general partner Imran Khan, is for these startups to have a clear idea of what products they could build and the resources they might need to attract firms from the trading realm.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"What we want out of this is at the end of, say, four weeks is we want startups to be better at understanding what types of products they're building, understand what the path to liquidity is, and understand whether they need additional resources like talent,\" Khan told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, CDA also provides a channel for trading firms to learn more about DeFi. According to Khan, although many trading firms are interested in DeFi, a lack of thorough understanding of the various protocols and concerns such as the security of assets have kept many on the sideline.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"A part of this alliance is to also educate traditional trading firms about DeFi… So it's more, I would say, a dual funnel where we're helping DeFi companies get liquidity and feedback, but then also from the traditional trading side, it's to understand the DeFi space better. It is&nbsp;<\/span>an education funnel, and [it helps] bridging that liquidity back to DeFi,\" <span data-v-f87c67ca=\"\">said Khan.<\/span>","<em data-v-f87c67ca=\"\">Update: a previous version of this story incorrectly stated that Jump Trading is a member of CDA. The post has since been updated to reflect that Jump Capital, instead of Jump Trading, is a CDA member.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arca","content":"LOCATION"},{"type":"Ameritrade","content":"ORGANIZATION"},{"type":"Volt Capital","content":"ORGANIZATION"},{"type":"CMT Trading","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Chicago DeFi Alliance<\/a> (CDA","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Imran Khan","content":"PERSON"},{"type":"CDA","content":"ORGANIZATION"},{"type":"Chicago","content":"LOCATION"},{"type":"Open Finance (DeFi","content":"ORGANIZATION"},{"type":"Peter Johnson","content":"PERSON"}],"hashtag":[],"authors":["Celia Wan","The Block"]}