{"summary":"The recent ruling regarding Ripple&#x27;s sales of XRP as not constituting the sale of securities has underpinned a surge in crypto trading volumes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239808\/crypto-volumes-increase-post-ripple-ruling","publishDate":"2023-07-15T18:39:31","id":9925,"type":null,"title":"Crypto spot volumes increase post Ripple ruling","category":["MARKETS"],"content":["The recent ruling regarding Ripple’s sales of XRP as not constituting the sale of securities has underpinned a surge in crypto trading volumes.","Crypto trading volumes across spot exchanges increased following a judge ruling that Ripple’s sales of XRP on public trading venues did not constitute the sale of securities.","Data from The Block's data dashboard shows the seven day moving average for spot trading volumes on exchanges increased from $12.74 billion on July 12 to $16.56 billion on July 14.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/total-exchange-volume-daily\/embed\" title=\"Daily Exchange Volume (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","While the future of the case — which could now go to trial or be appealed — is not clear, the market has rallied on the news with crypto equities like Coinbase and cryptocurrencies like XRP surging in the wake of the ruling from a judge in New York’s Southern District.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"Southern District","content":"ORGANIZATION"},{"type":"$12.74 billion","content":"MONEY"},{"type":"July 14","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"July 12","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"$16.56 billion","content":"MONEY"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}