{"summary":"Investment firm 1kx has raised $75 million in its latest funding round, which included participation from investors such as a16z and Galaxy Digital.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285702\/1kx-raise-75-million-funding-round","publishDate":"2024-03-29T15:20:41","id":9927,"type":null,"title":"1kx raises $75 million in latest funding round","category":["COMPANIES"],"content":["1kx has raised $75 million, the latest sign investors are once again embracing the cryptocurrency industry.&nbsp;","The investment firm on Thursday completed the first close of a new oversubscribed closed-ended fund, a statement from the company said. The round included participation from Marc's Marc Andreessen and Chris Dixon, as well as Accolade Partners and Galaxy Digital.&nbsp;","The firm said that with this recent closing, 1kx has raised $275 million across two funds since the start of the crypto bear market nearly two years ago. The latest funding will be allocated to offering technical support, financial resources and infrastructure assistance to early-stage companies and token networks. This support aims to help these entities attract new users and cater to their communities.","This latest fundraiser marks investors’ renewed interest in the digital assets industry after nearly two years of <a href=\"https:\/\/www.theblock.co\/post\/268972\/crypto-vc-funding-2023-recap\" data-v-f87c67ca=\"\">belt-tightening from venture capitalists<\/a> and other investors during the cryptocurrency bear market.&nbsp;The value of VC investments increased 2.5% from the third to the fourth quarter of 2023, data from PitchBook <a href=\"https:\/\/pitchbook.com\/news\/reports\/q4-2023-crypto-report\" data-v-f87c67ca=\"\">shows<\/a>.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$275 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"Marc Andreessen","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Accolade Partners","content":"ORGANIZATION"},{"type":"2.5%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Chris Dixon","content":"PERSON"},{"type":"Marc","content":"PERSON"},{"type":"$75 million","content":"MONEY"},{"type":"fourth quarter of 2023","content":"DATE"}],"hashtag":[],"authors":["Elizabeth Napolitano","The Block"]}