{"summary":"How can our industry defend against rising scrutiny, forthcoming legislation and agency rulemaking? The same way we have for the past decade; show them that crypto and digital assets offer fundamentals that are simply better than the alternative.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119742\/digital-assets-can-do-it-better","publishDate":"2021-10-07T09:45:41","id":9929,"type":null,"title":"Digital Assets Can Do It Better","category":["SPONSORED"],"content":["How can our industry defend against rising scrutiny, forthcoming legislation and agency rulemaking? The same way we have for the past decade; show them that crypto and digital assets offer fundamentals that are simply better than the alternative.&nbsp; That means we need to seize the opportunity to provide transparency to investors, users and token communities in ways that are not possible in traditional capital markets.","There are three key areas where blockchains and digital assets can “do it better.” First, <strong data-v-f87c67ca=\"\">transparency tools<\/strong> and <strong data-v-f87c67ca=\"\">reporting<\/strong> for users of custodial crypto services such as exchanges and crypto lenders. <a href=\"https:\/\/www.armaninollp.com\/software\/trustexplorer\/proof-of-reserves\/\" data-v-f87c67ca=\"\">Proof of Reserves<\/a> methodologies can offer customers of crypto exchanges the ability to participate in proving that the exchange has properly reserved customer assets. This is a paradigm shift in auditability that digital assets and cryptography enable, and something traditional finance and capital markets just can’t match.","Second, <strong data-v-f87c67ca=\"\">token treasury tracking<\/strong> and<strong data-v-f87c67ca=\"\"> financial reporting<\/strong> for utility token projects and DAOs. Tools like real-time treasury reporting on Armanino’s <a href=\"https:\/\/www.armaninollp.com\/software\/trustexplorer\/treasury\/\" data-v-f87c67ca=\"\">Treasury<\/a> tool, enable token projects and users unparalleled visibility to circulating, locked, and other classes of tokens. Here again, blockchains enable public visibility, auditability and trust in a way not possible with legacy financial instruments and markets.","Third, <strong data-v-f87c67ca=\"\">AML\/KYC tools<\/strong> and <strong data-v-f87c67ca=\"\">policies<\/strong>. We won’t cover this in depth here as there is a wealth of content on this topic and an abundance of tech tools available. All in all, adopting a self-regulatory mindset and instituting best practices allows for blockchain and digital asset ecosystem participants to deliver on the longstanding promises of the industry. Utilizing the features of public chains to our benefit also helps industry participants combat an oncoming wave of regulatory pressure and uncertainty.","The benefits of transparency are numerous, yet the digital asset industry is only gradually adopting systems and tools that provide end users with the trust they desire. More transparency and accountability protects investors and token holders, enhances regulatory trust and strengthens the decentralized financial ecosystem by instilling confidence for all market participants.","How can the industry add more transparency to the equation?","Armanino leads the way in fostering trust through digital asset solutions, offering easy-to-use products and services that make transparency simple. <a href=\"https:\/\/www.armaninollp.com\/software\/trustexplorer\/\" data-v-f87c67ca=\"\">TrustExplorer™<\/a>, a world-first suite of crypto-focused transparency and attest tools, is utilized by several industry leaders, with $16 billion in assets under Real-Time Attest. Today, TrustExplorer realizes the potential of blockchain and digital assets with solutions that allow our exchange, lending platform, token project, and DAO clients to simply <em data-v-f87c67ca=\"\">do it better<\/em>.","<em data-v-f87c67ca=\"\">For questions or to learn more, contact our&nbsp;<\/em><a href=\"https:\/\/www.armaninollp.com\/industries\/crypto-digital-assets\/#contactform\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Digital Assets &amp; Blockchain team<\/em><\/a><em data-v-f87c67ca=\"\">.<\/em>"],"entity":[{"type":"Time Attest","content":"ORGANIZATION"},{"type":"Armanino’s <a href=\"https:\/\/www.armaninollp.com\/software\/trustexplorer\/treasury\/\" data-v-f87c67ca=\"\">Treasury","content":"ORGANIZATION"},{"type":"KYC","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$16 billion","content":"MONEY"},{"type":"AML","content":"ORGANIZATION"},{"type":"Digital Assets &amp; Blockchain","content":"ORGANIZATION"},{"type":"Armanino","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}