{"summary":"European crypto asset manager CoinShares has launched a new hedge fund division — expanding its reach to U.S. investors.\nThe initiative marks a return to the company’s roots — leveraging its experience in digital assets trading.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252563\/coinshares-us-hedge-fund-division","publishDate":"2023-09-22T08:31:01","id":993,"type":null,"title":"CoinShares launches hedge fund division in US expansion","category":["Finance firms"],"content":["European crypto asset manager CoinShares International Ltd has launched a new hedge fund division, CoinShares Hedge Fund Solutions, as the company expands into the U.S. market.","The Jersey-based firm’s move aims to increase the company's product suite, targeting qualified U.S. investors with a range of private investment strategies, according to a <a href=\"https:\/\/www.globenewswire.com\/news-release\/2023\/09\/22\/2747885\/0\/en\/CoinShares-Launches-Hedge-Fund-Division-Begins-U-S-Expansion.html\" data-v-f87c67ca=\"\">statement<\/a>.","“CoinShares Capital LLC, a wholly-owned subsidiary of CoinShares and a broker-dealer registered with the Financial Industry Regulatory Authority (FINRA), will be conducting marketing activities to qualified investors in the United States in support of CoinShares Hedge Fund Solutions’ strategies and products,” the statement added.","CoinShares appointed traditional asset management veteran Lewis Fellas to head the new division. “CoinShares inspired my move into crypto asset management in 2016, so being able to lead the new division within the firm and further pioneer the space is an honor,” Fellas said. “The design of our strategies reflects the team’s deep and practical knowledge of digital assets and showcases the firm’s ability to develop new products that meet the demands of institutional investors.”&nbsp;","“The long-awaited return of interest rate-driven volatility is a great opportunity that we plan to capture with our novel fund products,” Fellas added. “Each product that will be offered is designed to mitigate counterparty risk whilst providing investors with clearly defined asset class and strategy exposures.”","CoinShares Hedge Fund Solutions will utilize CoinShares' existing trading and quantitative teams, according to CoinShares' CEO, Jean-Marie Mognetti. \"In a changing macro environment prominently marked by interest rates and inflation, the demand for actively managed exposure to digital assets is a natural progression,” Mognetti said. “Our products focus on delivering a premium experience to our investors and we are delighted to enrich our long-only asset management offerings by returning to our core founding program.”","Focused on the crypto market since 2013, CoinShares' expansion marks a return to its roots. It began as the commodity hedge fund Global Advisors, later operating the regulated Global Advisors Bitcoin Investment Fund (GABI) from 2014 to 2017.&nbsp;This new hedge fund division is a nod toward that heritage, combined with experience from its proprietary trading arm established in 2016, CoinShares said.","The firm is publicly traded on the Nasdaq Stockholm (CS) and the OTCQX (CNSRF).","Earlier this week, CoinShares <a href=\"https:\/\/www.theblock.co\/post\/251422\/crypto-funds-hit-half-billion-outflows-solana-cardano-xrp-buck-trend\" data-v-f87c67ca=\"\">reported<\/a> digital asset investment products hitting a near half-billion dollar outflow streak led by Bitcoin, with Solana, Cardano and XRP products bucking the trend."],"hashtag":["INVESTMENT FIRMS"]}