{"summary":"DXM, the cryptocurrency financial services subsidiary of South Korea’s fintech firm Dunamu, is working with Paris-headquartered crypto security giant","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49199\/crypto-exchange-upbits-operator-rolls-out-custody-service-with-ledger-targeted-at-institutional-investors","publishDate":"2019-12-04T07:43:30","id":9937,"type":null,"title":"DXM rolls out custody service with Ledger, targeted at institutional investors","category":["ASIA"],"content":["DXM, the cryptocurrency financial services subsidiary of South Korea’s fintech firm Dunamu, is working with Paris-headquartered crypto security giant Ledger to launch a new custody service targeting institutional investors.","Founded in January 2019, DXM operates under Dunamu, the majority shareholder of popular South Korean cryptocurrency exchange Upbit. The new product, Upbit Safe, will leverage Ledger Vault’s hardware security technology to make trading more efficient and more secure for DXM’s institutional clients.&nbsp;","Ledger Vault offers hardware security module (HSM) based solutions that allow institutions to customize governance rules depending on what type of operation they run, according to Ledger’s Head of APAC Glenn Woo. He explained that while Ledger Nano X is a more well-known product, Ledger Vault is superior when it comes to institutional use cases.&nbsp;","DXM first plans to target captive customers who are already using Upbit or other cryptocurrencies that Dunamu has invested in, DXM Chief Strategy Officer Eric Yoo told The Block. Dunamu's venture capital arm, Dunamu &amp; Partners, has <a href=\"http:\/\/www.businesskorea.co.kr\/news\/articleView.html?idxno=31860\" data-v-f87c67ca=\"\">made<\/a> a three-year plan to invest $84 million in the blockchain industry and has already put in $46 million in 26 blockchain companies. Yoo believes that assets already owned by DXM’s parent company will provide clients for Upbit Safe and help it succeed.","“We are a subsidiary of the largest exchange in Korea and have an advantage over our peers given that we already have a lot of assets we can bring into our custody,” Yoo said. “The combination of the Upbit brand, Ledger Vault’s security technology, and DXM’s own technology will give DXM an edge in the Korean market.”","Ledger’s Asian Pacific (APAC) operations were set up about a year ago in Hong Kong to expand the company’s services to countries in the region. This collaboration with DXM offers Ledger an opportunity to popularize its technology solution among Korean clients.","“We’re still pretty young and we’re trying to penetrate different markets with the help of partners that want to use Ledger Vault to meet their needs,” said Ledger’s Head of APAC Glenn Woo. “DXM has a reputation of being very secure…With the track record that they have in Korea, they can definitely help us scale.”","<strong data-v-f87c67ca=\"\">Lack of regulation is the biggest hurdle in Korea<\/strong>","In Korea, Yoo said, cryptocurrency is still in its nascent stage compared to other Asian countries. Whereas retail investors are considerably ahead compared to those outside Korea, institutional finance is somewhat dormant due to legal uncertainty and lack of regulation.","There is currently no comprehensive guidance from regulatory authorities regarding how cryptocurrency should operate under the law, according to research by <a href=\"https:\/\/www.globallegalinsights.com\/practice-areas\/blockchain-laws-and-regulations\/korea\" data-v-f87c67ca=\"\">Global Legal Insights<\/a>. In 2017, the Financial Supervisory Service (FSS) announced that cryptocurrencies are not fiat currencies, electronic currencies, or financial investment instruments, but did not specify how exactly it should be classified. As a result, it remains unclear what regulatory standards and restrictions cryptocurrencies are subject to.","Compared to countries such as Indonesia where the government’s financial body has put out detailed regulations and licensing rules for crypto exchanges, Yoo said, Korea has not seen a clear guideline.","“The biggest regulatory risk in Korea is uncertainty and lack of regulations,” Yoo said. “It’s quite a Wild Wild West out there.”","In recent years, Korea's National Assembly has proposed several cryptocurrency bills that try to spell out licensing requirements, anti-laundering requirements, consumer protection, cybersecurity requirements, among others, Global Legal Insights’ report shows. Yoo believes that such regulatory attempts will come to fruition within the first half of 2020, and DXM will capture newly empowered institutional investors and smart money that will flow into the space.","“We are one of the few companies in Korea to actually hope for regulations to form out,” Yoo said. “Once regulations become clearer, it’d be easier for us to engage with institutional money and not take the risks from uncertainties.”","Woo agrees that DXM and Ledger are prepared to deal with future regulations and believes Ledger can benefit from Dunamu’s experience with and expertise in the traditional finance market.","“With Dunamu and DXM, we do not see regulation as a problem at all,” Woo said. “I’ve worked with them for almost a year now. They have people such as Eric Yoo who are coming from traditional finance. They understand how the traditional market works and wants to apply it to the new crypto world.”","“Whereas a lot of crypto companies have to walk on thin ice and are taking a lot of risks, Dunamu’s people have a very good understanding of the Korean regulations—what’s coming up, if there are risks, and how they can properly mitigate new risks, he said. \"So I’m very confident that they’ll always do the right thing.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"FSS","content":"ORGANIZATION"},{"type":"Paris","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"Indonesia","content":"LOCATION"},{"type":"APAC Glenn Woo","content":"ORGANIZATION"},{"type":"Ledger Vault","content":"LOCATION"},{"type":"APAC","content":"ORGANIZATION"},{"type":"$84 million","content":"MONEY"},{"type":"January 2019","content":"DATE"},{"type":"Upbit Safe","content":"ORGANIZATION"},{"type":"Eric Yoo","content":"PERSON"},{"type":"DXM","content":"ORGANIZATION"},{"type":"Dunamu","content":"PERSON"},{"type":"National Assembly","content":"ORGANIZATION"},{"type":"the Financial Supervisory Service","content":"ORGANIZATION"},{"type":"$46 million","content":"MONEY"},{"type":"first half of 2020","content":"DATE"},{"type":"Yoo","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Dunamu &amp; Partners","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}