{"summary":"Former BitGo and Curv executive Josh Schwartz has built out a new MPC-powered wallet for institutions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182927\/former-bitgo-curv-exec-launches-new-crypto-wallet-security-firm","publishDate":"2022-11-04T11:21:59","id":9938,"type":null,"title":"Former BitGo, Curv exec launches new crypto wallet security firm","category":["THE BLOCK"],"content":["Even in the crypto bear market, new companies are springing up to tackle old problems.&nbsp;","Fordefi — which offers a wallet platform that allows institutions to engage across various chains — is emerging from stealth and entering a market crowded by firms that aim to safeguard assets for decentralized finance and web3 investors.","Founder Josh Schwartz previously worked at two such companies. His first foray into crypto was at BitGo, where he served as a sales executive. In 2019, Schwartz joined Curv, which was acquired by PayPal in March 2021.&nbsp;","His latest venture aims to meet the needs of the current market, which Schwartz said is defined more by active participation in web3 and decentralized finance than simply \"holding\" bitcoin in a digital vault. Today's market requires participants to stake their assets or sign smart contracts to engage in governance and other on-chain activities, he said.&nbsp;&nbsp;","\"This cycle is different because users are demanding controls to pair with any key management technology,\" Schwartz said. \"Users want to build the right set of controls around what is actually getting signed.\"","Using a secure multiparty computation (MPC) that distributes a user's private keys in a way that makes it more difficult to compromise, Fordefi says it will allow users to automate their engagements with blockchains and smart contracts.&nbsp;","MPC requires parties to hold secret information and solve a problem that requires the input of all of those secrets, eliminating a single failure point. Fordefi said its systems protect users against accidentally signing malicious transactions through a user interface that flags such incidents.&nbsp;","Fordefi's 25-person team, based in Israel and New York, includes co-founders Michael Volfman and Dima Kogan. The firm has tapped Stanford crypto professor Dan Boneh and former Curv CEO Itay Malinger as advisors.&nbsp;","Schwartz declined to name Fordefi's investors, but said that they were drawn to the firm because they have been active in decentralized finance and \"they understand that opportunity means nothing if one can’t manage the risks — billions of dollars continue to be compromised and legacy solutions are not equipped to handle these new risks.\"","\"The need for an institutional wallet and security platform that is purpose-built for DeFi was clear and by helping institutions understand and mitigate the risks of DeFi, we are paving the way for increased adoption,\" Schwartz added.&nbsp;","Ventures capitalists are becoming increasingly more interested in custody and security plays, which historically haven't been as attention-grabbing as marketplaces or exchanges.&nbsp;","\"What we're really excited about is moving beyond just speculative trading and where there are the real world use-cases,\" said Peter Johnson of Brevan Howard Digital. \"So things like gaming, which we think are going to be absolutely huge, things like NFTs creating a new category of fashion and luxury items and art... and the supporting infrastructure that makes all that happen, things like smart contract security.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Itay Malinger","content":"PERSON"},{"type":"Brevan Howard Digital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Michael Volfman","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"— billions of dollars","content":"MONEY"},{"type":"March 2021","content":"DATE"},{"type":"Dima Kogan","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Fordefi","content":"ORGANIZATION"},{"type":"Israel","content":"LOCATION"},{"type":"Stanford crypto","content":"ORGANIZATION"},{"type":"Josh Schwartz","content":"PERSON"},{"type":"Dan Boneh","content":"PERSON"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Schwartz","content":"PERSON"},{"type":"Peter Johnson","content":"PERSON"}],"hashtag":["WALLETS"],"authors":["Frank Chaparro","The Block"]}