{"summary":"Ethereum developers released updates for Prysm and Teku clients in response to recent beacon chain finality issues.\nEthereum’s beacon chain suffered a technical issue twice this week, causing the network to stop finalizing blocks briefly.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230723\/ethereum-beacon-chain-patches-finality-issues","publishDate":"2023-05-13T07:11:16","id":994,"type":null,"title":"Ethereum developers release patches for recent beacon chain issues","category":["Layer 1s"],"content":["Ethereum developers have released software updates to resolve recent finality issues that hit Ethereum's beacon chain and restore stability to the network.","The patches have been released for Ethereum clients <a href=\"https:\/\/twitter.com\/prylabs\/status\/1657232587256102912\" data-v-f87c67ca=\"\">Prysm<\/a> and <a href=\"https:\/\/github.com\/ConsenSys\/teku\/releases\/tag\/23.5.0\" data-v-f87c67ca=\"\">Teku<\/a>, allowing them to update their systems. The beacon chain experienced finality issues on Thursday and Friday, although end users of Ethereum did not face any transaction issues.","\"This was made possible due to client diversity as not all client implementations were affected by this exceptional scenario. After all clients caught up, the network finalized again,\" <a href=\"https:\/\/twitter.com\/superphiz\/status\/1657303471098404866\" data-v-f87c67ca=\"\">the Ethereum Foundation said in a blog post<\/a> that was shared by Superphiz.eth, a self-proclaimed \"Ethereum beacon chain community health consultant,\" on Twitter.","The Ethereum Foundation said the full cause for the finality issues is still being investigated, but \"This appears to have been caused by high load on some of the consensus layer clients, which in turn was caused by an exceptional scenario.\"","Arnold Toh, a research analyst at The Block, said, \"The timely response from the Ethereum community is certainly a good sign for the blockchain's development moving forward.\" At the same time, the finality issues are a \"stark reminder that Ethereum's beacon chain remains a work in progress.\"","<a href=\"https:\/\/www.theblock.co\/post\/230680\/ethereum-beacon-chain-finality-issue\" data-v-f87c67ca=\"\">Ethereum's beacon chain briefly lost finality twice this week<\/a>. The first occurrence caused the network to stop finalizing blocks for around 25 minutes and the second outage lasted for over an hour. Now that the patches have been released for Prysm and Teku, \"we can start putting this loss of finality issue behind us,\" according to Superphiz.eth.","\"This is one step on our diversity and decentralization journey, let's learn from it and move forward with greater purpose,\" they said."],"hashtag":["ETHEREUM"]}