{"summary":"Several of the largest crypto miners have seen their share price halve in the past few months.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129491\/bitcoin-mining-stocks-halve-as-turbo-charged-thesis-plays-out","publishDate":"2022-01-06T23:42:49","id":9940,"type":null,"title":"Bitcoin mining stocks halve as ‘turbo-charged’ thesis plays out","category":["MINING"],"content":["Just as the price of bitcoin has steadily declined from highs of near $70,000 to around $42,000 today, so too have the share prices of the biggest crypto mining companies fallen.","But the decline of those mining stocks — which experts believe represent <a href=\"https:\/\/www.theblockcrypto.com\/news+\/98806\/how-investors-value-bitcoin-mining-stocks\" data-v-f87c67ca=\"\">a kind of turbo-charged proxy<\/a> for the price of bitcoin — has been even sharper than bitcoin’s. Several of the largest crypto miners have seen their share prices halve since the highs of November.","Based on The Block Research’s data, the market capitalization of Nevada-based Marathon Patent Group has dropped from $7.65 billion in early November to roughly $3 billion today. Colorado’s Riot Blockchain has fallen from $4.25 billion to $2.05 billion. And Toronto-based Hut 8 mining is down from $2.33 billion to $1.19 billion.","The share prices of Hive, Argo Blockchain and Canaan have also plummeted — albeit less sharply than their larger rivals.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/crypto-mining-stocks-marketcaps\/embed\" title=\"Crypto Mining Stocks Marketcaps\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The performance of these stocks is hardly surprising given the headwinds that crypto miners have come up against in recent months. Authorities in China have <a href=\"https:\/\/www.theblockcrypto.com\/news+\/120475\/china-crypto-mining-crackdown\" data-v-f87c67ca=\"\">become increasingly adept<\/a> at snuffing out mining operations following a blanket ban, despite the evasive efforts of China’s crypto miners.","Other countries have followed in China’s footsteps. Only yesterday, Kosovo moved to <a href=\"https:\/\/www.bbc.com\/news\/world-europe-59879760\" data-v-f87c67ca=\"\">outlaw crypto mining<\/a>&nbsp;amid rolling blackouts enforced because of the country’s energy crisis. Tumult in Kazakhstan has <a href=\"https:\/\/www.theblockcrypto.com\/post\/129312\/bitcoin-mining-pool-hashrates-fall-amid-kazakhstan-internet-shutdown\" data-v-f87c67ca=\"\">also hindered<\/a> bitcoin mining efforts.","Dilution is another key factor here. Crypto mining is a capital-intensive business and operators have been forced to raise significant amounts from public markets investors.","Analysis from The Block Research underscores the extent to which this constant need to raise money has diluted shareholders.","In the fourth quarter of last 2020, Marathon had 51,599,792 shares in circulation. By the fourth quarter of 2021, it had 102,630,637 shares — a 98.9% increase. The story is similar for most of the big miners, as the table below shows.","","","But perhaps more relevant than these external factors in the decline of the bitcoin mining stocks is the simple fact that this is exactly how experts expected such stocks to behave.","In March last year, Ethan Vera, COO at Luxor Tech, described mining stocks as similar to “a levered play on bitcoin.”","The reason is that, beyond simply investing in and holding bitcoin, miners must invest heavily in infrastructure that will produce more bitcoin in the future.","“Public mining stocks act as a high beta play to bitcoin price, so when the bitcoin price decreases the mining companies will feel extra pain,” said Vera. “Not only do most of them hold bitcoin as treasury, but their ASIC fleets [crypto mining machines] fluctuate in value with the price and are increasingly leveraged with USD denominated debt.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Marathon Patent Group","content":"ORGANIZATION"},{"type":"$3 billion","content":"MONEY"},{"type":"Ethan Vera","content":"PERSON"},{"type":"$1.19 billion","content":"MONEY"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"$7.65 billion","content":"MONEY"},{"type":"Luxor Tech","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"March last year","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Kosovo","content":"LOCATION"},{"type":"98.9%","content":"PERCENT"},{"type":"Toronto","content":"LOCATION"},{"type":"fourth quarter of last 2020","content":"DATE"},{"type":"$42,000","content":"MONEY"},{"type":"$2.33 billion","content":"MONEY"},{"type":"$4.25 billion","content":"MONEY"},{"type":"Argo Blockchain","content":"PERSON"},{"type":"$2.05 billion","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"fourth quarter of 2021","content":"DATE"},{"type":"$70,000","content":"MONEY"},{"type":"Kazakhstan","content":"LOCATION"},{"type":"Nevada","content":"LOCATION"},{"type":"Colorado’s Riot Blockchain","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["MINING"],"authors":["Ryan Weeks","The Block"]}