{"summary":"The hacker responsible for draining $47 million from KyberSwap last week pledged to release a statement on a potential deal with victims.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265095\/kyberswap-hacker-promises-to-outline-potential-treaty-in-coming-days","publishDate":"2023-11-28T20:52:20","id":9942,"type":null,"title":"KyberSwap hacker promises to outline potential treaty in coming days","category":["CRYPTO ECOSYSTEMS"],"content":["The hacker responsible for draining $47 million from decentralized exchange protocol KyberSwap last week pledged to release a statement on a potential deal with victims later this week.","The attacker, whose identity remains unknown, encoded a message into an Ethereum transaction late on November 28, promising to release a statement on a “treaty” on November 30.","“I said I was willing to negotiate. In return, I have received (mostly) threats, deadlines, and general unfriendliness from the executive team. That's ok, I don't mind,” they said.","“Under the assumption that I am treated with further hostility, we can reschedule for a later date, when we all feel more civil. You need only say the word,” they continued. “If not, we proceed as planned on Nov. 30.”","The ominous message comes roughly a week <a href=\"https:\/\/www.theblock.co\/post\/264432\/dex-protocol-kyberswap-appears-to-lose-47-million-in-possible-exploit\" data-v-f87c67ca=\"\">after $47 million was suspiciously drained<\/a> form KyberSwap’s Elastic Pools liquidity solution. KyberSwap advised all users to withdraw their funds in the immediate aftermath of the incident. It has since <a href=\"https:\/\/www.theblock.co\/post\/264579\/kyberswap-offers-10-bounty-to-hacker-following-47-million-exploit\" data-v-f87c67ca=\"\">offered up a 10% bounty<\/a> to whoever was responsible for the exploit, who had already left a message encoded in blockchain data stating that negotiations would begin once they were “fully rested.”","Yesterday, the team said in a statement that it had <a href=\"https:\/\/www.theblock.co\/post\/264756\/kyberswap-recovers-4-7-million-after-exploit\" data-v-f87c67ca=\"\">managed to recover $4.7 million<\/a>.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$4.7 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"November 30","content":"DATE"},{"type":"last week","content":"DATE"},{"type":"Nov. 30","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"November 28","content":"DATE"},{"type":"$47 million","content":"MONEY"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}