{"summary":"The Bank of England wants academics to help it, &quot;understand the practical challenges of designing, implementing and operating a CBDC.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244072\/boe-digital-pound-recruitment","publishDate":"2023-08-10T06:18:10","id":9945,"type":null,"title":"BoE recruiting academics for next phase of digital pound design","category":["CENTRAL BANKS"],"content":["The Bank of England is recruiting academics for its newly created central bank digital currency Academic Advisory Group.&nbsp;","\"We will bring together experts related to our work on the digital pound, including monetary policy, finance, competition economics, industrial organisation, behavioural science, law, innovation theory, marketing, and business,\" the BoE said in a <a href=\"https:\/\/www.bankofengland.co.uk\/the-digital-pound\/academic-advisory-group\" data-v-f87c67ca=\"\">statement<\/a>.","The BoE wants academics to help it, \"understand the practical challenges of designing, implementing and operating a CBDC.\"","The CBDC Academic Advisory Group&nbsp;will not have any decision-making responsibilities. It will <a href=\"https:\/\/www.bankofengland.co.uk\/the-digital-pound\/cbdc-academic-advisory-group\" data-v-f87c67ca=\"\">serve<\/a> as a platform for knowledge and research exchange. \"Through this group, we seek to generate expert academic input and promote interdisciplinary discussions on a range of topics related to retail CBDC,\" the BoE added.","The UK <a href=\"https:\/\/www.theblock.co\/post\/209304\/uks-bank-of-england-launches-digital-pound-project-as-new-form-of-money\" data-v-f87c67ca=\"\">launched<\/a> a CBDC consultation in February. While no decision has been made yet by the UK to introduce a CBDC, it was concluded that \"a digital pound is likely to be needed in the future.\" Work on the project has now moved onto a design phase. \"Over the next 2-3 years, we will look at the technology and policy requirements for a digital pound,\" the BoE <a href=\"https:\/\/www.bankofengland.co.uk\/the-digital-pound\" data-v-f87c67ca=\"\">said<\/a>.","\"While cash is here to stay, a digital pound issued and backed by the Bank of England could be a new way to pay that’s trusted, accessible and easy to use,” UK finance minister Jeremy Hunt <a href=\"https:\/\/www.gov.uk\/government\/news\/hm-treasury-and-bank-of-england-consider-plans-for-a-digital-pound#:~:text=Chancellor%20of%20the%20Exchequer%2C%20Jeremy,sure%20we%20protect%20financial%20stability.\" data-v-f87c67ca=\"\">said<\/a> when the consultation was launched in February.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CBDC Academic Advisory Group","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"3 years","content":"DATE"},{"type":"Jeremy Hunt","content":"PERSON"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Academic Advisory Group","content":"ORGANIZATION"}],"hashtag":["BOE","CBDCS"],"authors":["Brian McGleenon","The Block"]}