{"summary":"DeFi protocols are naturally dispersed, forcing users to interact with each individually, but some companies are collecting the tools on a single platform. Zerion, a user interface for DeFi protocols, will likely be a competitive force with the introduction of new, more ambitious features.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/26011\/zerion-is-looking-to-bring-defi-to-the-masses-with-a-new-app-that-puts-decentralized-lending-and-trading-under-one-roof","publishDate":"2019-06-05T14:26:42","id":9946,"type":null,"title":"Zerion is looking to bring DeFi to the masses with a new app","category":["DEFI"],"content":["As DeFi protocols continue to gain popularity, some companies are making DeFi more user-friendly.","Decentralized exchanges have long had a higher barrier to entry when it comes to usability, forcing consumers to interact with DeFi products on an individual basis rather than collecting tools in a single hub like centralized exchange offerings often do. Products providing an interface for DeFi protocols, like Zerion and InstaDapp, are growing to meet this need.","However, Zerion may soon lead the pack due to its focus on streamlining the user experience with a clean user interface. Its plans are also more ambitious than its competitors, with plans to integrate fiat on-ramp.","","","The Zerion team began building out its portal, a one-stop shop to access DeFi protocols, last summer. This coincided with the emergence of the DeFi space, which spans trading, borrowing, lending and investing. Indeed, it can be used as a single point to manage a portfolio, exchange assets via Uniswap and soon Kyber, borrow via Maker and lend via Compound v2. The seven- person team is led by three cofounders: Evgeny Yurtaev, Vadim Koleoshkin, and Alexey Bashlykov. They are currently in the middle of a fundraise.","","","They began with MetaMask integration, the web application that allows users to run Ethereum dApps in their browsers, but have expanded to support Fortmatic, which allows users to create a wallet with their phone number, making the DeFi space more approachable to new users. Zerion reported 40% of wallets on Fortmatic were created rather than connected, indicating new users coming to the space.","<strong data-v-f87c67ca=\"\"><\/strong>","","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Zerion's user base across platforms&nbsp;<\/em><\/span>","It's future integrations that have DeFi users talking. They plan to include dYdX, an alternative lending platform, although are holding off on direct access to margin trading, in addition to a proprietary service that balances user assets across lending protocols based on best rates, ETF-like products, UMA Protocol (which gives access to a synthetic asset market and non-crypto native instruments), and Wyre. Indeed, the Zerion team recently won the Y Combinator hackathon for their Wyre and Plaid-integrated product.","","","Because Zerion is merely the portal to access these products and not the facilitator or custodian of the transactions themselves, it skirts the need for regulatory approval and doesn’t require a Money Transmitter or banking license.","Going forward, Zerion said it hopes to make the onboarding process simpler, since even with the increased usability, DeFi is daunting for non-crypto native users: in particular, they are targeting Asian, African, and Latin American populations. But Robert Paone of AirSwap pointed out that, in the near term, these types of products are still most impactful for heavy DeFi users rather than a point of entry for non crypto-native demographics.","As of now, Zerion reports a mere 1,000 active monthly users globally. Still, the firm says they will push into underserved markets outside of the U.S. and Europe.","","","<em data-v-f87c67ca=\"\">Zerion's user-base by country<\/em>","Moreover, Zerion's success will ultimately depend on its ability to compete in a crowded landscape. With InstaDapp, Balance, DexWallet, and several other consolidated DeFi offerings coming to market, each will have to offer a unique user experience and tools to attract a critical mass of customers. In particular, questions remain as to which product can produce the most efficient and high-yielding lending rebalancing algorithm, the likely source of future revenues.","<em data-v-f87c67ca=\"\">Matteo <span data-v-f87c67ca=\"\">Leibowitz<\/span>&nbsp;contributed reporting.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zerion","content":"ORGANIZATION"},{"type":"Leibowitz","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Wyre","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Evgeny Yurtaev","content":"PERSON"},{"type":"Alexey Bashlykov","content":"PERSON"},{"type":"AirSwap","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"Robert Paone","content":"PERSON"},{"type":"Vadim Koleoshkin","content":"PERSON"},{"type":"Zerion","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"Balance","content":"ORGANIZATION"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}