{"summary":"NFT company Dapper Labs has confirmed it&#x27;s blocking crypto accounts with Russian ties, citing new EU sanctions on Russia.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175790\/dapper-labs-breaks-down-why-its-suspending-russian-accounts","publishDate":"2022-10-09T07:26:27","id":9949,"type":null,"title":"Dapper Labs breaks down why it&#x27;s suspending Russian accounts","category":["COMPANIES"],"content":["NFT company Dapper Labs has confirmed that it's <a href=\"https:\/\/www.theblock.co\/post\/175639\/dapper-labs-freezes-funds-in-wallets-with-russian-ties-following-eu-sanctions-users-say\" data-v-f87c67ca=\"\">blocking crypto accounts<\/a> with Russian ties and said it was because of new EU sanctions on Russia.","The sanctions prohibit companies from offering crypto wallet, account and custody services to accounts with connections to Russia, Dapper Labs said in a <a href=\"https:\/\/support.meetdapper.com\/hc\/en-us\/articles\/5486302427795-Restrictions-Affecting-Collectors-in-Russia\" data-v-f87c67ca=\"\">statement<\/a>. It added that its payment service is based in the EU, which has directed it to comply with the sanctions.","The company said it is restricting Russian accounts from being able to buy, sell or gift NFTs, as well as make other purchases or withdraw NFTs from the platform.","Dapper Labs added that while users cannot access their NFTs, they still own them and can continue to view them.","The statement comes after multiple crypto users complained that they could no longer access their accounts, and revealed email correspondence from Dapper Labs about the restrictions.","Dapper Labs is the creator of CryptoKitties and the Flow blockchain, which is used by NFT project NBA Top Shot and others.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Dapper Labs","content":"ORGANIZATION"}],"hashtag":["SANCTIONS"],"authors":["Tim Copeland","The Block"]}