{"summary":"Crypto lending platform Nexo is suing the Cayman Islands regulator for denying the firm a virtual asset license. The firm hopes to get the decision reversed, according to a January 13 court filing.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/202614\/nexo-sues-cayman-islands-regulator-over-rejected-license","publishDate":"2023-01-16T11:51:32","id":9952,"type":null,"title":"Nexo sues Cayman Islands regulator over rejected license","category":["LEGAL"],"content":["Crypto lending platform Nexo is suing the Cayman Islands regulator for denying the firm a virtual asset license, according to a Jan. 13 filing.","Nexo, which only last week saw its office in Bulgaria raided by 300 police and has been the recipient of cease and desist orders from various U.S. regulators, hopes to have the decision reversed.","Crypto lending platform Nexo is suing the Cayman Islands regulator for denying the firm a virtual asset license.","Nexo, which only last week saw its office in Bulgaria <a href=\"https:\/\/www.theblock.co\/post\/201454\/nexos-bulgaria-office-raided-by-police\" data-v-f87c67ca=\"\">raided<\/a> by 300 police and has been the recipient of <a href=\"https:\/\/www.theblock.co\/post\/172900\/california-issues-cease-and-desist-against-crypto-lender-nexo\" data-v-f87c67ca=\"\">cease and desist<\/a> orders from various U.S. regulators, hopes to have the decision reversed, according to the lawsuit filed Jan. 13.","The Cayman Islands Monetary Authority rejected Nexo's application on Dec. 20, saying the firm's business model did not meet the required risk profile, a Cayman court filing said. ''Nexo posed a risk to market confidence, consumer protection and the reputation of the Islands as a financial centre,'' the CIMA said.&nbsp;","Nexo directors and shareholders had failed to disclosure to the CIMA potential regulatory enforcement matter in the U.S. and proceedings in English courts, the lawsuit cited the regulator as saying.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNexo lawyers argue the CIMA's decision was procedurally unfair and that the regulator also breached its constitutional and statutory duties by not informing Nexo the detailed reason for the rejection. Nexo added that it had addressed the regulator's concerns during the application process.","Nexo dismissed CIMA's concerns about litigation in English courts, saying it was an action brought by crypto exchange BitMEX against Nexo and a former employee over ownership of a BitMEX account.","Nexo not only wants the CIMA decision reversed, but it also wants the court to rule that Nexo is suitable to be registered and then order CIMA to register it.","\"This is a natural reflection of Nexo's ongoing license acquisition mission around the world and something quite normal that occasionally happens throughout the process of getting authorized,\" the company said in a Telegram message. \"Nexo had applied for VASP registration in the Cayman Islands as of some time. The activity you are seeing is simply Nexo disputing recent developments in the process, as we believe we are eligible to be granted the registration.\"","Nexo said <a href=\"https:\/\/www.theblock.co\/post\/192204\/crypto-lender-nexo-says-its-leaving-the-u-s-cites-regulatory-dead-end\" data-v-f87c67ca=\"\">last month<\/a> that it was leaving the U.S., citing a ''dead end'' in talks with regulators. Its main Earn product took in crypto deposits from investors in return for paying a set rate of interest. State and federal regulators had questioned the firm's operation in recent months with a mix of lawsuits and cease and desist letters.","<em data-v-f87c67ca=\"\">With reporting assistance from Christiana Sciaudone.<\/em>","<em data-v-f87c67ca=\"\">Update: This story has been updated with comment from Nexo.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cayman Islands","content":"LOCATION"},{"type":"Cayman Islands Monetary Authority","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Dec. 20","content":"DATE"},{"type":"Bulgaria","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Nexo","content":"ORGANIZATION"},{"type":"Christiana Sciaudone","content":"PERSON"},{"type":"VASP","content":"ORGANIZATION"},{"type":"Jan. 13","content":"DATE"},{"type":"last month","content":"DATE"},{"type":"Nexo","content":"PERSON"},{"type":"CIMA","content":"ORGANIZATION"}],"hashtag":[],"authors":["Benjamin Robertson","The Block"]}