{"summary":"Tech giant Microsoft is working on a non-custodial crypto wallet for its web browser Edge, Bleeping Computer reported Friday, citing testing of the new feature.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221014\/microsoft-testing-crypto-wallet-in-its-web-browser-edge-bleeping-computer","publishDate":"2023-03-18T10:49:17","id":9953,"type":null,"title":"Microsoft testing crypto wallet in its web browser Edge: Bleeping Computer","category":["COMPANIES"],"content":["Tech giant Microsoft is working on a non-custodial crypto wallet for its web browser Edge, Bleeping Computer <a href=\"https:\/\/www.bleepingcomputer.com\/news\/microsoft\/microsoft-is-testing-a-built-in-crypto-wallet-in-microsoft-edge\/\" data-v-f87c67ca=\"\">reported<\/a> Friday, citing testing of the new feature.","Microsoft sleuth Albacore <a href=\"https:\/\/twitter.com\/thebookisclosed\/status\/1636759487829917698\" data-v-f87c67ca=\"\">first spotted<\/a> the feature by tweeting some screenshots of the wallet. \"I mostly do software research and reverse engineering. That's how I ended up discovering the wallet functionality in the first place,\" Albacore told The Block.&nbsp;","Bleeping Computer said it tested the wallet, which is most likely only available to Microsoft Edge Dev Channel users as part of a limited test phase.","\"This is a non-custodial wallet, meaning you are in complete control of your funds. We will not have access to your password and recovery key. It is embedded in Edge, making it easy to use without installing any extension,\" one of the screenshots tweeted by Albacore read.","\"As a tester, you will use your own funds. In the event of loss of funds, Microsoft will not reimburse any loss. This is a confidential project and no details should be shared externally.\"","Other screenshots show integrations with Coinbase and Moonpay and support for NFTs and crypto swaps.","Bleeping Computer said Microsoft has partnered with Ethereum development studio Consensys to offer a built-in crypto swap feature between ether (ETH), Uniswap (UNI), the dai stablecoin (DAI), and the USD coin (USDC) and Tether (USDT) stablecoins.","\"At Microsoft, we regularly test new features to explore new experiences for our customers,\" a Microsoft spokesperson told Bleeping Computer. \"We look forward to learning and collecting feedback from customers but have nothing further to share at this time.\"","When asked if it is probable that Microsoft will launch a crypto wallet, Albacore said: \"I would personally lean toward yes. While Microsoft has a wide range of experimental projects in all kinds of fields, if one happens to land in publicly accessible versions of a product (say Windows, or in this case Edge) it rarely gets completely canceled. Worst case scenario usually is that it gets launched and decommissioned later if it doesn't get the traction they were hoping for.\"","Rival web browsers <a href=\"https:\/\/www.theblock.co\/post\/191695\/opera-to-add-drag-and-drop-nft-creation-tool-to-browser-in-early-2023?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">Opera<\/a> and <a href=\"https:\/\/www.theblock.co\/linked\/95279\/brave-browser-swag-store-now-sells-nfts?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">Brave<\/a> offer several crypto features, including a built-in wallet.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bleeping Computer","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Moonpay","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Microsoft Edge Dev Channel","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Albacore","content":"PERSON"}],"hashtag":["INTERNET","WALLETS"],"authors":["Yogita Khatri","The Block"]}