{"summary":"Rep. French Hill said the SEC is getting &quot;trampled&quot; by the courts in cases involving digital assets, and cited the recent DEBT Box ruling as the latest example.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283712\/sec-trampled-by-courts-with-debt-box-as-the-latest-case-says-rep-french-hill","publishDate":"2024-03-20T12:14:56","id":9955,"type":null,"title":"SEC &#x27;trampled&#x27; by courts, with DEBT Box as the latest case, says Rep. French Hill","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission is being \"trampled\" by the federal courts in cases involving digital assets, with DEBT Box being the latest example, said Rep. French Hill, R-Ark.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Not only has the SEC lost in the court of public opinion, even on a bipartisan basis here on Capitol Hill, but the agency is now getting trampled by the federal courts as well, especially as it relates to digital assets,\" Hill said on Wednesday during a House Financial Services capital markets subcommittee hearing titled \"SEC Overreach: Examining the Need for Reform.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Hill cited a ruling by a Utah judge, Robert Shelby, on <a href=\"https:\/\/www.theblock.co\/post\/283229\/utah-judge-denies-secs-motion-to-dismiss-debt-box-case-imposes-sanctions\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">Monday<\/span><\/a> that said the SEC acted in bad faith and ordered the agency to pay sanctions, including attorney's fees and costs following charges it lodged against crypto startup DEBT Box. Judge Shelby also denied the SEC's move to dismiss the case without prejudice, meaning the regulator could have refiled its case. Shelby also criticized what he characterized as the SEC's misleading statements, with the agency admitting that it had fallen short of expectations.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">During Wednesday's hearing, Hill also rebuked the regulator for the fees it must pay.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The commission is required to pay the legal fees, which means that our constituent tax dollars are now being used to pay for the SEC's overreach and failure,\" said Hill, who is also chair of the House Financial Services Subcommittee on Digital Assets,&nbsp;Financial Technology and Inclusion.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC's sued DEBT Box last year, alleging it defrauded thousands of investors of at least $49 million by offering customers so-called \"node licenses\" to receive revenue from mining 11 tokens, though they were never mined.<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Hill also pointed to other cases in which the SEC has not gotten a favorable outcome in the courts, including a New <\/span><span class=\"s4\" data-v-f87c67ca=\"\">York judge's <a href=\"https:\/\/www.theblock.co\/post\/239559\/sec-faces-wake-up-call-after-ripple-ruling-though-appeal-likely\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">ruling<\/span><\/a> in July that differentiated the legality of Ripple's sales of XRP; some sales did not violate securities laws because of a blind bid process in place for them, while other direct sales of the token to institutional investors were classified as securities.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Hill also cited a D.C. court <a href=\"https:\/\/www.theblock.co\/post\/246115\/court-hands-grayscale-win-in-long-running-suit-against-sec\" data-v-f87c67ca=\"\">ruling<\/a> over the summer<\/span><span class=\"s4\" data-v-f87c67ca=\"\">&nbsp;where three judges mandated the SEC to re-evaluate Grayscale Investments' proposal for a spot bitcoin ETF, the SEC subsequently approved spot bitcoin ETFs.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">The SEC is currently involved in high-profile crypto cases, including against crypto exchanges Coinbase, Kraken and Binance. Last week, the agency received a favorable response from a New York judge when <a href=\"https:\/\/www.theblock.co\/post\/282363\/us-judge-denies-motions-to-dismiss-secs-lawsuit-against-gemini-earn-program\" data-v-f87c67ca=\"\">motions<\/a> to dismiss from crypto exchange Gemini and crypto lender Genesis were denied.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New <\/span><span class=\"s4\" data-v-f87c67ca=\"\">York","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"$49 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Robert Shelby","content":"PERSON"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Hill","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Utah","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"House Financial Services Subcommittee on Digital Assets","content":"ORGANIZATION"},{"type":"Shelby","content":"PERSON"},{"type":"House Financial Services","content":"ORGANIZATION"},{"type":"Financial Technology","content":"ORGANIZATION"},{"type":"Ark.","content":"LOCATION"},{"type":"summer","content":"DATE"},{"type":"D.C.","content":"LOCATION"}],"hashtag":["COINBASE","CONGRESS","GEMINI","HOUSE FINANCIAL SERVICES COMMITTEE","SEC"],"authors":["Sarah Wynn","The Block"]}