{"summary":"The Fed wasn&#x27;t impressed with Custodia&#x27;s application to become a member of its system, and provided new details behind the Jan. 27 rejection.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222708\/fed-gives-reasons-why-custodia-failed-examination","publishDate":"2023-03-24T15:43:00","id":9958,"type":null,"title":"Fed explains why Custodia got an &#x27;F&#x27; on its examination","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">The Federal Reserve published its previously announced rejection of Custodia Bank’s application to become a member of the Fed system, citing the lender's management, financial condition and narrow focus on digital assets as reasons for its failure.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Fed also highlighted its desire to avoid further connecting the volatile asset class with the traditional banking sector.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“In general, the Board has heightened concerns about banks with business plans focused on a narrow sector of the economy,” the Fed’s <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/pressreleases\/files\/orders20230324a1.pdf\" data-v-f87c67ca=\"\">decision document<\/a> reads. “Those concerns are further elevated with respect to Custodia because it is an uninsured depository institution seeking to focus almost exclusively on offering products and services related to the crypto-asset sector, which presents heightened illicit finance<\/span> <span data-v-f87c67ca=\"\">and safety and soundness risks.”<\/span>","<span data-v-f87c67ca=\"\">Bank regulators conduct an examination of institutions applying to join the Fed system, or who want or hold other charters. In the Fed board’s eyes, Custodia received an ‘F’ on its pre-application exam. The order itself was published weeks after the announced rejection because the central bank redacts sensitive information around business plans.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Fed concluded that “findings indicated Custodia’s risk management and controls for its core banking activities were insufficient, particularly with respect to overall risk management; compliance with the Bank Secrecy Act and U.S. sanctions; information technology; internal audit; financial projections; and liquidity risk management practices.”<\/span>","<span data-v-f87c67ca=\"\">Those “deficiencies” and a “novel” business model focused largely on crypto-related activities with no federal deposit insurance worried the Fed, which called Custodia’s plan “an unprecedented business model that presents heightened risks involving activities that no state member bank previously has been approved to conduct.”<\/span>","<span data-v-f87c67ca=\"\">The Fed's Board of Governors also cast doubt on Custodia’s ability to make money in the future.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Indeed, some products that are estimated to be significant sources of revenue were still in the ‘conceptualization phase,’ and policies, procedures, and processes related to planned crypto-asset-related activities remained in the early stages of development, especially in the area of compliance,” the Board of Governors said.<\/span>","The central bank noted that Custodia's revenue and funding model relied \"almost solely\" on an \"active and vibrant\" crypto market, then went on to cite events like the bankruptcies of&nbsp; <span data-v-f87c67ca=\"\">Celsius, Voyager, BlockFi, and FTX as proof that \"the global and largely unregulated or noncompliant crypto-asset sector lacks stability and that dislocations in the sector can result in stress at financial institutions focused on serving the crypto-asset sector.”<\/span>","<span data-v-f87c67ca=\"\">The Fed also said Custodia’s business model largely relied on a series of business activities that it saw as too risky for member banks to participate in, due to the potential liability to U.S. taxpayers in the event of a failure.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“[I]n the event Custodia’s application were to be approved, the Board would prohibit Custodia from engaging in a number of those activities because Custodia has not demonstrated that it can conduct the activities in a safe and sound manner and, in some cases, also because the activities would be impermissible for a national bank,” the Fed order reads, adding that it does not believe Custodia can survive as a business without those activities, citing Custodia’s own financial statements made to examiners.&nbsp;<\/span>","Custodia management anticipated the failure of their application, <a href=\"https:\/\/www.theblock.co\/linked\/150686\/digital-asset-bank-custodia-is-suing-the-federal-reserve-over-an-application-delay\" data-v-f87c67ca=\"\">filing suit<\/a> against the Fed months before the central bank made its final judgment. It accused the central bank of a bias against crypto in response to today's disclosure.","“The recently released Fed order is the result of numerous procedural abnormalities, factual inaccuracies that the Fed refused to correct, and general bias against digital assets,” Custodia Bank spokesperson Nathan Miller said in an emailed statement. “Rather than choosing to work with a bank utilizing a low-risk, fully-reserved business model, the Fed instead demonstrated its shortsightedness and inability to adapt to changing markets.","That same management&nbsp;didn't avoid criticism either. <span data-v-f87c67ca=\"\">The Fed wrote that “the depth of relevant banking experience and bank-specific risk management experience among Custodia’s board of directors and management team is limited” and that “the number and degree of shortcomings identified in the pre-membership examination suggest that management’s experience is not commensurate with the firm’s intended risk profile.”<\/span>","<span data-v-f87c67ca=\"\">The Fed also says it would be “unprecedented” to approve membership of a bank without deposit insurance, like Custodia, an issue that has received more scrutiny in the weeks since the rejection due largely to the failure of Silicon Valley Bank.<\/span>","<span data-v-f87c67ca=\"\">In the order, which was written and delivered well-before <a href=\"https:\/\/www.theblock.co\/post\/218838\/silicon-valley-bank-closed-by-california-regulator\" data-v-f87c67ca=\"\">Silicon Valley Bank’s failure<\/a>, the Fed notes that the lack of deposit insurance could raise risk for a bank run at Custodia. Crypto-friendly Silvergate Bank, a Fed member and, like Custodia, a state-chartered bank, saw troubles emerge late last year due to its large exposure to the digital asset industry through companies including FTX and the failed Facebook-led stablecoin project Diem, additional context the Fed considered Custodia’s application.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Banks accepted to the Fed system gain access to ongoing facilities run by the central bank that helps provide additional low-cost liquidity to member banks. The central bank carefully guards access to its system largely because of that access, and bank regulators are conservative in their evaluations of bank business models due to a strong aversion to failures, which can necessitate government intervention, as has recently happened with Silicon Valley and Signature Banks. Non-crypto fintech firms have also faced high hurdles in recent years in <a href=\"https:\/\/www.stlouisfed.org\/on-the-economy\/2022\/sep\/fed-guidelines-master-account-access-payment-services\" data-v-f87c67ca=\"\">applying for similar access<\/a>.<\/span>","<span data-v-f87c67ca=\"\">The Kansas City Federal Reserve, the regional Fed bank named by Custodia in its lawsuit over the application, has asked a federal judge presiding over the case for an extension until March 28 to respond to Custodia's claims.<\/span>","“It is a shame that Custodia must turn to the courts to vindicate its rights and compel the Fed to comply with the law,” Custodia's Miller said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Board of Governors","content":"ORGANIZATION"},{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Custodia Bank","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Nathan Miller","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"” Custodia","content":"ORGANIZATION"},{"type":"March 28","content":"DATE"},{"type":"Voyager","content":"LOCATION"},{"type":"Kansas City Federal Reserve","content":"ORGANIZATION"},{"type":"” Custodia Bank","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Miller","content":"PERSON"},{"type":"Custodia","content":"LOCATION"},{"type":"Board","content":"ORGANIZATION"},{"type":"Custodia","content":"PERSON"},{"type":"Custodia","content":"ORGANIZATION"},{"type":"Silicon Valley and Signature Banks","content":"ORGANIZATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":["FEDERAL RESERVE"],"authors":["Colin Wilhelm","The Block"]}