{"summary":"The Sandbox explained that an unauthorized third party accessed an employee&#x27;s computer and sent a fraudulent email to some users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216471\/the-sandbox-warns-users-of-security-breach-used-for-email-phishing-campaign","publishDate":"2023-03-02T05:05:58","id":9961,"type":null,"title":"The Sandbox warns users of security breach used for email phishing campaign","category":["CRYPTO ECOSYSTEMS"],"content":["The Sandbox, a blockchain-based metaverse company, released a warning regarding a security breach.","The company explained in a <a href=\"https:\/\/sandboxgame.medium.com\/notice-of-security-incident-february-2023-ea692ee8094b\" data-v-f87c67ca=\"\">blog post<\/a> on Thursday that an unauthorized third party accessed an employee's computer and sent a fraudulent email to the platform's users.","The fraudulent email was titled \"The Sandbox Game (PURELAND) Access,\" sent on Feb. 26. and contained links that could install malware on a user's computer if clicked on. This malware would give the third party control over the user's computer, allowing access to their personal information. The company has stated that the third party only had access to the single employee's computer and was unable to access any other service or account of The Sandbox.","The only data the attacker had access to was email addresses of The Sandbox users, the company said. So far, no financial loss has been reported.","The Sandbox warned users to be wary of potential phishing attacks following the breach, telling targeted users \"not to open, play, or download anything from the hyperlinked website.\" It also recommended that users strengthen their passwords, implement two-factor authentication, and avoid clicking on suspicious links.","The project has taken quick action to address the issue, including emailing users who may have received the fraudulent email, blocking the employee's accounts and access and resetting all related passwords with two-factor authentication. The employee's laptop was also reformatted, and the company said it was working to improve its security policies and practices.","This breach is the latest in a string of email-phased phishing attempts aimed at stealing crypto assets or extracting information of crypto users. Just recently, the email system of domain name registrar Namecheap was <a href=\"https:\/\/www.theblock.co\/post\/211031\/hackers-target-domain-registrar-namecheap-for-crypto-phishing-campaign\" data-v-f87c67ca=\"\">breached<\/a>, resulting in a widespread fake phishing campaign which told users to upgrade crypto wallets.","There have been times when hackers have been able to steal large sums of money with these types of phishing email campaigns. For example, in February 2022, a bad actor stole about <a href=\"https:\/\/www.bleepingcomputer.com\/news\/security\/opensea-users-lose-2-million-worth-of-nfts-in-phishing-attack\/\" data-v-f87c67ca=\"\">$2 million<\/a> worth of NFTs from OpenSea users by tricking them into signing a malicious transaction sent via an email link.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"February 2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Feb. 26","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"Namecheap","content":"PERSON"}],"hashtag":["THE SANDBOX"],"authors":["Vishal Chawla","The Block"]}