{"summary":"The pair renamed the original Hashdex Bitcoin Futures ETF to the Hashdex Bitcoin ETF, which plans to invest 95% of assets in spot bitcoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284897\/tidal-hashdex-announce-trading-of-spot-bitcoin-etf-upon-completion-of-fund-conversion","publishDate":"2024-03-26T21:01:18","id":9962,"type":null,"title":"Tidal, Hashdex announce trading of spot bitcoin ETF upon completion of fund conversion","category":["MARKETS"],"content":["<span data-v-f87c67ca=\"\">Tidal Investments and Hashdex Asset Management on Tuesday announced the trading of their spot bitcoin exchange-traded fund (ETF) in the U.S. after renaming the Hashdex Bitcoin Futures ETF to the Hashdex Bitcoin ETF (DEFI).<\/span>","<span data-v-f87c67ca=\"\">The pair said in a <\/span><a href=\"https:\/\/www.hashdex.com\/en-US\/insights\/tidal-and-hashdex-announce-trading-of-u-s-spot-bitcoin-etf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\"> that the renaming of the ETF — with “DEFI” as its ticker symbol — corresponds to its conversion to allow the ETF to provide spot bitcoin holdings and track a new benchmark index effective March 27.<\/span>","<span data-v-f87c67ca=\"\">The ETF is expected to invest at least 95% of the fund’s assets in spot bitcoin, with up to 5% of its remaining assets set to be invested in CME-traded bitcoin futures contracts and in cash or cash equivalents. The volume of the fund’s total net assets stood at $11.16 million as of March 27, according to Hashdex’s <\/span><a href=\"https:\/\/hashdex-etfs.com\/defi\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">website<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">“We are thrilled to complete the conversion of DEFI, and with it deliver an innovative product in coordination with Tidal that furthers our mission of empowering individuals and institutions around the world to access this revolutionary innovation,” Marcelo Sampaio, co-founder and chief executive officer of Hashdex, said in the statement.<\/span>","<span data-v-f87c67ca=\"\">Bloomberg Senior ETF Analyst Eric Balchunas <\/span><a href=\"https:\/\/x.com\/EricBalchunas\/status\/1772754086086980053?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">wrote<\/span><\/a><span data-v-f87c67ca=\"\"> on social media platform X that DEFI “finally and officially makes it to the starting gate.”<\/span>","<span data-v-f87c67ca=\"\">“Spot Bitcoin ETF #11. The getting is so good right now I could see this one getting some bites (if the fee is competitive) despite being so late,” Balchunas added.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$11.16 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"5%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 27","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"95%","content":"PERCENT"},{"type":"Marcelo Sampaio","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Hashdex Asset Management","content":"ORGANIZATION"},{"type":"Hashdex","content":"LOCATION"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["SPOT BITCOIN ETF"],"authors":["Timmy Shen","The Block"]}