{"summary":"The agency has yet to identify a culprit in the hijacking of its account that led to the posting of a false spot bitcoin ETF announcement.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272534\/sec-chair-gensler-addresses-x-account-hack-in-statement-still-assessing-the-impacts","publishDate":"2024-01-13T20:28:56","id":9971,"type":null,"title":"SEC Chair Gensler addresses X account hack in statement: &#x27;Still assessing the impacts&#x27;","category":["POLICY"],"content":["The Securities and Exchange Commission has released a statement addressing the recent hijacking of its X account, through which an unknown agent <a href=\"https:\/\/www.theblock.co\/post\/271373\/secs-x-account-compromised-to-post-fake-spot-bitcoin-etf-approval\" data-v-f87c67ca=\"\">posted<\/a> a false spot bitcoin ETF approval announcement.&nbsp;","In a statement attributed to SEC Chair Gary Gensler, the agency claims \"an unauthorized party gained access to the @SECGov X.com account by obtaining control over the phone number associated with the account.\" This language is reminiscent of SIM-swapping attacks, a common form of X account hijacking that can be mitigated through multi-factor authentication—something Gensler once advised in his own <a href=\"https:\/\/x.com\/GaryGensler\/status\/1716786621847392497?s=20\" data-v-f87c67ca=\"\">X post<\/a>.&nbsp;","In the <a href=\"https:\/\/www.sec.gov\/news\/statement\/gensler-x-account\" data-v-f87c67ca=\"\">statement<\/a>, Gensler writes, \"Commission staff are still assessing the impacts of this incident on the agency, investors, and the marketplace but recognize that those impacts include concerns about the security of the SEC’s social media accounts.\"","Gensler also notes that the agency is working with law enforcement to investigate the incident further.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"X.com","content":"LOCATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["GARY GENSLER"],"authors":["Zack Abrams","The Block"]}