{"summary":"New court documents show messages Sam Bankman-Fried sent to new FTX CEO John Ray and an unnamed witness in his criminal case.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206845\/bankman-fried-sought-constructive-relationship-with-criminal-case-witness","publishDate":"2023-01-30T14:50:09","id":9975,"type":null,"title":"Bankman-Fried sought &#x27;constructive relationship&#x27; with criminal case witness","category":["COMPANIES"],"content":["&nbsp;","Prosecutors shared copies of Sam Bankman-Fried’s messages to FTX CEO John Ray III and an unnamed witness in new court documents on Monday, as lawyers seek to <a href=\"https:\/\/www.theblock.co\/post\/206462\/prosecutor-seek-to-restrict-bankman-frieds-bail-terms-after-apparent-attempts-to-influence-witnesses\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">restrict<\/span><\/a> the FTX founder’s communication with former employees of his failed crypto exchange.","Bankman-Fried appears to have contacted a witness in the case asking to establish a “constructive relationship,” according to messages included in new court documents. The recipient of the message is redacted.","“I know it’s been a while since we’ve talked. And I know things have ended up on the wrong foot. I would really love to reconnect and see if there’s a way for us to have a constructive relationship, use each other as resources when possible, or at least vet things with each other,” Bankman-Fried wrote.","The Justice Department wants to amend the conditions of Bankman-Fried’s bail to restrict his access to encrypted messaging services and bar him from communicating with former employees of FTX and Alameda Research, suggesting he tried to influence witnesses in the case.","Bankman-Fried, who attacked the new FTX chief executive in the press before he reached out to talk, faces decades in prison if he is convicted.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> Bankman-Fried stepped down as CEO of FTX in November when the firm filed for bankruptcy protection.<\/span>","“Hi Mr. Ray, I know things haven’t got off on the right foot, but I really do want to be helpful—whether on the funds, or on anything else,” Bankman-Fried wrote in a Jan. 2 email, the day before he pleaded not guilty to criminal charges. “As I’m guessing you’ve heard, I’m in NYC for the next day. I’d love to meet up while I’m here—even if just to say hi.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Bankman-Fried’s lawyers accused the government of having “sandbagged” the process of amending his bail in a letter on Saturday, claiming prosecutors made an effort to “portray our client in the worst possible light.”","Mark Cohen, who represents Bankman-Fried, has proposed that his client's bail should be amended to bar him from contacting certain former FTX employees and others involved in the case, rather than a wider ban.","“It is time to move past such tactics and spin to the merits of the narrow question before the court as to the proper scope of the bail modification,” Cohen wrote. “The defense proposal balances the parties’ interests, permits the defendant to participate in his defense, and is consistent with the law and approaches taken in this circuit, and should be adopted.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<i data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i><span class=\"s2\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ray","content":"PERSON"},{"type":"Cohen","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Jan. 2","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"John Ray III","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"NYC","content":"ORGANIZATION"},{"type":"Mark Cohen","content":"PERSON"},{"type":"Saturday","content":"DATE"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}