{"summary":"Here’s a primer on Mutant Ape Yacht Club serums and how they fit in with the Bored Ape Yacht Club ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129023\/a-mutant-ape-yacht-club-serum-sold-for-nearly-6-million-heres-what-that-means-for-the-bored-ape-ecosystem","publishDate":"2022-01-03T16:33:21","id":9976,"type":null,"title":"Why did a Mutant Ape Yacht Club serum sell for $6 million?","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">The rare Serum #69 for Yuga Labs’ Bored Ape Yacht Club just sold for <a href=\"https:\/\/twitter.com\/boredapebot\/status\/1477491344994091008\" data-v-f87c67ca=\"\">1,542.069 ETH<\/a> ($5.8 million), making it the largest sale of a Bored Ape \"serum\" thus far.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Deepak Thapliyal, CEO of the blockchain tech startup Chain, bought this rare non-fungible token or NFT — though not without competition from the Andreessen Horowitz-backed Meta4 Capital, which had offered to buy Serum #69 for <\/span><a href=\"https:\/\/twitter.com\/Meta4Capital\/status\/1477451387239862273\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">1,500 ETH<\/span><\/a><span data-v-f87c67ca=\"\"> ($5.76 million).&nbsp;<\/span>","While perhaps serving as an illumination of the current state of collectibles sales in the NFT space, the development also begs the inevitable question: what is a serum, and why would it sell for so much?","To help answer this question, here's a primer on&nbsp;<span data-v-f87c67ca=\"\">Mutant Ape Yacht Club serums and how they fit in with the Bored Ape Yacht Club ecosystem.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The NFT development startup Yuga Labs first created the Bored Ape Yacht Club (BAYC, or Bored Apes) in April 2021. BAYC is a collection of 10,000 <\/span><a href=\"https:\/\/www.theblockcrypto.com\/news+\/123857\/what-goes-into-creating-collectible-nft-sets-like-bored-apes\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">generativity made<\/span><\/a><span data-v-f87c67ca=\"\"> images of cartoon apes minted on the Ethereum blockchain.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">BAYC quickly sold out after the initial mint and saw ever-rising secondary sales on NFT marketplaces like OpenSea. BAYC NFTs easily fetch hundreds of thousands of dollars at purchase, and the most expensive Bored Ape previously sold for <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/121445\/crowned-bored-ape-with-trippy-fur-sells-for-record-2-7-million\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$2.7 million<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yuga Labs didn’t intend for Bored Ape to be their only collection, however. Mutant Ape Yacht Club (MAYC, or Mutant Apes) has always been a part of the Bored Ape road map and was set to launch after 100% of BAYC NFTs sold.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Thus, Yuga Labs set out to create 20,000 Mutant Apes. Ten thousand of them would reward Bored Ape owners with new creatures based on the traits of their original Bored Ape, while the other 10,000 would be designed to welcome newcomers into the Bored Ape ecosystem with a lower cost of entry.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For the latter, 10,000 Mutant Apes would be sold via a \"Dutch Auction\" on August 28. A Dutch auction is a method in which an item is auctioned at a higher asking price and gradually lowered. Yuga Labs set the original Mutant Ape price at 3 ETH and reduced it until they were all sold.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The former 10,000 Mutant Apes? They’d need a little something called serums.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bored Ape serums are an NFT that mutates the collection's languid primates. To mutate a Bored Ape with a serum, an individual must have both a Bored Ape NFT and a serum NFT in their wallet before using the mutating feature on the <a href=\"https:\/\/boredapeyachtclub.com\/#\/mayc\" data-v-f87c67ca=\"\">MAYC website<\/a>.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yuga Labs airdropped, or sent out, 10,000 serums to BAYC owners on August 28, 2021 — the same day as the Dutch auction. Serums burn upon use and can thus only be used once. A Bored Ape that has been mutated cannot use another serum of the same tier.<\/span>","<span data-v-f87c67ca=\"\">However, not all serums are alike. Of the 10,000 serums, Yuga Labs originally airdropped 7,500 M1 serums, 2,492 M2 serums, and eight Mega Mutant, or M3, serums.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As Yuga Labs demonstrated with a Bored Ape named Curtis, M1 and M2 serums do not really make a significant difference — other than the scarcity, and thus price, of the serum.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yuga Labs' demonstration of M1 and M2 serums on a Bored Ape named Curtis.<\/span>","<span data-v-f87c67ca=\"\">The M3 serum, though, offers more exaggerated features of the original Bored Ape.&nbsp;<\/span>","\n\t\t<style type=\"text\/css\" data-v-f87c67ca=\"\">\n\t\t\t#gallery-4 {\n\t\t\t\tmargin: auto;\n\t\t\t}\n\t\t\t#gallery-4 .gallery-item {\n\t\t\t\tfloat: left;\n\t\t\t\tmargin-top: 10px;\n\t\t\t\ttext-align: center;\n\t\t\t\twidth: 33%;\n\t\t\t}\n\t\t\t#gallery-4 img {\n\t\t\t\tborder: 2px solid #cfcfcf;\n\t\t\t}\n\t\t\t#gallery-4 .gallery-caption {\n\t\t\t\tmargin-left: 0;\n\t\t\t}\n\t\t\t\/* see gallery_shortcode() in wp-includes\/media.php *\/\n\t\t<\/style>\n\t\t","","<span data-v-f87c67ca=\"\">It must be noted that not all M3 Mutant Apes are derived from serums. Five more were added in the Dutch auction, bringing the total number of possible M3 Mutant Apes to 13, according to the Bored Ape Discord. But those existing eight serums are incredibly rare — and become even more so as users burn serums by mutating Bored Apes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Rarity was one of the biggest reasons why Thapliyal decided to spend nearly $6 million on M3 serum #69, as he <\/span><a href=\"https:\/\/twitter.com\/dt_chain\/status\/1477843627175038976\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">explained<\/span><\/a><span data-v-f87c67ca=\"\"> on Twitter. He spent a total of $7.2 million for both the serum and his Bored Ape. Thapliyal's argument: he sees the potential to quadruple his earnings — if he decides to sell at all.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With Mutant Ape Yacht Club and serums, Yuga Labs found a way to add a scarcity model that goes beyond the Bored Ape initial mint. <\/span>","<span data-v-f87c67ca=\"\">Bored Apes do indeed have <\/span><a href=\"https:\/\/nftrarity.net\/boredapeyachtclub\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">rare features<\/span><\/a><span data-v-f87c67ca=\"\">, such as an Ape wearing a prom dress or donning a party hat, but they are permanently etched into the NFT’s JPEG. <\/span><span data-v-f87c67ca=\"\">By comparison, these serums are ephemeral and thus become rarer the more they’re consumed.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"#69","content":"DATE"},{"type":"Deepak Thapliyal","content":"PERSON"},{"type":"Bored Ape","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Yuga Labs’ Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"$5.8 million","content":"MONEY"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"$2.7 million","content":"MONEY"},{"type":"$7.2 million","content":"MONEY"},{"type":"33%","content":"PERCENT"},{"type":"$5.76 million","content":"MONEY"},{"type":"Bored Ape NFT","content":"ORGANIZATION"},{"type":"August 28","content":"DATE"},{"type":"100%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"August 28, 2021","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"4","content":"DATE"},{"type":"$6 million","content":"MONEY"},{"type":"Curtis","content":"PERSON"},{"type":"Bored Ape Discord","content":"ORGANIZATION"}],"hashtag":["BAYC","MAYC","YUGA LABS"],"authors":["MK Manoylov","The Block"]}