{"summary":"Gavin Newsom&#x27;s office is working on a crypto regulatory regime after the governor vetoed a state Assembly bill.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173865\/california-wants-to-model-crypto-rules-for-the-rest-of-the-u-s","publishDate":"2022-09-29T17:57:32","id":9978,"type":null,"title":"California wants to model crypto rules for the rest of the U.S.","category":["CRYPTOCURRENCY"],"content":["Much as it did in the 1960s for automobile emissions, California wants to develop a crypto and web3 regulatory regime that could be a model for other states to adopt, with a particular eye toward crypto mining operations.&nbsp;","Gov. Gavin Newsom’s <a href=\"https:\/\/www.theblock.co\/post\/172676\/california-gov-newsom-nixes-crypto-license-bill\" data-v-f87c67ca=\"\">veto<\/a> of a state crypto licensing bill earlier this month frees up his administration to create its own regulations, said Dee Dee Myers, director of the Governor’s Office of Business and Economic Development. The vetoed bill proposed that digital assets firm in the state apply for a license to operate.","“The bill created a regulatory regime in a very narrow lane,” she said, adding, “We told the Assembly to try again and to work with [California] government agencies to get it right.”&nbsp;","Instead, the Newsom administration is basing its own regulatory work on an executive order the governor <a href=\"https:\/\/www.gov.ca.gov\/2022\/05\/04\/governor-newsom-signs-blockchain-executive-order-to-spur-responsible-web3-innovation-grow-jobs-and-protect-consumers\/\" data-v-f87c67ca=\"\">issued<\/a> in May. The order aims to provide more clarity and flexibility for the crypto industry, while retaining the consumer protections in the vetoed Assembly bill, Myers argued.&nbsp;","The goal is to work in “tandem with the federal government,” to ensure that there is no conflict between California’s regulations and the federal government’s, Myers said in an interview at Circle's Converge22 conference in San Francisco.","“We are hoping the federal government leads on regulations,\" adding, “We have to go fast, but we have to be careful,” she said of the Newsom administration plans. “We need to measure twice and cut once.”","The vetoed bill would have put onerous restrictions on the growing crypto industry, at the risk of stifling innovation, added Gayle Miller, chief deputy director of the state Department of Finance. \"We want the industry to continue to expand here, and we'll do what it takes to continue to build [the crypto and web3 industries].\" The state wants industry input to help create regulations, Myers said. \"Everybody thinks it's important to have a clear set of guidelines.\"&nbsp;&nbsp;","The Newsom administration believes any regulatory regime it creates will be a model for other states. “When California puts forth cutting-edge regulations, a lot of other states follow suit and adopt them,” Myers said, making the comparison between the current digital asset debate to California's regulations on automobiles in the 1960s, which influenced rules in other states and on the national level.&nbsp;","Myers added that the California officials are in dialogue with other states, even those led by Republican governors and state legislatures around digital asset regulation, though she did not go into specifics. “There is huge bipartisan interest in us getting this right,” Myers said.","Regulating crypto’s environmental impact is one way the state could deviate from the federal government. The Biden administration <a href=\"https:\/\/www.theblock.co\/post\/168621\/white-house-report-proposes-possible-restrictions-on-proof-of-work-crypto-mining\" data-v-f87c67ca=\"\">raised concerns<\/a> over the energy consumption of proof-of-work mining in a report issued earlier this month, and Ethereum's recent switch from proof-of-work to proof-of-stake in an event known as The Merge aimed to lessen the blockchain's energy use.","Myers said that California would take a close look at regulating crypto mining's environmental impact.&nbsp;","“Environmental protection is more than California’s goal; it’s our mission,” said Myers.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Gavin Newsom","content":"PERSON"},{"type":"Newsom","content":"PERSON"},{"type":"Department of Finance","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Gayle Miller","content":"PERSON"},{"type":"Governor’s Office of Business and Economic Development","content":"ORGANIZATION"},{"type":"1960s","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"Myers","content":"PERSON"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Dee Dee Myers","content":"PERSON"},{"type":"Biden","content":"PERSON"}],"hashtag":[],"authors":["Madhu Unnikrishnan","The Block"]}