{"summary":"Grayscale Investments said the U.S. Securities Exchange Commission has filed its first legal brief in the lawsuit the crypto asset manager filed over the rejection of its application for a spot bitcoin exchange-traded fund.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193900\/grayscale-says-sec-filed-first-legal-brief-in-ongoing-bitcoin-futures-etf-lawsuit","publishDate":"2022-12-10T17:50:10","id":9979,"type":null,"title":"Grayscale says SEC filed first legal brief in ongoing bitcoin futures ETF lawsuit","category":["FINANCE FIRMS"],"content":["Grayscale Investments said the U.S. Securities Exchange Commission has filed its first legal brief in the lawsuit the crypto asset manager filed over the rejection of its application for a spot bitcoin exchange-traded fund.","\"This is the next milestone in our ongoing litigation following the filing of our&nbsp;<a href=\"https:\/\/grayscale.com\/gbtc-litigation-opening-brief-amicus\/\" data-v-f87c67ca=\"\">opening brief<\/a> on October 11 and the supporting amicus briefs shortly after,\" the company said Friday in a <a href=\"https:\/\/grayscale.com\/gbtc-lawsuit-the-secs-response-brief\/?utm_source=TWITTER&amp;utm_medium=social&amp;utm_term=other&amp;utm_content=8384959451&amp;utm_campaign=!!!quick+post&amp;linkId=193164912\" data-v-f87c67ca=\"\">statement<\/a>.","In an October opening brief, Grayscale's legal argument centered around what it said was an uneven application of law after regulators approved bitcoin futures that are tied to spot market pricing. The SEC rejected Grayscale's request to convert its flagship GBTC fund into an ETF in late June, and the company has argued the refusal harms its 850,000 investors who already own shares in the trust.","In the 73-page <a href=\"https:\/\/grayscale.com\/wp-content\/uploads\/2022\/12\/Reply-Brief-of-Respondent-SEC-12092022.pdf\" data-v-f87c67ca=\"\">response brief<\/a>, the SEC argued its rejection was \"reasonable, reasonably explained, supported by substantial evidence,\" with \"no inconsistency in the Commission’s disapproval of Grayscale’s spot ETP despite having approved two CME bitcoin futures ETPs.\"","The SEC said futures and spot-based bitcoin funds are \"fundamentally different products.","\"The Commission previously approved ETPs that hold only futures contracts that trade on the CME, which is registered with the CFTC; those ETPs’ underlying assets are thus subject to robust surveillance,\" it said. \"The bitcoin spot market, by contrast, is fragmented and unregulated, and petitioner presented no supportable basis to conclude that the CME’s surveillance of futures trading would sufficiently detect and deter fraud and manipulation targeting the bitcoin spot market and thereby protect against fraud and manipulation in Grayscale’s product.\"","The SEC said its disapproval of Greyscale's proposed ETF did not reflect an \"impermissible, merits-based<br data-v-f87c67ca=\"\">\nskepticism of bitcoin as an investment.''","In response to the SEC filing, Grayscale reiterated its arguments from its opening brief and accused the SEC of \"creating an uneven playing field for investors by approving Bitcoin futures-based ETFs, while continuously denying spot Bitcoin ETFs.\"","\"We look forward to reviewing the SEC’s reply brief,\" the company said, noting that its next brief is due Jan. 13 before final briefs are due on Feb. 3.","The price of GBTC versus the bitcoin it actually holds hit an all-time low on Wednesday, with the discount ratio reaching 47.3%, according to data from The Block. The fund trades at a discount to the net asset value, as shares don't grant the holder access to the underlying assets.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Commission","content":"ORGANIZATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"October 11","content":"DATE"},{"type":"U.S. Securities Exchange Commission","content":"ORGANIZATION"},{"type":"Jan. 13","content":"DATE"},{"type":"late June","content":"DATE"},{"type":"Greyscale","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"47.3%","content":"PERCENT"},{"type":"Friday","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Feb. 3","content":"DATE"},{"type":"CME","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}