{"summary":"Michael Lewis, the author of &quot;Moneyball&quot; and &quot;The Big Short,&quot; said he&#x27;s still working on his book about Sam Bankman-Fried, and that FTX&#x27;s collapse completed the story.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231624\/michael-lewis-sam-bankman-fried-ftx-book","publishDate":"2023-05-19T17:55:27","id":9980,"type":null,"title":"&#x27;Big short&#x27; Michael Lewis is almost done with his much-hyped SBF book","category":["COMPANIES"],"content":["<a href=\"https:\/\/michaellewiswrites.com\/\" data-v-f87c67ca=\"\">Michael Lewis<\/a>, the financial journalist and author of \"Moneyball\" and \"The Big Short,\" told an audience at the Bitcoin 2023 conference that he's nearly finished writing his book about <a href=\"https:\/\/www.theblock.co\/post\/231269\/ftx-bankman-fried-embed\" data-v-f87c67ca=\"\">Sam Bankman-Fried<\/a> and the collapse of the FTX crypto empire that the 30 year-old founded.","Lewis said his interviews included those in Bankman-Fried's inner circle, employees, investors, Bahamas officials and U.S. regulators. While he's already sold the movie rights to Apple, his final manuscript isn't due for a couple more months.&nbsp;","Lewis started the book before FTX's bankruptcy and fraud charges were filed against the disgraced digital asset mogul. He shed light about how he first started the project, telling a crowd in Miami that the entire idea started out with an out of the blue call in 2021 from a friend who ran a Wall Street firm.","\"It was a really odd call,\" Lewis recounted, telling the story at the Bitcoin 2023 conference. \"He said, 'I've got a problem. I'm about to do a deal where I'm going to exchange shares in my company with another company. It's like a couple hundred million dollar deal. And I'm very comfortable with the company. But I just don't know the guy who runs it. I just can't get a read on him. His name is Sam Bankman-Fried.'\"","Lewis said the friend asked him to spend time with <a href=\"https:\/\/www.theblock.co\/post\/229881\/bankman-fried-crypto-winter-ftx-failure-dismiss-charges\" data-v-f87c67ca=\"\">Bankman-Fried<\/a> and report back, and that was the start of an odyssey would eventually take him to Hong Kong and the Bahamas, and lead to interviews with over a hundred people.&nbsp;","\"Two weeks later, he comes tumbling out of an Uber at my office in Berkeley. A mop of hair, and shorts and the shirt,\" Lewis said. \"He's like always dressed for hike but he's never been on one.\"","\"But so we went for a walk and I asked him lots of questions,\" Lewis continued. \"First thing is I call my friend and I said, 'go ahead do the deal. What could go wrong?' And the second thing was, is I thought like, 'I just want to see what happens to this person.'\"","Lewis said he asked Bankman-Fried if he could\" just watch,\" and be a \"fly on the wall.\" The FTX and Alameda Research owner agreed, and reporting went through October of last year.","But until FTX's sudden and epic implosion Lewis wasn't sure he had enough for a real story.&nbsp;","\"I thought 'I don't have a book,'\" Lewis said. \"I had this conversation with kind of a person I used as a sounding board...And he said&nbsp; 'your problem is you don't have third act. You have the first two acts, but you don't have a third act.' And I said 'that's absolutely right. I don't know how to end it.' A week later, FTX blows up. I was so grateful.\"","While he didn't give too many details about the content of the book, Lewis said it's \"great stuff. He recounted the story of sneaking into a shuttered office in Hong Kong, and said the office in the Bahamas seemed liked it had been evacuated with a \"feeling of Pompeii.\"","\"It aims to read like a piece of fiction,\" Lewis said. \"If you didn't know anything about crypto. If you didn't even know who Sam Bankman-Fried was. You might think 'this is just a made up story.' It's an incredible story.\"","Lewis didn't give a formal publication date, but he said he wants the release the book to coincide with the start of a criminal trial against Bankman-Fried, if one occurs. Prosecutors set an original target date for the trial in October, though Bankman-Fried's lawyers have suggested they may try to push back the date.&nbsp;","\"I'm grateful for the invention of crypto,\" Lewis said. He noted that he had owned some crypto, which is now tied up in the FTX bankruptcy process.&nbsp;","\"It wasn't much,\" he said. \"I didn't put all our money into bitcoin.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pompeii","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"Lewis","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Short","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Berkeley","content":"LOCATION"},{"type":"Michael Lewis","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}