{"summary":"Users can transfer &quot;funds instantly, including to those who haven&#x27;t set up a wallet yet, all via a Twitter handle as a crypto address.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241822\/crypto-transfers-using-twitter-handles-rolled-out-amid-talk-musk-will-do-the-same","publishDate":"2023-07-27T16:10:57","id":9983,"type":null,"title":"New wallet lets users send crypto with just a Twitter handle","category":["COMPANIES"],"content":["Aiming to streamline the process of creating a digital wallet and sending digital crypto, a company called Suku launched a solution it says allows users to do both using just their Twitter handles.","More than 48,000 people downloaded the wallet, the web3 firm said in a <a href=\"https:\/\/www.prweb.com\/releases\/polygon_and_suku_launch_the_first_ever_open_edition_nft_collection_minted_entirely_via_twitter\/prweb19460480.htm\" data-v-f87c67ca=\"\">statement<\/a>.","Suku's \"wallet allows users to receive and send funds instantly, including to those who haven't set up a wallet yet, all via a Twitter handle as a crypto address,\" the company said.","The announcement comes amid several months of <a href=\"https:\/\/www.theblock.co\/post\/206783\/twitter-preps-for-payments-with-crypto-option-as-musk-eyes-super-app-ft-says\" data-v-f87c67ca=\"\">speculation<\/a> that Elon Musk, the owner of Twitter, will eventually integrate digital currency transfers with the social media platform popular with crypto enthusiasts.","In order to speed \"the adoption of web3 among everyday internet users,\" Suku said it's creating \"intuitive products that don’t require prior knowledge of the crypto space.\" Adoption and interest of crypto has suffered recently in response to a prolonged downturn and a series of scandals and bankruptcies.","","","The company said it also set out to demonstrate the simplicity of its tools by partnering with Polygon for the unveiling of an \"open edition NFT collection.\" Suku and Polygon will allow people to mint 50,000 NFTs by posting to Twitter, the company said.","\"Tagging @0xPolygon and @SukuThis in a new tweet\" enables users to mint an NFT, the company said. After \"tweet-minting,\" users can then manage their NFT by downloading either a Google Chrome extension or logging into Suku's wallet app using their Twitter account handle.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Elon Musk","content":"PERSON"},{"type":"Suku","content":"PERSON"}],"hashtag":[],"authors":["RT Watson","The Block"]}