{"summary":"Former SEC lawyer Ladan Stewart who litigated high-profile crypto cases has moved over to law firm White &amp; Case LLP. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278411\/former-sec-enforcement-attorney-ladan-stewart-joins-white-case-llp","publishDate":"2024-02-21T11:59:29","id":9984,"type":null,"title":"Former SEC enforcement attorney Ladan Stewart joins White &amp; Case LLP","category":["POLICY"],"content":["Ladan Stewart, a former lawyer for the Securities and Exchange Commission known for litigating high-profile cases against Ripple and Coinbase, has joined the law firm White &amp; Case LLP as a partner. Stewart started on Tuesday and will provide guidance to clients facing SEC examinations or investigations<span class=\"s1\" data-v-f87c67ca=\"\">, according to a <a href=\"https:\/\/www.whitecase.com\/news\/press-release\/ladan-stewart-joins-white-case-partner-new-york\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">statement<\/span><\/a> released on Wednesday.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Stewart spent eight years at the SEC's enforcement division, where she recently led the development of a new trial unit—the agency's first specialized litigation team—and managed the SEC's crypto litigation program. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">This placed Stewart <\/span><span class=\"s1\" data-v-f87c67ca=\"\">on the front lines of the SEC's expanded focus on crypto enforcement, including against crypto exchanges Coinbase, Bittrex, FTX and Ripple Labs. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">The case against Coinbase is ongoing as the SEC and the exchange's lawyers <a href=\"https:\/\/www.theblock.co\/post\/274703\/will-a-judge-dismiss-the-secs-case-against-coinbase-experts-have-differing-views\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">faced<\/span><\/a> off in court last month during oral arguments. As for the case against&nbsp;<\/span><span class=\"s1\" data-v-f87c67ca=\"\">Ripple Labs, which was accused of illegally raising $1.3 billion through unregistered XRP offering, a<\/span><span class=\"s3\" data-v-f87c67ca=\"\"> New York judge's <a href=\"https:\/\/www.theblock.co\/post\/239559\/sec-faces-wake-up-call-after-ripple-ruling-though-appeal-likely\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">ruling<\/span><\/a> in July differentiated the legality of Ripple's sales of XRP; some did not violate securities laws because of a blind bid process in place for them, while other direct sales of the token to institutional investors were classified as securities.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"In the past year or so, the SEC's focus shifted from bringing cases against issuers like the Ripple case for example, to broader cases with more market impacts, like the case against Coinbase,\" Stewart said in an interview with The Block, adding that the agency is thinking different about crypto enforcement than it had in the past.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I have a lot of good expertise developed from that and also a really good sense of how the SEC thinks about these issues,\" Stewart said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Stewart will work in the firm's Global White Collar \/ Investigations Practice where she will hone in on SEC and other enforcement matters, white collar investigations, civil litigation and trials, according to her <a href=\"https:\/\/www.whitecase.com\/people\/ladan-stewart\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">bio<\/span><\/a>.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">As for where the SEC could be focused next, Stewart said she expects the regulator to sharpen its focus on making sure investors are protected as crypto becomes part of the mainstream financial markets.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"So I think this is really an area that's going to continue to be quote unquote hot for some time to come because it's hard to think of a time when such a sort of relatively novel financial instrument was becoming so integrated into our national economy and the larger global economy and so I think we can expect that the focus of the regulators will continue on crypto,\" Stewart said.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Stewart","content":"PERSON"},{"type":"$1.3 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"White &amp; Case LLP","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Bittrex","content":"LOCATION"},{"type":"Global White Collar \/ Investigations Practice","content":"ORGANIZATION"},{"type":"Ladan Stewart","content":"PERSON"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}