{"summary":"One of the major drawbacks of cryptocurrencies like bitcoin and ether is the lack of privacy features offered by their networks. Incognito hopes to change","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/42385\/incognito-is-building-a-sidechain-to-bring-privacy-to-cryptocurrencies","publishDate":"2019-10-09T14:00:42","id":9988,"type":null,"title":"Incognito is building a sidechain to bring privacy to cryptocurrencies","category":["LAYER 1S"],"content":["One of the major drawbacks of cryptocurrencies like bitcoin and ether is the lack of privacy features offered by their networks. <a href=\"http:\/\/incognito.org\/\" data-v-f87c67ca=\"\">Incognito<\/a> hopes to change that.","Incognito is building a blockchain-agnostic sidechain to bring privacy features to various networks. Founded in 2018, the firm is entirely self-funded with $1 million from the founding team.","Incognito CEO and founder Duy Huynh tells The Block he was inspired to start the project after paying his employees with stablecoins at his last company. While Huynh \"<span data-v-f87c67ca=\"\">saved processing time and money on international wire fees, employee salaries were exposed publicly on the Ethereum blockchain.\"<\/span>","\"<span data-v-f87c67ca=\"\">No one wants to show their bank statements to the entire world,\" Huynh says.<\/span>","To use Incognito, users will need to access one of the sidechain's \"bridges\" linked to the relevant blockchain. The bridge locks an asset on the native blockchain, mints a new private asset on Incognito's sidechain, and issues it to the user. According to Huynh, this process for smart contract blockchains like Ethereum is \"entirely trustless\" but for blockchains with limited smart-contract functionalities like Bitcoin and Binance Coin, the firm will use a trusted custodian.","To ensure the security of its network and the validations of transactions through its network, Incognito will be powered by Proof-of-Stake nodes that will stake its native asset, PRV. Huynh hopes the network will be powered by \"at least 25,600 nodes\" at full scale.&nbsp;","When Incognito launches its mainnet in late October, the project will face many competing privacy projects like Aztec Protocol for Ethereum and Wasabi Wallet for Bitcoin. When asked how Incognito hopes to compete with these projects, Huynh tells The Block \"<span data-v-f87c67ca=\"\">We believe that each blockchain is designed for a very specific purpose. It should do one thing and do it well. Bitcoin is designed to be the new gold. Ethereum is designed for.. I don’t know.. maybe DeFi is its best use case. Incognito is designed for a single purpose: incognito mode for crypto, and we’re trying to do this one thing well.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Huynh","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Duy Huynh","content":"PERSON"},{"type":"Incognito","content":"ORGANIZATION"},{"type":"Huynh","content":"LOCATION"},{"type":"Wasabi Wallet for Bitcoin","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Binance Coin","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["The Block","The Block"]}