{"summary":"Coinbase CEO Brian Armstrong said the exchange&#x27;s goal is to list every crypto asset, as long as it is legal to do so.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109889\/coinbase-ceo-we-plan-to-list-every-crypto-asset-where-legally-viable","publishDate":"2021-06-28T13:51:29","id":9996,"type":null,"title":"Coinbase CEO: We plan to list every crypto asset where legally viable","category":["EXCHANGES"],"content":["Coinbase CEO Brian Armstrong said today that the exchange plans to list every crypto asset where it is legally permissible to do so.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Reminder about how Coinbase lists assets: our goal is to list *every* asset where it is legal to do so,\" he <a href=\"https:\/\/twitter.com\/brian_armstrong\/status\/1409555338836078592\" data-v-f87c67ca=\"\">tweeted<\/a>.<\/span>","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\"> Armstrong added that the exchange wants no coin to get special treatment.<\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\"> \"Outside of our listing standards (for safety\/legality), we don't offer an opinion on the value of each asset. We are asset agnostic, because we believe in free markets and that consumers should have choice in the cryptoeconomy. This is how we'll have the most innovation,\" he said.<\/span>","The CEO suggested that, over time, the exchange will introduce ways for its users to review or rate each asset. In theory, this would be to provide other consumers with information to make more educated decisions, he said.","The exchange has certainly picked up the pace when it comes to listing new assets. In 2017, the exchange offered just four cryptocurrencies: bitcoin, ethereum, litecoin, and bitcoin cash. At the time, a Coinbase listing was a big occasion, often pumping a coin's price on the announcement that it was coming to the exchange — something that became known as \"The Coinbase Effect.\"","Now the exchange lists 63 cryptocurrencies, from stablecoins like tether (USDT) to well-known coins like cardano (ADA) and even more obscure coins like NKN (NKN), which ranks 166th on CoinMarketCap.","In January, Coinbase said that it was <a href=\"https:\/\/blog.coinbase.com\/coinbase-continues-to-explore-support-for-new-digital-assets-2c5b84813fcf\" data-v-f87c67ca=\"\">considering<\/a> 44 cryptocurrencies that it may choose to add. It has already added a few of them, including ankr (ANKR), curve (CRV) and skale (SKL). Just three days ago, the exchange added more tokens including barnbridge (BOND), livepeer (LPT) and quant (QNT) to its roster.","But with thousands more assets out there, it still has a long way to go if it truly wants to list every cryptocurrency.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"three days ago","content":"DATE"},{"type":"CRV","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"ADA","content":"ORGANIZATION"}],"hashtag":["BRIAN ARMSTRONG","COINBASE"],"authors":["Tim Copeland","The Block"]}