{"summary":"Brevan Howard Digital and Morgan Creek Digital have led a $40 million round into web3 gaming studio Horizon Blockchain Games. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174638\/brevan-howard-and-morgan-creek-lead-web3-gaming-startups-40-million-series-a-bloomberg","publishDate":"2022-10-04T08:09:16","id":9998,"type":null,"title":"Brevan Howard and Morgan Creek lead web3 gaming startup&#x27;s $40 million Series A: Bloomberg","category":["METAVERSE & NFT"],"content":["The digital asset divisions of investment firms Brevan Howard and Morgan Creek have led a $40 million round into web3 gaming startup Horizon Blockchain Games.&nbsp;&nbsp;","The Series A funding will be used to build its platform for developers Sequence and Niftyswap, a digital-asset marketplace, said the startup in <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-10-04\/blockchain-gaming-startup-horizon-raises-40-million-in-funding-round\" data-v-f87c67ca=\"\">an interview with Bloomberg<\/a> on Tuesday.","Gaming giants Ubisoft Entertainment SA and Take-Two Interactive Software also participated in the round.&nbsp;","Horizon will also continue to funnel capital into the development of its NFT fantasy trading card game.","“It’s something that anyone can use and that anyone can participate in,” said Horizon co-founder and CEO Peter Kieltyka said in the interview, outlining how the company was committed to making blockchain-based games more accessible for the everyday user.&nbsp;","The company declined to disclose its valuation after the round but noted that it was higher than when it previously raised capital <a href=\"https:\/\/www.businesswire.com\/news\/home\/20210729005220\/en\/Horizon-Blockchain-Games-Raises-Funds-From-BITKRAFT-and-CMT-Digital-to-Drive-Web3-Adoption-by-Making-Blockchain-Easy-Fun-and-Powerful-for-Users-and-Developers\" data-v-f87c67ca=\"\">in July last year<\/a>. The Block contacted a Horizon representative for comment but did not receive a reply before publication time.&nbsp;","The news comes when gaming startups in the blockchain sector continue to attract fresh funding from investors despite notable calamities in the sector such as the Axie Infinity hack. According to The Block Research, last month NFTs and Gaming startups accounted for <a href=\"https:\/\/www.theblockresearch.com\/august-blockchain-funding-recap-169221\" data-v-f87c67ca=\"\">38% of Seed and Pre-Series A deals<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Peter Kieltyka","content":"PERSON"},{"type":"Morgan Creek","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"July last year","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ubisoft Entertainment SA","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"38%","content":"PERCENT"},{"type":"Brevan Howard","content":"PERSON"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}