{"summary":"A judge has approved Celsius&#x27; proposed bidding procedures, setting a schedule that could have the firm&#x27;s assets sold by the end of the year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179529\/judge-approves-celsius-schedule-for-a-possible-sale","publishDate":"2022-10-24T17:12:39","id":9999,"type":null,"title":"Judge approves Celsius&#x27; schedule for a possible sale","category":["LEGAL"],"content":["A federal bankruptcy judge has approved Celsius' bidding procedure plans, setting a schedule in motion that could see the platform's assets sold by the end of the year.","While Celsius may still submit a standalone proposal to reorganize, the procedures lay out the steps for a sale of the platform's assets.","Celsius plans to solicit bids for the retail asset business, which includes the earn accounts and coin balances, the retail and institutional lending portfolio, its swap services, staking platform, payment feature, decentralized finance arm and any crypto assets it's still holding. It also plans to solicit bids for the \"remaining assets,\" which would include the mining business.&nbsp;","Today's order sets dates and deadlines related to a possible sale, authorizes Celsius to select a stalking horse bidder if it chooses to do so and sets the layout for a sale, directing the lender to enter a sale order that the court and creditors would have to approve. The order sets a Dec. 12 deadline for final bids. An auction, if necessary, would be slated for Dec. 15. Once a winner is selected, a sale hearing for any objections or discussion on the sale order would follow on Dec. 22.&nbsp;","The order also includes the appointment of a consumer privacy ombudsman. Part of the sale process could include the sale of customer lists and information, and the outside party would ensure that customer information is adequately protected throughout the sale process.","Celsius pushed back on the initial proposal from the government's representative in the case — the U.S. Trustee — that the court appoint an ombudsman, saying it was unnecessary since it planned to comply with its own privacy policy.","However, the U.S. Bankruptcy Court for the Southern District of New York found that \"appointing a neutral Consumer Privacy Ombudsman early in the sale process will ensure that any sale adequately protects such customer data.\" The U.S. Trustee is directed to submit a court order appointing a person with knowledge of consumer privacy laws to the role.&nbsp;","The U.S. Trustee previously objected to the bidding procedures, saying it remained unclear what assets are being sold and there isn't a clear justification for the swift timeline Celsius proposed. The Trustee asked that any sale wait for the upcoming examiner report, since the independent examiner's findings could raise issues related to the sale. The court appointed an outside examiner to Celsius earlier this month after continued complaints of a lack of transparency from the firm.&nbsp;","Likewise, securities regulators across 12 states objected, saying any sale should wait until the parties have hashed out who owns certain assets. There is an ongoing dispute over which funds are considered custodied and should be returned to creditors — an issue which the independent examiner is tasked with tackling in her report.","Chief Bankruptcy Judge Martin Glenn ultimately approved a revised form of the procedures that shifted the timeline to after the Dec. 10 deadline for the examiner report and provided that any successful purchaser will have to gain the necessary regulatory approvals to move forward, satisfying state regulators. He also disagreed with the U.S. Trustee, saying that because Celsius has essentially filed to sell all of its assets, there is sufficient clarity into the assets being sold at the stage.&nbsp;","A sale would mark the end game of a bankruptcy process that began in July of this year. As of now, Celsius has developed a list of more than 30 parties that may further explore the possibility of bidding for the platform. Any that wish to move forward would enter confidentiality agreements in the next phase.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Martin Glenn","content":"PERSON"},{"type":"Dec. 10","content":"DATE"},{"type":"Dec. 22","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"earlier this month","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Dec. 15","content":"DATE"},{"type":"Dec. 12","content":"DATE"},{"type":"Celsius","content":"LOCATION"},{"type":"Celsius","content":"ORGANIZATION"},{"type":"U.S. Trustee","content":"ORGANIZATION"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}